{"body": "\n<br/>[](http://api.ning.com/files/aq07GQXjwH3FVbSRtIN-2gYNhsM-aRIpGGwxmSLnPAxmf-ZDxqYNPpfsNl4ookkcQYV-wu4wXr1Kuuxrnr0WLtsZgTLtmjX6/Version.0.0.54Honeybee.0.0.50.jpg)[<img class=\"align-center\" src=\"http://api.ning.com/files/aq07GQXjwH3FVbSRtIN-2gYNhsM-aRIpGGwxmSLnPAxmf-ZDxqYNPpfsNl4ookkcQYV-wu4wXr1Kuuxrnr0WLtsZgTLtmjX6/Version.0.0.54Honeybee.0.0.50.jpg?width=545\" width=\"545\"/>](http://api.ning.com/files/aq07GQXjwH3FVbSRtIN-2gYNhsM-aRIpGGwxmSLnPAxmf-ZDxqYNPpfsNl4ookkcQYV-wu4wXr1Kuuxrnr0WLtsZgTLtmjX6/Version.0.0.54Honeybee.0.0.50.jpg?width=545)\n\nWe are extremely excited today to release Honeybee version 0.0.50 (and Ladybug 0.0.54) after months of development and testing. The current version of Honeybee includes 64 components that enable users to run variety of daylight analyses using RADIANCE and Daysim.\n\n<iframe _origwidth=\"420\" frameborder=\"0\" height=\"315\" src=\"//www.youtube.com/embed/o5WNxkgL0hc?wmode=opaque\" width=\"420\"></iframe>\n\n\n \n\nHere is a short list highlighting some of the capabilities of this current Honeybee release:\n\n-   Prepare geometry: Users can create geometry for simulations by either starting with a mass and quickly turning it to a complete zone or creating the geometry surface by surface, enabling maximal freedom and control.\n\n-   Generate RADIANCE materials: Users can generate a wide variety of Radiance materials by either specifying a material color or inputting individual numeric values for material properties.\n\n-   Generate RADIANCE skies: Honeybee supports several sky types including a Climate-based sky, a Cumulative Climate-based sky, and several Standard CIE skies. And that’s not all! You can also visualize the sky by using the “watch the sky” component.\n\n-   Run several types of RADIANCE simulations: Honeybee enables users to run several types of accurate image-based analyses to produce images for luminance, Illuminance or Radiation. Honeybee supports all of the Radiance view types including Fish-eye, Parallel and Perspective, as well as both rendered and FalseColor images.  There are even components that enable users to calculate Daylight Factor and the Vertical Sky Component! Lastly, users can run image-based glare analyses using evalglare.\n\n-   Run annual daylight analyses: Honeybee uses the Daysim engine to run annual daylight analysis. There is a full set of components for setting up this type of daylight study and another set for exploring the results. If you dare, you can even setup annual runs with dynamic blinds and advanced lighting controls! All right from Grasshopper!\n\n-   …\n\nHere is what you will need to do:\n\n\n\n“Radiance is a suite of programs for the analysis and visualization of lighting in design. Greg Ward developed RADIANCE at Lawrence Berkeley National Laboratory.”\n\n\n\n“DAYSIM is a validated, RADIANCE-based daylighting analysis software that models the annual amount of daylight in and around buildings. The overall development of DAYSIM has been coordinated by Christoph Reinhart since 1998.” Read more about Daysim on the website ([http://daysim.ning.com/](http://daysim.ning.com/page/download)).\n\n \n\n**Make sure that you install both RADIANCE and DAYSIM in folders with no spaces in the file path (e.g. “C:\\Program Files” has a space between “Program” and “Files”). A good option for each is C:\\RADIANCE and C:\\Daysim, which are usually the default locations when you run the downloaded installers.**\n\nIf you want to run Glare analysis, you need to download EvalGlare from this link: ([http://www.ise.fraunhofer.de/en/downloads-englisch/software/evalglare_windows.zip/at_download/file](http://www.ise.fraunhofer.de/en/downloads-englisch/software/evalglare_windows.zip/at_download/file)). Evalgalare is developed by J. Wienold at Fraunhofer ISE. [http://www.ise.fraunhofer.de/en/](http://www.ise.fraunhofer.de/en/)\n\n \n\nTo produce false color images, you need to download FalseColor2 from this link: ([http://pyrat.googlecode.com/files/falsecolor2.exe](http://pyrat.googlecode.com/files/falsecolor2.exe)). FlaseColor2 is developed by Thomas Bleicher and is based on RADIANCE falsecolor.\n\nCopy both evalglare.exe and falsecolor2.exe to C:\\RADIANCE\\bin (or wherever you have installed RADIANCE\\bin).\n\nWe have put together some example files based on the different analysis types and you should use these to get yourself started with the ‘bee. You can download them from the link on the group page.\n\nLadybug also has four five new components. Chris and Saeran each developed two different types of Solar Fan and Solar Envelope components! Yes! Now you have more than one option to choose based on your design problem. Follow this [discussion](http://www.grasshopper3d.com/group/ladybug/forum/topics/solar-fan-solar-envelope-with-ladybug) for more information and be sure to give them a try.\n\nLast but not least, we give so many thanks to all of our great users who tested the Honeybee through its multiple iterations. Special thanks to Abraham and Daniel. Thanks again for all the support, great suggestions and comments. We really cannot thank you enough.\n\nAs always, please keep the suggestions coming and keep a critical eye to the ‘bug, ‘bee and the results of your studies!\n\nBest,\n\nMostapha, Chris and Saeran\n\nPS.1. Honeybee is a part of the Ladybug plugin and is under the same license as Ladybug.\n\n \n\nPS.2. We know that a single key installation is something that many users might want but we thought that it is more important that users have a good understanding of the programs that are under the hood of HoneyBee and we accordingly ask you to download and install RADIANCE, DAYSIM and the other applications separately from the Honeybee components. Honeybee is, after all, just an interface and all of the hard calculations are done using validated engines (such as RADIANCE and DAYSIM), which have been developed by some of the greatest scientists over years. By making users aware of where their results are coming from, we also hope to avoid questions about whether the results accurate or not. You can trust that the engines are accurate but an accurate engine is just one element needed to achieve an accurate result.  Without the ability to understand the inputs, interpret the outputs, or have a sense what is happening under the hood, users may find themselves at a loss.\n\n \n\nPS.3. As mentioned before, the energy simulation components are still under development and are not included in this package. If you compare the Honeybee of last March ([http://www.youtube.com/watch?v=aoMy4O3vN6g](http://www.youtube.com/watch?v=aoMy4O3vN6g)) with the current version here, we are sure that then you probably agree that there is a good reason for this delay.\n\n \n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "February 17, 2014 at 10:02pm", "created_by": "MostaphaSadeghipour", "topic": "Release Notes > Honeybee 0.0.50 + Ladybug 0.0.54", "replies": [{"body": "\nMostapha, Chris and Saeran:\n\nCongratulations and thank you for sharing.\n\nI can say that this is a piece of work that a lot of people will get a lot of benefit.\n\nGreat job!!\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "February 17, 2014 at 10:34pm", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nThanks Mostapha , Chris and Saeran<br/>So great, i  was reading all features ,. awesome..<br/>Best\n", "attachments": [], "created_by_name": "mohammad", "created_at": "February 18, 2014 at 1:13am", "created_by": "mohammad447", "replies": []}, {"body": "\nBrilliant stuff. Congrats Mostapha!\n", "attachments": [], "created_by_name": "Anders Holden Deleuran", "created_at": "February 18, 2014 at 4:35am", "created_by": "AndersHoldenDeleuran", "replies": []}, {"body": "\nGreat job! congratulations! ... I am starting installation process...\n", "attachments": [], "created_by_name": "Michal Dengusiak", "created_at": "February 18, 2014 at 3:27pm", "created_by": "MichalDengusiak", "replies": []}, {"body": "\nThanks Mostapha! \n", "attachments": [], "created_by_name": "Igor Mitrić Lavovski", "created_at": "February 22, 2014 at 11:34am", "created_by": "Igor425", "replies": []}, {"body": "\nwhere can i download the sample files?\n", "attachments": [], "created_by_name": "wiku", "created_at": "February 27, 2014 at 7:15am", "created_by": "chaowu", "replies": [{"body": "\nCheck the main page. From there:\n\n[Example Files for Ladybug](https://app.box.com/s/npvxmdeukoheqaq5v465)\n\n[Example Files for Honeybee](https://app.box.com/s/znns0dtewd1tclicx74q)\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "February 27, 2014 at 9:42pm", "created_by": "AbrahamYezioro", "replies": []}]}, {"body": "\nHi,\n\nIs there a plugin or a definition to let grasshopper open Evalglare and load the output image for glare analysis??? something where you can insert the image file location string and open it in Evalglare\n\nThat would be very helpfull!!\n", "attachments": [], "created_by_name": "Dalia Hafiz", "created_at": "February 28, 2014 at 11:24am", "created_by": "DaliaHafiz", "replies": [{"body": "\nHi Dalia, Honeybee has a glare analysis plugin which uses evalglare for glare analysis. You can also locate the work area. Check Honeybee example files for the glare analysis example.\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "February 28, 2014 at 3:59pm", "created_by": "MostaphaSadeghipour", "replies": []}]}, {"body": "\nHi,\n\nI just download the \"RADIANCE 4.2 for Windows\" successfully, but when I double click it. An error comes out saying \"Common causes include incomplete download and damaged media...\"\n\nSo I am here to ask if you know how to fix it?\n\nThx \n", "attachments": [], "created_by_name": "Michael Ren", "created_at": "March 13, 2014 at 4:23am", "created_by": "MichaelRen", "replies": [{"body": "\nHi Michael,\n\nThe error tells me that the download wasn't probably successful. Can you check the size of the file? It should be 13.9 MB (14,647,001 bytes).\n\nI also captured a video that shows how you can install these packages which may help: [http://www.grasshopper3d.com/group/ladybug/forum/topics/how-to-get-...](http://www.grasshopper3d.com/group/ladybug/forum/topics/how-to-get-radiance-and-daysim-installed)\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "March 13, 2014 at 8:53am", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nI would say also that you need to be patient with the Radiance website. It often happens that the download fails. Just look on your browser if the download is completed successfully.\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "March 13, 2014 at 9:55am", "created_by": "AbrahamYezioro", "replies": []}]}]}