{"body": "\nI know some of you had issues getting RADIANCE and DAYSIM installed on your system, so here is a video that shows how you can get everything installed on your system in less than 15 minutes.\n\n \n\n<iframe _origwidth=\"420\" frameborder=\"0\" height=\"315\" src=\"//www.youtube.com/embed/VSw-DYrgS68?wmode=opaque\" width=\"420\"></iframe>\n\n\n \n\nHope it helps,\n\nMostapha\n\n\n\n**PS: I forgot two things in the video:**\n\n**1. if you don't install Radiance at C:\\Radiance then you need to add the path to the system. Check this page: ([https://openstudio.nrel.gov/getting-started-developer/getting-start...](https://openstudio.nrel.gov/getting-started-developer/getting-started-radiance)).**\n\n**2. You need to also install GHPython component.**\n\n**3. Radiance has been moved to github and now you can download it from this page: ([https://github.com/NREL/Radiance/releases](https://github.com/NREL/Radiance/releases)). Download the latest .exe file for Windows.**\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "March 11, 2014 at 8:30pm", "created_by": "MostaphaSadeghipour", "topic": "How to get RADIANCE and Daysim installed", "replies": [{"body": "\nHi Mostapha,\n\nThanks for that video. Still having some problems, though. I originally installed Radiance on C:\\Energy\\Radiance (no spaces) and got the following issues when opening the \"000_GettingStarted_With_Honeybee.gh\" file:\n\n\n\nWarnings:\n\n1. Honeybee cannot find RADIANCE folder on your system.\n\nMake sure you have RADIANCE installed on your system.\n\nYou won't be able to run daylighting studies without RADIANCE.\n\nA good place to install RADIANCE is c:\\radiance\n\n \n\n2. Honeybee cannot find EnergyPlusV7-2-0 folder on your system.\n\nMake sure you have EnergyPlusV7-2-0 installed on your system.\n\nYou won't be able to run energy simulations without EnergyPlus.\n\nA good place to install EnergyPlus is c:\\EnergyPlusV7-2-0\n\n \n\nError:\n\n1. Solution exception:Could not find a part of the path 'c:\\ladybug\\HoneybeeRadMaterials.mat'.\n\n---------------------\n\nI now reinstalled Radiance in the C:\\Radiance folder and when dropping the Honeybee_Honeybee component on the canvas, I get the following:\n\nRuntime error (DirectoryNotFoundException): Could not find a part of the path 'c:\\ladybug\\HoneybeeRadMaterials.mat'.<br/>Traceback:<br/> line 253, in __init__, \"&lt;string&gt;\"<br/> line 2200, in script\n\n----------------------\n\n[that is also the only  error that I'm now getting when opening the 000 getting started file).\n\nThere is no c:\\ladybug on my PC.\n\nNote: In order to run the Radiance installer, I had to run as administrator. My user doesn't have write rights on the c-root folder (and no chance of getting that either... :)\n\n\n\nThanks,\n\nwim\n\n\n\n\n", "attachments": [], "created_by_name": "Wim R.M. Dekeyser", "created_at": "March 13, 2014 at 9:37am", "created_by": "WimRMDekeyser", "replies": [{"body": "\nUpdate:\n\nI uninstalled LBHB, manually created the c:\\ladybug folder and then installed LBHB again. I see that dropping the Honeybee_Honeybee component on the canvas creates one file in this folder.\n\nNow there only is an OpenStudio warning message but as I understand, that is not important.\n\n\n\nOpening the 000 getting started file now generates the following:\n\nWarning:\n\n1. Honeybee cannot find EnergyPlusV7-2-0 folder on your system.<br/>Make sure you have EnergyPlusV7-2-0 installed on your system.<br/>You won't be able to run energy simulations without EnergyPlus.<br/>A good place to install EnergyPlus is c:\\EnergyPlusV7-2-0\n\nError:\n\n1. Solution exception:Construction\n\n-------------------------------------------------------\n\nThe output in the panel reads as follows:\n\nLoading RAD default materials...6 RAD materials are loaded\n\nDownloading OpenStudioMasterTemplate.idf to c:\\ladybug<br/>Download complete!<br/>Loading EP construction library<br/>Runtime error (KeyNotFoundException): Construction<br/>Traceback:<br/> line 195, in __init__, \"&lt;string&gt;\"<br/> line 2202, in script\n\n \n\ncheers,\n\nwim\n", "attachments": [], "created_by_name": "Wim R.M. Dekeyser", "created_at": "March 13, 2014 at 11:56pm", "created_by": "WimRMDekeyser", "replies": []}, {"body": "\nFor what it's worth, I've now installed EnergyPlus (latest version: 8.1.0) in the c:\\EnergyPlusV8-1-0 directory.\n\n\n\nI'm still getting the warning about not finding EnergyPlusV7-2-0 and the error message as before (1. Solution exception:Construction).\n\n\n\nNote that the Honeybee_createHBSrfs in the 000 getting started file is not delivering any output and has an error:\n\n1. Solution exception:honeybee_EPZone\n\n\n\nThe Honeybee_RADParameters component is throwing the following error:\n\n1. Solution exception:honeybee_RADParameters\n\n\n\nTotally stuck...\n\nwim\n", "attachments": [], "created_by_name": "Wim R.M. Dekeyser", "created_at": "March 14, 2014 at 8:16am", "created_by": "WimRMDekeyser", "replies": []}, {"body": "\nHi Wim,\n\nSorry that I couldn't get back to you sooner. Let's get it fixed one by one. Can you please go ahead and download the new version. I updated the component not to give the warning for EnergyPlus. I will check the rest of your messages and reply shortly.\n\nTo update the components you should be able to use Honeybee_Update Honeybee to do it but as it looks like you can't copy files to C drive it may not work.\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "March 14, 2014 at 8:41am", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nI've now downloaded LB 0.0.55 and HB 0.0.51. Uninstalled the old version and installed the new one.\n\nI've then used the update components for Ladybug and Honeybee to update the components in the 000 getting started file.\n\nI'm still getting the construction, EPZone, and RADParameters errors.\n\nStanding by :)\n", "attachments": [], "created_by_name": "Wim R.M. Dekeyser", "created_at": "March 14, 2014 at 10:50am", "created_by": "WimRMDekeyser", "replies": []}, {"body": "\nI see... That happens because of the same issue. Honeybee tries to download the material files to c:\\ladybug but it fails. That 'Download complete!' message is a lie! ;)\n\nIf you copy this file to c:\\ladybug manually ([https://dl.dropboxusercontent.com/u/16228160/honeybee/OpenStudioMas...](https://dl.dropboxusercontent.com/u/16228160/honeybee/OpenStudioMasterTemplate.idf)) and re-open the file the error should go away for Honeybee_Honeybee but you will still have issues since other components also use the same folder! :|\n\nI will get this fix this by Sunday and let you know. Sorry for all the troubles you have been through and thank you for letting me know. [We will get it fixed soon](https://github.com/mostaphaRoudsari/Honeybee/issues/15). :)\n\n\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "March 14, 2014 at 11:01am", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nWell...\n\nSince I manually (i.e. by means of a admin user) created c:\\ladybug earlier today (my second message), my user has all rights within that directory. Before downloading the OpenStudioMasterTemplate.idf from the link above, I saw that the directory contained a bunch of files already.\n\nSadly (:-) there was a complicating factor that I hadn't thought of: when I was doing those first steps, I was at work. The directory already contained the OpenStudioMasterTemplate.idf file but when opening that in notepad, I found out that this was a fake - it was in fact an html file that get generated by the system at work that blocks access to all kinds of websites (considered social networking). Replacing that file with the one I now downloaded from dropbox, fixes everything...\n\n\n\nOK, a quick test shows that there are other instances of root access, e.g. the 003_shadowanalysis file has the c:\\shadowStudy path. But manually fixing these seems to work.\n\n\n\nCool!\n\nThanks a lot, Mostapha, for your hard work on these components! I'm sure going to have a good time (and a lot of learning) with all this.\n\ncheers,\n\nwim\n", "attachments": [], "created_by_name": "Wim R.M. Dekeyser", "created_at": "March 14, 2014 at 3:26pm", "created_by": "WimRMDekeyser", "replies": []}, {"body": "\nHi Wim,\n\nThank you for the update.\n\nNevertheless I added  C:\\Users\\%USERNAME%\\AppData\\Roaming\\Ladybug as an alternate folder for similar cases.\n\nThanks again for reporting this. Happy analysis! :)\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "March 17, 2014 at 9:12pm", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nThe error for the material is because of what you mentioned. The component tries to write a file for materials on your system but then it fails because of the permissions. It will cause more issues as the component needs to write several files on your C drive.\n\n\n\nDo you have write permissions on (C:\\Users\\%USERNAME%\\AppData\\Roaming\\Grasshopper)? I can add an extra check to use the roaming folder instead.\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "March 14, 2014 at 8:49am", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nMostapha,\n\nAn easy answer first :-)\n\nYes, I have write access to that path.\n", "attachments": [], "created_by_name": "Wim R.M. Dekeyser", "created_at": "March 14, 2014 at 10:27am", "created_by": "WimRMDekeyser", "replies": []}, {"body": "\nGreat! So let me apply this to Honeybee and get back to you. You should be good to go after that. Let me check the rest of your comments! :)\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "March 14, 2014 at 10:33am", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nBack to \"C:\\Energy\\Radiance\" I forgot to mention in the video that you need to add the path if you don't install it at c:\\radiance. Check this page on how you can do it: [https://openstudio.nrel.gov/getting-started-developer/getting-start...](https://openstudio.nrel.gov/getting-started-developer/getting-started-radiance)\n\n\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "March 14, 2014 at 9:19am", "created_by": "MostaphaSadeghipour", "replies": []}]}]}