{"body": "\nHi,\n\nI was wondering if there is anyway we can make adjustments on the layout of a falsecolor image like number of steps on the legend between the maximum and minimum values, generating color bands instead of color lines and the location of the legend on the final layout of the image. All these options are available within the interface of wxfalsecolor software. However, I am looking for a component within the interface of grasshopper to allow me apply these changes for a given PIC file.\n\nIs there anyway to add such features through scripting to the Honeybee_falsecolor component?\n", "attachments": [], "created_by_name": "Alireza", "created_at": "April 10, 2014 at 9:07pm", "created_by": "Alireza", "topic": "Honeybee_Falsecolor", "replies": [{"body": "\nHi Alireza,\n\nIt is indeed doable. I wasn't sure if people would ever use them though.\n\nI updated the component to support number of segments and contour bands.\n\n-Mostapha\n\n\n\n[<img class=\"align-center\" src=\"http://api.ning.com:80/files/zbcSW1D04avDeiqeAg7QmBTx9F0yX9K1YjNnB5WR*1lAtXns201nz3I8pgm*IHONm9QwjwD13umVlHDvX8tiVr-T6Dvei4KG/falseColorLegenPosition.png?width=721\" width=\"721\"/>](http://api.ning.com:80/files/zbcSW1D04avDeiqeAg7QmBTx9F0yX9K1YjNnB5WR*1lAtXns201nz3I8pgm*IHONm9QwjwD13umVlHDvX8tiVr-T6Dvei4KG/falseColorLegenPosition.png)\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1043128", "name": "falseColorLegenPosition.gh"}], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "April 12, 2014 at 1:38pm", "created_by": "MostaphaSadeghipour", "replies": [{"body": "\nHi Mostapha,\n\nThank you indeed for the response. The new options added to the component are critical once analyzing a considerable number (over five hundred images) of luminance distribution images and saves a lot of time avoiding the hassle of making such adjustments individually for every single image through the wxfalsecolor interface. I believe such features significantly accelerate the workflow of lighting analysis for projects dealing with numerous point-in-time luminance distribution images.\n\nI wanted to ask for a couple of other options that are both available through the interface of wxfalsecolor. I hope this would not be too much to ask and would not be time-consuming to integrate with the Honeybee falsecolor components:\n\n\n\n1) would it be possible to have the option to save the generated false color image with PNG format? There are components already for conversion to TIFF and GIF formats. However, the PNG is not one of them. The PNG format would be helpful especially for web-based layouts.\n\n2) would it be possible to integrate the masking feature with the Honeybee-falsecolor component? It is available on wxfalsecolor and allows the user to replace the areas with luminance values below a certain threshold with a black region. Therefore, instead of the pink-purple background, as you can see in your image, we will have a black region. I have added a link to the specified feature for further reference:\n\n[Background Masking](https://sites.google.com/site/tbleicher/radiance/falsecolor2)\n\n\n\nI appreciate indeed all the great effort put into these components.\n\nThanks,\n\nAlireza\n", "attachments": [], "created_by_name": "Alireza", "created_at": "April 12, 2014 at 3:28pm", "created_by": "Alireza", "replies": []}, {"body": "\nHi Alireza,\n\n\n\nDefinitely! Curious to know more about your web-based 500+ analysis project.\n\n\n\n1. I'm using Radiance for converting HDR files. I can't see any option for PNG in Radiance files. I will check wxfalsecolor source code.\n\n\n\n2. The component already masks the values less than 0.1 but not for contour line or contour band images ([here](https://github.com/mostaphaRoudsari/Honeybee/blob/master/src/Honeybee_FalseColor.py#L126)). Now that I opened up the other options it makes sense to have masking threshold as an input. I will try to apply it tomorrow.\n\n\n\nAnything else that you can think might be helpful?\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "April 12, 2014 at 5:41pm", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nThank you for your quick response.\n\nThe problem I have ran into with the version of the Honeybee_falsecolor used in the \"[falseColorLegenPosition.gh](http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1043128)\" file you have uploaded is that the new component is obviously different from the original component found in the latest version of Honeybee. Therefore, once I attempt to open the file, the grasshopper sends an error message informing me that there is no replica of the component used in the file as a source userobject. I suppose I'd need the new Honeybee_falsecolor component with the new features with a .ghuser format so that I can copy and replace it within the grasshoppers' UserObject folder. Unless the discrepancy between the new falsecolor component with the added features and the original component installed with the most recent version of the Honeybee should be solved in some other way.\n\nThanks,\n\nAlireza\n", "attachments": [], "created_by_name": "Alireza", "created_at": "April 13, 2014 at 1:54am", "created_by": "Alireza", "replies": []}, {"body": "\nThe file should work fine regardless unless David has recently changed the way userObjects work in GH. The .ghuser file is attached. Make sure you are using the newest version of Honeybee_Honeybee which is also attached. -Mostapha\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1043387", "name": "Honeybee_FalseColor.ghuser"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1043388", "name": "Honeybee_Honeybee.ghuser"}], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "April 13, 2014 at 7:58am", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nHi Mostapha,\n\nThanks for uploading the .ghuser files. I have replaced the previous files with the new ones and the problem with the discrepancy between two different versions of a component appears to be solved.\n\nI almost forgot to answer your questions on the previous post.\n\nThe capability to avoid the hassle of setting adjustments for individual luminance distribution images generated over a long period of time with short intervals between consecutive shots allows the user to setup a semi-automated process through which the generated images could be integrated for a preset layout such as a web page and updated once required.\n\n\n\nRegarding the flasecolor component, the two features of saving as PNG file and the capability to adjust the masking threshold would be all I can think of for now to enable the user for further modifications on the false color images. There are certainly other options like acuity loss, color loss and veiling glare that are available through the interface of wxfalsecolor. However, I do not find them as critical at least for the purposes of my own project.\n\nI hope the source code for wxfalsecolor/falsecolor2 would provide the options for PNG formatting.\n\n\n\nThe situation with the integrated masking feature for values below 0.1 is that once you change the output from regular \"color fill\" to \"contour bands\", the margin around the image frame will also receive the color of lowest value (pink-purple) and will be no longer rendered as a black margin that you can find on a  regular \"color fill\" output. Now, this is not a  problem with the Honeybee_falsecolor component. wxfalsecolor also does the same thing with the margin colors with a \"contour bands\" layout. I was under the impression that the added feature for \"Background masking\" on the link I had attached would address this issue. \n\nI appreciate indeed all the effort for further developments of the Honeybee/Ladybug components.\n\nAlireza\n", "attachments": [], "created_by_name": "Alireza", "created_at": "April 13, 2014 at 4:13pm", "created_by": "Alireza", "replies": []}, {"body": "\nHi Alireza,\n\n\n\nI checked wxfalsecolor source code. Tomas is using wx libraries for converting to png.\n\n\n\nI ended up using Windows libraries. I added a new component that let you convert image files. It won't convert an HDR file to PNG but you can convert frequently used image file types. You have to do in two steps (HDR&gt;TIFF&gt;PNG) but it does the job.\n\n\n\nI also added the maskThreshold as an input so you can change it for your studies. Please check the attached file.\n\n\n\n[<img class=\"align-center\" src=\"http://api.ning.com:80/files/LzTY94yzCcJrseHYcFgsdFJbDYLb6ltJFPOoNCniKaWQyIoCrVi3poVh6DgenkTniAj6UbA-RhLKW*UNVDOpSt20s5jUThmW/falseColorMasked_PNG.png?width=500\" width=\"500\"/>](http://api.ning.com:80/files/LzTY94yzCcJrseHYcFgsdFJbDYLb6ltJFPOoNCniKaWQyIoCrVi3poVh6DgenkTniAj6UbA-RhLKW*UNVDOpSt20s5jUThmW/falseColorMasked_PNG.png)\n\n\n\nBest of luck with your studies,\n\nMostapha\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1043506", "name": "falseColorMasked_PNG.gh"}], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "April 13, 2014 at 4:45pm", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nThis is great!\n\nThank you very much for applying the new features in such short notice.\n\nI believe I would need the .ghuser file formats for the two components  (Honeybee_falsecolor and Honeybee_Convert IMG) as I encountered the same discrepancy error between the new ones and the previous versions. Once I replace the previous versions of the component inside the Userobject folder with the latest ones, I would be able to easily load them into my project via the Honeybee tool bar with no error messages.\n\n\n\nThank you indeed,\n\nAlireza\n", "attachments": [], "created_by_name": "Alireza", "created_at": "April 13, 2014 at 5:42pm", "created_by": "Alireza", "replies": []}, {"body": "\nYou are very welcome. Both files are attached.\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1043661", "name": "Honeybee_FalseColor.ghuser"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1043662", "name": "Honeybee_Convert IMG.ghuser"}], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "April 13, 2014 at 5:45pm", "created_by": "MostaphaSadeghipour", "replies": []}]}]}