{"body": "\nHi all,\n\nI am trying to understand the basics of how the RADIANCE-program works, and how one is actually able to get daylight factor values and illuminance values in sensor points.\n\nAm I right to say that radiance is a measure of the light-power that radiates from a surface within a solid angle on a surface in W/(sr m^2), and that the RADIANCE-program evaluates the light in every point on an analysis grid by weighting the colour each light ray carries (i.e. the RGB channels of the light) with the equation R = 0.265*r + 0.670*g + 0.065*b.\n\nTo get illuminance one must then factor in the luminous efficacy of standard skies in RADIANCE by multiplying the equation with the factor 179, and to obtain the daylight factor, the luminous efficacy should be divided by 10000 which is the sky illuminance of the CIE standard overcast sky?\n\nAlso, can this be directly related to dynamic daylight metrics such as daylight autonomy?\n", "attachments": [], "created_by_name": "Örn Erlendsson", "created_at": "May 22, 2014 at 10:58am", "created_by": "OErnErlendsson", "topic": "Understanding Radiance", "replies": [{"body": "\nHi Orn,\n\n\n\nTo get the daylight factor you can generate a sky with a certain horizontal illuminance value, run the analysis and then divide the results with the sky value. -B is the key that let you do this.\n\ngensky 12 4 +12:00 -c -B 55.866 will generate a sky with 10,000 lux (55.866 = 10000/179)\n\nCheck Radiance gensky documentation for more information.\n\n\n\nAlso, can this be directly related to dynamic daylight metrics such as daylight autonomy?\n\n\n\nI'm not sure if I fully understand your question for this one. Are you asking if this is how dynamic daylight meters get calculates? Daysim uses daylight coefficient method to run the annual analysis which you can read more about it in the publications that you can find on their website.\n\n\n\nMostapha\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "May 22, 2014 at 4:18pm", "created_by": "MostaphaSadeghipour", "replies": [{"body": "\nHi Mostapha,<br/><br/>Thank you for the reply. <br/><br/>Sorry for the poorly formulated question. What I wanted to ask was how the illuminance for dynamic simulations was obtained, i.e. if it was with the same method as explained in RADIANCE, and how DAYSIM and RADIANCE interact with one another.\n", "attachments": [], "created_by_name": "Örn Erlendsson", "created_at": "May 27, 2014 at 1:46am", "created_by": "OErnErlendsson", "replies": []}, {"body": "\nHi Orn,\n\n\n\nDaysim is developed on top of Radiance but it has a different approach to the simulation. There are multiple publications but I would suggest you to read this paper if you want to only read one:\n\n\n\nBourgeois D, Reinhart CF, Ward G, “A Standard Daylight Coefficient Model for Dynamic Daylighting Simulations” Building Research &amp; Information 36:1 pp. 68 – 82, 2008.\n\n\n\nI assume you have already checked Daysim home page. Just in case you haven't you will find more resources on the page: [http://daysim.ning.com/](http://daysim.ning.com/)\n\n\n\nHope it helps,\n\nMostapha\n\n\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "June 2, 2014 at 8:20pm", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nGreat, thank you.\n", "attachments": [], "created_by_name": "Örn Erlendsson", "created_at": "June 4, 2014 at 6:53am", "created_by": "OErnErlendsson", "replies": []}]}]}