{"body": "\nOk I manage to produce DLA analysis. But I still have a question.\n\nIn the definition of DLA ([http://patternguide.advancedbuildings.net/using-this-guide/analysis...](http://patternguide.advancedbuildings.net/using-this-guide/analysis-methods/daylight-autonomy)) As well as in The daylight handbook I [http://thedaylightsite.com/daylighting-handbook-i/](http://thedaylightsite.com/daylighting-handbook-i/)) which I recommend to everyone interested in daylight metrics. The definition always talks about 50% of the occupancy period. In HB the component only returns the DLA as a % of the Occ. Period.\n\nIs the 50% of Occ.Period required or DLA can also work as given by the HB component?\n\n \n\nthank you all\n", "attachments": [], "created_by_name": "Claudio", "created_at": "June 18, 2014 at 11:59am", "created_by": "Claudio", "topic": "Daylight Autonomy", "replies": [{"body": "", "attachments": [], "created_by_name": "Claudio Campanile", "created_at": "June 18, 2014 at 4:30pm", "created_by": "ClaudioCampanile", "replies": [{"body": "\nThank you Claudio. It does help, but I'm confused on the 50%of Occ. Period that all the related literature talks about. I think it does depend on the user as well as illuminance requirements. I do think that the 50% is a well informed of roughly the amount of time user will use the space.\n\nI'll try to keep a poste here with our conclusions and tests\n\n\n\ncheers\n", "attachments": [], "created_by_name": "Claudio", "created_at": "June 19, 2014 at 6:13am", "created_by": "Claudio", "replies": []}, {"body": "\nHi Claudio(s), 50% comes with sDA (spatial daylight autonomy). Check this reference: <cite class=\"_Zd\">[www.techstreet.com/products/preview/1853773](http://www.techstreet.com/products/preview/1853773)</cite>\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "June 20, 2014 at 3:21am", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nHi Claudio,\n\n\n\nIf I remember correctly from what Christoph Reinhart told me, you can count a certain space (or point) as daylit if the Daylight Autonomy at the space (or point) is greater than 50%.  Christoph uses this to draw a line across a lot of large open rooms and divide the daylit part of the space from the not daylit part of the space.  Interestingly, he has compared this calculated line to surveys of occupants in the space who where asked to draw a line between the portion of the space that they thought was daylit and the portion that they thought was not daylit.  Ultimately, Christoph and team used this to calculate a \"Daylit Area\" of a given building, which they then used this to argue to developers and planners that floor cost pera are could be higher if a space was considered daylit.\n\n\n\nI am sorry that I cannot find the specific study for you at the moment but I remember that Christoph was working on this with my friends Tarek and Alstan.  I hope that this helps.\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "June 23, 2014 at 11:49pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nI should also say that Daylight Autonomy in this case is the percentage of occupied hours in which a given space (or point) is above the daylight threshold (usually around 300 lux).\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "June 23, 2014 at 11:51pm", "created_by": "ChrisMackey", "replies": []}, {"body": "", "attachments": [], "created_by_name": "Claudio", "created_at": "June 24, 2014 at 7:33am", "created_by": "Claudio", "replies": []}, {"body": "\nThat's great to hear.  I have been meaning to pick up Christoph's book since he published it.  I'll have to give it a read sometime this summer.  I'm looking forward to the images and all questions are always welcome!\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "June 24, 2014 at 3:23pm", "created_by": "ChrisMackey", "replies": []}]}], "id": "1090211"}