{"body": "\nGreetings LB+HB Community!\n\n\n\nI write to start a discussion about the future LB+HB wiki.  Please post here any suggested features that you might want for the wiki and any good examples of other wikis that you think we should follow.  The list so far of these two things are:\n\n\n\nFeatures of the LB+HB Wiki:\n\n1. Includes all component descriptions as well as component input + output descriptions.\n\n2. Pictures to go along with the component descriptions above.\n\n3. Ability to search for keywords across all LB+HB components.\n\n4. Include the links to example files that feature each component.\n\n5. Include the links to Youtube videos that feature each component.\n\n6. Include links to referenced scientific papers used to make components.\n\n7. Allow users to upload teaching resources or post links of their own youtube videos.\n\n8. (Developer Wish) Make a component that can easily check all components and update the wiki.\n\n\n\nPotential Models to Follow:\n\n1. Build our own html pages from the ground up (probably creating something like the rhinocommon documentation [http://4.rhino3d.com/5/rhinocommon/index.aspx](http://4.rhino3d.com/5/rhinocommon/index.aspx))\n\n2. Make a Wiki next to our code on Github like the Dynamo Wiki ([https://github.com/DynamoDS/Dynamo/wiki](https://github.com/DynamoDS/Dynamo/wiki)).\n\n3. Create a sleek-looking but potentially difficult-to-update wiki from a template like the Blender Wiki ([http://wiki.blender.org/](http://wiki.blender.org/)).\n\n\n\n\n\nPlease post any features we're forgetting or wikis you like.  Suggestions from people who have created wikis before would be EXTREMELY helpful.  We're going to try to put this wiki together sometime this year so post now or forever hold your peace!\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "July 6, 2014 at 4:54pm", "created_by": "ChrisMackey", "topic": "Ladybug + Honeybee Wiki", "replies": [{"body": "\nNice discussion.\n\n\n\nOn \"Potential Models to follow\":\n\n1. Build our own html pages\n\n**pros:** the best custom features\n\n**cons:** some of us, not that much familiar with html, might struggle when creating pages.\n\n\n\n2. Github pages:\n\n**pros:** it has nice search feature recalling those of [rhinocommon](http://4.rhino3d.com/5/rhinocommon) one:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/c2nk1pk6akR65Iu2gCBJ*C8eKbeoIyrIEl6V-Is4VWixdcOadzZLAOSFQ15PxY4WTs8LvRVTBEbPVohfe8ueNYiZjHQZoyM0/proba.jpg?width=250\" width=\"250\"/>](http://api.ning.com:80/files/c2nk1pk6akR65Iu2gCBJ*C8eKbeoIyrIEl6V-Is4VWixdcOadzZLAOSFQ15PxY4WTs8LvRVTBEbPVohfe8ueNYiZjHQZoyM0/proba.jpg)\n\nConnection with already present ladybug repository.\n\n**cons:** (personally) I do not like the default github theme. It's too \"coder\" like, white background, black letters. It would be nice if we could change it to some other one.\n\n\n\n3. Free bloggs - wordpress, blogger... (some other ones).<br/>**pros:** That would be visually more appealing than github. It would also allow for more easy creation of pages than \"1. Build our own html pages\". Wordpress even has a feature to support syntax highlighting for python snippets ([sourcecode language=\"python\"]code[/sourcecode]). Blogger might have than one too, with additional mods.\n\n**cons:** both mentioned blogs have a bit \"tricky\" search engines. \"Tricky\" - meaning the searching would not look like in case of github or rhinocommon, by topic names, but it will list the topics along with previews:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/c2nk1pk6akQUk-JjAT5y16uuMsMB5AxHwxhw8iVD*OtuRt8zV8sk605L3sKERWelvIDPEX8E1MFQqxaG3nV1ay4XyYVrBQdI/proba2.jpg?width=250\" width=\"250\"/>](http://api.ning.com:80/files/c2nk1pk6akQUk-JjAT5y16uuMsMB5AxHwxhw8iVD*OtuRt8zV8sk605L3sKERWelvIDPEX8E1MFQqxaG3nV1ay4XyYVrBQdI/proba2.jpg)\n\nNot sure if some additional search module exist for both platforms?\n", "attachments": [], "created_by_name": "djordje", "created_at": "July 7, 2014 at 4:52am", "created_by": "djordje", "replies": []}, {"body": "\nHi Chris, Mostapha and others.\n\nSo I think Github is a fantastic solution, and it's a lot less work, but it has a couple drawbacks that you've probably already noticed.\n\nIf the goal of the wiki is to primarily act as documentation, and secondarily act as a forum, I think this is fine. You can encourage users to use the issues page if they have questions (these can act like small discussion threads). And you can create a FAQ page if needed. If you'd like auto-generate pages, remember that it is possible to create a separate repo for your wiki and that it can be composed entirely of plain-text markdown files.\n\nFor big binary files that might be provided as downloads, you can put them anywhere (dropbox, google docs) and then just grab a download link.\n\nAlso, I'm sure there's a lot more out of the box wiki-style content management systems that you could probably install for php on a basic linux server. You may want to do a little more research into wiki-style or discussion board style CMS.\n\nI'm curious what you choose, as I often face similar dilemmas.\n\n\n", "attachments": [], "created_by_name": "Benjamin Golder", "created_at": "July 7, 2014 at 5:19am", "created_by": "BenjaminGolder", "replies": []}, {"body": "\nHi Chris, Djordje and Ben, Thank you for your thoughtful comments.\n\nFor me one of the most important aspects of the platform is ease of contribution from the community. I picture that the majority of the contents come from the community of the users and not the developers for multiple reasons.\n\nFor this reason I would vote for a wiki similar to Blender which is build using MediaWiki ([http://www.mediawiki.org/wiki/MediaWiki](http://www.mediawiki.org/wiki/MediaWiki)). It is easy to maintain, already designed for wiki and easy to get users involved. The only issue is probably setting it up for the first time which will probably need a great amount of effort.\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "July 9, 2014 at 8:39pm", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nHey guys, I think this is a fantastic idea.\n\n\n\nI agree that html and github would probably be too difficult for the majority of the users, (although I personally really like github's sophistication, i.e: integration with code, search features).\n\n\n\nReiterating Benjamin's point: are you guys imagining this to be a straight-up wiki, or more of a community-oriented platform? If the latter, I think something like Ning: [http://www.ning.com/](http://www.ning.com/) would be better than MediaWiki. You can see an example of its use here for UMI: [http://urbanmodellinginterface.ning.com/](http://urbanmodellinginterface.ning.com/). \n\n\n\nThe main advantage with Ning is that it has a lot more out-of-the-box features: including a dedicated forum and places to share projects and a place to store downloads. One possible disadvantage here is that a forum feature would be redundant with the LB/HB Grasshopper page and threads. Overall though, I think it's a  stronger community platform then MediaWiki.   \n", "attachments": [], "created_by_name": "Saeran Vasanthakumar", "created_at": "August 18, 2014 at 2:41pm", "created_by": "SaeranVasanthakumar", "replies": [{"body": "\nHi Saeran, Thank you for your comments. I assume there should be an option to close the discussion forum so it can only be used as a wiki. Do you have any experience of using Ning?\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "August 23, 2014 at 10:42am", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nI would go for MediaWiki, as it looks to have more wiki oriented approach, while Ning, may not be the best platform if we are not planning on using it as a forum too (we will be using this current [grasshopper3d group pages](http://www.grasshopper3d.com/group/ladybug/forum) as a forum, right?). The MediaWiki [installation procedure](http://www.mediawiki.org/wiki/Manual:Installation_guide) seems to be documented.\n", "attachments": [], "created_by_name": "djordje", "created_at": "August 23, 2014 at 4:27pm", "created_by": "djordje", "replies": []}, {"body": "\nAh, I just realized that Ning is not free - $25/mth - so that, I believe, kills that option. \n\nGiven that we're leaning towards a wiki-style CMS, I looked for other options[1][2] but MediaWiki so far seems the best. The alternatives tend to be be more complicated to install. \n\n[Blender](http://wiki.blender.org/) is a good case study. What other wiki-communities are there, that we can use as precedent?\n\n \n\n[1] [http://www.onlamp.com/pub/a/onlamp/2004/11/04/which_wiki.html](http://www.onlamp.com/pub/a/onlamp/2004/11/04/which_wiki.html)\n\n[2] [http://www.1stwebdesigner.com/design/14-cms-for-wiki-websites/](http://www.1stwebdesigner.com/design/14-cms-for-wiki-websites/) \n", "attachments": [], "created_by_name": "Saeran Vasanthakumar", "created_at": "August 23, 2014 at 5:55pm", "created_by": "SaeranVasanthakumar", "replies": []}]}, {"body": "\nIn the category of 'yet another option'...\n\nI just noticed that McNeel uses DokuWiki for its wiki pages.\n\nI haven't looked into this any further myself at the moment...\n\n[https://www.dokuwiki.org/dokuwiki](https://www.dokuwiki.org/dokuwiki)\n", "attachments": [], "created_by_name": "Wim R.M. Dekeyser", "created_at": "September 10, 2014 at 11:26pm", "created_by": "WimRMDekeyser", "replies": []}], "id": "1098315"}