{"body": "\nSo, when I apply ladybug to a very simple/continuous form/surface I'm able to get good results but now I'm trying to apply it to a more complicated model and I'm having trouble simplifying the mesh enough for ladybug to function correctly, otherwise I just get a bunch of scattered test points and results (See attached images). So I guess I'm trying to simplify the model's mesh so that the test points are applied uniformly to generate more accurate results.\n\nAny suggestions would be great! Thanks.\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1101888", "name": "Image 1.JPG"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1101889", "name": "Image 2.JPG"}], "created_by_name": "Justin", "created_at": "July 14, 2014 at 2:57pm", "created_by": "Justin950", "topic": "How to simplify model for Ladybug analysis?", "replies": [{"body": "\nHi Justin,\n\n\n\nI guess you are using meshes (and not breps) for analysis. In this case Ladybug assumes you already taken care of face sizes so it doesn't regenerate the mesh. The scattered points are based on your input mesh. This feature let the user use any custom grid that fits their design.\n\n\n\nThere are two solutions for this:\n\n1. Convert test meshes to brep, and use them for the analysis. Brep input will be meshed based on your input for grid size. You don't need to do it for context, just for what you connect to input geometry.\n\n\n\n2. Generate the appropriate mesh yourself using any of the other Grasshopper plugins.\n\n\n\nHope it helps,\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "July 14, 2014 at 5:44pm", "created_by": "MostaphaSadeghipour", "replies": [{"body": "\ngreat, thanks for the reply.\n\n\n", "attachments": [], "created_by_name": "Justin", "created_at": "July 21, 2014 at 8:48am", "created_by": "Justin950", "replies": []}]}], "id": "1101890"}