{"body": "\nHello, \n\nFirst of all: Great Work! I can't even imagine how much you have put into this wonderful project. Thank you! \n\nI am running solar radiation simulation using ladybug and ecotect and I am getting slightly different results. I am calculating average daily solar radiation for entire year for a massing. The ecotect shows flat roofs to be exposed to over 2200 Wh/m2 while ladybug max daily average is about 1700Wh/m2 \n\nIn ladybug, i just divide the total by 365 days and since output is in kWh/m2, I multiply by 1000 to get Wh/m2 (using the Re-Color mesh to display final results and the new legend)\n\n\n\nIf anyone knows why, could you please point me in the right direction? My model is in meters. \n\nThanks! \n\nIlya Bourim\n\n\n", "attachments": [], "created_by_name": "Ilya Bourim", "created_at": "July 22, 2014 at 6:50am", "created_by": "IlyaBourim", "topic": "Ecotect vs Ladybug", "replies": [{"body": "\nHi Ilya,\n\n\n\nThank you for the nice comment.\n\n\n\nLet's make sure we are comparing similar values together. First of all make sure that you are using the same weather file for both Ecotect and Ladybug.\n\n\n\nMoreover Ecotect's sky model is different from Ladybug's sky model ([http://naturalfrequency.com/wiki/sky-subdivision](http://naturalfrequency.com/wiki/sky-subdivision)). Ladybug uses Tregenza/Reinhart sky models and Radiance's gendaymtx which are both validated methods.\n\n\n\nFor what you are calculating it is easy to compare the values with the weather data. Check global Horizontal Radiation values from the weather file and compare them to your results of the simulation for a roof. They should be pretty close. The more you add to sky density the closer the values will be. Check the attached file for an example.\n\n\n\nCheers,\n\nMostapha\n\n\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1105785", "name": "globalHorizontalRadiationComparison.gh"}], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "July 24, 2014 at 3:31am", "created_by": "MostaphaSadeghipour", "replies": [{"body": "\nYou are right, I am kinda comparing apples and oranges. The weather file is not the same. The project is in Guangzhou, but Ecotect only has a file for Hong Kong. It isn't that far, but still. So in Ecotect I used the weather for Hong Kong, in Ladybug I used the weather for Guangzhou. I am also not sure how Ecotect and Ladybug take samples of the surfaces and how face normals play into that.  Just last week I started testing with solar shading devices and Ladybug's results tend to come out better. They look like something we might expect in real life. I am simplifying to a one bay of the office tower and I will do the tests again and will share the results.\n\nThanks again for responding and your help!\n", "attachments": [], "created_by_name": "Ilya Bourim", "created_at": "July 27, 2014 at 8:15pm", "created_by": "IlyaBourim", "replies": []}, {"body": "\n\n\nHi Ilya,\n\nwhen you are done this study in both tools would be good if you could share your results.\n\nMichal\n", "attachments": [], "created_by_name": "Michal Dengusiak", "created_at": "July 30, 2014 at 2:54pm", "created_by": "MichalDengusiak", "replies": []}, {"body": "\nHi Michal, \n\nResults are different at the end. I made sure to have the same weather file this time. The size of each sample I tried to make the same. In ecotect, I divided the surface into 50mm squares. In ladybug, I've setup the sample to be taken every 50mm. (Ecotect generated 17712 panels, Ladybug 17856) I ran both tests from 8am to 6pm, everyday for the entire year. If the sky is pre-calculated, ladybug is much faster in analyzing. About 3 times as fast. \n\nNext I will do the same test, but non-shaded. I guess it would be crucial to see if the difference is the same. I am not so concerned about the actual numbers, but about percent differences. \n\nIlya\n\nPS I posting screenshots. If you see errors let me know. \n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1108804", "name": "ecotect_model.jpg"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1108805", "name": "ecotect_results.jpg"}], "created_by_name": "Ilya Bourim", "created_at": "July 31, 2014 at 1:54am", "created_by": "IlyaBourim", "replies": []}, {"body": "\nAnd here are the screen-shoots for ladybug. \n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1108809", "name": "ladybug_model.jpg"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1109010", "name": "ladybug_results.jpg"}], "created_by_name": "Ilya Bourim", "created_at": "July 31, 2014 at 1:56am", "created_by": "IlyaBourim", "replies": []}, {"body": "\nDrum-roll!!!!\n\nOk, so there is a bit of a difference. On average values, the results are very close (6% difference), on the extremes, not so much. It looks like on the lower extreme, ladybug and ecotect have a difference of about 30%. While on the upper extreme, the difference is only about 8%. It looks to me ecotect is more conservative on average and ladybug is picking up more values on the lower extreme... way more. \n\nPlease be aware that I am running the ecotect radiation simulation using the \"fast calculation\" option. I am going to re-run without that checkmark and share results. But so far it takes very long time(many, many hours). I don't know if I have the patience. \n\n\n\nSo, I don't know what to do now. \n\nCheers, \n\nIlya\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1109115", "name": "final_results.jpg"}], "created_by_name": "Ilya Bourim", "created_at": "July 31, 2014 at 3:27am", "created_by": "IlyaBourim", "replies": []}]}]}