{"body": "\nI have a sphere covered in test points (testPts) that are used for radiation analysis with the \"radiation analysis\" component.\n\n\n\nI can color and \"weight\" each test vector (testVec) using the vector display Ex component to show the magnitude of solar radiation on each point, as demonstrated in the attached images.\n\nThis is already cool, but the vector information i am looking for relates to the more complex relationship between a given test point, and the multiple number of sky patches it \"sees.\" For each patch, there should be a corresponding vector, and some radiation contribution.\n\n\n\nI would like to color and scale each of these vectors to illustrate the direction and contribution of the sky patches on each test point.  This would result in a more cactus-like outcome, with each test point sprouting a collection of \"spikes,\" with each spike oriented directly at a particular sky patch in view.\n\n\n\nHope this makes sense, any suggestions if (A: this is possible or not) and (B: how to do it) would be appreciated. \n\n\n\n\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1106161", "name": "Screen Shot 2014-07-24 at 11.33.22 PM.png"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1106162", "name": "Screen Shot 2014-07-24 at 11.35.19 PM.png"}], "created_by_name": "Octagon26", "created_at": "July 25, 2014 at 12:46am", "created_by": "Octagon26", "topic": "Visualizing all vectors for test point and klems patches it \"sees\"", "replies": [{"body": "\nHi, You can generate skyPatches, and correspondent vectors and radiation values from the sky dome. Sky density of 0 generates 145 patches while sky density of 1 generates 580 patches.\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/JH0C62scBfCdeoZMNmTfcPcFTdepPzJWYzmagP0s0U6aTOd4s9A0ZHC02hAIY3ron-o1cX5PkZY7z*WsdkaRQv2xu1*5FteX/skyVectors.png?width=721\" width=\"721\"/>](http://api.ning.com:80/files/JH0C62scBfCdeoZMNmTfcPcFTdepPzJWYzmagP0s0U6aTOd4s9A0ZHC02hAIY3ron-o1cX5PkZY7z*WsdkaRQv2xu1*5FteX/skyVectors.png)\n\n\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1106189", "name": "skyVectors.gh"}], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "July 25, 2014 at 2:27am", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nHi ,\n\nYou can gather the vectors to each skypatch by drawing a vector from (0,0,0) to the centerpoint of each skypatch (output by the ladybug skydome module). Measure the incident angle between each skypatch and the normal of your target surface. You can then use the equation I*cos(@) (I = skypatch radiance, @ = incident angle) or the dot product between the two unit vectors * the skypatch intensity to gather the irradiation on the surface expected from each skypatch. These are the values you use to scale and color your vectors.\n\n \n\nTo visualize your cactus try the SDL line component. Use the patch center point as the start input, the skypatch vectors as the direction input, and a length scaled by the calculated irradiance value. These lines can be colored with the script you already have set up and previewed using the custom preview module. The \"Human\" plugin has a great module that will allow you to change the color and thickness of the lines.\n\n \n\nYou could also make a cone or some other shape based on the start point, vector direction and calculated value but using Breps may slow it down too much. These could be colored using the custom preview component. Good luck.\n", "attachments": [], "created_by_name": "Leland Curtis", "created_at": "July 25, 2014 at 8:18am", "created_by": "LelandCurtis", "replies": [{"body": "\nThanks Leland and Mostapha,\n\n\n\nI have created one spikey vector thing, which has a basepoint of 0,0,0 and displays the direction and intensity of solar irradiation.\n\n\n\nWhat i really want to do now, is create the entire cactus, which represents a building geometry and corresponding point grid, where the spikey vector thing is applied to each point over the grid.\n\n\n\nThis may be what Leland is suggesting, however i found it difficult to feed the SDL line component with the proper information to simply map the spikey thing to each point on a grid covering (say) a box or some arbitrary geometry. Assuming that gets working, i could then tweek the vectors to display the irradiation properly based on law of cosine.\n\n\n\nHave a look\n\n\n\n\n\n\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1106564", "name": "skyVectors_idea1.gh"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1106565", "name": "Screen Shot 2014-07-25 at 10.24.57 PM.png"}], "created_by_name": "Octagon26", "created_at": "July 25, 2014 at 11:34pm", "created_by": "Octagon26", "replies": []}, {"body": "\none more image here\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1106659", "name": "Screen Shot 2014-07-25 at 10.24.44 PM.png"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1106660", "name": "Screen Shot 2014-07-25 at 10.25.23 PM.png"}], "created_by_name": "Octagon26", "created_at": "July 25, 2014 at 11:36pm", "created_by": "Octagon26", "replies": []}, {"body": "\nHere's a visualization of what i am going for .....\n\n\n\nspikey things over a geometry, now the task is to adjust the graphics a bit to make it readable, and scale the vectors in response to surface orientation (for example, the vectors displayed on the horizontal roof plane should be valid, but those on the vertical surfaces should be modified as suggested by Leland).  file attached\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1106569", "name": "Screen Shot 2014-07-25 at 10.59.47 PM.png"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1106570", "name": "skyVectors_idea2.gh"}], "created_by_name": "Octagon26", "created_at": "July 26, 2014 at 12:08am", "created_by": "Octagon26", "replies": []}, {"body": "\nI think you are on the right track. Be sure to size each \"cactus\" based on the incident angle measurements generated from each point. I would cull all negative data to ensure you aren't using vectors that are fully blocked by the facade. You can do this using the cull pattern component and test each cos to see if it is negative. Use the resultant Boolean argument as the cull pattern mask. If your data tree structure is correct, you should be able to scale the cactus on each point based on the values calculated at each point. All surfaces, even the horizontal ones, should weight the incoming values based on the incident angle.\n", "attachments": [], "created_by_name": "Leland Curtis", "created_at": "July 27, 2014 at 11:58am", "created_by": "LelandCurtis", "replies": []}, {"body": "\nhere are a few examples, with weighting and culling based on surface view...\n\n\n\nlots of graphic edits to be done here next,\n\n\n\nthanks for the tips!\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1109931", "name": "Screen Shot 2014-08-02 at 9.54.23 PM.png"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1109932", "name": "Screen Shot 2014-08-02 at 10.04.29 PM.png"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1109933", "name": "skyVectors_cactus_scaled_BAKE_complex_v2.gh"}], "created_by_name": "Octagon26", "created_at": "August 2, 2014 at 11:08pm", "created_by": "Octagon26", "replies": []}]}], "id": "1106163"}