{"body": "\nHello Mostapha,\n\n\n\nI start here a discussion regarding the Sky Factor analysis.\n\n\n\nIf I understand correctly also, it seems to be a Vertical Sky Component analysis on the interior horizontal working plane at 0.85m above the floor.\n\n\n\nI copy paste from the Appendix E:Rights to Light of the book \"Paul Littlefair**,** **Site Layout Planning for Daylight and Sunlight, A good practice,** BRE Press, p.60\" which is the primary guide for evaluating the impact of new construction to the Rights to Light of the existing adjustment buildings:\n\n\n\n**\"The accepted way of calculating the loss of light is to compute the sky factor at a series of points on the working plane. In dwellings, the working plane height is usually taken to be 0.85 m (two feet nine inches). The sky factor is the ratio of the illuminance directly received from a uniform sky at the point indoors, to the illuminance outdoors under an unobstructed hemisphere of this sky. No allowance is made for glass losses or light blocked by glazed bars and (usually) window frames; nor is reflected light included, either from interior surfaces or obstructions outside. Thus the sky factor is not the same as the CIE daylight factor (see Appendix C). The sky factor is often calculated using a Waldram diagram, but this is a different Waldram diagram to Figure B1 in Appendix B, which should not be used for this purpose.\"**\n\nThought couldn't find the specific Waldram diagram for this case from the references, I assume contemporary analytical tools should exist to calculate it.\n\n\n\nI used your Vertical Sky Component process and culled the mesh faces lower than 0.2% but I believe because of they type of the radiance analysis as you have explained it before (stochastic method) it doesn't create one continuous edge, as you can see in the attached image.<br/><br/>\n\nThanks,\n\nDimitris\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1121199", "name": "Sky_Factor_Contour_Test_01.jpg"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1121200", "name": "Sky_Factor_01.gh"}], "created_by_name": "Dimitrios Papadopoulos", "created_at": "August 25, 2014 at 2:49pm", "created_by": "doompop", "topic": "Sky Factor (Rights to Light) BRE", "replies": [{"body": "\nHi Dimitris, It is a bit tricky. Give me more time to think about this. In this case we cannot add to -ab since we don't want to have reflections to be ambient reflections to be considered in the calculation. At the same time it will make discrepancy in the results. There should be a way to set radiance parameters to get this right. I won't be able to get to this problem right now but I added this to github as a wish and will take care of it soon: ([https://github.com/mostaphaRoudsari/Honeybee/issues/174](https://github.com/mostaphaRoudsari/Honeybee/issues/174)).\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "August 26, 2014 at 9:29pm", "created_by": "MostaphaSadeghipour", "replies": [{"body": "\nThank you very much once again!\n\n\n\nDimitris\n\n\n", "attachments": [], "created_by_name": "Dimitrios Papadopoulos", "created_at": "August 27, 2014 at 8:12am", "created_by": "doompop", "replies": []}, {"body": "\nHere we go! I added _ad_ as one of the inputs so you can get a higher resolution by adding to the number. One less issue for 2015!\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/TuH-vYM0DCwltwNTaJInHFbeyAISr1S4lgR4uuYu2u9-o4Wgfs-xOJEkmUCmAC3j6lyrsSpoOPi9I3PSboqRbcnUZsPXp8vJ/SkyFactor.png\" width=\"500\"/>](http://api.ning.com:80/files/TuH-vYM0DCwltwNTaJInHFbeyAISr1S4lgR4uuYu2u9-o4Wgfs-xOJEkmUCmAC3j6lyrsSpoOPi9I3PSboqRbcnUZsPXp8vJ/SkyFactor.png)\n\nMostapha\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1197345", "name": "Sky_Factor_01_msr.gh"}], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "December 31, 2014 at 2:01pm", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nThat its fantastic!\n\nThank you very much for the Christmas present Mostapha!\n\nHappy New Year! Wish you all the best for 2015!\n\nMay it bring happiness, health and............Butterfly!!! ;))))))))))))))))))))))))))P\n\nBest!\n\nDimitris\n", "attachments": [], "created_by_name": "Dimitrios Papadopoulos", "created_at": "December 31, 2014 at 2:33pm", "created_by": "doompop", "replies": []}]}]}