{"body": "\n**Release Notes - September 15th**\n\n**Ladybug 0.0.58 and Honeybee 0.0.55:**\n\n \n\nWe are all pleased to announce that, after months of development and a long fruitful summer, we will be releasing a new stable version of both Ladybug and Honeybee.  Notable among the new components are 51 new Honeybee components for setting up and running **energy simulations** and 15 new Ladybug components for running detailed comfort analyses.  We are also happy to announce the start of comprehensive tutorial series on how to use the components and the first one on getting started with Ladybug can be found here:\n\n[https://www.youtube.com/playlist?list=PLruLh1AdY-Sj_XGz3kzHUoWmpWDXNep1O](https://www.youtube.com/playlist?list=PLruLh1AdY-Sj_XGz3kzHUoWmpWDXNep1O)\n\n \n\nA second one on how to use the new Ladybug comfort components can be found here:\n\n[https://www.youtube.com/playlist?list=PLruLh1AdY-Sho45_D4BV1HKcIz7oVmZ8v](https://www.youtube.com/playlist?list=PLruLh1AdY-Sho45_D4BV1HKcIz7oVmZ8v)\n\n<br/> <br/>\n\n**Here is a short list highlighting some of the capabilities of this current Honeybee release:**\n\n \n\n1) Run EnergyPlus and OpenStudio Simulations - A couple of components to export your HBZones into IDF or OSM files and run energy simulations right from the grasshopper window!  Also included are several components for adjusting the parameters of the simulations and requesting a wide range of possible outputs.\n\n \n\n2) Assign EnergyPlus Constructions - A set of components that allow you to assign constructions from the OpenStudio library to your Honeybee objects.  This also includes components for searching through the OpenStudio construction/material library and components to create your own constructions and materials.\n\n \n\n3) Assign EnergyPlus Schedules and Loads - A set of components for assigning schedules and Loads from the Openstudio library to your Honeybee zones.  This includes the ability to auto-assign these based on your program or to tweak individual values.  You can even create your own schedules from a stream of 8760 values with the new “Create CSV Schedule” component.  Lastly, there is a component for converting any E+ schedule to 8760 values, which you can then visualize with the standard Ladybug components\n\n \n\n4) Assign HVAC Systems - A set of components for assigning some basic ASHRAE HVAC systems that can be run with the Export to OpenStudio component.  You can even adjust the parameters of these systems right in Grasshopper.\n\nNote: The ASHRAE systems are only available for OpenStudio and can’t be used with Honeybee’s EnergyPlus component. Also, only ideal air, VAV and PTHP systems are currently available but more will be on their way soon!\n\n \n\n5) Import And Visualize EnergyPlus Results - A set of components to import numerical EnergyPlus simulation results back into grasshopper such that they can be visualized with any of the standard Ladybug components (ie. the 3D chart or Psychrometric chart).  Importers are made for zone-level results as well as surface results and surfaces results can be easily separated based on surface type.  This also means that E+ results can be analyzed with the new Ladybug comfort calculator components and used in shade or natural ventilation studies.  Lastly, there are a set of components for coloring zone/surface geometry with EnergyPlus results and for coloring the shades around zones with shade desirability.\n\n \n\n6) Increased Radiance and Daysim Capabilities - Several updates have also been made to the existing Radiance and Daysim components including parallel Radiance Image-based analysis.\n\n \n\n7) Visualize HBObject Attributes - A few components have been added to assist with setting up honeybee objects and ensuing the the correct properties have been assigned.  These include components to separate surfaces based on boundary condition and components to label surfaces and zones with virtually any of their EnergyPlus or Radiance attributes.\n\n \n\n8) WIP Grizzly Bear gbxml Exporter - Lastly, the release includes an WIP version of the Grizzly Bear gbXML exporter, which will continue to be developed over the next few months.\n\n \n\n**And here’s a list of the new Ladybug capabilities:**\n\n \n\n1) Comfort Models - Three comfort models that have been translated to python for your use in GH: PMV, Adaptive, and Outdoor (UTCI).  Each of these models has a “Comfort Calculator” component for which you can input parameters like temperature and wind speed to get out comfort metrics.  These can be used in conjunction with EPW data or EnergyPlus results to calculate comfort for every hour of the year.\n\n \n\n2) Ladybug Psychrometric Chart - A new interactive psychrometric chart that was made possible thanks to the releasing of the Berkely Center for the Built Environment Comfort Tool Code ([https://github.com/CenterForTheBuiltEnvironment/comfort-tool](https://github.com/CenterForTheBuiltEnvironment/comfort-tool)).  The new psychrometric chart allows you to move the comfort polygon around based on PMV comfort metrics, plot EPW or EnergyPlus results on the psych chart, and see how many hours are made comfortable in each case.  The component also allows you to plot polygons representing passive building strategies (like internal heat gain or evaporative cooling), which will adjust dynamically with the comfort polygon and are based on the strategies included in Climate Consultant.\n\n \n\n3) Solar Adjusted MRT and Outdoor Shade Evaluator - A component has been added to allow you to account for shortwave solar radiation in comfort studies by adjusting Mean Radiant Temperature.  This adjusted MRT can then be factored into outdoor comfort studies and used with an new Ladybug Comfort Shade Benefit Evaluator to design outdoor shades and awnings.\n\n \n\n4) Wind Speed - Two new components for visualizing wind profile curves and calculating wind speed at particular heights.  These allow users to translate EPW wind speed from the meteorological station to the terrain type and height above ground for their site.  They will also help inform the CFD simulations that will be coming in later releases.\n\n \n\n5) Sky Color Visualizer - A component has been added that allows you to visualize a clear sky for any hour of the year in order to get a sense of the sky qualities and understand light conditions in periods before or after sunset.\n\n \n\n**Ready to Start?**\n\n \n\nHere is what you will need to do:\n\nDownload Honeybee and Ladybug from the same link [here](http://www.food4rhino.com/project/ladybug-honeybee). Make sure that you remove any old version of Ladybug and Honeybee if you have one, as mentioned on the Ladybug group page.\n\n**You will also need to install RADIANCE, DAYSIM and ENERGYPLUS on your system.** We already sent a video about how to get RADIANCE and Daysim installed (link). You can download EnergyPlus 8.1 for Windows from the DOE website ([http://apps1.eere.energy.gov/buildings/energyplus/?utm_source=Energ...](http://apps1.eere.energy.gov/buildings/energyplus/?utm_source=EnergyPlus&amp;utm_medium=redirect&amp;utm_campaign=EnergyPlus%2Bredirect%2B1)).\n\n“[EnergyPlus](http://apps1.eere.energy.gov/buildings/energyplus/energyplus_about.cfm) is a whole building energy simulation program that engineers, architects, and researchers use to model energy and water use in buildings.”\n\n“OpenStudio is a cross-platform (Windows, Mac, and Linux) collection of software tools to support whole building energy modeling using EnergyPlus and advanced daylight analysis using Radiance.”\n\n\n\n**Make sure that you install ENERGYPLUS in a folder with no spaces in the file path (e.g. “C:\\Program Files” has a space between “Program” and “Files”). A good option for each is C:\\EnergyPlusV8-1-0, which is usually the default locations when you run the downloaded installer.**\n\n<br/> <br/>\n\n**New Example Files!**\n\n \n\nWe have put together a large number of new updated example files and you should use these to get yourself started. You can download them from the link on the group page.\n\n<br/> <br/> <br/>\n\n**New Developers:**\n\nSince the last release, we have had several new members join the Ladybug + Honeybee developer team:\n\n \n\n**Chien Si Harriman** - Chien Si has contributed a large amount of code and new components in the OpenStudio workflow including components to add ASHRAE HVAC systems into your energy models and adjust their parameters.  He is also the author of the Grizzly Bear gbxml exporter and will be continuing work on this in the following months.\n\n \n\n**Trygve Wastvedt** - Trygve has contributed a core set of functions that were used to make the new Ladybug Colored Sky Visualizer and have also helped sync the Ladybug Sunpath to give sun positions for the current year of 2014\n\n \n\n**Abraham Yezioro** - Abraham has contributed an awesome new bioclimatic chart for comfort analyses, which, despite its presence in the WIP tab, is nearly complete!\n\n \n\n**Djordje Spasic** - Djordje has contributed a number of core functions that were used to make the new Ladybug Wind Speed Calculator and Wind Profile Visualizer components and will be assisting with workflows to process CFD results in the future.  He also has some more outdoor comfort metrics in the works.\n\n \n\n**Andrew Heumann** - Andrew contributed an endlessly useful list item selector, which can adjust based on the input list, and has multiple applications throughout Ladybug and Honeybee.  One of the best is for selecting zone-level programs after selecting an overall building program.\n\n \n\n**Alex Jacobson** -  Alex also assisted with the coding of the wind speed components.\n\n<br/> <br/>\n\nAnd, as always, a special thanks goes to all of our awesome users who tested the new components through their several iterations. Special thanks goes to Daniel, Michal, Francisco, and  Agus for their continuous support. Thanks again for all the support, great suggestions and comments. We really cannot thank you enough.\n\n \n\nEnjoy!,\n\nLadybug + Honeybee Development Team\n\n \n\nPS: If you want to be updated about the news about Ladybug and Honeybee like Ladybug’s Facebook page ([https://www.facebook.com/LadyBugforGrasshopper](https://www.facebook.com/LadyBugforGrasshopper)) or follow ladybug’s twitter account (@ladybug_tool).\n\n \n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "September 14, 2014 at 11:49pm", "created_by": "ChrisMackey", "topic": "NEW RELEASE OF LADYBUG AND HONEYBEE!", "replies": [{"body": "\nImpressive and needed.\n\nPity that the summer is almost over, ah? :-)\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "September 15, 2014 at 5:19am", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nGreat Finally here. Can't wait to put it to use. One question. I guess this will break all previous definitions that we've put together?\n\n \n\nThank you Chris for your videos they are great and Mostapha you rock man!!! Love LB and HB.....\n\n \n\nKeep up the good work\n\n \n\nCheers\n\nClaudio\n", "attachments": [], "created_by_name": "Claudio", "created_at": "September 15, 2014 at 8:26am", "created_by": "Claudio", "replies": [{"body": "\nHi Claudio,\n\n\n\nGlad that you're excited.  All of your old GH files will still work as they originally did.  The only issue is that, if you want to edit these old files using the new LB+HB components, the old version is not compatible with the new components and you will get a warning from any of the new components that you are not using the latest version if you drop it onto the canvas of an older GH definition.\n\n\n\nIf you have a GH definition that you must update so that you can edit it, the safest way to do this is to go through component-by-component in your definition and replace the old Ladybug + Honeybee components with new ones in your LB+HB tabs.  This is what I would recommend for the majority of the Ladybug community and in cases where you want to be sure that everything works correctly in your new GH file.\n\n\n\nOf course, I know that this process above is tedious and, if you are willing to risk not having a perfect file in order to maximize your speed, I will mention that there is a way of trying to update your old GH definitions using the Ladybug_Update Ladybug component.  The \"updateThisFile\" input can search through your GH definition and try to replace the code in all LB+HB components with new code.  HOWEVER, this does not always work - particularly in the cases where a new component does not have the same inputs and outputs as its older version.  Such components with different inputs/outputs have to be updated manually as stated above after the initial run of the Update Ladybug component. Also, this process with the Update Ladybug component technically syncs the components in your GH definition to what is on our github, which is not as stable as the version that we release here so be wary of bugs in files updated this way.\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "September 15, 2014 at 1:50pm", "created_by": "ChrisMackey", "replies": []}]}, {"body": "\nI am studying Architecture at UNC Charlotte (North Carolina, United States) and I would like to thank the creators of Honeybee and Ladybug.  I am new to both Grasshopper and parametric design, but I am excited to be investigating them and even more for discovering the tools you've developed!  Big thanks to you all.\n\n\n\nNoah\n", "attachments": [], "created_by_name": "Noah Palmer Licht", "created_at": "December 11, 2014 at 10:12pm", "created_by": "NoahPalmerLicht", "replies": []}], "id": "1131302"}