{"body": "\nHi everyone,\n\n \n\nI'm having an issue with the latest release, I can't get either Ladybug or Honeybee to fly, when I drop the base component onto the workspace it freezes up and I have to kill the process.\n\n \n\nI have updated to latest Grasshopper and python, anything basic I'm missing?\n\n \n\nI'm only a novice user but managed very easily to get the last one up and running!\n\n \n\nCheers\n", "attachments": [], "created_by_name": "Ben Foster", "created_at": "September 23, 2014 at 9:02pm", "created_by": "BenFoster", "topic": "Can't let Ladybug or Honeybee Fly?", "replies": [{"body": "\nwell this is embarrassing.....  turns out I wasn't waiting long enough on my slow PC. Now onto updating Energyplus!\n", "attachments": [], "created_by_name": "Ben Foster", "created_at": "September 23, 2014 at 9:18pm", "created_by": "BenFoster", "replies": []}, {"body": "\nHi Ben,\n\nHow long have you waited for the process to run before you kill it?  Copying LB_KB and HH_HB usually take several seconds now that we have added a lot more classes and functions that take time to copy to the menory.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "September 24, 2014 at 6:25am", "created_by": "ChrisMackey", "replies": [{"body": "\nHi Chris,\n\n \n\nIt's taking upwards of 4-5 minutes, so I was wondering if something was wrong. Sounds like something might be up then if it's only meant to take several seconds?\n\n \n\nI'm hopefully getting a PC upgrade in a few days so I'll be able to compare. It should be a fresh install of Rhino/GH/LB+HB so that might fix things up as well.\n\n \n\nCheers\n", "attachments": [], "created_by_name": "Ben Foster", "created_at": "September 24, 2014 at 4:51pm", "created_by": "BenFoster", "replies": []}, {"body": "\nHi Ben,\n\nIs that the case both for Ladybug and Honeybee? Ladybug shouldn't take long at all to load. In case of Honeybee the first time that you let it fly, it downloads a number of files that you can find in installation folder. I wonder if that is the reason of 4-5 minutes?\n\n\n\nCheers,\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "September 25, 2014 at 1:56am", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nIt is the case for both.  I was thinking it could have been an issue with attempts at downloading. I'm stuck behind a rather strict corporate firewall.\n\n \n\nI noticed that Openstudio_standards.json was one file that was attempted and blocked, so I got a copy of that downloaded separately. Still no fix. Are there more specific files that are needed?\n\n \n\nIf I can get the firewall relaxed for an initial run should this fix it up for good?\n\n \n\nThanks for the help\n", "attachments": [], "created_by_name": "Ben Foster", "created_at": "September 25, 2014 at 2:03am", "created_by": "BenFoster", "replies": []}, {"body": "\nI'm not sure if firewall is the reason since Ladybug doesn't download anything once you let it fly. Is that also the case when you insert other GHPython components into canvas?\n\nLet us know if changing your system didn't solve the issue. There might be something strange going on with copying data to sticky.\n\nNot really related to your issue but in case you don't know, once you let them fly you will be fine for that instance of Rhino and you don't need to do it again.\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "September 25, 2014 at 2:41am", "created_by": "MostaphaSadeghipour", "replies": []}]}, {"body": "", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "September 24, 2014 at 7:56pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nThanks for the help guys, much appreciated.  I think it's my system and will know for sure when my new one arrives. A colleague who hasn't updated HB/LB only take a few seconds.\n\n \n\nWill keep you updated.\n\n \n\nBen\n", "attachments": [], "created_by_name": "Ben Foster", "created_at": "September 25, 2014 at 11:08pm", "created_by": "BenFoster", "replies": [{"body": "\nHi Ben,\n\n\n\nOut of curiosity. are you able to drop the normal GHPython component in the Maths tab onto your canvas?  That will give us an idea if it is something specific to LB+HB or something that more generally happens with GHPython on your system.\n\n\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "September 26, 2014 at 7:51am", "created_by": "ChrisMackey", "replies": []}, {"body": "\nHi Chris,\n\n \n\nI am able to drop it on without any issues. Of course it has a warning that I have no script to execute!\n\n \n\nOne thing that Honeybee says after it has run is that Schedule = OA already is existed in the library, please rename on of the OA. What does this mean?\n\n \n\nHopefully my new system will be around this week to test.\n", "attachments": [], "created_by_name": "Ben Foster", "created_at": "September 28, 2014 at 5:18pm", "created_by": "BenFoster", "replies": []}, {"body": "\nHi Ben,\n\nSorry for taking so long to get back.  I can tell you what the error means: the component is saying that the schedule for Outdoor Air (OA) is already in your openStudio library.  So my guess something is going wrong in the download of the OpenStudio libraries that automatically happens when you drag and drop the HB component onto the canvas the first time.\n\n\n\nWhat is your internet connection like on your machine?  Is is stable? Is there a firewall or anything that could block your access to the site app.box?\n\n\n\nThere is a workaround for this if this is so.  You will have to download the openstudio libraries here:\n\n[https://app.box.com/s/y2sx16k98g1lfd3r47zi](https://app.box.com/s/y2sx16k98g1lfd3r47zi)\n\nand then copy and paste them into a folder that you create in this location of your computer:\n\nC:\\ladybug\\openstudio\n\n\n\nIf there is a folder there already, then delete it.\n\n\n\nMy guess is that something similar might be happening for Ladybug and the Radiance functions that it downloads and uses.  I can give you more instructions if this first workaround helps.\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "September 30, 2014 at 11:56am", "created_by": "ChrisMackey", "replies": []}, {"body": "\nHi Chris, no worries.\n\n\n\nMy internet connection is behind a corporate firewall and very difficult to get around, so I agree it could be an issue here.\n\n \n\nUnfortunately the openstudio files downloaded and placed in the spec'd location didn't have an effect.\n\n \n\nIt did however highlight for me that not all content is defaulting to c:\\ladybug.  Model results seem to go between that location and the appdata\\roaming folder for ladybug instead.  I copied the openstudio files into there as well, but no luck.\n\n \n\nNow, which is even stranger, my GH file asks for HB and LB to be flown even after the file has initialised (346.7 seconds...), so I have to delete and re-drop them onto the canvas.\n\n \n\nAll very strange, and my colleague who is running an older version of HB and LB doesn't have these issues.\n\n \n\nLast but not least, these issues are happening on my new system as well.\n\n \n\nThanks for all the help, let me know anything you ned from me to help identify what this could be!\n\n \n\nCheers\n", "attachments": [], "created_by_name": "Ben Foster", "created_at": "September 30, 2014 at 10:04pm", "created_by": "BenFoster", "replies": []}]}], "id": "1136437"}