{"body": "\nHi Mostapha,\n\nI generated the shading mask for a very simple model, placing the test point in a window sill. What is bizzare (as you can see in the image) is the fact that this point can see behind the walls!\n\nAlso you have provided ain image with a transparent shading mask, is ti possible to explain me how you did it?\n\nThanks in advance,\n\nKostas\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1140730", "name": "image1.jpg"}], "created_by_name": "kostas mourkos", "created_at": "October 1, 2014 at 8:38am", "created_by": "kostasmourkos", "topic": "inquires regarding the shading mask component", "replies": [{"body": "\nHi Kostas,\n\nDidn't get well the \"behind the walls\" issue, but for the transparency you have 2 options:\n\n1. Using the LB_shadingMask (as you are doing) there is no option in GH. Just to bake the resulting geometry and do the transparency directly in Rhino.\n\n2. Use the LB_shadingMaskII (the one with the colors). Then you can play with the color and transparency if you conect the appropriate outputs to a CustomPrevie component. The pitfall is that is a kind of proof of concept version of the component and can take some time to do the calculation. This is the one Mostapha shows in the comments section a while ago.\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "October 1, 2014 at 10:08am", "created_by": "AbrahamYezioro", "replies": [{"body": "\nHi Abraham and thanks for your prompt response!\n\nYes, I didn't explain it very well.\n\nI mean that the area where the arrow points out should be in shadow and the sky view factor hould be 50% ( I get a slightly larger value).\n\nThanks again,\n\nKostas\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1140986", "name": "image2.png"}], "created_by_name": "kostas mourkos", "created_at": "October 1, 2014 at 11:57am", "created_by": "kostasmourkos", "replies": []}, {"body": "\nNow i get it,\n\nJust checked this. There is an input _skyDensity, which is supposed to be 0 or 1 (For Tregenza sky patch subdivision, or 1 for Reinhart's). Default is supposed to be 0.\n\nIn anycase your isue is related to this resolution value. I was thinkung that the possible values are 0 or 1, but now i see that the default is 3. If you make this bigger, say 5, you'll see that it looks smoother ... taking more time to compute.\n\nSo, the question (another one) for Mostapha is what this value is supposed to be, or better, if the values are 0 or 1 only and there is a bug right now.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "October 1, 2014 at 12:29pm", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nAbraham and Kostas,\n\n\n\nThank you for all of the questions.  I wrote that description to the shading mask before I really understood what the function inside the component was doing.  I have just replaced it with the following:\n\n\n\n\"An integer that is greater than or equal to 0, which to sets the number of times that the Tergenza sky patches are split.  Set to 0 to view a sky mask with the typical Tregenza sky, which will divide up the sky with a coarse density of 145 sky patches.  Set to 1 to view a sky mask of a Reinhart sky, which will divide up each of these Tergenza patches into 4 patches to make a sky with a total of 580 sky patches. Higher numbers input here will ensure a greater accuracy but will also take longer. The default is set to 3 to give you a high accuracy.\"\n\n\n\nTo answer the question of what the number is supposed to be, it is really whatever level of accuracy that you need the results to be.  You can put it as high of a number as you like until your system crashes :)\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "October 1, 2014 at 9:16pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nHi all,\n\n\n\nAbraham, All your comments are correct (as usual). As Chris mentioned sky can be as dense as you want. There is no limitation. The reason that I put limitation on genCumulativeSky is that it can take very long for denser skies and it won't do that much for accuracy of the results.\n\n\n\nAlso looking to Kostas image it might be a good idea to break the top surface also in pieces so it gives more accurate results.\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "October 2, 2014 at 4:48am", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nHi all,\n\nMany thanks for your answers,\n\nKostas\n", "attachments": [], "created_by_name": "kostas mourkos", "created_at": "October 4, 2014 at 3:48am", "created_by": "kostasmourkos", "replies": []}]}]}