{"body": "\nMostapha,\n\n\n\nI have a question on the results I'm getting from honeybee. I'm testing the illuminence in my project at a specific hour with the grid based recipe and the annual recipe, but get different results. I have the same geometry, test points and weather file. I'm pulling the sky for my grid based analysis from the weather file. When I look at the color gradient, I can see similarities, but the lux drops off much quicker in one than the other.\n\n\n\nCan you shed some light on how these two types of analysis compare to each other and why the results would differ? I'm working with our lighting engineers to determine the baseline lighting scenario for the space and I'm not sure which analysis to trust or recommend.\n\n\n\nI attached a simplified version of the rhino model and a GH definition with both workflows.\n\n\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/ep*dLmCPR*zVFuQdYIjFNaSDF2luXgCD4wY0*6ansyOaDAjL2*7sReWcpJrU5KQeOuMpAWuFsYExp2DovNW7ps30tHfx-uLV/gridvsannual.JPG?width=750\" width=\"750\"/>](http://api.ning.com:80/files/ep*dLmCPR*zVFuQdYIjFNaSDF2luXgCD4wY0*6ansyOaDAjL2*7sReWcpJrU5KQeOuMpAWuFsYExp2DovNW7ps30tHfx-uLV/gridvsannual.JPG)Thanks for your help,\n\nNate\n\n\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1142430", "name": "annual vs grid daylight.3dm"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1142431", "name": "annual vs grid daylight.gh"}], "created_by_name": "Nate Holland", "created_at": "October 3, 2014 at 5:51pm", "created_by": "NateHolland", "topic": "Annual vs Grid Daylighiting", "replies": [{"body": "\nHi Nate,\n\nThose are some very high lux levels that you are getting there and I see that you are simulating an almost fully-glazed building.  I haven't gotten the chance to run your Daysim analysis yet but, if I had to guess, it looks like the simulations differ from each other by an hour.  On one hour, you have the sun shining directly through most of the glass making that big orange mark across your building (this would be the annual analysis on the right).  On the other, you have the sun moved one hour later and is directly shining only on a little corner of your building (this would be the grid-based analysis).  It seems like you may have discovered a bug in the matching of hours between the two analyses types.  Let me know if I am mistaken and, Mostapha, let me know if you think that this is true.\n\n\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "October 3, 2014 at 7:55pm", "created_by": "ChrisMackey", "replies": [{"body": "\nHi Nate and Chris,\n\nThis is an interesting discussion. I will check the files after work today. Keep in mind that Daysim is using a simplified method (both for sky and ray-tracing) to minimize the analysis time. Naturally it will always give you different and less accurate results than using Radiance for each hour. Look for this paper online: Bourgeois D, Reinhart CF, Ward G, “A Standard Daylight Coefficient Model for Dynamic Daylighting Simulations” Building Research &amp; Information 36:1 pp. 68 – 82, 2008.\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "October 6, 2014 at 7:54am", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nHi Nate,\n\nI cannot generate as much as difference as you have in your image. I can still see a difference though which is as expected.\n\n[<img class=\"align-center\" src=\"http://api.ning.com:80/files/l4W8jVdh3X9ZZA6NvHweDk10wQTRR2XQ-04IR2RkDkqN9WwGfcqXCSggv-MPGJHQcx1vjXZBhfp27D1AHmRWHMIb2eWtdRWu/results_12pm_Top.png?width=721\" width=\"721\"/>](http://api.ning.com:80/files/l4W8jVdh3X9ZZA6NvHweDk10wQTRR2XQ-04IR2RkDkqN9WwGfcqXCSggv-MPGJHQcx1vjXZBhfp27D1AHmRWHMIb2eWtdRWu/results_12pm_Top.png)\n\nIt is mainly because the sky is pretty clear at the hour that you are testing and as you have probably seen in the paper Daysim methodology has quite a bit of simplification for the direct lights. If you try it for another hour with less direct light you will see that the results will closely match (e.g. 10 am the same day)\n\n[<img class=\"align-center\" src=\"http://api.ning.com:80/files/l4W8jVdh3X-UB2rqF8K2wHYHmlEdrPBYvvARMwQUH6n1S8LMi5uY-N7g*c78yn23lTF06zSGA2FhX--0dUj9S7QfFDwUQo8A/results_10am_Top.png?width=680\" width=\"680\"/>](http://api.ning.com:80/files/l4W8jVdh3X-UB2rqF8K2wHYHmlEdrPBYvvARMwQUH6n1S8LMi5uY-N7g*c78yn23lTF06zSGA2FhX--0dUj9S7QfFDwUQo8A/results_10am_Top.png)\n\nYou are probably thinking that how can you trust the results from Daysim then! Well, if you check one of the annual measures, for instance check the area that has illuminance &gt; 500 lux, you will see the results will be pretty close.\n\n\n\nSaying this, I should also add that there are newer methodologies (3-5 Phase methods) that are trying to address this issue. Implementing them to Honeybee will open up a new set of possibilities.\n\n\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "October 6, 2014 at 8:38pm", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nHere is the file - \n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1144258", "name": "annualvsgriddaylight_msr.gh"}], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "October 6, 2014 at 8:40pm", "created_by": "MostaphaSadeghipour", "replies": []}]}], "id": "1142432"}