{"body": "\nHi Mostapha and Chris,\n\nJust finished to see the whole video series on HB. Awesome Chris!\n\nAfter that i have some questions regarding the addToEPLibrary component.\n\n1. Adding an element to the library will make this element available for all new GH file or just for the specific GH where it is defined?\n\n2. Where the library is located? It is the jason file?\n\n3. If i added an element to the library, and the general library is updated becouse of a new version of HB or any other reason, i will loose my \"personal\" elements? If so, how can i back them up?\n\nThanks,\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "October 7, 2014 at 12:04pm", "created_by": "AbrahamYezioro", "topic": "HB material/construction/schedule library", "replies": [{"body": "\nForgot to ask also the following:\n\nI have a very long list of local materials and constructions. Is there a way to input them externally to the library? It will be very painful to do that one by one.\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "October 7, 2014 at 12:18pm", "created_by": "AbrahamYezioro", "replies": [{"body": "\nHi Abraham,\n\n\n\n1. Right now it will be only added to the memory for the current project.\n\n2. When you add it to the library using the component it will be in the memory and won't be written to any file (I know what you are thinking about now, read the next one).\n\n\n\n3 &amp; 4. In case you have materials and constructions already created just copy them to \"LadybugFolderOnYourMachine\\userCustomLibrary.idf\" and it will be loaded every time you let the Honeybee fly. This is your custom library and won't be ever overwritten. You can copy any standard material, construction or schedule and it will be added to Honeybee library.\n\n\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "October 7, 2014 at 3:07pm", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nThese are all very good questions that should also have answers in the video tutorial series.  I think I will put up another video at some point that shows the workflow for adding constructions to the userCustomLibrary.  When it is up, I will post in here so that other users that find this page will know.\n\n\n\nThanks for watching all of the videos, Abraham!\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "October 7, 2014 at 7:32pm", "created_by": "ChrisMackey", "replies": []}]}, {"body": "", "attachments": [], "created_by_name": "jP Trujillo Levy", "created_at": "July 17, 2016 at 12:35pm", "created_by": "JuanPabloTrujilloLevy", "replies": [{"body": "\nI found 2 usercustomeplibrary.idf files: in the c:\\ladybug and c:\\user...\\...appdata\\roaming... folders. I found HB reads custom materials and constructions from first folder.\n", "attachments": [], "created_by_name": "jP Trujillo Levy", "created_at": "July 19, 2016 at 8:29am", "created_by": "JuanPabloTrujilloLevy", "replies": []}]}]}