{"body": "\nHello, I have a question\n\n\n\nI have done my last daylight calculations in Diva (Rhino + Grasshopper) and there the workflow of building geometry was as follows:\n\n\n\n1. Building the geometry in Rhino\n\n2. Adding Radiance Materials to that geometry\n\n3. Exporting the Radiance File\n\n4. Go into Grasshopper and add the parametric geometry needed\n\n5. Set up the wanted daylight calculation via Diva for Grasshopper\n\n6. \"Switching on\" the add from Rhino option -&gt; this means having an exported File in the Temp folder (as from 3.)\n\n7. Running the calculation\n\n\n\nSo is there a workflow like that for Honeybee or do you need to add the geometry from Rhino as Breps in Honeybee and so on ?\n\n\n\nThank you very much\n\n\n\ncheers Tom\n", "attachments": [], "created_by_name": "Thomas Lechner", "created_at": "October 8, 2014 at 8:05am", "created_by": "ThomasLechner", "topic": "What is the best workflow regarding geometry?", "replies": [{"body": "\nHi Tom,\n\nYou can start from Rhino or Grasshopper and it doesn't really matter as far as you are \n\nYou have couple of options on how to prepare the geometry and it really depends on what you want to do.\n\nThe general concept is that you need to convert a Rhino/Grasshopper object to a Honeybee object. You can assign your custom materials and apply it to the geometries or just let Honeybee apply default materials based on the type.\n\nYou can also put several recipes that you can also put together (Daylight factor, gridBased, imageBased, AnnualAnalysis, etc...)\n\nIf you have an example it will be easier to help. Also I suggest you to watch this video from minute 22 ([https://www.youtube.com/watch?v=M4MA82_CPPA&amp;list=UUX0holrRypJil...](https://www.youtube.com/watch?v=M4MA82_CPPA&amp;list=UUX0holrRypJilkFo-Dv4JsQ)). As far as I remember I cover these concepts.\n\nMostapha\n\n\n\n\n\n\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "October 8, 2014 at 9:42pm", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nTom,\n\nIf I had to lay out a step-by-step method:\n\n\n\n1. Build the geometry parametrically in Grasshopper or manually in Rhino + bring the geo into GH (as long as you end up with breps in Grasshopper, any geometry creation method is good).\n\n2. Pass the Breps through a createHBSrfs or a Mass2Zone component, which will turn the breps into HBSrfs or HBZones that have Radiance materials assigned to them (note that you can assign glazing based on a ratio to HBZones without windows).\n\n3. Connect the HBSrfs or HBZones up to a Honeybee_Run Daylight Simulation component.\n\n4. Connect an anlysis recipe up to the Honeybee_Run Daylight Simulation component, which tells the component what type of radiation/daylight simulation to run.\n\n5. Run the simulation by setting _writeRad and _runRad to \"True\".\n\n6. If the simulation produced something you want to use in GH, import the results back into Grasshopper using one of the Honeybee Daylight \"Read Result\" components (this will vary depending on your simulation).\n\n\n\nAs Mostapha noted, the youtuibe video might be your best way to learn.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "October 9, 2014 at 12:56pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nThank you very much Mostapha and Chris for your answers! That helped a lot and I'm getting first results\n", "attachments": [], "created_by_name": "Thomas Lechner", "created_at": "October 11, 2014 at 1:41am", "created_by": "ThomasLechner", "replies": []}]}