{"body": "\nHello Guys,\n\n\n\nI took the definition in this discussion( [http://www.grasshopper3d.com/group/ladybug/forum/topics/glare-analysis](http://www.grasshopper3d.com/group/ladybug/forum/topics/glare-analysis))\n\nThe idea is to illustrate the galre risk of a given Srf that is in front of a glass building. I manage to create a mesh that displays the risk of glare over the whole year.\n\nBut now my client asks if its possible to have a false color image (like evalglare) from the interior of the building looking towards the glass building in order to evaluate the possible glare at a working station. I guess using HoneyBee I'll be able to get that glare analysis. \n\nWhat will be the method to evaluate the glare over the whole year?\n\nHow can I contro the reflectance of the glass building within a HoneyBee_Radiance_Glass Material\n\n\n\nThank you all in advance\n\n\n\ncheers\n\n\n", "attachments": [], "created_by_name": "Claudio", "created_at": "October 14, 2014 at 8:18pm", "created_by": "Claudio", "topic": "Glare analysis according to a reflectance % of a glass panel", "replies": [{"body": "\nHi Claudio,\n\nMostapha will probably jump in with some better information after me but I thought that I should post what I know now in case it helps you get started.  You are right that you can do in-depth glare analysis with the Honeybee components related to daylight/Radiance.\n\nAlso, I can confirm that will definitely be making a big jump from the previous discussion that you quoted.  However, you will ultimately be able to get a much more accurate understanding of the glare risk this way.\n\nIn order to narrow down your run time, I might start by selecting out a a set of hours of the year where you are interested in studying the glare probability (since running the entire year can be a lengthy calculation that takes many hours).  Next, you can follow these general steps:\n\n1) Set up your Rhino geometry as you would for any daylight simulation.  Import the geometry into Grasshopper as breps and convert them to HBObjects.  For the glass on the outside of the building across the street, I would model the glass as a mirror material instead of a HoneyBee_Radiance_Glass Material and set the reflectance of the mirror equal to that of the glass exterior.  This should ensure that the material behaves as you want it to.\n\n2) Plug the HBObjects into a Run Daylight Simulation component for which you have hooked up an image-based analysisRecipe_ that is set up at the Rhino view of the work station that you are studying.\n\n3) After running the image-based simulation, use the resulting HDR image and a Honeybee_Glare Analysis component to post-process the image to get a daylight glare probability (DGP) for the workstation at the hour of the image.\n\n4) Repeat for more hours of the year so that you get a sense of the times when glare might be an issue.\n\n\n\nLet us know if you have any questions and, Mostapha, let me know if I forgot anything important.  Hopefully, we will get around to producing a tutorial video on this at some point.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "October 14, 2014 at 9:59pm", "created_by": "ChrisMackey", "replies": [{"body": "\nGreat,\n\nAs Always Chris you've come to the rescue. I wish at some time I'll be able to post some images and workarounds of these projects. So far they are in a confidential state and I can't show anything. But in time I'll try to post something.\n\nOne more question: How can I control the reflectiveness of the mirror like Srf as it requires R-G-BReflectance (I guess that is RGB colors) if the glass reflects 27% of the light should I input 27 for all three. I try to understand the Radiance materials (www. artifice.com) but it does not say much. And what kind of sky should be used for the analysis recipe\n\nThank you\n\nCheers\n", "attachments": [], "created_by_name": "Claudio", "created_at": "October 15, 2014 at 7:49am", "created_by": "Claudio", "replies": []}, {"body": "\nOk First attempt no very successfully. I can not get any image from the HDR to Tiff.\n\nhere is the definition. This procedure used to be very simple in the previous versions of HB did something change?\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1149337", "name": "1410_HB_GlareAnalysis.gh"}], "created_by_name": "Claudio", "created_at": "October 15, 2014 at 8:24am", "created_by": "Claudio", "replies": []}, {"body": "\nI've used the file from the HB example folder and it does generates an image as shown. But Something that I don't understand is that the mirror like object should produce some kind of reflection. but I looks mat in the produced image. Is there something I'm not getting right?\n\nI always generates an image first to see if all the geometries is well understand by Randiance\n\n \n\nthank you for your help\n\ncheers[<img class=\"align-full\" src=\"http://api.ning.com:80/files/HbsRLQ*GNXZRef0SeHGIaiSS7HxjAJ-YnftnYV-SjlJOIu9mEtOtbALjz43VIiYxBNjesDDLvDe7QMtLcDOJDyGKNYUNBte4/Canvasat103632.png?width=721\" width=\"721\"/>](http://api.ning.com:80/files/HbsRLQ*GNXZRef0SeHGIaiSS7HxjAJ-YnftnYV-SjlJOIu9mEtOtbALjz43VIiYxBNjesDDLvDe7QMtLcDOJDyGKNYUNBte4/Canvasat103632.png)[<img class=\"align-full\" src=\"http://api.ning.com:80/files/HbsRLQ*GNXacHANYxYlDGZ9SuEP0weO3g99B59vYd5Ye2f9FTklyzOyN6uCv0bixTzI38nrRdfzwQ-i7-Vrwjm3vA69F6YC*/Canvasat103710.png?width=721\" width=\"721\"/>](http://api.ning.com:80/files/HbsRLQ*GNXacHANYxYlDGZ9SuEP0weO3g99B59vYd5Ye2f9FTklyzOyN6uCv0bixTzI38nrRdfzwQ-i7-Vrwjm3vA69F6YC*/Canvasat103710.png)\n", "attachments": [], "created_by_name": "Claudio", "created_at": "October 15, 2014 at 8:40am", "created_by": "Claudio", "replies": []}, {"body": "\nUpdate HB and the LB manually and it did work fine. finally\n\n \n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/HbsRLQ*GNXY2S7Q3GeVJ7U6YU0Xd3bOWzWKYm6BL2JM5LNdrZSQqUqXAMaLFpntpv4qZaYpcFEeuejt7bEtq7lL4BDcqOfXK/Canvasat111415.png?width=721\" width=\"721\"/>](http://api.ning.com:80/files/HbsRLQ*GNXY2S7Q3GeVJ7U6YU0Xd3bOWzWKYm6BL2JM5LNdrZSQqUqXAMaLFpntpv4qZaYpcFEeuejt7bEtq7lL4BDcqOfXK/Canvasat111415.png)\n\n \n", "attachments": [], "created_by_name": "Claudio", "created_at": "October 15, 2014 at 9:16am", "created_by": "Claudio", "replies": []}, {"body": "\nI've Try with the HB exemple file and the Glare component fails to display an image. Any idea why[<img class=\"align-full\" src=\"http://api.ning.com:80/files/HbsRLQ*GNXb7Qz*3ubGaue3-5kR9W4*IjpUXxehkU2JOok1*If41*Y5i6pFe0lMAo-LhZZdC0LuclyjTTzkOlTfOyTwvGFvh/Canvasat145244.png?width=721\" width=\"721\"/>](http://api.ning.com:80/files/HbsRLQ*GNXb7Qz*3ubGaue3-5kR9W4*IjpUXxehkU2JOok1*If41*Y5i6pFe0lMAo-LhZZdC0LuclyjTTzkOlTfOyTwvGFvh/Canvasat145244.png)\n", "attachments": [], "created_by_name": "Claudio", "created_at": "October 15, 2014 at 12:57pm", "created_by": "Claudio", "replies": []}, {"body": "\nHi Claudio,\n\nMostapha might already know what is going wrong here but I can help if you upload you GH file.  I need to know the red balloon error message that you are getting on the DGP component to figure out what is going wrong.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "October 16, 2014 at 11:58am", "created_by": "ChrisMackey", "replies": []}, {"body": "\nHi Chris,\n\nI think the problema was on my side I mean my machine and HB where having strange behavior.  Now the component works just fine. One question. What the colors of the glare component represents in terms of DGP scale. Can I find a scale some where so I can relate the colors to a comprehensive chart.\n\nAlso I'm uploading the works of Wienold, Jan; Christoffersen, Jens (\n\nEvaluation methods and development of a new glare prediction model for daylight\n\nenvironments with the use of CCD cameras) that came to this DGP concept. Very interesting\n\nThank you\n\nclaudio\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1150232", "name": "Evaluation_methods_and_development_of_a_new.pdf"}], "created_by_name": "Claudio", "created_at": "October 16, 2014 at 1:37pm", "created_by": "Claudio", "replies": []}, {"body": "\nHi Claudio,\n\nI am glad that everything worked out on your system.  Also, thank you for posting the journal article.  It looks like a really good reference for DGP.\n\nTo be honest, I have not delved deep enough into the glare analysis to know exactly what the color in the analyzed HDR image means beyond a vague definition of \"glare sources.\"  If you are already citing journal articles, I feel that you are already well beyond my level.  Perhaps Mostapha could comment here with more information?\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "October 17, 2014 at 3:14pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nHi Claudio,\n\n1. In the results of the glare analysis colors are randomly assigned and has no meaning more than source of the glare. You can read it in evalglare documentation file as \"The color is chosen by chance, no significance is given by the color\"\n\n2. To understand the probability of glare you should check DGP values.\n\n3. The algorithms that are used in evalglare are based of studies for stationary desks and for indoor offices. I'm not sure if using them for an outdoor area will give you any meaningful results. I'm pretty sure that you have see that in Jan's presentations.\n\n- Mostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "October 18, 2014 at 11:20pm", "created_by": "MostaphaSadeghipour", "replies": []}]}], "id": "1149112"}