{"body": "\nHello , I'm trying to make a list of data of solar radiation incident on a vertical surface . What I need is a list of all hourly values ​​throughout the year, but I am not able to do it with Ladybug. Is there a way to do it?\n\nThanks<br/>Simone\n", "attachments": [], "created_by_name": "Simone", "created_at": "October 16, 2014 at 2:41am", "created_by": "Simone370", "topic": "Hourly radiation data", "replies": [{"body": "\nHi Simone,\n\nYou can do this with Ladybug, although I will admit that the current workflow for this is not ideal and is more time consuming than necessary.  In the future, I plan to make a component that can do this easily and quickly using a method that I wrote into the solar temperature adjustor component (right now this is only working for a mannequin mesh and not any geometry that you want, though).\n\nAttached, you can find a file that shows you how to do what you are asking.  Be prepared to wait ~10 minutes or so until the slider finishes animating.  In the future, you should be able to do this in parallel and this will get the run time down to a minute if your geometry is simple.\n\nLet me know if you have any questions,\n\n-Chris\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1150897", "name": "Hourly Radiation Values With LB.gh"}], "created_by_name": "Chris Mackey", "created_at": "October 17, 2014 at 2:14pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nHi Simone,\n\nChris's method does what you need. You can connect a series of numbers and graft them instead animating the slider and then remove record component and the panel for faster calculation.\n\nYou can also use annual daylight recipe with Honeybee, and change the type to radiation analysis. Then you can use read hourly results from annual study to get the results for all the hours.\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "October 18, 2014 at 9:21pm", "created_by": "MostaphaSadeghipour", "replies": [{"body": "\nAh right.  The grafting method Mostapha mentioned will probably give you a result much faster. I attached an updated GH definition with this method. Thank you, Sir Sadeghipour!\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1151396", "name": "Hourly Radiation Values With LB2.gh"}], "created_by_name": "Chris Mackey", "created_at": "October 18, 2014 at 9:41pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nHello everyone! I solved as soon as I wrote on the forum with the metod suggested by Chris, ...but the second is even faster!\n\n\n\nThanks!\n\nSimone\n", "attachments": [], "created_by_name": "Simone", "created_at": "October 19, 2014 at 1:07pm", "created_by": "Simone370", "replies": []}]}]}