{"body": "\nHello again Mostapha!\n\nWhen I attempt to make a custom glazing material it isn't able to run through the ep sim component. The simulation works just fine with default materials, and I believe I've added my glazing to the ep library correctly so I'm not sure what's wrong. The reported fatal error is that it can't \"GetSurfaceData\"\n\n\n\nIf you have a free moment would you mind taking a look at my file to see what I'm not doing right?\n\n\n\nVery much appreciated in advance, thank you!\n\nAaron\n\n\n\n[Further%20Testing2.gh](http://api.ning.com:80/files/TzObvhxOuadWlOaLJ2GOO*wdRTB9p4VCjzBQtNME4jqIlDQ9oBFi5zTU7UM8bfEElMWY7VRu-AJiCtSQlHmK5-MJfPxmQuDa/FurtherTesting2.gh)\n", "attachments": [], "created_by_name": "Aaron Loomans", "created_at": "October 21, 2014 at 1:41pm", "created_by": "AaronLoomans", "topic": "EP Custom Materials", "replies": [{"body": "\nAaron,\n\nThe problem is becouse the window material you choose for the construction. In E+ you can define a simplified window material based on 3 definitions (U, SHGC and VT). This type can't be used as an individual material in a construction composite. For this type you need to define a glass material (or draw one from the library). See the attached. In red group wath is to delete from your definitions. In yellow group what i added and works.\n\nRecheck your weather files inputs since i changed the connections a bit.\n\n-A.\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1153387", "name": "FurtherTesting2_A.gh"}], "created_by_name": "Abraham Yezioro", "created_at": "October 21, 2014 at 3:19pm", "created_by": "AbrahamYezioro", "replies": [{"body": "\nThank you for the quick response Abraham. I too was able to use existing ep materials from the ep library to run the simulation with success. However, I'd like to be more specific and manipulate the glass properties. I was under the impression that I could create my own glazing material and glazing construction and then save it into the library. Then simulate using the saved material and construction. Are you saying that even by using the \"add to energyplus library\" component, I won't be able to run a simulation with custom materials? If so is there any way to manipulate the three definitions (U, SHGC and VT) of the \"Theoretical Glass (167)\" that you've used?  How else do I define my own custom glass material?\n\n\n\nI recently watched chris mackey's tutorial -&gt; [https://www.youtube.com/watch?v=GTnwMuadjyE&amp;list=UUc6HWbF4UtdKd...](https://www.youtube.com/watch?v=GTnwMuadjyE&amp;list=UUc6HWbF4UtdKdjbZ2tvwiCQ&amp;index=5)<br/>\n\n\n\nFrom this I thought I could use custom materials in a simulation.\n\n\n\nYour response is much appreciated in advance,\n\nAaron\n", "attachments": [], "created_by_name": "Aaron Loomans", "created_at": "October 21, 2014 at 3:55pm", "created_by": "AaronLoomans", "replies": []}, {"body": "\nHi Aaron,\n\nYou can use custom materials. What Abraham mentioned above is in EnergyPlus you need to create a construction using the material and then apply it to your window. You cannot apply the material directly.\n\nWhat parameters of Glass do you want to play with which is not available here? You can manipulate all the 3 parameters that you mentioned above. I didn't include an interface for full glazing definition as I wasn't sure if anyone would ever use it but you can just create it as a string and change the properties with sliders.\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "October 21, 2014 at 9:31pm", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nWill add that you can have your own customized material, constructions, schedues (and probably more parameters) in the userCustomEPLibrary.idf file (located at c:\\ladybug - normally).\n\nAttached one example for ilustration. You need to reload the HB_HB component to update the library with the custom definitions (just remember to delete from the name file the word \"Test\").\n\nI personally agree with Mostapha that the detailed glazing definitions, as E+ request, will almost be an impossible task.\n\n-A.\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1153639", "name": "userCustomEPLibrary_Test.idf"}], "created_by_name": "Abraham Yezioro", "created_at": "October 21, 2014 at 10:38pm", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nI guess I'm still confused, I never applied the material directly. I made my construction using two layers of glass and a layer of air in between and plugged into the EPConstruction component and then added it to the ep_library using the \"AddtoEnergyplus Library\" component.\n\nThe only parameters of glass I want to manipulate are the three (U, SHGC and VT). The amount of parameters is not my problem.\n\nI just want to simply take the construction I made and plug it into the windowEPConstruction slot of the modifiedHBZone component and then run a simulation. However when I do so energyplus reports that it can't get surface data for the material.\n\nFrom your response Abraham, I'm gathering that this is not possible to do this in honeybee and that I have to make my custom materials in energyplus itself first?\n\n\n\nUnfortunately I also have to keep manually downloading the master zip files from github and plug it into the update honeybee/ladybug components respectively as well. The automatic update isn't working as it reports an issue that the remote party has closed the transport stream. This was a separate issue I thought but could it have something to do with why the simulation isn't reading my custom construction?\n\n\n\nApologies for any of my misunderstandings, your time and patience is extremely appreciated as always.\n\nAaron \n", "attachments": [], "created_by_name": "Aaron Loomans", "created_at": "October 22, 2014 at 10:44am", "created_by": "AaronLoomans", "replies": []}, {"body": "\nAttached a simple example using both cases: Simple glazing material and construction, and composed.\n\nTry to follow. The simple one (U, SHGC, VT) defines the window properties. So if you have a double glazed window those 3 parameters weight the type (BTW the values include also the influence of the frames).\n\n\n\nMostapha can answer more precisely, but i can say that the updates don't have nothing to do with the issue at all.\n\n\n\nHope this helps for a better understanding.\n\n-A.\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1153949", "name": "setGlassMaterials.gh"}], "created_by_name": "Abraham Yezioro", "created_at": "October 22, 2014 at 12:25pm", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nThank you Abraham for putting the example together.\n\nAaron, can you run the example that Abraham put together with no issue? As you can see on the top part of the script you can set the properties parametrically. Just be aware that some of the combinations that you may ended up using won't be real (e.g. VT 0.9 and SHGC .10).\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "October 22, 2014 at 9:30pm", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nSorry that I didn't open your file before the reply. I can see that you are using construction in the right way, and Abraham file is running fine on my system. Do you want to upload the latest version of the file that you have problem with and I will be happy to take a look if still need help. -Mostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "October 22, 2014 at 9:35pm", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nAfter messing around with it I found that if I only use one layer of glass in my construction the simulation runs smooth and works perfect. It's after adding an air gap and a second layer of glass that energyplus doesn't like it. Take a look, and thank you!\n\nAaron\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1154562", "name": "Further Testing3.gh"}], "created_by_name": "Aaron Loomans", "created_at": "October 23, 2014 at 10:28am", "created_by": "AaronLoomans", "replies": []}, {"body": "\nThis is the file that works using just one layer of construction for the glass\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1154289", "name": "Further Testing3_1.gh"}], "created_by_name": "Aaron Loomans", "created_at": "October 23, 2014 at 10:47am", "created_by": "AaronLoomans", "replies": []}, {"body": "\nAaron,\n\nSorry for coming into the discussion so late.  I feel partly responsible as my video showed a method for making a custom window construction but we currently have no component to make a custom glass material (only a component to make a custom window material).  Your second file uses the custom window material correctly since the window material is meant to represent an entire window element (including all panes of glass and the frame).  Right now, if you want a custom glass material, which you could use in layered constructions and would work with your first file, you have to input a text string in IDF language (as you see in the attached file here).  Now that I see the demand for it, I think I will write a component this weekend that produces this string for you automatically and allows you to make a custom glass material.  I will post here once I have done so.\n\n-Chris\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1154845", "name": "FurtherTesting3_CWM.gh"}], "created_by_name": "Chris Mackey", "created_at": "October 23, 2014 at 10:21pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nChris, thank you so much!\n\nI've been able to manipulate my glazing in the EP IDF editor to get the results I want but the ability to do so right within honeybee would be fantastic!\n\nAaron\n", "attachments": [], "created_by_name": "Aaron Loomans", "created_at": "October 24, 2014 at 3:32pm", "created_by": "AaronLoomans", "replies": []}]}], "id": "1153201"}