{"body": "\nHey there!\n\nFirst of all, congratulations to your outstanding work! Just found out about Ladybug and Honeybee yesterday and I'm pretty excited to get into it...\n\nI've come across some minor difficulties with installing LBHB. Well, the installation worked well but the OpenstudioMasterTemplate didn't download, which I resolved by looking through some threads here in the group. Thanks for that!\n\nSo I've got one issue left. As I usually install all my simulation-related applications in my C:\\Simulation\\ directory, Honeybee can't find Radiance and EnergyPlus. Is there a way to tell HB where to look for those? Or do I have to install the tools in the default location (C:\\)? (Which is not my preferred method).\n\nI think Mostapha posted a link to the OpenStudio Website regarding this issue, but they recently changed it, so the link is not working anymore.\n\nAny help would be much appreciated :)\n\n\n", "attachments": [], "created_by_name": "Albert Pressler", "created_at": "October 22, 2014 at 2:05pm", "created_by": "AlbertPressler", "topic": "EnergyPlus Installation Path", "replies": [{"body": "\nHi Albert,\n\nThank you for the kind comments.\n\nIf you add your installation folders to system paths, Honeybee should be able to find it. As far as the path doesn't have white spaces you should be fine.\n\nDo you have the folders included in the path? If you don't know, open a cmd window and type path and see if the folders are there. let me know if it didn't solve your issue and we can try an alternative solution.\n\nCheers,\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "October 22, 2014 at 5:31pm", "created_by": "MostaphaSadeghipour", "replies": [{"body": "\nAlrighty! That works so far... no complaining about missing tools anymore. Thank you very much!\n\nHaven't had the time yet to give it a test run, but I'll do that as soon as I can...\n\ncheers!\n", "attachments": [], "created_by_name": "Albert Pressler", "created_at": "October 23, 2014 at 7:00am", "created_by": "AlbertPressler", "replies": []}]}], "id": "1153966"}