{"body": "\n[AUS_QLD.Brisbane.94578_RMY.epw](http://api.ning.com:80/files/Ga2iaGVWnSFhQ9p2Iu0RMNXVQKt5462QpYfyM2ku2re3XHeOjif6QcyY-GOlUKjd8DjuF5Ns9CJVjF*clFGaHVBBcFNteK1Y/AUS_QLD.Brisbane.94578_RMY.epw)\n\n\n\nHi community\n\n\n\nI need a huge favor. \n\nSeems to me, everytime when i try to run the example file of the \"psych chart -1\" my rhino and grasshopper will crash.\n\n\n\nCan someone please provide me this psychometric chart for me?\n\nA simple graph will do just fine.\n\nI have attached the epw file and its Australia -Brisbane.\n\n\n\nScreenshot of the result or JPEG file will be fine.\n\nI apologize for this, and thank you in advance.\n\n\n\nIf you have any questions or concerns please contact me at\n\ntky90@live.com.au\n\n\n\nI need this result as soon as possible since my report is due this saturday for my university purpose.\n\nFor my academic reference, this thread will be under my reference list and the image that I will be using will be mentioned to avoid copy rights.\n\n\n\nBest Regards\n\n\n\nTK\n", "attachments": [], "created_by_name": "Takuya Watanabe", "created_at": "October 28, 2014 at 5:47pm", "created_by": "TakuyaWatanabe", "topic": "PSYCHOMETRIC CHART NEEDED - AUSTRALIA:BRISBANE", "replies": [{"body": "\nHi TK,\n\nI know why this issue happens because I have seen some students have it.  It results from the fact that earlier versions of Rhino 5 (from service release 1-5) had some bugs that would cause the program to crash if Grasshopper did anything that was too computationally intensive.  In order to fix the problem, you need to update to the most recent service release of Rhino and most recent grasshopper (or at least to SR5 of Rhino).  For some people, this update was not possible on their machines but, in those cases, I have found that the 90-day free trial version of Rhino (or the very awesome educational discounted Rhino) usually does the trick.\n\nSince I know that you are in a bind, here is a rhino file with a Brisbane psych chart in it.\n\n-Chris\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1157511", "name": "Psych Chart for TK.3dm"}], "created_by_name": "Chris Mackey", "created_at": "October 28, 2014 at 6:30pm", "created_by": "ChrisMackey", "replies": [{"body": "\nHi Chris\n\n\n\nReally thank you for this.\n\nI will update my rhino now for future work, also thanks for this information.\n\n\n\nBest Regards\n\n\n\nTK\n", "attachments": [], "created_by_name": "Takuya Watanabe", "created_at": "October 28, 2014 at 6:47pm", "created_by": "TakuyaWatanabe", "replies": []}]}], "id": "1157480"}