{"body": "\nHi,\n\n\n\nI am getting strange results from the v.58 cumulativeSkyMtx component when I run the Reinhart skypatch model. See attached files and images. The Reinhart model reports an error saying it cannot read the weather data, yet it creates a skydome that is almost reasonable. Strangely, the Reinhart sky has lower values over the hourly sunpath lines.  I ran this all using the attached cumulativeSkyMtx module, which should have been updated to resolve an issue with the latest radiance release based on your another post.\n\n \n\nThe Tregenza sky model calculates fine, but might not be pixelated enough to show the issue that appears in the Reinhart model. Do you know what is going on?\n\n \n\nAs always, I'm a big fan of your work! Thanks for your help with this.\n\n\n\n[<img class=\"align-left\" src=\"http://api.ning.com:80/files/mQNS8aIZyEvNeJC2ukjqWCrJWFxw4K33YTzQPaG5ZbqG0DA7nKWdVidnKaIitCrA0lQniL924BFrJu8C1MVMUnQ6YATYF*D2/cumSkyReinhartstrangeoutput.jpg?width=750\" width=\"750\"/>](http://api.ning.com:80/files/mQNS8aIZyEvNeJC2ukjqWCrJWFxw4K33YTzQPaG5ZbqG0DA7nKWdVidnKaIitCrA0lQniL924BFrJu8C1MVMUnQ6YATYF*D2/cumSkyReinhartstrangeoutput.jpg)\n\n[](http://api.ning.com:80/files/mQNS8aIZyEsOs2Yu6Y9SdE0tA1pBbWqbLYRni0cURzTE55wOM3dYbAUQTNo1J2eRAcnKhW5YxEYrIVqxtiN-YaZV3utOCtft/cumSkyReinhartstrangeoutput.jpg)\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/mQNS8aIZyEtUr5lnr3xKkMhHmMu6gw44aktkFZLQRI7GijTQyYWcUxgsBhH6wyOiWoqE1W6xuOoFjaZ*uPNxo*NO9uqBrNRi/cumSkyoutputfailureerror.jpg?width=750\" width=\"750\"/>](http://api.ning.com:80/files/mQNS8aIZyEsOs2Yu6Y9SdE0tA1pBbWqbLYRni0cURzTE55wOM3dYbAUQTNo1J2eRAcnKhW5YxEYrIVqxtiN-YaZV3utOCtft/cumSkyReinhartstrangeoutput.jpg) \n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1162103", "name": "cumulativeSkyMtx error.gh"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1162104", "name": "USA_KY_Louisville-Bowman.Field.724235_TMY3.epw"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1162105", "name": "Ladybug_GenCumulativeSkyMtx.ghuser"}], "created_by_name": "Leland Curtis", "created_at": "November 5, 2014 at 8:21am", "created_by": "LelandCurtis", "topic": "cumulativeSkyMtx error", "replies": [{"body": "\nHmm.  I am not sure why you are getting these messages.  Everything looks good to me with the sky domes and I noticed that you do not get the error messages when you run just the Tregenza sky.  For now, I would not worry about the messages as the results really seem fine.  Hopefully Mostapha will comment on this sometime soon as I think that he would have a much better idea of what's going on.\n\n\n\nMostapha, here's a closeup of the message:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/mQNS8aIZyEvYmFUEhWy9y*1-3-PHwV-KEh028r*mmHmUfaq*afCuPRCr271Ya-ZA91GIM68TDBCqdv8jfJKwvnpnDv9WG5aO/SkyMtxError.PNG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/mQNS8aIZyEvYmFUEhWy9y*1-3-PHwV-KEh028r*mmHmUfaq*afCuPRCr271Ya-ZA91GIM68TDBCqdv8jfJKwvnpnDv9WG5aO/SkyMtxError.PNG)\n\nIt is basically saying that every hour of the year has failed.  I remember that this used to be an issue a year ago when there was an hour of the year when genSkyMtx.exe would fail.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "November 5, 2014 at 11:11am", "created_by": "ChrisMackey", "replies": [{"body": "\nI am confused by the banding in the direct and diffuse skydomes. They conveniently line up with the hourly sun paths. Should I expect this? Again, this only happens with the Reinhardt sky. The Tregenza sky looks normal.\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/Rw5DXnG-22R01xqTFNYJlQ9N-ypO2L-xD3bwUl8ex7nB53UHT5-t*bOC1mjXANqrtVb*GzMAtXugGAX-T4iFfLntHLHlWxeE/cumSkyReinhartstrangeoutputtotalzoomin.jpg\" width=\"580\"/>](http://api.ning.com:80/files/Rw5DXnG-22R01xqTFNYJlQ9N-ypO2L-xD3bwUl8ex7nB53UHT5-t*bOC1mjXANqrtVb*GzMAtXugGAX-T4iFfLntHLHlWxeE/cumSkyReinhartstrangeoutputtotalzoomin.jpg)\n", "attachments": [], "created_by_name": "Leland Curtis", "created_at": "November 5, 2014 at 12:21pm", "created_by": "LelandCurtis", "replies": []}, {"body": "\nLeland,\n\nInteresting observation and yes, the radiation should line up with the hour lines (or lamellas) of the sunpath.  Radiance is only calculating the sky on an hourly time step since the EPW file is on an hourly time step and so this is why that happens.  On a tregenza sky dome with a lot less patches, you would never be able to see this phenomenon but the high resolution of the Reinhart sky allows this to be visible.  You are peering into the limits of the simulation assumptions.  Interesting stuff.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "November 5, 2014 at 1:50pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nHi Chris,\n\n\n\nThat makes sense for the direct component. But I can't figure out why we see bands on the diffuse component or why the top of the skydome is nearly zero. Any thoughts?\n\n \n\nIs there any way within genCumSky to generate a Reinhart skydome using 1/2 hour or 15 minute increments? It seems that the Reinhart skydome offers false accuracy by adding higher resolution without interpolating hourly data. I would think Reinhart figured out a way around this but I don't understand the radiance commands. Do you know a way to do this?\n\n \n\nThanks for your help.\n", "attachments": [], "created_by_name": "Leland Curtis", "created_at": "November 5, 2014 at 5:59pm", "created_by": "LelandCurtis", "replies": []}, {"body": "\nIt's true that the banding is a bit weird and my guess is that it just results from trying to apply a lot of the same Radiance algorithms to a higher resolution dome.  As far as I remember, the paper in which C Reinhart published the idea of increasing the resolution of the sky dome, it was just about how to divide up the sky patches and validating that it was more accurate.  I don't think that there was much of a proposal for changing the underlying algorithms.  Maybe, for the whole year, the Reinhart sky doesn't change the results much but it definitely improves accuracy on an hour-by-hour basis (the sun of one hour is usually divided across 3 or 4 patches any you can imagine that it makes a big difference if those patches are smaller).\n\nIf you do single-hour simulations with the Honeybee Radiance components, I believe that it is possible to get some skies at sub-hourly intervals (I believe that the climate-based sky should do this).  For entire-year simulations, both the Tregenza dome and the Reinhart dome are already pretty accurate (at least when you consider that your radiation and cloud cover is probably going to vary from year to year anyway).\n\nIf you really need this higher accuracy over the whole year, I think that the only way that you would be able to get it is by editing the Radiance source code and recompiling it.  Maybe I'm wrong, though. Mostapha would be the man who knows this.\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "November 5, 2014 at 8:17pm", "created_by": "ChrisMackey", "replies": []}]}, {"body": "\nHi Leland. This is a bug for conversion factors in Reinhart sky. I did an initial fix right now and it looks to work fine but I want to test it more before uploading it here. Thanks for reporting and for the kind comments. Cheers, -Mostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "November 5, 2014 at 11:11pm", "created_by": "MostaphaSadeghipour", "replies": [{"body": "\nHi Mostapha,\n\n \n\nI look forward to testing it out when it's ready.\n\n \n\nChris, your idea of using the Honeybee CB module is perfect. This should allow me to do exactly what I need if it can calculate sub-hourly skies. Once I generate a custom matrix of skies, how do I combine them back into the skyFilePath format so I can use it in the other Honeybee components? I can use this custom sky with a basic single-ray calc, but have been unable to translate this into a format radiance can use. I was hoping your new Honeybee components could get me there. Do you know a way?\n\n \n\nAlso, what sky models are used to create the luminance distributions? CIE clear/overcast/intermediate, Perez, Kittler, or a combination of others? There are so many.\n\n \n\nThanks for your help.\n", "attachments": [], "created_by_name": "Leland Curtis", "created_at": "November 6, 2014 at 9:17am", "created_by": "LelandCurtis", "replies": []}, {"body": "\nLeland,\n\nI am not so sure of the best method for integrating across many sub-hourly skies and this is probably a better question for Mostapha when he gets the chance.  I can think of some methods where you could animate a slider in GH to run several radiation studies, collect all of the data with a record component, and parse/total all of the data together in grasshopper to get a really high accuracy radiation study for whatever period you ran the slider for.  Is there a particular reason why you need such a high accuracy?  This seems far beyond the accuracy needed for most design decisions.\n\nHoneybee allows you to generate many different types of skies.  Here's an example comparing the cumulative sky, which is usually a Tregenza sky and a Climate-based sky.\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/15pbGCBw7iMmu1Lg*y6cE-7fL27NPf9drK8uH7G5-EwVMJIrT2Urlxz8XbtqoqfxtcwjVQ7T6Trtw4Vk0RFC5sQWlDRu1YuH/SkyTypes.png?width=721\" width=\"721\"/>](http://api.ning.com:80/files/15pbGCBw7iMmu1Lg*y6cE-7fL27NPf9drK8uH7G5-EwVMJIrT2Urlxz8XbtqoqfxtcwjVQ7T6Trtw4Vk0RFC5sQWlDRu1YuH/SkyTypes.png)\n\nAs you see, the climate-based sky is really smooth and accurate but it only for a specific time of day.  For cumulative radiation methods, the sky is divided into patches.  There are also several types of CIE skies (sunny, cloudy, isotropic, etc.).  I think Mostapha put together a whole example file on the different sky types and I would look at that.\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "November 6, 2014 at 7:21pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nChris,\n\n \n\nWe use a single-ray calc engine to test various orientations and shading devices in real-time. A 145 patch skydome is often too coarse to pick up geometry changes. Of course we would use radiance for final runs, but we need something that gives us instantaneous feedback while we explore approaches.\n\n \n\nThe ability to create custom skies allows us study very particular data sets. We can do this using the method you described and calculate values with our single-ray calc engine, but we can't run a custom sky in radiance. Is there any way to allow an occ-file type input into the Honeybee CM component? The analysis period defined by a start and end hour is limiting. We need hourly pattern inputs. Or, is there a way to combine a series of CB skies into a single file that can then be input into the Honeybee radiance components? I just can't wrap my head around the radiance gensky source code to even figure out where to do this.\n\nThe shade optimizer seems to already be using a complex custom sky based on E-plus heating/cooling values. I assume this is still the single-ray method used in the ladybug components. Are you planning to expand those kind of capabilities into components that use the radiance engine?\n", "attachments": [], "created_by_name": "Leland Curtis", "created_at": "November 7, 2014 at 7:24am", "created_by": "LelandCurtis", "replies": []}, {"body": "\nLeland,\n\nThe radiance questions are way out of my league and they are definitely for Mostapha or possibly even Greg Ward and the Radiance team.  I don't know how to make the specific sky that you are looking for.\n\nI can, however, speak to the method I put in the shade shade optimizer, which Mostapha had helped me develop.  Right now the shade benefit evaluator only works for direct radiation (I will incorporate diffuse radiation soon) and so it uses just the sun vectors.  If you boost up the sky resolution input on that component to the highest value that it can go, it will intersect every sun vector of every hour of the year with your test mesh.  This high accuracy usually isn't necessary to make most design decisions so I usually group these vectors by sky patch in order to cut down the number of intersections and the time that it takes to run the component.  Sky resolutions that are lower than 4 just divide up the Tregenza sky patches.  So 0 is the original 145 patches, 1 is 4 times 145, 2 is 16 times 145, etc.  Perhaps there is a way to use this method of sky patch division in your case too although, if you need the diffuse radiation, I'm not sure that it will be so helpful yet.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "November 7, 2014 at 10:37am", "created_by": "ChrisMackey", "replies": []}, {"body": "\nHi Chris and Leland, I'm very late to the party but let's see if I can address the questions here.\n\n1. Please find the attached file for the fixed version of the component. I ran comparative studies between 3 different types of sky for Ladybug and also Radiance and the difference is less than 5%.\n\n2. Ladybug is using gendaymtx to generate the sky. You can read the details here: [http://www.radiance-online.org/learning/documentation/manual-pages/...](http://www.radiance-online.org/learning/documentation/manual-pages/pdfs/gendaymtx.pdf)\n\n3. You can use Daysim subprogram ds_shortterm to generate the sky for less than and hour timesteps ([http://daysim.ning.com/page/daysim-subprogram-ds-shortterm-1](http://daysim.ning.com/page/daysim-subprogram-ds-shortterm-1)) but then the number of patches will be limited to 145 patches. It is not applied to Honeybee.\n\n4. Sky is almost 0 on the top because of the bug that you found. The value for the last row of patches was missing from the code. It should be fixed now.\n\nMostapha\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1164810", "name": "SkyMtxRHSky_fixed.gh"}], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "November 8, 2014 at 9:03pm", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nThanks for the knowledge and wisdom, Mostapha.\n\nFor the sake of my own curiosity, could you explain more about what ds_shortterm does that is different from the climate based sky.  I tested just to be sure that I was actually getting sub-hour skies with the climate based sky as seen here:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/TtwBo078M6gJ30M0iLIeO6WXpTvSktC22AqByZTsYqnigOAK-212O0T2lO3xXhxxKI0iQC*Dxl6ANoL-m9Wvi0i1f8ZYeMG*/Subhourskies.PNG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/TtwBo078M6gJ30M0iLIeO6WXpTvSktC22AqByZTsYqnigOAK-212O0T2lO3xXhxxKI0iQC*Dxl6ANoL-m9Wvi0i1f8ZYeMG*/Subhourskies.PNG)\n\nAm I right in thinking that ds_shortterm generates cumulative skies at sub-hour timesteps?  If so, I understand why it's not so useful to integrate it into HB as the increased accuracy of sub-hour timesteps is probably offset by the poor resolution of 145 sky patches.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "November 9, 2014 at 2:03pm", "created_by": "ChrisMackey", "replies": []}]}]}