{"body": "\nHi,\n\nI'm having the following issue: I'm defining various zones based only on surfaces. There are 4 floors with about 3 zones per floor.\n\nWhen i create each floor and apply SolveAdjacencies it went OK.\n\nBut when i apply it for all floors together some of them doesn't show.\n\nI need to say that for the zones definition the ceiling surface of one zone is the floor for the other in the floor above it.\n\nI believe, and hope, the attached file is clear enough to see the problem (The rightmost adjacency is the whole building).\n\nWhat i'm missing?\n\n\n\nThanks,\n\n-A.\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1174962", "name": "Caldwell.gh"}], "created_by_name": "Abraham Yezioro", "created_at": "November 24, 2014 at 2:58pm", "created_by": "AbrahamYezioro", "topic": "Zones from Syrfaces and Solve Adjacencies", "replies": [{"body": "\nHi Abraham,\n\nFirst of all this file is beautiful! You are pushing Honeybee hard.\n\nI know that you opened this discussion for solveAdj but I noticed that zones are not closed Breps. Looks to be a tolerance issue with Rhino and shouldn't make an issue with EnergyPlus but just to have cleaner geometries, I untrimmed base surfaces so zones are closed brep now.\n\nI also noticed that when you are adding multiple openings to a surface, the surface doesn't show-up in the output of createHBZoneFromHBSurfaces. The surfaces are there though and show up once you explode the zone! Again should be a tolerance issue for join. I need to take a closer look to both of these.\n\nAlso, in a number of the zones you had wall surfaces connected to createZoneFromHBSurfaces both before and after adding glazing. I removed parent surfaces so you don't end up having duplicate surfaces.\n\nBack to adjacency which was your question, the issue happens since you have couple of zones with the same name so component was assuming them to be the same zone so it wouldn't solve the adjacency (Yes! it shouldn't. That was a bug which is fixed now). I changed the names and now it should find the surfaces that you are looking for.\n\n[<img class=\"align-center\" src=\"http://api.ning.com:80/files/8fil5gmLgTbUV1DiUtJsacCilRgJ*g72o4KIU1wz744GyLOxeq7utO4X1wL1J4xkJEFJTWIhrhFA-UH*Aopgrjr8*dcrRKB0/solveAdj.png?width=600\" width=\"600\"/>](http://api.ning.com:80/files/8fil5gmLgTbUV1DiUtJsacCilRgJ*g72o4KIU1wz744GyLOxeq7utO4X1wL1J4xkJEFJTWIhrhFA-UH*Aopgrjr8*dcrRKB0/solveAdj.png)\n\n\n\nMoreover, once you solve the adjacency, next solveAdjacency won't overwrite the BC unless you set remCurrentAdj to True.\n\n\n\nMostapha\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1175494", "name": "Caldwell_msr.gh"}], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "November 25, 2014 at 9:15pm", "created_by": "MostaphaSadeghipour", "replies": [{"body": "\nThanks Mostapha!! You are the best.\n\nA question though. I took my original file, fixed  the names and then i get all the zones all right. Should i expect problems further on if i don't make the breps closed?\n\n\n\nBTW, changing the tolerance didn't closed the breps (from 0.01 to 0.001).\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "November 25, 2014 at 11:01pm", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nMy pleasure... In theory, it shouldn't cause any issues in your energy model. I will take a closer look to this component later and see if there is a simple way to get it fixed. In case of multiple openings for a single surface it can be really confusing for new users... Mostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "November 25, 2014 at 11:09pm", "created_by": "MostaphaSadeghipour", "replies": []}]}]}