{"body": "\nHi all, \n\nI was wondering if the thermal mass of the intermediate slabs (those that are not part of the thermal envelope) are considered by Energy plus in terms of thermal mass. \n\nRegards,\n\nAlejandro\n", "attachments": [], "created_by_name": "Alejandro Pacheco Diéguez", "created_at": "November 26, 2014 at 3:38am", "created_by": "3ahr35r8m5dl1", "topic": "HB interior thermal mass", "replies": [{"body": "\nYes but ... E+ takes what you defined and only that. I mean, in this case, if you defined the internal floors with a Construction that has thermal mass or with a light construction, the simulation results should reflect this.\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "November 26, 2014 at 4:41am", "created_by": "AbrahamYezioro", "replies": [{"body": "\nGood, thanks! I have another question about the adiabatic surfaces, the way I undestand it since there is no heat transfer though them their interior temperature should be the same as the interior air temperature, right? I am asking this because I set some surfaces in my building as adiabatic and when I assessed the internal temperature during a winter week some of the adiabatic surfaces turned out to be among the coldest surfaces in the building, which does not make much sense to me. \n", "attachments": [], "created_by_name": "Alejandro Pacheco Diéguez", "created_at": "November 26, 2014 at 9:00am", "created_by": "3ahr35r8m5dl1", "replies": []}, {"body": "\nAnd also, what is the difference between a \"adiabatic adjacency\" and a \"surface adjacency\"\n", "attachments": [], "created_by_name": "Alejandro Pacheco Diéguez", "created_at": "November 26, 2014 at 9:33am", "created_by": "3ahr35r8m5dl1", "replies": []}, {"body": "\nThere will be no heat transfer from adiabatic surfaces. More here: [http://bigladdersoftware.com/epx/docs/8-2/input-output-reference/pa...](http://bigladdersoftware.com/epx/docs/8-2/input-output-reference/page-011.html#walladiabatic)\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "November 26, 2014 at 11:53am", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nsince there is no heat transfer though them their interior temperature should be the same as the interior air temperature\n\nI think this is not true. You can check EnergPlus email list to see explanatory answers for this question. It also looks like a good question for [https://unmethours.com/](https://unmethours.com/) Let me know if you couldn't find the answer from this resources and I can help you with more in detail reply.\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "November 26, 2014 at 11:48am", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nAlejandro,\n\nI believe that I may have just looked at your file in which you set a lot of surfaces to adiabatic and sorry for not doing so sooner.\n\nUnderstanding the difference between isothermal (no temperature change) and adiabatic (no heat flow) was one of the hardest things for me to understand when I was just starting out with thermodynamics.  Adiabatic does not mean that the interior surfaces of the zone are at the same temperature as that of the air.  It just means that any heat that becomes stored in that interior surface and the thermal mass of its construction can only exit by going back into the zone which it is a part of (either into the air or radiating to the other surfaces of the zone).\n\nIn an E+ simulation where you do not set the interior surfaces to adiabatic, heat can conduct all of the way through a floor or an interior wall to the zone on the other side.  In simulations with adiabatic surfaces, heat tends to get trapped within the single zones and this can give you cooling loads that are much higher than they should be in reality.  In adiabatic simulations, I am used to seeing surface temperatures that are much higher than the zone air but, in winter, I imagine that you could get the case that you are describing.  Generally, after I experimented with adiabatic cases a lot, I have decided that I should try to avoid them if I can since they can give results that are pretty far from the real case unless you set up the simulation and the problem that you are trying to solve just right.\n\n\n\nIt sounds like you are referring to the different types of boundary conditions in your question about the difference between a \"adiabatic adjacency\" and a \"surface adjacency.\"  \"Adiabatic\" means no heat flow, as above, and \"surface\" just means that it is a normal E+ surface where heat can conduct all of the way through the wall or floor into the adjacent zone.\n\n\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "November 29, 2014 at 5:35am", "created_by": "ChrisMackey", "replies": []}, {"body": "\nOk, now I think I understand. Thank you Chis and Mostapha!\n", "attachments": [], "created_by_name": "Alejandro Pacheco Diéguez", "created_at": "December 1, 2014 at 6:10am", "created_by": "3ahr35r8m5dl1", "replies": []}]}], "id": "1175704"}