{"body": "\nHi all,\n\n\n\nI have received this question couple of times and I'm not sure if I know the answer.\n\n\n\nMy suggestion is usually to use Green Building Studio for energy modeling, and then download the .idf file from GBS and import it into Honeybee using importIdf knowing that importIDF just imports the geometry and you need to import materials, constructions, and schedules separately so it is not fun at all.\n\n\n\nI don't know how many users are using REVIT &gt; Honeybee workflow but if it is a common workflow then we should get importIdf fixed soon.\n\n\n\nAnybody on the list has a better solution that they use?\n\n\n\nThanks,\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "November 27, 2014 at 9:56pm", "created_by": "MostaphaSadeghipour", "topic": "What is the best practice to import Revit models for energy modeling with Honeybee?", "replies": [{"body": "\nThis is a really good question!\n\nI have tried using Chameleon (a plugin for both Revit and GH), that allow importing gb.xml files exported from Revit. The problem is often the import of the model is not that good. It is limited to only import the simple energy model geometry.\n\nThere is also a connection from CASE, that export Rooms from Revit to GH directly. But I have never tried it. As seen in the linked video, it only transfer the geometry, no windows or noting: [https://www.youtube.com/watch?v=zclpoUUqSlk&amp;list=UUqJXNsH0Tx1U2...](https://www.youtube.com/watch?v=zclpoUUqSlk&amp;list=UUqJXNsH0Tx1U2WaDddCGR9Q)\n\nA basic problem when exporting energy models from Revit is that, the models is typical not that good. In many cases there is a lot of smal air gabs and other strange things in the export. In fact this is also a issue when running energy simulations within Revit with GBS.\n\nWhy would people try to export and import models in GH with all properties? Knowing the settings in Revit is really limited. Only the constructions could be nice to have in the import to Honeybee, or?\n\nIs it to get a more accurate result, or to use the benefit of Honeybee and GH's parametric possibilities? If so, is it needed to have all properties added in Revit?\n\nWhat I have done more often is importing these simple xml models into GH for running daylight simulations. Instead of export a whole detailed model. Because the numbers of surfaces determines the simulation speed therefore a more zone model is much better.\n\n/daniel\n", "attachments": [], "created_by_name": "daniel nielsen", "created_at": "November 28, 2014 at 10:19am", "created_by": "arkdanielnielsen", "replies": [{"body": "\nI just remembered a other crazy way of creating a better energy model based on Rooms. CASE have a free plugin for Revit that creates 3D Mass from Rooms. This method dont create air gabs, the downside is - no windows, but maybe this could be added with some Dynamo nodes !?!\n", "attachments": [], "created_by_name": "daniel nielsen", "created_at": "November 29, 2014 at 4:41am", "created_by": "arkdanielnielsen", "replies": []}, {"body": "\nHi Daniel, Thank you for the reply.\n\n\n\nMy experience with gbXML hasn't been that good. It is usually supposed to carry the data but in reality it doesn't! At least output from Revit/Vasari doesn't include data for constructions. The one that you can download from GBS does. This project came out recently that should ease the process of converting xml &lt;&gt; idf to each other: [https://github.com/MarcusJones/EnergyParser](https://github.com/MarcusJones/EnergyParser)\n\n\n\nYou are right about the gap and I can also see that in the model that you posted on github.\n\n\n\nWell, I'm not sure why people do it but maybe since it is easier to customize your model with Honeybee, or visualize the results.\n\n\n\nFor now I fixed idfImport component so one can import idf file as Honeybee objects, modify the model and run it in Grasshopper and visualize the results. In this example I change construction for glazing. The process doesn't input data related to systems. It imports geometry, materials and constructions. It imports schedules but don't assign them to zones. That should be an easy fix for later.\n\n\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/alJLWH62eMTWJhyCFI28pirIrglfe2vJsKdcoY4jH9HzLK6V-l9pjp1gxOua0DfnFRnksbyerG952mNyiLL8yx4hl0aAyVlV/importIdf_toHoneybee.png?width=721\" width=\"721\"/>](http://api.ning.com:80/files/alJLWH62eMTWJhyCFI28pirIrglfe2vJsKdcoY4jH9HzLK6V-l9pjp1gxOua0DfnFRnksbyerG952mNyiLL8yx4hl0aAyVlV/importIdf_toHoneybee.png)\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1177807", "name": "importIdf.gh"}], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "November 29, 2014 at 12:52pm", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nAlso you are right. Maybe MantisShrimp or Honeybee for Dynamo can make that happen.\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "November 29, 2014 at 12:53pm", "created_by": "MostaphaSadeghipour", "replies": []}]}, {"body": "\nPardon me for bumping into this old thread, this was the only I could find regarding Revit.\n\nI'm looking for a plugin for my workflow (all models done in Revit, import to GH -&gt; simulate -&gt;make changes in Revit -&gt; import again -&gt; Simulate, etc.).\n\n\n\nI've checked the videos of the plugins from this group ([http://www.grasshopper3d.com/group/gh-revit](http://www.grasshopper3d.com/group/gh-revit)), also checked Mantis Shrimp. \n\nThey look promising but they seem geared for those who know how to model in Rhino/GH (I don't).\n\n\n\n[CASE](http://www.case-inc.com/) in particular seems plausible but when I checked the videos, it didn't export the walls, doors. Is there a workaround for this?\n", "attachments": [], "created_by_name": "Pin", "created_at": "June 11, 2016 at 7:38am", "created_by": "Pin", "replies": [{"body": "\nPin, I haven't used CASE plugins. For which simulation are you using Honeybee? The good news is that you can use Honeybee in Dynamo to run daylight analysis quite soon and eventually the energy simulations.\n\n\n\n[<img class=\"align-full\" src=\"https://cloud.githubusercontent.com/assets/2915573/14061951/9601e14c-f364-11e5-89bb-d6fcfb75eb9d.png\"/>](https://cloud.githubusercontent.com/assets/2915573/14061951/9601e14c-f364-11e5-89bb-d6fcfb75eb9d.png)\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "June 11, 2016 at 11:34am", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nThanks for the reply.\n\nI'll be running mostly energy simulations. \n\nMostly these:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/TW14Rg5t5QWtLgNso5wI80locA3KcVVNGQrLatvsyD0-kh*weE1N1DBUcDOi66AT6NrUa9ea0sn*0bSSlSLHlztinzFvQGe0/Capture.PNG\" width=\"379\"/>](http://api.ning.com:80/files/TW14Rg5t5QWtLgNso5wI80locA3KcVVNGQrLatvsyD0-kh*weE1N1DBUcDOi66AT6NrUa9ea0sn*0bSSlSLHlztinzFvQGe0/Capture.PNG)\n\n\n\nI already have LB for Dynamo but HB is still under development right? I'll wait for the release of HB for Dynamo then?\n", "attachments": [], "created_by_name": "Pin", "created_at": "June 12, 2016 at 3:37am", "created_by": "Pin", "replies": []}, {"body": "\nwow - great news!! Can't wait.\n\n\n\nHope that Dynamo is as strong as GH to make a pretty graphical output of the simulations with isocurves etc.\n", "attachments": [], "created_by_name": "Mathias s n", "created_at": "June 13, 2016 at 2:21pm", "created_by": "Mathiassn", "replies": []}, {"body": "\nHi all,\n\n\n\nMy 2 cents here, I am experimenting with flux please see: [https://flux.io/](https://flux.io/)\n\nto move Revit models into Rhino for analysis, I'm not there yet but I will post my work flow once I get there (Hopefully next few weeks). \n\n\n\nThat being said HB in Dyanmo would be wonderful but at this stage I feel Dyanmo is just so clunky it would be hard for things to ever be as smooth as Grasshopper\n", "attachments": [], "created_by_name": "Anton Szilasi", "created_at": "June 13, 2016 at 3:12pm", "created_by": "AntonSzilasi", "replies": []}, {"body": "\nLooks promising. Already downloaded it. Is this a trial version though? Or completely free?\n", "attachments": [], "created_by_name": "Pin", "created_at": "June 13, 2016 at 8:14pm", "created_by": "Pin", "replies": []}, {"body": "\nLooking forward! I've tried flux before, but I'm not familiar with dynamo, maybe I should practice now\n", "attachments": [], "created_by_name": "Qinheng", "created_at": "June 13, 2016 at 9:02pm", "created_by": "Qinheng", "replies": []}]}], "id": "1177037"}