{"body": "\nHi,\n\nThis discussion starts from an issue i posted asking for the inclusion of E+'s lightshelf object.\n\nMostapha's answer to this wish request was:\n\nI'm kind of skeptical about using any of EnergyPlus objects which are related to (day)lighting, why don't you use Daysim for that and then integrate the results to EP?\n\nI get curious from this response:\n\nYes. My intention was to integrate this into the E+ simulation. I'm aware about the limitations of the daylighting implementation in E+.<br/> But with your suggestion i'm more intrigued about integrating Daysim with E+. I have no experience or clue on how to do this, so any pointers will be appreciated. Maybe this issue can become a discussion for all users, for good practice.<br/> My doubts about this integration relate to the light loads for the simulation in E+, but maybe this is becouse of my ignorance on the integration you recommend.\n\nI understand from Mostapha's answer that:\n\nHoneybee already supports the process. You can do it by running daylight analysis by daysim and then use the annual profile as lighting schedule. If you check the issues on github there should be an issue posted by Trygve.\n\nand\n\nAlso once we get 3-5 phase methods implemented the same workflow will work and will be just so powerful.\n\nSo, i suppose we can expect some updates on this one soon ...\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "November 30, 2014 at 10:43pm", "created_by": "AbrahamYezioro", "topic": "Lightshelves in simulation", "replies": [{"body": "\nI searched for Trygve/Daysim but didn't find the relevant issue ...\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "December 1, 2014 at 1:43am", "created_by": "AbrahamYezioro", "replies": [{"body": "\nHi Abraham, I attached a pretty old file that shows the process. You need to update the components.\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1179331", "name": "daylightingEnergyIntegration.gh"}], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "December 1, 2014 at 12:57pm", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nThank you Sir!\n\nAfter the update i'll upload again.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "December 1, 2014 at 1:31pm", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nSure thing! I want to add two more things here which I couldn't do this afternoon:\n\n1. In case you are running the analysis for multiple zones, make sure that test points are separated in different branches for each zone (which will be the default unless you flatten the points), so when it comes to daysim Honeybee will generate a separate schedule for each zone.\n\n2. I tested the process in a class recently and it didn't work: ([https://github.com/mostaphaRoudsari/Honeybee/issues/215](https://github.com/mostaphaRoudsari/Honeybee/issues/215)) I'm anxiously waiting for your test to tell me that was just an incident and not a bug! It used to work fine!\n\n\n\nThanks,\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "December 1, 2014 at 7:41pm", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nHi Mostapha,\n\nI think i did the test (attached). No problems running it, but ... (as you can imagine, i've found an issue). See the arrows/circles red and blue. Explanation: There are two zones only. Al the way they are 2. For some reason at the setEPZoneSchedules component they became 4 zones (or breps), so for the E+ simulation you are simulating 4 zones. Weird ...\n\nFor what reason i would like to flatten the list of test points? I left the defaults and basically everything went well.\n\n-A.\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1180451", "name": "daylightingEnergyIntegration_2Zones_A.gh"}], "created_by_name": "Abraham Yezioro", "created_at": "December 3, 2014 at 12:34pm", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nHi Abraham,\n\nThank you for testing. When you assign the schedules you need to flatten them to match energy zones. Everything else works fine and also I did the comparative study and schedule changes the results. Good news for me and I will close the issue! :)\n\nMostapha\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1180507", "name": "daylightingEnergyIntegration_2Zones_A_msr.gh"}], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "December 3, 2014 at 8:45pm", "created_by": "MostaphaSadeghipour", "replies": []}]}], "id": "1178818"}