{"body": "\nHi all!\n\nI am curious about how you guys create and/or edit your geometries for your analysis?\n\nI am not really familiar with the workflows in Rhino (yet) to create Breps for a building model. Is there a simple method to import floor plans (i.e. dxf files) and create 3-dimensional models from that?\n\nI personally like the simplicity of putting the geometry together Sketchup but the OpenStudio Plugin has its flaws when it comes to editing Spaces/Zones. Using Honeybee to create the zones from a model seems to work better, so what I am doing right now is:\n\n-importing a floor plan on Sketchup\n\n-trace the walls and extrude the faces\n\n-group the faces per zone\n\n-import in Rhino\n\n-set as Brep in Grasshopper\n\nThat seems to be working quite nicely, but not 100%. There are always some faces that are not being recognized correctly in terms of boundary conditions (after intersecting and solving adjacencies). Sometimes redrawing and reimporting that particular zone helps.\n\nBut what I would like to know as a Rhino noob if there are easier ways to get these things going in Rhino/Grasshopper and/or what kinds of limitations there might be with the Sketchup import.\n\nThanks in advance!\n", "attachments": [], "created_by_name": "Albert Pressler", "created_at": "December 4, 2014 at 1:20pm", "created_by": "AlbertPressler", "topic": "Creating and editing Geometry", "replies": [{"body": "\nCreating it natively in Rhino will probably be your best option if you don't want to troubleshoot and correct geometry imports.  The main limitation is that you'll be importing Mesh surfaces from sketchup rather creating nurbs surfaces. If you want to control curvature or double curvature geometry, stick with Rhino. There are tools in Rhino that functional similarly to sketchup, you just have to find them.\n\nExtrudecrv, Extrudesrf, Wirecut, Cntrl+Shift on a brep to move a face, Solidpton, among others. \n\n\n\nCheck out these tuts on starting with a floor plan. [http://digitaltoolbox.info/farnsworth-house/](http://digitaltoolbox.info/farnsworth-house/)\n", "attachments": [], "created_by_name": "will krzymowski", "created_at": "December 4, 2014 at 3:48pm", "created_by": "willkrzymowski", "replies": []}, {"body": "\nHi Albert,\n\nI agree with Will. I usually manage it all in Grasshopper. Here is how I do it.\n\n1. Import 2D plans into Rhino, and put them in layers based on building program.\n\n2. Use Human plugin to import them into Grasshopper, extrude and cap them.\n\n3. Create HBZones and so on...\n\nIf your curves/lines are clean then solveAdj should work 100%. I know that it is not always the case - there is a tolerance input in solveAdj component that should help in many cases.\n\nIf you are still having cases that don't work, I will be happy to take a look.\n\nMostapha\n\n\n\nPS: I just found a bug in OpenStudio component for exporting custom constructions. Use the attached component which has this issue fixed.\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1181472", "name": "OpenStudioExample.gh"}], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "December 4, 2014 at 10:56pm", "created_by": "MostaphaSadeghipour", "replies": [{"body": "\nAlright guys, thanks a lot for the input!\n\nI guess I'm gonna try getting comfortable with Rhino and I'll definitely check out those tutorials...\n\nMostapha, do you have a simple example file lying around for me to have a look at that workflow? As I said, I'm not too familiar yet with Rhino and all the Grasshopper plugins.\n\nCheers!\n\n\n", "attachments": [], "created_by_name": "Albert Pressler", "created_at": "December 5, 2014 at 1:08pm", "created_by": "AlbertPressler", "replies": []}, {"body": "\nHi Albert, Unfortunately I don't have a simple example. The ones that I put together were for office projects with dozen of zones, however if you can share a simple example I would be happy to set it up based on your file. It shouldn't take long. Also I want to capture some videos on tips and tricks for modeling with Honeybee and I never did. Maybe this one can get me started.\n\nCheers,\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "December 5, 2014 at 8:48pm", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nOkay cool,\n\nI've attached the one I've been experimenting with. It's a Sketchup file with simplified floor plans as well as the extruded model. I'm quite interested in seeing what would be the quickest was to build the geometry in Rhino/Grasshopper from those floor plans.\n\nAlso I would like to give huge props to you and Chris for providing those great tutorials. Keep it up!\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1183120", "name": "Hotel_floorplan.skp"}], "created_by_name": "Albert Pressler", "created_at": "December 7, 2014 at 7:53am", "created_by": "AlbertPressler", "replies": []}, {"body": "\nHi Albert,\n\nI definitely recommend getting comfortable with Rhino and it will pay off a lot in the long run (Rhino's geometric capabilities are a lot greater than Sketchup in a number of key areas). It is also worth mentioning that, if you haven't used them yet, we have a few components that can help you manage and format your geometry in the way that E+ likes (including components to split building masses into core/perimeter zones and a component to ensure that there are reciprocal matching surfaces of adjacent zones).  These 3 videos in the Honeybee Energy Modeling tutorial series should help you use them in your workflow:\n\n[https://www.youtube.com/watch?v=cDvBWDA0aF0&amp;list=PLruLh1AdY-SgW...](https://www.youtube.com/watch?v=cDvBWDA0aF0&amp;list=PLruLh1AdY-SgW4uDtNSMLeiUmA8YXEHT_&amp;index=10)\n\n[https://www.youtube.com/watch?v=DClON71RuuA&amp;list=PLruLh1AdY-SgW...](https://www.youtube.com/watch?v=DClON71RuuA&amp;list=PLruLh1AdY-SgW4uDtNSMLeiUmA8YXEHT_&amp;index=11)\n\n[https://www.youtube.com/watch?v=nMQ2Pau4q6c&amp;list=PLruLh1AdY-SgW...](https://www.youtube.com/watch?v=nMQ2Pau4q6c&amp;list=PLruLh1AdY-SgW4uDtNSMLeiUmA8YXEHT_&amp;index=12)\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "December 6, 2014 at 1:41am", "created_by": "ChrisMackey", "replies": []}]}]}