{"body": "\nHi<br/> I wanna simulate a midpane blind in honeybee, but Honeybee just know internal and external blind.<br/> i'll appreciate you if helping me.<br/> thanks a lot<br/> MSM\n", "attachments": [], "created_by_name": "masoome", "created_at": "December 5, 2014 at 8:24am", "created_by": "masoome", "topic": "Midpane blind in HoneyBee-Grasshopper", "replies": [{"body": "\nHi Massome, It should be an easy change to support midpane binds but since Chris has initially implemented this I just leave it to him to reply to your question: [https://github.com/mostaphaRoudsari/Honeybee/issues/234](https://github.com/mostaphaRoudsari/Honeybee/issues/234)\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "December 5, 2014 at 7:24pm", "created_by": "MostaphaSadeghipour", "replies": [{"body": "\nHi Masoome,\n\nHi Masoome,\n\nI should have seen that you had started a discussion before posting to the group.\n\nSince that posting, I have realized that, by mid-plane blinds, you meant blinds in between two panes of glass.  I have spent an hour just now trying to work in the capability of this within the typical shades workflow that I set up but the issue is a lot larger than I have realized.  In order to run blinds between two panes of glass through E+, you have to set up a construction that contains a \"WindowMaterial:Blind:EquivalentLayer\" in the window construction.  Accordingly, to integrate this into HB now, I have to create a whole new material type of Blind:EquivalentLayer and I will have to find some other way of allowing people to set the shading control when they create this material.  How urgent is your need for blinds between glass and would it be possible for you to just pot-process your IDF with the IDFEditor for the time being?\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "December 6, 2014 at 4:00pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nHey Chris,\n\nThank you for looking into this. Can Masoome just uses a panel to generate the WindowMaterial:Blind:EquivalentLayer and then apply it to HBFenSrf? I haven't looked at your code for this particular case but if you are following general Honeybee's style then, in theory, this approach should work?\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "December 6, 2014 at 4:35pm", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nMostapha,\n\nIt is not that easy since Masoome needs to both create this WindowMaterial:Blind:EquivalentLayer and put a Shading Control object into the IDF to say when the blinds are pulled.  This shading control must be applied to the EPFenSrf that has the blind layer in it.  I am not so sure of the best way to implement this since our traditional method of simply making the material will not solve the whole issue of writing both the shading control object and the material layer into the IDF.\n\nLet me know if you have any suggestions on how you might want it implemented.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "December 6, 2014 at 5:56pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nHi Chris, Thank you for explanation. I will take a closer look later and get back to you if I have a simple solution for this but based on what you mention here we need extra changes to take care of this new object.\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "December 6, 2014 at 10:09pm", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nHi Chris\n\nI wanna assess the effect of between glass blind on the cooling and lighting load simultaneously and owing to the result of E+ lighting is inaccurate, I choose HB.\n\nUnfortunately it's force and should do it in these days. I'm lookinf for a suitabe software for my work.\n\nBest regards\n\nMasoome\n", "attachments": [], "created_by_name": "masoome", "created_at": "December 7, 2014 at 1:30pm", "created_by": "masoome", "replies": []}, {"body": "\nThanks a lot for your attention Mostafa\n", "attachments": [], "created_by_name": "masoome", "created_at": "December 7, 2014 at 1:24pm", "created_by": "masoome", "replies": []}, {"body": "\nMasoome,\n\nI realized that, as long as you do not need the blinds between the glass panes to be dynamic, all that you need is the WindowMaterial:Blind:EquivalentLayer and not the Shading Control object.  Accordingly, you can do this with Honeybee fairly easily and you can see how to set this up below and in the attached GH file.\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/3pbaBKayUO8nzJBIMWHCIvBH9qg*bQ5E3TDhCLX2kqJ1iIVeCQb2wOBRinjMYRuOoHViGfGLtlrhWA6ZSFCqwFd6GLtI3Dba/CreatingWindowWithBlindsBetweenPanes.PNG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/3pbaBKayUO8nzJBIMWHCIvBH9qg*bQ5E3TDhCLX2kqJ1iIVeCQb2wOBRinjMYRuOoHViGfGLtlrhWA6ZSFCqwFd6GLtI3Dba/CreatingWindowWithBlindsBetweenPanes.PNG)\n\nSorry to both you and Mostapha for not realizing this sooner and overcomplicating the issue.  I should have just followed Mostapha's initial suggestion and not worried about getting dynamic shading to work.  Masoome, let me know if you need the blinds to be on a dynamic schedule and, if so, the issue may be as complicated as I originally made it.\n\nI will add in an official component soon so that you do not have to edit the big block of text to change the properties of the blinds construction layer.\n\nBy the way, from this initial test I have noticed a big drop in cooling energy when the blinds are placed in between the glass.  This seems like a fruitful line of research!\n\n-Chris\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1182999", "name": "Simple Energy Simulation Base_Blinds.gh"}], "created_by_name": "Chris Mackey", "created_at": "December 7, 2014 at 4:02pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nHi Chris,\n\nI'm going to make this hard for you :-)\n\nThe dynamic schedule is a must (i.e. Shading Control object). I myself am trying to solve this midpane issue for my research and it is indeed more complicated than i thought. One of the issues i have is that i really like using the SingleGlazing object (define only U, SHGC and VT). Then i don't think i can't use the midpane with this object (is it?). But the possibility of opening or closing the blinds/drapes is really needed. Moreover, the possibility of opening/closing at desired rates (10%, 50% etc) and not only full open/close situation, which fits using a roller blind (which also requires special definitions).\n\nIn short ... complicated issue.\n\nAs for the results, are you saying that cooling loads are lower with midpane than with external blinds? Suspicious result ... but maybe that can happen becouse they are closed all the time. But your heating loads are higher, right?\n\nToo much stuff in this discussion. Nice!\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "December 7, 2014 at 11:35pm", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nThanks Chris! You are the man. This should be good enough for Masoome to work on her project.\n\nAbraham, I hear you and as we already discussed ([http://www.grasshopper3d.com/group/ladybug/forum/topics/idf-import-...](http://www.grasshopper3d.com/group/ladybug/forum/topics/idf-import-and-setepzonethresholds-issues?commentId=2985220%3AComment%3A1179934&amp;groupId=2985220%3AGroup%3A658987)) we need to add shadings in general. I personally want to make sure that we add them generic enough in a way that we don't have to write so many methods for each individual EP object. There are so many of them!\n\nAn alternative is to move all these features to OpenStudio component? What do you think about that?\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "December 8, 2014 at 7:47pm", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nHmmm,\n\nYes, i'm aware of the previous discussion, but since Chris asked if there is a need ... i just wanted to \"confirm\" that it is.\n\nMoving features to OS can be an option, but i think this will limit the functionality in GH environment. Usually you want (or i want) to mange on one working environment. This is rather a more \"philosophycal\" thought.\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "December 8, 2014 at 10:32pm", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nI was talking about OpenStudio component and not the OpenStudio itself. They have an API so we will use their development to write the idf file, which will potentially save us some time.\n\n- Mostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "December 9, 2014 at 7:32pm", "created_by": "MostaphaSadeghipour", "replies": []}]}]}