{"body": "\nHi all, \n\nI am running a thermal comfort assessment in a room with a high level of glazing. I am trying to assess the effect of the windows G-value (or SHGC) on the thermal comfort annually.\n\nHowever, as I change the G-value of the window the annual PPD in the room stays unchanged, which does not make much sense to me. Can someone think of a likely explanation to this?\n\nRegards,\n\nAlejandro\n\nGH definition attached\n\n[shgc%20windows.gh](http://api.ning.com:80/files/3pbaBKayUO-7*oki0lNrc9p4Q6r7zHXoy9huo90Kn4wSQqHrSFmu645rdHJ4PxSpMe2DUhIRynV4ku8xT1WTmPiCy25GZf0S/shgcwindows.gh)\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1183290", "name": "shgc windows.gh"}], "created_by_name": "Alejandro Pacheco Diéguez", "created_at": "December 8, 2014 at 5:01am", "created_by": "3ahr35r8m5dl1", "topic": "Thermal comfort depending on the G-value of the windows", "replies": [{"body": "\nHi,\n\nThere are two issues here that explain why it is not working, as far as i checked.\n\n1. Where you define the material and construction for the window was not connected to the HB_setEPZoneCnstr component (see 3 in attached), so in theory, until you don't connect here it will use a default material (right Mostapha and Chris?) or the material you assigned previously (see 1 in attached).\n\n2. I updated many of the components to the last definitions, hoping this will help ... but it doesn't.\n\n3. This is the key one, where i think there is some kind of bug, or a big misunderstanding how to operate on my side. After connecting the new defined material to the setEPZoneCnstr (point 1 above), i was hoping this will be taken into account for the simulation. It isn't. I checked the IDF created and i see there that the construction material assigned for all windows is ExternalWindow, which i assume is the default. I see also that the defined materials and constructions are not included there. Maybe there is a problem with the SimpleGlazingSystem?\n\nIn short, you are receiving the same results simply because the materials are not changed in the simulation file.\n\nWill be glad to hear M and C explanations :-)\n\n-A.\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1183588", "name": "shgcwindows_AY.gh"}], "created_by_name": "Abraham Yezioro", "created_at": "December 8, 2014 at 10:42am", "created_by": "AbrahamYezioro", "replies": [{"body": "\nYes! Back to number 1.\n\nI'm checking the file now. If it doesn't update the construction then it is a bug. Let me check the file before making any further comments.\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "December 8, 2014 at 8:50pm", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nIt was a bug and it was deep down in the Honeybee_Honyebee reEvaluateHBZone. I'm surprised that no one has reported this before. Looks like it is not happening in all cases. Maybe a good reason to have a new release. Thank you both for reporting and checking this. Just checked with Chris and he has number of examples for construction test which is working fine. It is fixed in the attached file.\n\nCan you please check and let me know if it works as supposed after the fix.\n\nMostapha\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1183886", "name": "shgcwindows_AY_MSR.gh"}], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "December 8, 2014 at 10:17pm", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nPerfect now!\n\nResults makes sense ... or at least change.\n\nI'll check later if there are issues with the other envelope elements.\n\nThanks,\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "December 8, 2014 at 11:30pm", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nIt works now, thanks Mostapha! You are right, it might be a good idea to do a new release with these errors fixed. \n\nA. \n", "attachments": [], "created_by_name": "Alejandro Pacheco Diéguez", "created_at": "December 9, 2014 at 2:40am", "created_by": "3ahr35r8m5dl1", "replies": []}, {"body": "\nAwesome.  I can confirm that it was not working before but it works now.  Well done, Sir Sadeghipour!\n\nLet me know if you would need me to assist at all with a new release.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "December 9, 2014 at 3:33pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nThen let's do it. This is a major bug and I'm so sorry that I didn't realize this sooner. I just want to get read annual daylight results fixed and then we can go for the new release. I also need to check the issues on github and mark the ones that should be addressed for this release. I should be ready after this weekend.\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "December 9, 2014 at 7:25pm", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nOk.  Let me know if there are any issues assigned to me that I should clear up before the release.\n\nAlso, so that you know my larger plan, I am hoping to do a lot of development over January (including implementing basic natural ventilation airflow objects - not including the AFN - and all of the indoor comfort map stuff that I have been working on).  I was originally thinking that it would be good to do another release after this but, given that this development will mostly involve new features and not bug fixes, I can see it as a good idea to develop in January and have people beta-test until they find all of the bugs before releasing it with stable components.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "December 10, 2014 at 7:42pm", "created_by": "ChrisMackey", "replies": []}]}]}