{"body": "\nMustafa\n\nthanks for your reply and useful comments\n\nI managed to enhance the panels in the analysis.\n\nAnother question  that arose is how could i add artificial light sources within the space to measure illuminance from both artificial and natural light to check for example how much light bulbs and for how long I would need in order to maintain a specific illuminance level .\n\nI tried to use the honeybee_lighting control recipe but was not able to have it working. Also i could not find anything relate while searching so I thought it would be good to start a discussion\n\n\n\nThanks\n\n\n\nAttached the two files of the definition with the panels as a .zip file\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1183325", "name": "agent_panels_daylight_analysis.zip"}], "created_by_name": "Evangelos Pantazis", "created_at": "December 7, 2014 at 9:19pm", "created_by": "EvangelosPantazis", "topic": "Analysis for Light diffusing panels", "replies": [{"body": "\nHi Evangelos, I think there are three different questions here.\n\n1. How can you add artificial lights to your scene: Look for  IES2HB component and also read this discussion: [http://www.grasshopper3d.com/group/ladybug/forum/topics/simulating-...](http://www.grasshopper3d.com/group/ladybug/forum/topics/simulating-ies-lamps-file-through-rad-materials)\n\n\n\n2. How to generate lighting schedule (= when do you need to have the lights on?): If you run an annual analysis and use read Annual Results I, there is an output for annual profile that also include lighting schedule. Check Honeybee example file for annual analysis.\n\n\n\n3. Analysis for light diffusing panels (which is the topic of your discussion): You can create and apply translucent materials to your panels and they will diffuse the light.\n\n\n\nHope it helps,\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "December 9, 2014 at 6:48pm", "created_by": "MostaphaSadeghipour", "replies": [{"body": "\nHi Mostapha,\n\n\n\nthanks for your reply and clearing my question even more. Indeed they are  three questions that I am trying to approach in a step wise fashion and thanks for giving me feedback.\n\n\n\nRelating to your comments:\n\n\n\n1.Thanks for the link. I followed up and seems exactly what I was looking for. I will try to add it in my definition and run the analysis again and post the files here\n\n2. What we are currently doing is running experiments in an IVE  with users and we register what is their light preference (daylight+artificial Light) for implementing a set of office related activities (ie reading, typing etc). We want then to use the collected data in order to generate user based light schedules, so that we can feed it into the analysis.\n\nThanks for the reference I checked the example file and I was wondering if there could be way to integrate the annual results with that of data collected from users.\n\n\n\n3. What I started developing in java (attached image) is an agent based generative panel that I want to control its growth and geometry by the radiation analysis and achieve various degrees of light diffusion initially by geometry and then look into materiality. for now I am working with an opague RAD material\n\n\n\nThanks for your input. Will keep you posted with further progress \n\nBest,\n\nEvan\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1187139", "name": "Screenshot 2014-12-08 02.04.12.png"}], "created_by_name": "Evangelos Pantazis", "created_at": "December 12, 2014 at 6:56pm", "created_by": "EvangelosPantazis", "replies": []}, {"body": "\nHi Evan,\n\n\n\n2. I was wondering if there could be way to integrate the annual results with that of data collected from users\n\nIt is possible for sure. You just need to generate a .csv file.\n\n\n\n3. Sounds like an interesting idea. I like to know more about this and how you are trying to do this. Are you using annual simulation to measure the effect or some runs for a number of different times?\n\n\n\nMostapha\n\n\n\nPS: I will go to LA next year in Feb. for a conference. Maybe I should stop by at USC and UCLA. Looks like there are so many interesting stuff happening around similar topics.\n\n\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "December 15, 2014 at 11:12pm", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nHello Mostapha and thank for the reply:\n\n\n\n2. Ok great. I will try that out \n\n\n\n3. I just started setting up the experiment and developing a agent based system in java using iGEO library for that. We will soon publish a paper presenting the framework and  hope to have some interesting results soon. For now, I am using annual simulation, for specific time zones that relate to the function of the sapce(i.e.  office:9-5) and measure the continuous daylight autonomy and the useful daylight illuminance of the space\n\n\n\nPs: Would be great meet here in LA if you are visiting. You are wellcome to come and visit at USC and maybe I can arrange with the Engineering dept to give a presentation of the tool/your work if you have some extra time\n", "attachments": [], "created_by_name": "Evangelos Pantazis", "created_at": "December 18, 2014 at 5:47pm", "created_by": "EvangelosPantazis", "replies": []}, {"body": "\n3. Nice. I think your study would be run much faster once we have 3Phase method in place ([http://www.radiance-online.org/community/workshops/2014-london/pres...](http://www.radiance-online.org/community/workshops/2014-london/presentations/day1/McNeil_BSDFsandPhases.pdf)). I get a prototype working ([https://twitter.com/__Mostapha__/status/545230150942851073](https://twitter.com/__Mostapha__/status/545230150942851073)) but I need more time to fully integrate it to Honeybee.\n\n\n\nPS: Sounds good! Let's keep in touch by email and I will let you know early January. I don't know my plans yet. I will be there for Facades+ conference to do a workshop ([http://www.facadesplus.com/technology-workshops/](http://www.facadesplus.com/technology-workshops/)), and if I go for the conference day too then we can plan for Feb. 5th. \n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "December 23, 2014 at 10:27pm", "created_by": "MostaphaSadeghipour", "replies": []}]}]}