{"body": "\nHi Everyone!\n\nShort question aiming to clarify before I dive in honeybee world. Is it possible to substitute materials according to a specified schedule with honeybee? This feature would be helpful for those aiming to test insulated night shutters effect on performance in cold climates.\n\n\n\nWould appreciate any kind of advice.\n\n\n\n...\n\nAdditionally, I scanned the tools and didn't notice any evidence of natural ventilation? Is it WIP or I just didn't find it?\n", "attachments": [], "created_by_name": "Artem Polomanyy", "created_at": "December 9, 2014 at 11:35am", "created_by": "ArtemPolomanyy", "topic": "Insulated night shutters", "replies": [{"body": "\nArtem,\n\nThe short answer is \"you can\" although the long answer is that it might not be the best way to model what you are testing in E+.\n\nThere is a component that allows you to make dynamic blinds and you can drop down the conductivity of the blinds and boost up their thickness to give them insulating properties.  The image below shows how to do this, dropping the conductivity down to 0.16 and boosting the thickness up to 5 cm:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/HkR0dixAlewinQ6c0GfkS1PBNO1dg73EmAwQfiKRGT55afzMJh9kJCzKP5FmjnW-8x47eI2*hy-8hEETHpEmqeqMlDnh9cnL/InsulatedBlinds.PNG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/HkR0dixAlewinQ6c0GfkS1PBNO1dg73EmAwQfiKRGT55afzMJh9kJCzKP5FmjnW-8x47eI2*hy-8hEETHpEmqeqMlDnh9cnL/InsulatedBlinds.PNG)\n\nIf you know that airflow that you will get with Nat vent, you can set a custom airflow schedule. This video shows how to make it and set it up:\n\n[https://www.youtube.com/watch?v=b7ZQ5sazwrU&amp;list=PLruLh1AdY-SgW...](https://www.youtube.com/watch?v=b7ZQ5sazwrU&amp;list=PLruLh1AdY-SgW4uDtNSMLeiUmA8YXEHT_&amp;index=22)\n\n\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "December 9, 2014 at 5:45pm", "created_by": "ChrisMackey", "replies": [{"body": "\nI should add that a workflow for natural ventilation will be available at some point. We are still not sure what is the best way of addressing natural ventilation. You can read more here and there is an email chain going on: [https://github.com/mostaphaRoudsari/Honeybee/issues/134](https://github.com/mostaphaRoudsari/Honeybee/issues/134)\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "December 9, 2014 at 7:33pm", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nHi Chris, \n\n\n\nThank you as I didn't notice conductivity property in the blind tool (because I didn't expect it be there). Now I have more troubles as it is not very evident for me what do inputs \"zone data1...3_\" mean? Additionally what do I connect to _HBObjects? Windows or shading geometry? Then what is expected to come out of \"windowBreps\",\"shadeBreps\" and HBObjWShades? I ask as it was skipped in your video tutorials. If I am not correct, please give me a hint where I can find it.\n\n\n\nBut I am obviously curious of what is the best way to test elements that substitute each other according to the schedule. If this was a tool this would be EXTREMELY powerful as it one of fundamental strategies in adaptive architecture.\n\nUnfortunately, I do not know what happens behind the interface as before I have been an EDSL TAS user which is promoted at the AA school as user friendly).\n\n\n\nThe flow for the NatVent settings in the proposed settings is suitable for preliminary studies. However it would be helpful to control apertures by the weather data in a more tricky way. I mean that the input should be dynamic and obviously instead of using the outdoor temperature to open or close the window I would prefer to use the indoor DBT which appears dynamically while the conditions are calculated. Anyway you should know better!\n\n\n\nThank you for prompt help.\n\n\n", "attachments": [], "created_by_name": "Artem Polomanyy", "created_at": "December 10, 2014 at 5:48am", "created_by": "ArtemPolomanyy", "replies": []}, {"body": "\nHi Everyone!\n\n\n\nWhat can cause the trouble with the schedule of heating and cooling? If the trouble is unavoidable is there any trick to simulate something similar?\n\n\n\nAbove all I would be glad if you show me within the file how and where to plug in shading device to simulate insulated night shutters. Believe me, all AA School SED program will be using it) \n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1185523", "name": "trouble.PNG"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1185524", "name": "HB_shoeboxing.gh"}], "created_by_name": "Artem Polomanyy", "created_at": "December 10, 2014 at 12:11pm", "created_by": "ArtemPolomanyy", "replies": []}, {"body": "\nHi Artem,\n\nSchedule for cooling and heating is dualSetPoint and I'm not sure how you produce a schedule for dualSetPoint but I can check.\n\nYou can connect any shading object to HBContext_ input and they will be added to simulation.\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "December 10, 2014 at 6:49pm", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nI gave it another thought on my way back home. I actually think it should work for heating and cooling setpoints too. I will give it a try and let you know.\n\n-Mostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "December 10, 2014 at 8:58pm", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nArtem,\n\nI have altered your GH file to include how you set up a schedule with your insulated blinds.  You can find it attached and I hope that you don't mind that I also updated all components in the file to the version that we have on the github now.  Here's an image showing the workflow for setting up a schedule with the blinds:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/YRV3Lv4YkELWPsw4gWQIZ45x83LzJmM9H9F7ipQ6Yt5bf99kfeMjxf0KHTBaMDGr6Za8RIq-Xp0Xv6M5LrZKLYF28cYDA--Z/BlindsSchedule.PNG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/YRV3Lv4YkELWPsw4gWQIZ45x83LzJmM9H9F7ipQ6Yt5bf99kfeMjxf0KHTBaMDGr6Za8RIq-Xp0Xv6M5LrZKLYF28cYDA--Z/BlindsSchedule.PNG)\n\nHere, the blinds are being pulled any time that the solar radiation gets too intense or the outdoor temperature is above the building balance point.\n\nYou are right to point out to that I have not made any tutorial videos on how to use the ZoneShades component yet.  I have had it on my list for a while but the workflow doesn't address all cases of dynamic shades (notably cases where the shade is in between panes of glass) and I was considering holding off until this was better fleshed-out.\n\nAs you see in the example file, for HBObjects, you connect a HBZone or a HBSurface that has windows already on it.  You want to use the HBObjectsWShades in the rest of your workflow and the other outputs are just to help you visualize what you are simulating.  As you can see, I connect the shadeBreps to a preview component in the file so that you see what the generated shades look like.\n\nThe zoneData inputs are there for another type of shade analysis that is unrelated to the dynamic shades case that you are running here.  I attached a second GH file that shows this other workflow in case you are curious.  I mostly use those zoneData inputs to align zone heating, cooling and solar beam gain values to correct windows.  This can them be fed into another component that performs a \"shade benefit analysis\".\n\n\n\nAs I said before, if you calculate the airflow that you will get with certain aperture size, you can create a custom schedule of airflow values and feed it into your simulation for your NatVent values.  You can also use the temperature results that come out of your simulation to make a custom airflow schedule (not just outdoor data).  All of this said, I am currently working on the components that will allow you to set an indoor temperature at which to open the windows that will be used dynamically in the simulation.\n\nThe heating/cooling setpoint schedule cannot accept a CSV schedule currently because the default of HB is to use a dual setpoint schedule (which does not accommodate CSV schedules).  To be honest, I am not so sure why we have them as inputs right now but perhaps Mostapha can shed some light on this.  In the meantime, if you would like to set an HVAC availability scheduled to shut off the HVAC when you are not trying to reach a setpoint, I currently have a quick hack that does this that I will eventually turn into a full component.  Let me know if you need this and I will try to pull it together.\n\n-Chris\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1185725", "name": "HB_shoeboxing_CWM.gh"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1185726", "name": "Example of shade benefit simulation for energy14.gh"}], "created_by_name": "Chris Mackey", "created_at": "December 10, 2014 at 9:17pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nThanks Chris! That was a bug. I fixed the issue for assigning csv schedules for heating and cooling setpoints. It works fine now.\n\nArtem, Check the attached file for the fixed writeIdf component. Also grab Honeybee_Honeybee from this file and replace it in your file.\n\nHope it helps,\n\nMostapha\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1185645", "name": "setPointScheduleFixed.gh"}], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "December 10, 2014 at 9:52pm", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nBTW Chris! what you put together there is just awesome! I can't wait to get Natural Ventilation fully integrated to Honeybee. Some magical works can be done after that.\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "December 10, 2014 at 9:54pm", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nThat is great that the setpoints schedule is fixed!  I was trying to use it the other day and I should have just asked you to check it instead of editing the HVAC availability.  I noticed that the updated WriteIDF anf HB_HB components have not yet been committed to the github.  Let me know when you do this as I would like to see the changes that you made (if only to understand better how E+ is dealing with setpoint schedules).\n\nGlad that you liked the GH definition.  Yes, Nat vent is going to help a lot.  I am going write a big post to the NatVent github issue shortly.  I have been understanding a lot better the different ways that E+ can model nat vent and I think I have carved out a chunk that I am going to implement.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "December 10, 2014 at 10:57pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nThank you for the note. Just committed! In this case it was totally my mistake not taking care of .csv schedules for setpoints.\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "December 10, 2014 at 11:05pm", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nAwesome!  I didn't realize that was the problem.  I can see myself using this a lot now.\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "December 10, 2014 at 11:13pm", "created_by": "ChrisMackey", "replies": []}]}], "id": "1184446"}