{"body": "\nHi all!<br/><br/>First of all, thank you for this excellent tool!<br/><br/>I am starting a solar radiation analysis for a building located in Sweden, at a location that is not available on the EnergyPlus site. Weather files are however available for other locations in Sweden, but none that are very close to my building. <br/><br/>\n\nThe radiation analysis component does not seem to have any input to specify a custom location. It therefore appears that the only place where the location is specified is in the EPW file that goes as an input in the GenCumulativeSkyMTX component, but even there there is no input for a custom location. Is the only option here then to customize the coordinates in the EPW file, or is the location specified in some different way?<br/><br/>Thank you for your time!<br/><br/>[<img class=\"align-full\" src=\"http://api.ning.com:80/files/jF779BPAXfZjY*rjwhUF6DaTw1dx8eVe3D67FyxigUhGnh4597r-KR3naXUUnuoJdlzGfyqpOQZ0HgmOMWa3iktkZHmTBRKg/location.PNG?width=750\" width=\"750\"/>](http://api.ning.com:80/files/jF779BPAXfZjY*rjwhUF6DaTw1dx8eVe3D67FyxigUhGnh4597r-KR3naXUUnuoJdlzGfyqpOQZ0HgmOMWa3iktkZHmTBRKg/location.PNG)\n", "attachments": [], "created_by_name": "Örn Erlendsson", "created_at": "December 19, 2014 at 3:37am", "created_by": "OErnErlendsson", "topic": "Setting a custom geometric location for solar radiation study with Ladybug", "replies": [{"body": "\nHi Orn,\n\n\n\nTo run the radiation analysis you need to generate the sky and to generate the sky you need to have a climate file. Lon and lat will give you the sun position but they won't give you the intensity at the time so technically there is not way to generate an accurate sky based on only location information.\n\n\n\nYou can use sunlight hours component instead if you are trying to run some comparative studies.\n\n\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "December 23, 2014 at 10:31pm", "created_by": "MostaphaSadeghipour", "replies": []}], "id": "1191714"}