{"body": "\nHi\n\n\n\nI have some questions regarding the analysis period in Ladybug. If I enter in the hours from 9-15 with a 4 (15min) time step the last item in the sunPositionInfo output displays 14:45. Does this mean that the 3pm vector isn't being calculated? Is this a bug or is this intended to work this way?\n\n\n\nThanks\n\n\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/LXZYmTRupZ*THl8v22UWKW7jcO5o6kc2a34EPC7OypjtFe-ROFWgycGsDdOUrPKvCss4KoBlpOL903ol1cZPZ6npIy6tBtan/Ladybugquestion.JPG?width=750\" width=\"750\"/>](http://api.ning.com:80/files/LXZYmTRupZ*THl8v22UWKW7jcO5o6kc2a34EPC7OypjtFe-ROFWgycGsDdOUrPKvCss4KoBlpOL903ol1cZPZ6npIy6tBtan/Ladybugquestion.JPG)\n", "attachments": [], "created_by_name": "Paul Wintour", "created_at": "January 11, 2015 at 10:40pm", "created_by": "PaulWintour", "topic": "Ladybug analysis period problems", "replies": [{"body": "\nHi Paul,\n\nThis is one of my favorite topics actually. I have changed this couple of time and still I'm not sure if it is the best solution. The last hour is not intended to be there.\n\nSo here is the concept. Let's say you want to generate sun vectors for working hours. Let's say that people are working in an office  from 8 to 17. It means they will leave at 5pm so the data for hour 5 shouldn't be generated. Does it make any sense to you! I tried to match Ladybug sunpath with daysim logic but I agree that it's not what comes to mind first when you hear 8 to 5.\n\nMostapha\n\nPS: I like the time-saving component up there. How do you deal with the cutting hour?\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "January 12, 2015 at 3:54pm", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nHi Mostapha\n\n\n\nThe daylight savings cluster I made is just a simple dispatch with a Boolean input. If true, it adds an extra hour to the timezone. \n\n\n\nAs for the missing vector, I actually need to calculate the no. of hours of direct sunlight on a facade within a given period. So I believe for the calculations to work, I need this extra vector. It's pretty easy to do a workaround by adding an extra hour in the input and then splitting the output lists. I just want to check if there was some logic behind your methodology I was missing before I went ahead an amended it.\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/*E1*lxSss-cRzUvmLSem5Ktv9Cm9QPE*oPjVrnj2pBt3csjXOMdqUUvuC1AqR0n3QqV0K9sXqzYfF3rWTkou6Z*zIWMLEC5c/Location.JPG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/*E1*lxSss-cRzUvmLSem5Ktv9Cm9QPE*oPjVrnj2pBt3csjXOMdqUUvuC1AqR0n3QqV0K9sXqzYfF3rWTkou6Z*zIWMLEC5c/Location.JPG)\n", "attachments": [], "created_by_name": "Paul Wintour", "created_at": "January 12, 2015 at 5:25pm", "created_by": "PaulWintour", "replies": [{"body": "\nHi Paul,\n\nThanks. I think what you said make sense and maybe for cases like this we should add the last hour.\n\nBack to changing the time zone, I assume you know that your solution will move all the sun positions for all the hours (and not only daylight saving period). The reason that we haven't applied daylight saving hours is the fact that it is different in different countries. Maybe we should add it in a simplified version and give the user the chance to overwrite it similar to your Boolean option ([https://github.com/mostaphaRoudsari/ladybug/issues/118](https://github.com/mostaphaRoudsari/ladybug/issues/118)).\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "January 18, 2015 at 8:06pm", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nHi Mostapha,\n\n\n\nI think there should be an option to include sun vectors up to and including the end of the period as this is required when doing say solar access analysis.\n\n\n\nI've just been tripped up by this when creating a Solar Fan for a solar access exclusion zone to a public space between 11am-4pm. An initial pass using only hourly intervals effectively only calculated a solar envelope for 11am-3pm as the last vector (4pm) was not included!\n\n\n\nIt did not seem right to me the i realised the last vector was missing, so i increased the intervals to 12 (i.e 5min intervals) which then means the last vector is 3:55pm.\n\n\n\nIdeally the sun vectors produced from a sunpath would include the last period, and components would include or exclude this depending on their purpose (e.g Solar Fan would include, Shading would exclude but perhaps with an option to include, etc). But this would mess up existing definitions so understand it might not be the way to go\n", "attachments": [], "created_by_name": "Owen Sharp", "created_at": "July 13, 2016 at 7:23pm", "created_by": "OwenSharp411", "replies": []}, {"body": "\nHi Owen,\n\nWe had a lot of back and forth on this topic. Paul has raised the questions a couple of times himself. I agree with both of you. Not including the last hour is not a good idea even if it's technically correct in some case. [We are changing this in the new version of Ladybug](https://github.com/ladybug-analysis-tools/ladybug-dynamo/issues/12#issuecomment-224476897) so the last hour is included.\n\nMeanwhile you need to use list management in Grasshopper to add/remove extra hours.\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "July 14, 2016 at 5:01pm", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nHi Mostapha\n\nThis has been fixed in Dynamo but has it been updated in Grasshopper? I'll need to undo some of my work arounds once implemented.\n\n\n\nP\n", "attachments": [], "created_by_name": "Paul Wintour", "created_at": "July 24, 2016 at 5:44pm", "created_by": "PaulWintour", "replies": []}, {"body": "\nHi Paul, It will be implemented to the new Ladybug (ladybugX) which will be under a separate tab. We'll leave the current Ladybug as it is to avoid confusion and breaking current workflows.\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "August 11, 2016 at 8:15am", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nThanks Mostapha. When you say Ladybug X was exactly do you mean? Is it a separate component within v.0.0.63 or not yet released?\n", "attachments": [], "created_by_name": "Paul Wintour", "created_at": "August 22, 2016 at 12:10am", "created_by": "PaulWintour", "replies": []}, {"body": "\nIt's the new ladybug library which is what Ladybug for Dynamo is using. It's not released yet for Grasshopper.\n\n\n\nIt will be a new Ladybug. LadybugX to Ladybug is similar to what Kangaroo2 is to Kangaroo.\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "August 22, 2016 at 10:30am", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nOK. So you are completely rewriting it so that it works with both GH &amp; Dynamo?\n", "attachments": [], "created_by_name": "Paul Wintour", "created_at": "August 22, 2016 at 4:50pm", "created_by": "PaulWintour", "replies": []}, {"body": "\nYes. It's more than just to get it to work for both platforms. There are major code and performance enhancements plus an [API](http://ladybug-analysis-tools.github.io/ladybug/doc/).\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "August 22, 2016 at 4:55pm", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nHi Mostapha\n\nSo this topic has recently come up again with colleagues and I just wanted to get your expert opinion. If we add in the last vector in the context of performing a solar access study I believe it is technically correct. For example, if we have an analysis period of 1hr but only 1 vector, it will assume that it gets sun for the full hour. If however we have 2 vectors, we can be sure that the sun is there for the full duration. I think this is clear.\n\n\n\nBut what complicates things is the legend and all subsequent workings. By adding in the extra vector as a workaround, we would get 2hrs max, not 1 hr. So until Ladybug X is released, do you suggest simply subtracting the step value (1hr) from the results and adjusting the legend? So 2 vector compliance would be 1 hr, and 1 vector compliance would be 0 hrs. Does that make sense?\n", "attachments": [], "created_by_name": "Paul Wintour", "created_at": "September 4, 2016 at 7:00pm", "created_by": "PaulWintour", "replies": []}]}], "id": "1202845"}