{"body": "\nIf I want to create a Honeybee routine that samples a space with using this spherical sensor, how would I go about doing that?\n\n\n\nIf your interseted, here is my circumstance and how I'm currently gathering results.\n\nCurrently i'm modifying the pts vector in the grid analysis to always look up (+Zvector), rather than normal to the test surface in order to get a better result in section (otherwise they'd be shooting out into a wall). It still is only sampling as a hemisphere. The hemisphere makes total sense when evaluating the performance of a work surface, and room performance, but when evaluating an atrium in section, light comes from all angles, especially if the building opens up to side rather than just from above.\n\n\n\n<img src=\"http://api.ning.com/files/51GNwYDFQ0SeWUst*Z2nvZeooSpP9uxO3MxBDjVxvnMmsxeI63y5mXjTAAPo6dx*4NUt8-Z5aQs-IeD99LSLxZXhjEn3V18p/141203L4Section2.0.jpg?width=750\"/>\n\n\n\nIn this image you can see the atrium has a bright spot part way down. This is from an opening in the building, and with hemispherical sampling, your not getting a complete picture of light behavior.\n\n\n\nHere is the example file of a project I'm working that I'd like to get spherical sampling working on. \n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1206894", "name": "004_gridBasedAnalysis DOUGLAS - EXAMPLE.gh"}], "created_by_name": "will krzymowski", "created_at": "January 19, 2015 at 11:59am", "created_by": "willkrzymowski", "topic": "Spherical Sampling", "replies": [{"body": "\nHi Will, Thank you for posting this as a new discussion. I can get back to you with an example at some point next week but if you want to give it a try yourself the trick is to generate series of vectors in all different directions (instead of only one looking +Z), and use them to generate new set of test points (which will have the same XYZ for point and different XYZ for vector). Then run the analysis and average the values for same test points. This should give you what are you looking for.\n\n-Mostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "January 23, 2015 at 4:08am", "created_by": "MostaphaSadeghipour", "replies": [{"body": "\nThis answers the question of weather or not I'm modifying the radiance settings, or manipulating data post run to achieve a spherical sensor. Sounds like I'm running two hemispherical simulations and figuring out how to combine the data.\n\nThat makes sense except for one thing. Why would you average them? When I run the simulation in the two different directions... I get a high value (looking up) and a very low value (looking down)... if I average them, that would indicate that the high value was not accurate to begin with.\n\nI would assume that I would add the values together, that is, if the sensors are really \"searching for light\" and just additively gathering light from its project rays. Is there some sort of sophisticated method of combining the 'found' light from the rays of a sensor that would effect how I would combine light coming from these two directions?\n\nI think ultimately this is where I got stuck. I didn't want to present anything as predicted light levels of the atrium in the analysis due to this ambiguous understanding of the methodolgy.\n\nI hope this makes sense. Thanks for you wonderful help and dedication to this plugin... it is very exciting for us architects. \n", "attachments": [], "created_by_name": "will krzymowski", "created_at": "January 26, 2015 at 12:01pm", "created_by": "willkrzymowski", "replies": []}, {"body": "\nAny luck looking into this?\n", "attachments": [], "created_by_name": "will krzymowski", "created_at": "February 2, 2015 at 11:33am", "created_by": "willkrzymowski", "replies": []}, {"body": "\nHi Will, Here is what I would do to cover the full sphere. As I mentioned before if you just have two z vector up and down you are covering the sphere but the more vectors you generate the higher resolution you will have.\n\n\n\n[<img class=\"align-center\" src=\"http://api.ning.com:80/files/kHZNBDqH1ZhtrqsIyJiLE-sUo5ZHwXnkR67jgtZMj-jcwfXyOgvWgHBG9O*TVgPguiyqm7aA*E9BptU2YZ-CgAgRrVkjxC4P/spherical_sensors.jpg\" width=\"499\"/>](http://api.ning.com:80/files/kHZNBDqH1ZhtrqsIyJiLE-sUo5ZHwXnkR67jgtZMj-jcwfXyOgvWgHBG9O*TVgPguiyqm7aA*E9BptU2YZ-CgAgRrVkjxC4P/spherical_sensors.jpg)\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1216069", "name": "spherical_sensors.gh"}], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "February 2, 2015 at 8:49pm", "created_by": "MostaphaSadeghipour", "replies": []}]}]}