{"body": "\nDear all,\n\n\n\nI'm writing to you after two days of trials.\n\nI'm trying to use TransMaterials as a way to perform EP simulations with a translucent shading device added as Context.\n\n\n\nThe point is that the simulation runs fine but It seems that the material is not considered (I tried to variate the material parameters and also disconnect it from context component and the results output are the same).\n\n\n\nHope you can help me undergone this issue :)\n\n\n\nThank you,\n\nMarco\n\n\n", "attachments": [], "created_by_name": "Marco P", "created_at": "January 20, 2015 at 5:24am", "created_by": "MarcoP", "topic": "HB Shading Context_TransMaterial fails", "replies": [{"body": "\nMarco,\n\nThe RADMAterial is only for Radiance simulations and not E+. For E+ you need to define a schedule for the transparency. Look at the second input in the HB_HB_EPContextSrf component.\n\nIn E+ you can not define materials for context.\n\nCheck Chris's videos. One of them is dedicated to this specific issue.\n\n[https://www.youtube.com/playlist?list=PLruLh1AdY-SgW4uDtNSMLeiUmA8Y...](https://www.youtube.com/playlist?list=PLruLh1AdY-SgW4uDtNSMLeiUmA8YXEHT_) video 23.\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "January 20, 2015 at 5:36am", "created_by": "AbrahamYezioro", "replies": [{"body": "\nThank you Abraham for the quick reply!\n\noh yes, great tutorial. I already seen it but i thought it was possible to add a shading material for a more realistic simulation. However, also EPtransparency schedule will be good!\n\n\n\nthanks again,\n\nMarco\n", "attachments": [], "created_by_name": "Marco P", "created_at": "January 20, 2015 at 5:59am", "created_by": "MarcoP", "replies": []}, {"body": "\nHi Marco,\n\nAs Abraham mentioned, EnergyPlus has limitations in material types that you can assign to external shadings but you may want to check blinds if the shading device is integrated to your window. Related components are Honeybee_EnergyPlus Window Shade Generator + Honeybee_EnergyPlus Blinds Material.\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "January 20, 2015 at 8:37pm", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nHi Mostapha,\n\n\n\nactually I'm working on an external shading device. I'll try to construct the model as you said and check if the results will be reliable.\n\n\n\nThank you for the support guys!\n\nMarco\n", "attachments": [], "created_by_name": "Marco P", "created_at": "January 21, 2015 at 2:09am", "created_by": "MarcoP", "replies": []}, {"body": "\nHi Marco,\n\nAttached you can find an example file for how to set up blinds with the Honeybee_EnergyPlus Window Shade Generator.  Creating blinds this way will ensure that the surface temperature of the shades is calculated and factored into the energy simulation.  When you use the EPContextSrf component, the simulation is really only checking to see if the sun is blocked by the object and does not compute its surface temperature.  So, for objects that are very close to your building like an architectural shading device, you should consider using this component.\n\nI hope that helps,\n\n-Chris\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1209071", "name": "EnergySimulationBase_BlindsExample2.gh"}], "created_by_name": "Chris Mackey", "created_at": "January 22, 2015 at 2:16am", "created_by": "ChrisMackey", "replies": []}, {"body": "\nHi Chris,\n\n\n\nthanks for the BlindExample. I really appreciate that.\n\nHowever, the simulation does't run correctly if I choose a set of Brep as custom shadings.\n\nIn attachment the file with one of my hypothesis quickly inserted in your file.\n\n\n\nThanks again,\n\nMarco\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1208995", "name": "EnergySimulationBase_BlindsExample2_MPe.gh"}], "created_by_name": "Marco P", "created_at": "January 22, 2015 at 3:21am", "created_by": "MarcoP", "replies": []}, {"body": "\nHi Marco,\n\nUnfortunately, EnergyPlus does not really have a good way to model a custom shade as you have in a manner that includes the surface temperature of the shading device.  It can model blinds, drapes, and screens very well (I imagine that you might approximate your geometry as a screen if we had good algorithms to analyze how and when the sun passes through it).\n\nFor now, my advice would just be to go back to the original plan to use the \"EP Context Surface\" component, knowing that the surface temperature of the material is estimated to be that of the outdoor air and that this can be a source of error if your shading material is very thin.  Also, make sure that you use a \"Honeybee_ShadowPar\" and \"Honeybee_Energy Simulation Par\" component for and connect them to the \"EnergySimPar\" input of the \"Run Energy Simulation Component.\"  Boost up the \"maximumFigure\" input of the \"SahdowPar\" component to be sure that EnergyPlus accurately calculates the sun that gets through your shading device.\n\nAlso, for the record, the HBObjects that you plug into the \"Window Shade Generator\" component are HBSrfs that have windows assigned to them. Not shading geometry.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "January 22, 2015 at 6:09pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nHi Chris,\n\n\n\nthank you. \n\nActually what I'm trying to evaluate the most are the primary energy need for CHL the room. So, It is more important to estimated the solar gains/loads coming from the window with different types of shadings applied. \n\nIf we consider that after 5 cm between two elements the air can move and so the thermal resistance dropped to zero, I think I can avoid to consider the surface temperature of the shading.\n\nContrariwise, I constructed thanks to HB also a Daylight Simulation (UDI/DGP) in order to evaluate the visual parameters. It will be important to estimate either the amount of light passing through the shades.\n\n\n\nYes you're right about the WSG component. My mistake!\n\n\n\nThank you for the kind support,\n\nMarco\n", "attachments": [], "created_by_name": "Marco P", "created_at": "January 23, 2015 at 6:22am", "created_by": "MarcoP", "replies": []}, {"body": "\nHi Chris,\n\nI read from you(in several discussion) that E+ doesn't support custom shading device, but I really need to study thermal efficiency of a custom shading device;\n\nI used both blinds(with windows) and \"EP Context Surface\"\n\nI noticed that the only parameters that work are the \"ShadeTransmittanceSchedule\" applied to the \"EP Context Surface\"; \n\nthere is any chance to set up solar absorptivity and emissivity to the external shading device? I read on a scientific paper that it is possible with DesignBuilder that works with EnergyPlus..\n\ncontrary, could you suggest any example of good algorithms that can analyze the quantity of solar radiation to use blinds materials?\n\nin the file attached I simplified my shading device making a sort of grid;\n\nCould you please help me?\n\nthank you in advance,\n\nErnesto\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1468689", "name": "Ern_Window Shade.gh"}], "created_by_name": "Ernesto Cesario", "created_at": "February 22, 2016 at 9:46am", "created_by": "ErnestoCesario", "replies": []}, {"body": "\nErnesto and Marco,\n\nI should probably have been clearer with my previous statement and what I mean by a \"good way\" to model completely custom shade geometry. First, Marco, if your shades have enough thermal capacity or resistance to be safe with the assumption that they are the same temperature as the air, then the use of the the \"EP Context Surface\" is a \"good way\" to model this custom geometry.  However, if the shades do not have this heat capacity or resistance, you may have to find another method.\n\n\n\nAltogether, there are at least 4 main ways of modeling shades in EnergyPlus:\n\n\n\n1) Custom geometry of whatever you want but this geometry will only be factored in the simulation by it's blocking of sun.  The temperature of the geometry will be assumed to be the same as the outdoor air (no emissivity or absorptivity is specified) and so it is really only intended for shading objects like other buildings, trees, or shades made of materials with a high heat capacity/resistance.  This is what the \"EP Context Surface\" does.\n\n\n\n2) Blind geometry for which the temperature of the surface will be calculated.  Here you can specify an emissivity and absorptivity for the blinds but you are limited to expressing only horizontal or vertical slats as your shades (no other geometries).  This is what the \"EnergyPlus Window Shade Generator\" does by default.\n\n\n\n3) Interior Roller Shades / Exterior Perforated Screen geometry for which the temperature of the surface will be calculated.  This is just like the blind geometry in that you specify the emissivity and absorptivity but here you are are limited to 2D shades that are parallel to the window plane. The \"EnergyPlus Window Shade Generator\" is also capable of modeling this type of shade.\n\n\n\n4)  Completely custom geometry for which the surface temperature of the shade will be calculated.  While this may seem like the best of all worlds, it is usually VERY time-consuming to pull off as you have to parameterize the geometry into a matirx of values for the amount of sun that is permitted for every sun angle.  OR you have a BSDF file that represents the properties of your shade ready to go.  This is what I meant previously by a \"good way\" to model custom shade geometry and I should have clarified that there is no easy way to generate this type of matrix.  EnergyPlus can model it if you have it, though.  At the moment, there is no specialized Honeybee component to generate this type of shade as it is already such a high amount of custom work that you should probably only attempt it if you know how to generate such a matrix or have the BSDF file.  To include this type of shade in the Honeybee simulation, you will have to write custom IDF text into a panel and connect it to the additionalStrings of the RunSimulation component.  For this custom IDF string, you will use the windowmaterial:complexshade object in EnergyPlus:\n\n[http://bigladdersoftware.com/epx/docs/8-3/input-output-reference/gr...](http://bigladdersoftware.com/epx/docs/8-3/input-output-reference/group-surface-construction-elements.html#windowmaterialcomplexshade)\n\n\n\nErnesto, I think that your case is probably well-approximated by 3) Interior Roller Shades / Screen geometry as it is really not that complex:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/rFmq0S5l0CJTMKQnWmNmQlR61oKZ41e-LNKNaW2ZuqC0XiXfn748ea8r1eSke2ahLsRBGsvEEPnF3w3FHXFweq2eiCbFdrJ*/NotComplexGeomtry.JPG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/rFmq0S5l0CJTMKQnWmNmQlR61oKZ41e-LNKNaW2ZuqC0XiXfn748ea8r1eSke2ahLsRBGsvEEPnF3w3FHXFweq2eiCbFdrJ*/NotComplexGeomtry.JPG)\n\nHere is an example file that shows you how to do both 2 and 3 of the above examples so that you can get this working in your file, Ernesto:\n\n[http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;for...](http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;fork=hydra_2&amp;id=EnergyPlus_Window_Shade_Generator&amp;slide=0&amp;scale=1&amp;offset=0,0)\n\n\n\nIf you are really feeling like this perforated screen approximation wont do you justice, here is an example of how to use the additionalStrings input to add a custom EP Object that does not have a HB component (in this case, I am adding an evaporative cooling tower):\n\n[http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;for...](http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;fork=hydra_2&amp;id=Evaporative_Cooling_Tower&amp;slide=0&amp;scale=1&amp;offset=0,0)\n\n\n\nHope this helps and is clear.\n\n-Chris\n\n\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "February 24, 2016 at 9:10pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nHi Chris and really thank you;\n\nactually my shade geometry is not so simple and it changes every time depending on the case;\n\nI saw your example on hydra about additionalStrings(evaporative cooling tower) and I tried to reply it for my geometry;\n\ncould you please have a look? I cannot understand why it doesn't work..do I miss something when I connect the geometry and the IDF file? \n\nThank you in advance\n\nErnesto\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1532207", "name": "I-MESH_Thermal_002.gh"}], "created_by_name": "Ernesto Cesario", "created_at": "May 18, 2016 at 12:47am", "created_by": "ErnestoCesario", "replies": []}, {"body": "\nHi Chris,\n\nJust wondering how you get to the screen perforated geometry in the image above. Using the EPWindowShades I'm defining a shade type: Shades with any value in airPermeability (greater than 0), but the geometry shows no difference changing this value. Don't see any other input relevant to the setting of the openness of the shade.\n\nI want to use this for a daylight simulation.\n\nThanks,\n\n-A.\n\n[<img class=\"align-full\" src=\"undefined\"/>](http://undefined)\n\n\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "May 24, 2016 at 4:51pm", "created_by": "AbrahamYezioro", "replies": []}]}]}