{"body": "\nHi all, i'm tryng to calculate PET value with Ladybug about outdoor thermal comfort study. \n\nI am using for my thesis from which revenue Envimet some benchmarks including MRT and then through Rayman get the PET PMV SET index values. Unfortunately I can not (sorry I'm still in the early experiences with LB + HB) to calculate the PET with LB (maybe checking the result with that obtained by Rayman), my goal (idea) would be to write a component (or cluster) that allows me to determine the PET through the input of values as (potential temperature, wind speed, relative humidity, MRT)and view all within my 3D model.\n\nThank you in advance.\n", "attachments": [], "created_by_name": "Luciano", "created_at": "January 21, 2015 at 10:23am", "created_by": "Ambrosinus", "topic": "Is it possible to calculate PET value to evaluate Outdoor thermal comfort condition?", "replies": [{"body": "\nHi Luciano,\n\nThank you for posting.\n\nUnfortunately Physiologically Equivalent Temperature (PET) is the one comfort metric that Ladybug does not currently calculate.  For outdoor comfort, I usually suggest that people use universal thermal climate index (UTCI) and the \"Outdoor Comfort Calculator\" component will calculate this for you.\n\nStill, I know that both UTCI and PET form the current gold standard for outdoor comfort, depending on whether you have information on clothing and metabolic rate (when you would use PET) or prefer to have these variables adapted with the change in outdoor conditions (when you would use UTCI).\n\nTo be honest, the reason why I have been slower to integrate PET is because it seems very similar in principle to Outdoor Standard Effective Temperature (OUT_SET) and you can already calculate OUT_SET with the PMV comfort calculator.  I will also admit that I had more trouble finding documentation on how to calculate PET and its merits over OUT_SET.  Needless to say, if anyone on the forum knows of a good reference that explains how to calculate PET, I would be happy to take a look at it and pull together a means of calculating PET in Ladybug.\n\nI also know that the Ladybug developer Djordje Spasic has a lot of interest in the issue and there's a good chance that he is ahead of me on this. In case this is relevant to your study, his \"Thermal Comfort Indices\" component will calculate a number of different metrics - from wind chill to humidity index.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "January 22, 2015 at 3:02pm", "created_by": "ChrisMackey", "replies": [{"body": "\nLuciano,\n\nI will also say that, from my research, there is a general consensus that the metric of PMV is not suitable for outdoor comfort analyses.  At the least, if you use it for outdoor conditions, you cannot use it in the same way that you would for indoor conditions.  For example, you cannot say that, if PMV is in the range from +/- 1 PMV, at least 80% of people are comfortable.  It is known that people tolerate much more extreme conditions when they are outdoors and you will frequently find conditions where someone has a PMV of 1.6 or higher but will say that they are perfectly comfortable.  Also, the range of adaptability with clothing and metabolic rate is much greater in the outdoors than in the indoors and these variables can be hard to guess for outdoor conditions unless you are an expert.  All that I am saying is to be cautious and critical if you use the PMV method for outdoor conditions.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "January 22, 2015 at 3:23pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nHi Chris, Thank you so much for your help and explanation about PMV and outdoor comfort analyses! Maybe I'll use \"Thermal Comfort Indices\" to obtain MRT values (thank you again because i didn't know how many different metrics it can calculate), however I'will refer to UTCI values for Outdoor comfort, while we waiting to find a good documentation about PET.\n\nThank you Chris!\n", "attachments": [], "created_by_name": "Luciano", "created_at": "January 22, 2015 at 6:11pm", "created_by": "Ambrosinus", "replies": []}, {"body": "\nLuciano,\n\nThe MRT of the \"Thermal Comfort Indices\" is good for calculating a general MRT in sunny conditions.  If you want something that more specifically accounts for human geometry, you can use the \"Outdoor Solar Temperature Adjustor\" component.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "January 22, 2015 at 7:35pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nThank you Chris for your support, you're right I'll try to do this, in my workflow MRT was useful only as input parameter for Rayman (so I'll be able to calculate PET). Thank you a lot, above all for your effort and contribution in LB development!\n", "attachments": [], "created_by_name": "Luciano", "created_at": "January 23, 2015 at 4:42am", "created_by": "Ambrosinus", "replies": []}, {"body": "\nHi Luciano, just curious how are you going to calculate PET from MRT? I've been looking for the same thing and I can't seem to find easy to understand resources.\n\n\n\nThanks \n", "attachments": [], "created_by_name": "Ninja", "created_at": "April 22, 2015 at 8:36pm", "created_by": "RaniaLabib", "replies": []}, {"body": "\nHi Rania, by RayMan and ENVImet. From ENVImet i have 4 values (MRT, wind speed, relative humidity and potential temperature, so if you put these values in rayman you can obtain PMV, PET, SET and UTCI (this one from ladybug as well). At this moment i am working on a little component that will able to convert PMV to PET, because some researchers ([http://www.sciencedirect.com/science/article/pii/S1877705812016876](http://www.sciencedirect.com/science/article/pii/S1877705812016876)) have demonstrated the existence of an equivalence scale between these two comfort indexes (maybe it's not properly correct, but i need only an indication in my thesis about it).\n\n[<img class=\"align-center\" src=\"http://api.ning.com:80/files/nBD8FQWarq*u9JEgfxXsvtSisJXnuOLiml-b1HbOdKqt*Qipo8CAHNXz2dnkz7ILS7XcMiJVs2eG32Df*23mpMv-1J4Wc82v/PMVtoPET.png?width=720\" width=\"720\"/>](http://api.ning.com:80/files/nBD8FQWarq*u9JEgfxXsvtSisJXnuOLiml-b1HbOdKqt*Qipo8CAHNXz2dnkz7ILS7XcMiJVs2eG32Df*23mpMv-1J4Wc82v/PMVtoPET.png)PS.: i've used: -4&lt;PMV&lt;4; \n\n\n", "attachments": [], "created_by_name": "Luciano", "created_at": "April 24, 2015 at 12:50am", "created_by": "Ambrosinus", "replies": []}, {"body": "\nHi Luciano, Thank you so much for your helpful response. I\"m currently using Envimet to evaluate different street configurations in urban settings. I've heard about RayMan model ([This research paper](http://link.springer.com/article/10.1007/s00484-006-0061-8)) but I didn't realize that it's an actual software. So, upon your response, I searched up the software, and I tried to download it, but there was a problem with their website. To be able to download it I have to fill a short form, I did so but the form won't submit, I think the submit button doesn't work. Any chance you have a copy of the software that you can share with me.\n\nI like your component, looks promising :)\n", "attachments": [], "created_by_name": "Ninja", "created_at": "April 24, 2015 at 2:35pm", "created_by": "RaniaLabib", "replies": []}, {"body": "\nHi Luciano, Never mind my previous message .\n", "attachments": [], "created_by_name": "Ninja", "created_at": "April 24, 2015 at 11:45pm", "created_by": "RaniaLabib", "replies": []}, {"body": "\nthe form is probably only informative if I remember correctly. I'm happy if you solved the problem.\n", "attachments": [], "created_by_name": "Luciano", "created_at": "April 25, 2015 at 1:09am", "created_by": "Ambrosinus", "replies": []}]}, {"body": "\nHi Mackey,\n\n\n\nWould you mind sharing the equation of UTCI calculation? I have been looking for this a while without luck. Many thanks!\n\n\n\nBest,\n\nJason\n", "attachments": [], "created_by_name": "Jason", "created_at": "June 25, 2015 at 7:49pm", "created_by": "Jason482", "replies": [{"body": "\nHi Jason,\n\nThe equation for UTCI calculation is one enormous, 200-term polynomial approximation across all of the data points that were used to derive it.  The version of the UTCI equation in Ladybug is a direct python translation from the original FORTRAN code published on the UTCI website:\n\n[http://www.utci.org/utci_doku.php](http://www.utci.org/utci_doku.php)\n\n(you can find it by clicking on \"UTCI_Program_Code\" and then downloading the \"UTCI_a002.f90\" and opening it in the text editor of your choice).\n\n\n\nFor the python function that calculates UTCI in Ladybug, you can find it here:\n\n[https://github.com/mostaphaRoudsari/ladybug/blob/master/src/ladybug...](https://github.com/mostaphaRoudsari/ladybug/blob/master/src/ladybug_ladybug.py#L3305-L3582)\n\n\n\nEnjoy!\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "June 30, 2015 at 8:27pm", "created_by": "ChrisMackey", "replies": []}]}]}