{"body": "\nHi,\n\nFollowing this [thread](http://www.grasshopper3d.com/group/ladybug/forum/topics/invalid-heating-cooling-setpoint-temperature-schedule-name) i\"m having \"serious\" issues that i want to consult with you.\n\nI adapted the attached file (from Chris) to be a residential use, that will have 24 hrs use.\n\nI defined schedules for heating and cooling, where the temperatures will be 20 and 24 respectively. The loads change a bit during the day, and also defined the proper schedules for that.\n\nI defined \"hardcore\" that winter period will be from November to March.\n\n\n\nAll this under the warning \"I think i did that\". Since i'm not getting any heating consumption and when i check the temperatures i get crazy values for the winter period (see plotted charts in the attached file).\n\nSummer values are somehow reasonable (at least temperature wise).\n\n\n\nThe definitions that HB uses are a bit different than those i'm used to do, so i suppose there is something i'm doing wrong.\n\n\n\nYour comments will be much appreciated.\n\nThanks,\n\n-A.\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1211053", "name": "HB_shoeboxing_CWM_AY_Resid.gh"}], "created_by_name": "Abraham Yezioro", "created_at": "January 25, 2015 at 2:55am", "created_by": "AbrahamYezioro", "topic": "Heating/Cooling schedules ... high temperatures for winter time", "replies": [{"body": "\nHi Abraham, I can't check your file right now but can you check setPts for heating and cooling. There was a bug in OpenStudio schedules for set points which I reported while ago and they get it fixed. I wonder if they have the bug back in the new OpenStudioTemplate? It used to be 0 for both and that was causing the issue.\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "January 25, 2015 at 3:42pm", "created_by": "MostaphaSadeghipour", "replies": [{"body": "\nI'll try to check this, but i think i messed a little bit the things. That's why i'll be glad if you, whenever you have the time, check the file.\n\nIn the meantime i changed some definitions and the temperatures are \"right\" but it still bothers me that the heating in winter time is almost none and, beyond that, the cooling is much higher than the heating.\n\nThe OpenStudioMasterTemplate.idf in my system is dated 19.7.2014 and the OpenStudioMasterTemplate_1412836435.idf from 9.10.2014.\n\nThanks,\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "January 25, 2015 at 10:01pm", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nHi Abraham,\n\nI have taken a look at your model and I can say that nothing is wrong in the running of EnergyPlus and there are no bugs in Ladybug or Honeybee that are causing those results.\n\nThe very high temperature values in winter are the result of the fact that you have created a mostly glazed south-facing test box in a high solar radiation climate and you have left almost no place for this heat to escape from your zone.  All of your surfaces other than the glazed surface are adiabatic so there is no chance for the heat to escape there.  In the winter months, you do not allow users to pull the blinds (as per the blinds schedule), open the window (as per the minOutdoorTempForNatVent value of 18C) or run the cooling system (as per your cooling setpoint shcedule).  Left with only a small infiltration rate and a small amount of conduction through a window, the heat cannot escape your zone and so it builds up until the indoor temperature reaches up to 55 C in the afternoon.\n\nYou are effectively modeling a solar oven and so I do not find your results that surprising.\n\nTake a look at your solar gains:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/kwvKg1TQ8fUQ*6prgc65s8hDk9DbJo2PjLEX0AobSlDj83eUzQwGHHtzvNEViBUTy1VnsmdxhN9psXsSYCwwTA6Vn9k3zx7M/solargain.PNG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/kwvKg1TQ8fUQ*6prgc65s8hDk9DbJo2PjLEX0AobSlDj83eUzQwGHHtzvNEViBUTy1VnsmdxhN9psXsSYCwwTA6Vn9k3zx7M/solargain.PNG)\n\nTake a look at your total heat gain (people + equip + lights + solar) (you have some interesting internal gains schedules):\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/kwvKg1TQ8fV5rnX5lAx*IIy2dadui5rWLZm009ihy3Idj3Dn2tmi8tWxqJnHqre8ErFddWN7Mpvs6kM0u4-16MfwI-MPrmr-/totalgain.PNG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/kwvKg1TQ8fV5rnX5lAx*IIy2dadui5rWLZm009ihy3Idj3Dn2tmi8tWxqJnHqre8ErFddWN7Mpvs6kM0u4-16MfwI-MPrmr-/totalgain.PNG)\n\nNow take a look at the net flow of heat (solar+conduction) through your window (one of 2 places where heat escapes):\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/kwvKg1TQ8fViA3g2gkQwl*YpAYEemVXrNIGRU1nKnKIqmJUJFhoTkjAhPLgUeAnzIwfY8QsXFrCi3iUVrFB3i25JXERbZ4QA/GlazingEnergyFlow.PNG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/kwvKg1TQ8fViA3g2gkQwl*YpAYEemVXrNIGRU1nKnKIqmJUJFhoTkjAhPLgUeAnzIwfY8QsXFrCi3iUVrFB3i25JXERbZ4QA/GlazingEnergyFlow.PNG)\n\nAnd look at your infiltration loss/gain (the other place where heat escapes):\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/kwvKg1TQ8fVhNINBIiCR8VRhf1T7qKKjE8U*edFIKXMDyxEl-NwEKO7x*Q8OX8njev9mIVdK1XmzgwhmRwxtjb-Jj6Fl7b-J/InfiltrationLoss.PNG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/kwvKg1TQ8fVhNINBIiCR8VRhf1T7qKKjE8U*edFIKXMDyxEl-NwEKO7x*Q8OX8njev9mIVdK1XmzgwhmRwxtjb-Jj6Fl7b-J/InfiltrationLoss.PNG)\n\nWhen your building looses the majority of its heat through infiltration and the outdoor air that is not that cold, you know that the indoor temperature must be high.\n\nI would consider letting people pull blinds, open windows, or run the cooling system.  Or you could make the surfaces of your zone non-adiabatic.  Adiabatic surfaces can really distort energy results unless you know exactly how to use them.  My guess is that this test box is supposed to represent something different than what you are modeling.  I imagine that, if this test box were representing a part of a real building, it would probably be exchanging a lot of heat with a core or north-facing zone behind it.\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1212231", "name": "total gain.PNG"}], "created_by_name": "Chris Mackey", "created_at": "January 26, 2015 at 8:02pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nHi Chris and thanks,\n\nI'm preparing a proper answer to yours :-)\n\nI believe this is one of the cases where bad inputs lead to bad results (in other words: garbage in garbage out).\n\nThere is no way that you get such high temperatures in this climate conditions. But i'll send this later on.\n\nIn the meantime, i find those graphs very enlightening!! Very cool way of understanding what you are doing (or i'm doing). Though i can't reproduce all of them specially the total heat gain and net flow. Can you send the example where you get them?This will be very helpful for me (and others maybe) and to prepare, and justify my answer.\n\nThanks again,\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "January 27, 2015 at 3:51pm", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nHi Chris and thanks,\n\nI'm preparing a proper answer to yours :-)\n\nI believe this is one of the cases where bad inputs lead to bad results (in other words: garbage in garbage out).\n\nThere is no way that you get such high temperatures in this climate conditions. But i'll send this later on.\n\nIn the meantime, i find those graphs very enlightening!! Very cool way of understanding what you are doing (or i'm doing). Though i can't reproduce all of them specially the total heat gain and net flow. Can you send the example where you get them?This will be very helpful for me (and others maybe) and to prepare, and justify my answer.\n\nThanks again,\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "January 27, 2015 at 9:34pm", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nAbraham,\n\nIndeed, \"garbage in garbage out\" might be a good way to describe this case :).  You are correct in that there is no way (or at least very few ways) to get such high air temperatures in your climate's winter.  Believing that this is possible is nothing short of an adiabatic fantasy.\n\nAs for the means by which I created those colored charts: with the outputs that you can request with the \"Generate EP Output\" component, I have tried to make it possible for you to track all terms of the energy balance calculation that E+ is running. If you set the \"zoneGainsAndLosses_\" input of the \"Generate EP Output\" component to True, you will get a number of useful energy values out of the E+ simulation (and displayed on the \"Read EP Result\" component).  This includes solar gains, people gains and infiltration gains+losses.  If you take this output along with the lighting gains, the equipment gains and the heating/cooling that you already usually have coming out of this component, you have almost all of the terms of the energy balance that E+ does.  The only major thing that is missing is the conduction through the envelope but you can look at this if you set \"surfaceEnergyAnalysis\" to True on the \"Generate EP Output\" component and use the \"Read EP Surface Result\" component.  The heat flow through the envelope comes through on a surface-by-surface basis so it can sometimes be difficult to find just the surface that you are interested in if you have a large model.  Since you had only one window in your model, it was easy for me to find.\n\nI should note that the total heat gain chart that I made in the post above is a bit of a hack and is not a perfect representation of all of the heat that is coming into the zone - since it only includes people + equip + lights + solar and not possible infiltration or envelope gains.  It also excludes the heat that can be removed (or accidentally added) by natural ventilation.  To make the chart, all that I did was use the \"SeparateData\" component on those 4 types of gains and used the native grasshopper \"addition\" component to add them together (I think that I also had to use a native Grasshopper \"Flip Matrix\" component to make sure the right parts of the list were added).  The attached GH file shows how I did this.\n\nLet me know if you have any other questions.\n\n-Chris\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1213281", "name": "HB_shoeboxing_CWM_AY_Resid_CWM.gh"}], "created_by_name": "Chris Mackey", "created_at": "January 28, 2015 at 3:47pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nHi Chris and thanks,\n\nA bunch of garbage indeed there.\n\nSince i have plenty of questions, first i want to describe the garbage:\n\n1. The schedules for Heating and Cooling were intended to avoid heating/cooling consumption in those months i identified as winter/summer. I defined -50 oC and100 oC for such months. But it was a mistake. Just after i defined all the temperatures the same for winter/summer i get the desired temperatures.\n\n2. Equipment/Lighting schedules: I was mixing the occupancy/lighting schedules (when they are ON) with the loads themselves.  I suppose i get mislead with one of your previous examples. I think i'm getting right now.\n\nSo this is with regard the garbage (attached the file with the fixes if you don't mind to check).\n\nNow the questions:\n\na. HB_setEPZoneThresholds: I'm defining there Cooling/Heating Det point and Setbacks. I don't see them in the IDF. If i define HeatingCoolingSetpoint schedules in the HB_setEPZoneSchedules these definitions are not written in the IDF?\n\nb. HB_setEPNatVent: Im defining min/max indoor/outdoor temperatures. But i also don't see where in the IDF they are registered.\n\nc. I know you are using DualIdealSystem for the dafault HVAC. There is a way of not calculating cooling for winter months? I'm not defining well this question, but in this example i'm getting cooling loads bigger than heating for winter. Can't be (!!). In the worst case you open windows but don't cool. My faculty building shifts the HVAC from cooling to heating  at determined dates in the year. When not needed you don't switch them on. I hope you understand the meaning of the question and find the logic in it. The way i define Ideal Systems allows me to do that, but i can't find how to do that in HB components.\n\n\n\nHope this makes any sense for you.\n\nThanks for your help.\n\n-A.\n\n\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1214856", "name": "HB_shoeboxing_CWM_AY_Resid_ORG.gh"}], "created_by_name": "Abraham Yezioro", "created_at": "January 31, 2015 at 11:56am", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nHi Abraham,\n\nThanks for the clarification.  To answer the questions:\n\na. If you define the heating/cooling setpoints with custom CSV schedules, you will override anything that you have in the \"Set EP Zone Thresholds\" component.  The thresholds component only works if you are taking the original OpenStudio schedules assigned based on program.  If you take the original OpenStudio setpoint schedules, you should see that the setpoints show up under the schedules section.\n\nb. The max and min nat vent temperatures show up under the ZoneAirflow objects in the IDF (they are not schedules).  \n\nc. You are getting cooling loads bigger in winter than in summer because you are pulling the blinds every time that the outside temperature goes above 18 C (which does not happen in winter).  Looking at the total solar gain will help you understand this.  It is possible to shut off the cooling system with a schedule in the Ideal Air System template that we use.  I have not built in the functionality to do this in HB yet and, since it requires a schedule, it's difficult to do it manually by editing the IDF (I will do this soon).\n\nYou might also want to try adding in an an air side economizer to your ideal air system, which you can do with the new \"Set Ideal Air Loads Parameters\" component.  This will mix in more outside air when it is cool outside in winter.\n\n\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "February 1, 2015 at 4:11am", "created_by": "ChrisMackey", "replies": []}, {"body": "\nThanks Chris,\n\nMore questions here:\n\nAnswer b: i know they are not schedules but the only section i'm getting under ZoneAirflow is the Infiltration. So i suppose i'm missing some other definition in order to enable this ventilation. Attached the file, updated to today's version.\n\nAdded the Economizer, but also it is not making any difference in the IDF. I'm not talking about the results but about the definitions in the IDF file. Again, I'm missing something for sure.\n\n\n\nThanks,\n\n-A.\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1215418", "name": "HB_shoeboxing_CWM_AY_Resid_ORG.gh"}], "created_by_name": "Abraham Yezioro", "created_at": "February 2, 2015 at 12:13am", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nAbraham,\n\nThat is because you are using an older version of the nat vent component.  It is updated in the attached file.\n\nThe economizer boolean is changing the Enconomizer type in the ideal air loads template:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/Rbig4IUy3z9BBix0gssjsAuNMiD7MOQ0ojE3*LdKpBrMp7i3Fhz4hfyj7u8KuB7ALum8ShdxVnW3WdXBIGgp-i1jSUOfo4id/NoEconomizer.PNG\" width=\"496\"/>](http://api.ning.com:80/files/Rbig4IUy3z9BBix0gssjsAuNMiD7MOQ0ojE3*LdKpBrMp7i3Fhz4hfyj7u8KuB7ALum8ShdxVnW3WdXBIGgp-i1jSUOfo4id/NoEconomizer.PNG)\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/Rbig4IUy3z*OC9NnJFqcmYss98EKWFx5Tzm9ybnRdhXeUUaOob-t6owbiAQ3O6Ss1JIWViiZLcXkb-QXT43MrSKo-nj*Kcgi/Economizer.PNG\" width=\"475\"/>](http://api.ning.com:80/files/Rbig4IUy3z*OC9NnJFqcmYss98EKWFx5Tzm9ybnRdhXeUUaOob-t6owbiAQ3O6Ss1JIWViiZLcXkb-QXT43MrSKo-nj*Kcgi/Economizer.PNG)\n\n-Chris\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1215830", "name": "HB_shoeboxing_CWM_AY_Resid_ORG2.gh"}], "created_by_name": "Chris Mackey", "created_at": "February 2, 2015 at 12:42pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nYes, Thanks.\n\nJust realized this before your answer. When i update the version i noticed the date of the component is right. Since it didn't gave any error y assumed the component didn't changed. Now i see that i need to check further ...\n\nThanks again. I think this example file is doing what i wanted (except the cooling/heating consumption in winter/summer, but for now it is not possible).\n\nThanks again,\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "February 2, 2015 at 2:04pm", "created_by": "AbrahamYezioro", "replies": []}]}], "id": "1211054"}