{"body": "\nHello all,\n\n\n\nI wanted to write this note with the next release but it looks like not to be a good idea as we will already have enough notes with the release! Yes Ladybug is now more than two years old and I here is what I have to share:\n\n**Thanks!** Thank you for being awesome! When I released Ladybug two years ago I could never imagine how this project will take over my life! It has been such an invaluable experience for me so far and it wasn’t possible without you - so thank you so much.\n\n \n\n**What’s next?** Recently I get this question more and more and here is my fairly long answer! Chris is pushing the boundaries with comfort tools. Chien Si is working on HVAC systems integration. Chris, Anton and Alejandra will figure out how to effectively get natural ventilation to be modeled. Patrick, Sandeep, Michal and Boris are working on their developments. I’m working on getting 3 Phase method integrated, and Butterfly will be out at some point, but... they are not going to be what makes the next step. The next step is up to you. It is what you will do with the development. So go ahead and let us know what’s next!\n\n \n\n**If you can help someone on the group please do!** Doing so you are not only helping another person (and potentially yourself) but also the developers. The more you can help each other here the more we will have time for development and documentation.\n\n \n\n**Best place to send your questions is this group.** If you are using the latest version from github then you may want to sent it to github. Please consider emails as the last option. Go back to number 3 again! Thanks.\n\n \n\n**Don’t be nice to us!** Well, I mean don’t just be nice to us. I love your nice comments like anybody else and please keep them coming ;) but what we also need next to nice comments is your critiques, wishes and insight. I feel that recently we are getting less wishes and critiques than what it used to be. You can post them here in the group or on github and either way we will know about it. Thank you to all of you who has already done this.\n\n \n\n**Thanks again!** Before I let you go I want to specially thank all of you who contributed to the project by your development, thoughts and support. You are great and I can’t thank you enough.\n\n \n\nDavid Weinberger in his book “Too Big to Know” says: “**When an expert network is functioning as its best, the smartest person in the room is the room itself.**” Reading some of the discussions on the group gives me the feeling of staying inside a smart room. Thank you and **let’s keep the room growing!**\n\n \n\nCheers,\n\nMostapha\n\n \n\nPS: To avoid sending another post, I just post the updates about the two upcoming workshops here:\n\n \n\nI will lead a workshop in LA next Friday (Feb. 6) and there is still few seats left. If you want to learn more about energy and daylighting simulation with Honeybee here is your chance. Here is more information who to register: ([http://www.facadesplus.com/technology-workshops/](http://www.facadesplus.com/technology-workshops/)).\n\n \n\nChris will lead a 3 days intense and comprehensive Ladybug and Honeybee workshop in Mexico City this March. You have probably watched Chris’s tutorials and already know what you can expect from a workshop with Chris so I don’t have to speak for that! I would take this workshop if I was around that area. If you are around Mexico City or know a friend who might be interested please let them know. Here is more information about the workshop: ([https://www.facebook.com/LadyBugforGrasshopper/photos/a.44232096911...](https://www.facebook.com/LadyBugforGrasshopper/photos/a.442320969114095.107084.413910668621792/919318878080966)).\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "January 26, 2015 at 10:00am", "created_by": "MostaphaSadeghipour", "topic": "Few notes to celebrate two years and two weeks of having the 'bug flying around!", "replies": [{"body": "\ncongratulation on the anniversary! very excited about the progress on natural ventilation. they gas is cheaper now but egal. I will do my best to contribute to whats next.\n", "attachments": [], "created_by_name": "Youngjae chung", "created_at": "January 27, 2015 at 11:31pm", "created_by": "YOUNGJAECHUNG", "replies": []}]}