{"body": "\nHello guys!\n\n\n\nFirst of all I want to express my deepest gratitude for all your work. It is not only that you have created amazing functionalities and tools for our research and work. Mostly it is that you went out of your way to properly display how they work and what they can accomplish.\n\n\n\nOn that note, I have to say that I am a beginner, mostly of Rhino than the ideas discussed in the tools.\n\n\n\nI am currently on the Shade Benefit Evaluation and I am having problems when running the final step. I belive that since I am a complete beginner in Rhino the program stalls because of bad geometry (is it possible that the size of items covering the doll is just too much?). When I run the benefit evaluation Rhino and Grasshoper stop responding until they suck out all computer memory and windows shuts them down.\n\n\n\nI am attaching my rhino file here, maybe someone in the group can help a true beginner. The ladybug file is exactly the same as in the video, as I followed Chris to the dot.\n\n\n\nThank you very much in advance!\n\n\n\nKind regards,\n\nTheodore.\n\n\n\n\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1214592", "name": "ShadeBenefitEvaluation.3dm"}], "created_by_name": "Theodoros Galanos", "created_at": "January 30, 2015 at 8:40pm", "created_by": "TheodorosGalanos", "topic": "Beginner's problems", "replies": [{"body": "\nHi Theodore,\n\nThanks for all of the kind words.  I know that you say that you are a beginner but using the shade benefit evaluation method is a pretty advanced (or at least computationally intensive) operation.  In other words, it is very easy to accidentally run your computer into the ground if you are not careful.\n\nI looked at your Rhino file an the geometry is perfectly good.  The reason why your computer is crashing when you input your geometry is that your Rhino document is in millimeters and the grid size that you input to the Shade benefit component is in Rhino document units (in your case also mm).  The Rhino document that I was using in the videos was in meters and, as such, I set the grid size to 0.5 meters, which is a number that gives me a reasonably-sized set of mesh cells in my case.  In your case, however, you were inputting your geometry without changing the grid size, which essentially set the grid size to 0.5 millimeters.  As you can imagine, this is a huge number of test points and grid cells.  Accordingly, it overwhelmed your memory (as it did mine).\n\nAttached you can find a fixed GH file where the grid size has been set to a reasonable value (500 mm instead of 0.5 mm).  I also updated the components to the most recent version on the github.  There is new an option for a much faster solar-adjusted temperature calculation and a number of other features.  These components will be in the stable release that we are doing in the next few days.\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/eX-lQcksX1kmEYfU9hQgafdVp5aLaUDf*JxvEzZsaFLqY2f7fMFnzhPYpcbsjEOUZn3Sb*w-gWpeRWkWALsh3EZ5d*sTwv10/ShadeBenefitWorking.PNG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/eX-lQcksX1kmEYfU9hQgafdVp5aLaUDf*JxvEzZsaFLqY2f7fMFnzhPYpcbsjEOUZn3Sb*w-gWpeRWkWALsh3EZ5d*sTwv10/ShadeBenefitWorking.PNG)\n\nEnjoy!\n\n-Chris\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1214287", "name": "9 - Outdoor Shade Benefit Evaluation_UPDATED.gh"}], "created_by_name": "Chris Mackey", "created_at": "January 30, 2015 at 9:50pm", "created_by": "ChrisMackey", "replies": [{"body": "\nHi Chris!\n\n\n\nThank you for the quick reply! And thanks for solving the problem for me.\n\n\n\nI am quite okay with the concepts that are discussed and used in the tools but I am quite horrible in 3d modelling. I am going through your honeybee videos now, hoping there are a few tips on constructing the actual models :)\n\nI will try the above solution, I'm sure it will work as a charm. The tool is actually really interesting, as are most of the other tools I don't even know about yet.\n\nI'm lucky enough to be involved in a big project that actually gives priority to environmental analyses assessments to inform design (this is very very rare in my experience). That's why I am even luckier to be able to use these open source tools.\n\n\n\nWill be back with much more self-created problems in the future I'm sure!\n\n\n\nKind regards,\n\nTheodore.\n\n\n\n\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "January 30, 2015 at 11:37pm", "created_by": "TheodorosGalanos", "replies": []}]}], "id": "1214593"}