{"body": "\nHi everyone, i have some questions that i dont seem to be able to awnser to:\n\n\nI have set the analysis period equal in both the global horizontal radiation (ghr) and sun path component, from which i extract the sun vector data. The problem is there are a different number of ghr values and sun vectors: for instance for December, 289 global horizontal radiation values (other than 0) and 296 sun vectors. How come this difference? Is it limit situations when the sun has risen but no radiation still acountable?\n\nAnd i also would like to know if the sun vectors are ordered the same way the ghr values are (excluding 0 values). I'm trying to combine the sun vectors to the corresponding ghr value, which will be the amplitude of the vectors. I want to visualize the ghr data with oriented lines towards the center point, whose length will be the ghr of that given hour.<br/>\n\nAnd my last question: by knowing ghr daily, how can i calculate radiation on a non-horizontal surface?\n\n\n\nI've attached the files i'm working on, sorry if they are a bit messy, the parameters i'm talking about are in the green panels.\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1214969", "name": "PRT_Porto.085450_IWEC.epw"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1214970", "name": "solaranglevilar2.gh"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1214971", "name": "ruadovilar.3dm"}], "created_by_name": "Afonso Portela", "created_at": "January 31, 2015 at 9:06pm", "created_by": "AfonsoPortela", "topic": "Matching ghr data with sun vector data, monthly", "replies": [{"body": "\nHi Alfonso,\n\nIt is possible for you to have diffuse radiation coming from the sky after the sun has set and before the sun has risen.  This is why the list of radiation values larger than 0 is longer than the list of sun vectors or sun-up hours.\n\nIf you need a list of radiation values that aligns with the list of sun vectors, plug the radiation form the \"ImporEPW\" component into the \"annualHourlyData\" input of the sunpath.  A list of radation values aligned to the list of sunVectors will come out of the selHourlyData output.  You can use this to make your visualization\n\nThere are a few ways to understand radiation on a non-horizontal surface.  You can do a radiation study, use the radiation rose, or use the cala Lily.  All have tutorials here:\n\n[https://www.youtube.com/playlist?list=PLkjfDmSc5OrzBgdPWQB7rbqFycWp...](https://www.youtube.com/playlist?list=PLkjfDmSc5OrzBgdPWQB7rbqFycWpbxtaN)\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "February 1, 2015 at 6:32am", "created_by": "ChrisMackey", "replies": [{"body": "\nthank you very much for the reply chris!\n", "attachments": [], "created_by_name": "Afonso Portela", "created_at": "February 1, 2015 at 9:37am", "created_by": "AfonsoPortela", "replies": []}]}]}