{"body": "\nHi all , \n\nI'm working on my master's Thesis about \" the concept of breathing building to cope with climate change \" . I'm using responsive kinetic facade which moving according to changing in weather and the  needs of users inside the building .\n\nthe main goal is to achieve thermal comfort &amp; internal air quality by natural ventilation through the interactive facade .\n\nso I need to know how to optimize the movement of the facade ? \n\nwhat plug in can I use to get thermal simulation &amp; air movement through building zones? \n\nis there certain steps should I know to achieve my goal ? as I'm new in grasshopper just know basics only :) \n\nThank you \n", "attachments": [], "created_by_name": "mona rezk", "created_at": "February 2, 2015 at 2:17pm", "created_by": "monarezk", "topic": "energy simulation of a breathing building", "replies": [{"body": "\nHi Mona,\n\n\n\nIt depends how you want to simulate the airflow and what is the question of your thesis.\n\n\n\nFor thermal simulation you can use Honeybee and it will support what you need. Chris recently developed new components that lets you run studies for airflow changes for simple cases integrated to Energy Simulation but it is limited to what you can do with EnergyPlus (e.g. it is not CFD).\n\n\n\nIf you want to model airflow between zones with EnergyPlus then you probably want to set up an Airflow Network which we don't support right now. I don't know if there is any other plugin to do that but I'm sure other people on the group can help you with that.\n\n\n\nMostapha\n\n\n\nPS: I intentionally didn't use the word natural ventilation, but you can read airflow changes as natural ventilation!\n\n\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "February 2, 2015 at 11:52pm", "created_by": "MostaphaSadeghipour", "replies": [{"body": "\nThank you Mostapha for your reply ,\n\nI will start using honey bee &amp; ladybug for thermal simulation &amp; for Airflow I will need to model airflow between zones as you mentioned but with another software may be ansys fluent . but first I will see the results of honey bee airflow component by Chris.\n\n \n", "attachments": [], "created_by_name": "mona rezk", "created_at": "February 3, 2015 at 3:26pm", "created_by": "monarezk", "replies": []}]}, {"body": "\nThere are people here who could probably answer your question better, but the \"air movement\" element would be accomplished through Fluid Dynamics (CFD). I'm not sure Honeybee + Ladybug have that capbility yet (I've seen talk about it being WIP though). Real CFD work can be extremely sophisticated. I've worked with consultants who specialize in it, but have never really engaged it in the Grasshopper realm.\n\nIn regards to weather responsive stuff, Lady bug has lots of tools for interacting with local weather data through your local .epw file. That could be combined with some of the radiation tools for building massing.\n\n\n\nSounds like an interesting project. I'd love to see what kind criteria is developed in order to get meaningful kenetic facade behavior. \n", "attachments": [], "created_by_name": "will krzymowski", "created_at": "February 3, 2015 at 12:18am", "created_by": "willkrzymowski", "replies": [{"body": "\nMona,\n\nI think that this discussion already answers a lot of your questions:\n\n[http://www.grasshopper3d.com/group/ladybug/forum/topics/thoughts-on...](http://www.grasshopper3d.com/group/ladybug/forum/topics/thoughts-on-bouancy-driven-natural-ventilation?commentId=2985220%3AComment%3A1207131&amp;xg_source=msg_com_gr_forum)\n\nLet me know if there is anything in there that is missing.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "February 3, 2015 at 3:27pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nthanks Chris , there are so much data about ventilation in that discussion very useful to my research .   \n", "attachments": [], "created_by_name": "mona rezk", "created_at": "February 6, 2015 at 6:13am", "created_by": "monarezk", "replies": []}, {"body": "\nThank you Will , \n\nI found some grasshopper plugins for Cfd like Golden fish &amp; there's a script that linking ansys with grasshopper , but there's a problem with links &amp; the developers didn't reply for the discussion comments . \n\nso I decided to save time and efforts and use ansys fluent for the airflow study and I will see the results and will upload the whole study for you :)  \n", "attachments": [], "created_by_name": "mona rezk", "created_at": "February 3, 2015 at 3:34pm", "created_by": "monarezk", "replies": []}]}]}