{"body": "\nThis is a discussion continuing from comments to the GH group page:\n\nHi Chris.\n\nThanks for your response, i used the attached gh file that you sent me and im trying to run the simulation but im getting the same \"no ventilation will be assigned\" result \n\n[<img class=\"align-center\" src=\"http://api.ning.com/files/N3a4E7n0BnekN7XuSGscQHErGWtHjqFIp1LPlL5P7aBbsLCCg6ynatkv*UHdbQeLb19rcc03M*IpdhyYi72BEiN5jhnMJNJe/Captura.JPG?width=750\" width=\"750\"/>](http://api.ning.com/files/N3a4E7n0BnekN7XuSGscQHErGWtHjqFIp1LPlL5P7aBbsLCCg6ynatkv*UHdbQeLb19rcc03M*IpdhyYi72BEiN5jhnMJNJe/Captura.JPG)\n\n\n\nam i using the component the wrong way ? \n\nthanks.\n\nCésar\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1215592", "name": "clim_CWM.gh"}], "created_by_name": "Chris Mackey", "created_at": "February 2, 2015 at 11:42am", "created_by": "ChrisMackey", "topic": "Natural Ventilation Questions", "replies": [{"body": "\nCesar,\n\nYou are right about the readMe.  There was a bug in the code for writing the readMe.  The ventilation objects were still assigned correctly and were being run through E+.\n\nI just fixed the bug  and you can see a correct readMe in the attached file.\n\n-Chris\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1215598", "name": "clim_CWM.gh"}], "created_by_name": "Chris Mackey", "created_at": "February 2, 2015 at 11:56am", "created_by": "ChrisMackey", "replies": []}, {"body": "\nChris, \n\nim having very small changes in the zone temperature using all the glazeArea operable and the operable height (value set to 1) ill send you an attached GH file with the configuration im using.\n\nim some cases im just getting a difference of .30 degrees in the zone\n\n\n\n[<img class=\"align-center\" src=\"http://api.ning.com:80/files/Rbig4IUy3z8zh5C2zNH9Pe23lu5lo7g8WdL*hUp3060I7fjlJbSl1co3oKiavqknviqtOHAqZxYcc84t7L3IvHfBNh-9--Dl/Untitled1.jpg?width=721\" width=\"721\"/>](http://api.ning.com:80/files/Rbig4IUy3z8zh5C2zNH9Pe23lu5lo7g8WdL*hUp3060I7fjlJbSl1co3oKiavqknviqtOHAqZxYcc84t7L3IvHfBNh-9--Dl/Untitled1.jpg)\n\nthanks for your time !!\n\nCésar\n\n\n\n\n\n\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1216020", "name": "A climatico gcom.3dm"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1216021", "name": "clim_CWM cesar.gh"}], "created_by_name": "Cesar Diaz", "created_at": "February 2, 2015 at 2:28pm", "created_by": "CesarDiaz", "replies": [{"body": "\nCesar,\n\nMy guess is that you have chosen a day in your weather file that does not have good wind.  Maybe you should look at the differences over a longer period.\n\nAlso, your window area is still relatively small in comparison to the size of your whole building and this might be another reason why the flow is not so good.  You may want to try fan-forced natural ventilation (change the ventilation type to 3).  This will help you understand what flow rates you will need to get the temperatures that you want.  With fan driven ventilation, I image that you will get much better air flow.\n\nLastly, you should keep in mind that you are using a radiative temperature map to compare between cases when natural ventilation will probably change the air temperature much more than it changes the radiant temperature.  Even though it's one zone, I would use the color zone based on EP result for visual comparison (coloring the zone with the air temperature).\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "February 2, 2015 at 4:14pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nCesar,\n\nA new way to generate air temperature maps alongside radiant temperature maps is now available.  My guess is that you will see the air change temperature a lot more than the radiant environment.\n\nSee an example file here:\n\n[https://www.dropbox.com/s/rpty2ff9992ko5n/Indoor%20Temperature%20Ma...](https://www.dropbox.com/s/rpty2ff9992ko5n/Indoor%20Temperature%20Map19.gh?dl=0)\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "February 5, 2015 at 6:03pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nHi Chris, Cesar,\n\n\n\nI was wondering how I could model a zone with ideal air load parameters for heating during winter and natural ventilation during summer. Should I set my coolingcapacity to 0 and the connect my zones to the natural ventilation component? \n\n\n\nHave you tried something similar? Also do the nat ventilation component allow to apply to interconnected zones? or is for a simple zone only?\n\n\n\nThanks! \n\nTasos\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1228243", "name": "Screen Shot 2015-02-20 at 15.58.10.png"}], "created_by_name": "Anastasios Kokkos", "created_at": "February 20, 2015 at 8:00am", "created_by": "AnastasiosKokkos", "replies": []}, {"body": "\nTasos,\n\nTo get rid of cooling form the ideal air system, you can either set cooling capacity to zero or the cooling setpoint to a very high number.  You can also use the latter to model mixed-mode building by setting the cooling setpoint to the same value as the maxIndoorTempForNatVent.\n\n\n\nFor an explanation of how air walls and natural ventilation work together in the current version, see the latest release notes:\n\n[http://www.grasshopper3d.com/group/ladybug/forum/topics/new-release...](http://www.grasshopper3d.com/group/ladybug/forum/topics/new-release-ladybug-0-0-59-and-honeybee-0-0-56)\n\nSpecifically, here:\n\n**Air Walls** - Honeybee EnergyPlus models now officially support air walls (or virtual partitions) in a basic implementation.  Now, any time that you use the air wall construction or set a surface type to “air wall,” the air between adjacent zones will be automatically mixed.  At present, this mixing is just a constant flow based on the surface area between zones connected by air walls multiplied by an adjustable “flow factor.”  It is important to stress that this basic air mixing is not with the EnergyPlus Airflow Network, although the groundwork laid in this release will eventually allow for the implementation of the  Airflow Network in future releases.  As such, this present air mixing is only suitable for multi-zone conditions where there is not significant buoyancy-driven flow between zones.\n\n**Natural Ventilation** - To go along with the new potential introduced by air walls, there has been a basic implementation of EnergyPlus’s natural ventilation objects in a new component called “Set EP Airflow”.  The current setup allows for three possible types of natural ventilation: 1) natural ventilation through windows (with auto-calculated flow based on window area, outdoor wind speed/direction, and stack effects), 2) custom wind and stack objects that can be used to model things such as chimneys off of **single zones**, and 3) constant, fan-driven natural ventilation.\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "February 20, 2015 at 8:14pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nHi Chris,\n\n\n\nThank you for your answer! Indeed setting up the cooling capacity to zero did work. I was also wondering if the wind direction could somehow take into account surrounding obstructions that influence the intensity and distribution of the wind - as happens in an urban environment with adjacent buildings etc! I guess this is also more on the CFD side right? \n\n\n\nThank!\n\nTasos\n\n\n\n\n", "attachments": [], "created_by_name": "Anastasios Kokkos", "created_at": "February 22, 2015 at 2:34pm", "created_by": "AnastasiosKokkos", "replies": []}, {"body": "\nHi Chris and Cesar,\n\n\n\nI am not entirely sure how mean radiant temperature is calculated in EnergyPlus but I am pretty sure that to take full advantage of natural ventilation in a building, weather speed might not be the most important factor. For example, there might be a strong wind but the pressure difference in the orientations of the wind direction won't allow the space to take full use of it.\n\nIdeally you would need to run a cfd and get the numbers for such data.\n\n\n\nI wonder though, would honeybee/energyplus allow any cfd-generated schedules to actually influence the results?\n\n\n\nKind regards,\n\nTheodore.\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "February 21, 2015 at 12:08am", "created_by": "TheodorosGalanos", "replies": []}, {"body": "\nTheodore and Ceasar,\n\nA couple of notes about how surface/radiant temperature is calculated in EnergyPlus as well as the current natural ventilation implementation:\n\n1) The surface temperatures result from the balance of heat going into the surface, the amount of heat leaving the surface, and the amount of heat stored in the construction's mass.  Usually, about half of the internal heat gain from people, equipment and lights gets radiated to the surfaces of the room and the other half goes into warming the air.  Almost all incoming beam solar radiation goes into the floor surface and diffuse solar radiation is distributed by view factor to the other surfaces of the zone.  Usually, heat leaves the surface by either conducting all of the way through the envelope to the outside or transferring its heat to the air of the zone.  When you use natural ventilation (or an ideal air cooling system for that matter) the zone is cooled by removing heat from the air and not the surfaces.  So the surfaces are only cooled down after the air has become cool and this is why you will see natural ventilation having a larger on the air temperature than the radiant temperature.\n\n2) The current implementation of natural ventilation takes into account the direction of the wind from the weather file.  Essentially, EnergyPlus looks at the difference between the direction the window is facing and the direction of wind in order to derive a wind pressure coefficient that is used to help determine the flow rate through the window.  Theodore, while you are right to point out that a CFD simulation is the most accurate way to understand airflow, the simulations often take days to compute on high-end machines and so it isn't realistic that we will be able to calculate it dynamically for every hour of the year for the foreseeable future (at least until quantum computers are on the market. Or maybe photonic computers might get us most of the way there).  There are plans in the works (when we finally get butterfly up and integrated) to use point-in-time CFD simulations to help compute more accurate wind pressure coefficients for our EnergyPlus runs.  However, for the next couple of decades, I think we are looking at all dynamic simulations of building energy using a simplification of airflow parameters, which can be better informed by CFD as our computing power improves.\n\n\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "February 21, 2015 at 4:53pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nHey Chris,\n\n\n\nThanks for the answer. I wasn't sure how E+ simulates it. It sounds pretty good actually. And yes, I totally agree with you that CFD, at least on this level, is quite out of scope and probably reach. Although things get much faster in our beowulf cluster (Can I use that for my LB+HB? :) )\n\n\n\nI am mostly using it for urban planning on a larger level, where the model can be much more simplified or for smaller scales (e.g. rooms) with very specific design parameters, and of course short periods of time.\n\n\n\nI am waiting eagerly on the arrival of butterfly, CFD is probably what I'd like to see next in this suite.\n\n\n\nHave a nice day,\n\nTheodore.\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "February 21, 2015 at 11:21pm", "created_by": "TheodorosGalanos", "replies": []}]}]}