{"body": "\n**Release Notes - February 3rd 2015**\n\n**Ladybug 0.0.59 and Honeybee 0.0.56:**\n\n \n\nWe are all pleased to announce public release of Ladybug 0.0.59 and Honeybee 0.0.56. and you can download it from [Food4Rhino](http://www.food4rhino.com/project/ladybug-honeybee?ufh). Here are major changes and enhancements.\n\n\n\n**HONEYBEE**\n\n**More Flexible Workflow** - Many small modifications were made to support a more flexible workflow, such as the ability to separate a zone created with masses2Zones into editable HBSrfs that can be recombined.  For the energy components, it is now possible to plug custom constructions directly into the components that set the zone constructions without writing them first into the library.  For the daylighting components it is now possible to change all of the materials of specific surface types at once.\n\n**Support for Complex Geometry** - Many small bugs for complex geometry have been fixed including the ability to import energy results correctly for curved NURBS surfaces as well as unconventional window configurations.  Also, the intersectMasses component now almost always succeeds in splitting all of the surfaces of adjacent zones, no matter how complex the intersection is.\n\n**Automatic Download Issues Fixed** - Many users who faced issues with not having “gendaymtx.exe” or who had trouble syncing with our github know that we faced an issue with automatic background downloads.\n\n**Air Walls** - Honeybee EnergyPlus models now officially support air walls (or virtual partitions) in a basic implementation.  Now, any time that you use the air wall construction or set a surface type to “air wall,” the air between adjacent zones will be automatically mixed.  At present, this mixing is just a constant flow based on the surface area between zones connected by air walls multiplied by an adjustable “flow factor.”  It is important to stress that this basic air mixing is not with the EnergyPlus Airflow Network, although the groundwork laid in this release will eventually allow for the implementation of the  Airflow Network in future releases.  As such, this present air mixing is only suitable for multi-zone conditions where there is not significant buoyancy-driven flow between zones.\n\n**Natural Ventilation** - To go along with the new potential introduced by air walls, there has been a basic implementation of EnergyPlus’s natural ventilation objects in a new component called “Set EP Airflow”.  The current setup allows for three possible types of natural ventilation: 1) natural ventilation through windows (with auto-calculated flow based on window area, outdoor wind speed/direction, and stack effects), 2) custom wind and stack objects that can be used to model things such as chimneys off of **single zones**, and 3) constant, fan-driven natural ventilation.\n\n**Additional Thermal Mass** - The capability to add additional thermal mass to zones has been added.  This is useful for factoring in the mass of indoor furniture or heavy interior objects such as chimneys.\n\n**New Utility Components** - Abraham has added a couple of useful components to help calculate lighting loads based on bulb types and target lighting levels as well as a converter from ACH to the m3/s-m2 that the other HB components accept.  Along this vein, there is also a component for adding in the resistance of Air Films to HB constructions.\n\n**Improved and Editable Ideal Air Loads System** - The EnergyPlus Ideal Air System now goes through an automatic sizing period at the start of the simulation based on the extreme weeks of the weather file.  Furthermore, the ability to adjust many of the parameters of the ideal air loads system have been added with a new “Set Ideal Air Loads Parameters” component.  The component allows you to add in heat recovery, air side economizers and demand-controlled ventilation.\n\n**OpenStudio Export Update** - The OpenStudio workflow is still largely under development but this release includes a version with a working VAV and PTHP system template for those curious with experimenting.  Note that not all of the new features available for the basic “Run Energy Simulation” component are available for the OpenStudio component (such as air walls, natural ventilation, or additional thermal mass).\n\n**Microclimate/Indoor Comfort Maps** - Blossoming from initial experiments with the radiant temperature map, a workflow for looking into sub-zone microclimate and indoor comfort has been initiated.  All components for this are presently under the Honeybee WIP tab but, over the next month, they will be completing their development phase and moving into the rest of the tabs.  If you are interested in testing when they are ready, please let Chris know.  For a teaser video of the intended capabilities, see this video: ([https://www.youtube.com/watch?v=fNylb42FPIc&amp;list=UUc6HWbF4UtdKd...](https://www.youtube.com/watch?v=fNylb42FPIc&amp;list=UUc6HWbF4UtdKdjbZ2tvwiCQ))\n\n \n\n**LADYBUG**\n\n**Monthly Bar Chart** - After much demand from multiple parties, a new component to create monthly bar and line charts has been added.  The component is particularly useful for plotting the outputs of the “Average Data” component like monthly EPW data or averaged monthly-per hour data.  It also supports daily data and any type of Energy simulation results.\n\n**Wind Profile** - To go along with the new capabilities of natural ventilation in Honeybee, Ladybug now has a fully fleshed-out Wind Profile component that allows you to visualize how wind speed changes with height in relation to your building geometry.  The component is geared to understanding the conditions of prevailing wind and will be useful in the future for setting up CFD models.  Credit goes to Djordje Spasic for adding in all of the new capabilities. In a similar vein, the appearance of the wind rose has also been improved thanks to suggestions from Alejandra Menchaca.\n\n**Faster Solar Adjusted Temperature** - Thanks to the SolarCal method from the Center for the Built Environment at UC Berkeley ([http://escholarship.org/uc/item/89m1h2dg](http://escholarship.org/uc/item/89m1h2dg)), the solar adjusted temperature component now includes an option for a much faster calculation that produces results that are very close to those originally obtained with the genCumSky component.  Instead of using the cumulative sky, the component can now accept the direct and diffuse radiation from the ImportEPW component.  Over a whole year, this essentially takes a calculation that used to be a half-hour and shrinks it down to 10 seconds.  Thanks again to those at UC Berkeley for keeping their work open source!\n\n \n\n\n\n**We also want to welcome Anton, Patrick and Sandeep to the team**. Anton has kicked off his development by working on a component to import and visualize epw ground temperature data and he will be continuing to develop components to bring in reliable precipitation data to Ladybug.  With this basis, he will continue to implement Honeybee components for ground heat storage, earth tubes, rain collection and hot water systems. Patrick and Sandeep are working on integration of Honeybee to [Energy Performance Calculator](http://zeroenergygreen.com/2014/06/12/urban-epc/).\n\n \n\nAs always let us know your comments and suggestions.\n\n<br/>Enjoy!\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "February 3, 2015 at 7:55pm", "created_by": "MostaphaSadeghipour", "topic": "NEW RELEASE > Ladybug 0.0.59 and Honeybee 0.0.56!", "replies": [{"body": "\nThank you guys for the great work you are doing!\n", "attachments": [], "created_by_name": "Francesco Bedeschi", "created_at": "February 4, 2015 at 1:57am", "created_by": "FrancescoBedeschi", "replies": []}, {"body": "\nHi Mostapha!\n\n\n\nGreat job, and thanks for the amazing new tools for Indoor Comfort!\n\n\n\nI just wanted to mention a small thing. Some components give an error warning when dropped into the canvas, that asks for a new version of Ladybug, even though it is updated. Deleting and re-inserting ladybug, then re-inserting the components seems to solve the issue.\n\nSmall nuance, just a heads up.\n\n\n\nCheers,\n\nTheodore.\n\n\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "February 4, 2015 at 3:49am", "created_by": "TheodorosGalanos", "replies": [{"body": "\nThank you both!\n\nTheodoros, that is the expected behavior. It is happening because you probably have another file with an older version of Ladybug or Honeybee open which overwrites the newer version. Anytime that you see this warning, you can disable/enable ladybug_ladybug and honeybee_honeybee components. This will overwrite the older version. Now if you try again the components will run fine.\n\n\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "February 4, 2015 at 4:47am", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nThose are wonderful news!!\n\nThank you Mostapha and thank you Chris for such enormous contribution to this community.\n\n\n\nA small suggestion: Keep this discussion in the main area of the All Discussions. This is a resource that you want to keep handy.\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "February 4, 2015 at 6:32am", "created_by": "AbrahamYezioro", "replies": []}]}, {"body": "\nHi all,\n\n\n\nChris, Mostapha, team, thank you for the great work so far! I would be keen on trying any beta release of the integration of HB to EPC. I think it will add a great value to the plug-in and will bring its functionality to a whole new level! Any indication on when this might be due to release? Also a similar integration of a Passive House standard calculations sheet would be very handy! I am attaching a PHPP Demo calculation sheet that is provided for free from the PassiveHouse institute in Germany ([www.passiv.de](http://www.passiv.de)). Is only for indicative purposes, just to get an idea! \n\n\n\nLooking forward! \n\n\n\nTasos\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1230682", "name": "PHPP2007_English_Demo.xls"}], "created_by_name": "Anastasios Kokkos", "created_at": "February 24, 2015 at 8:04am", "created_by": "AnastasiosKokkos", "replies": [{"body": "\nHi Tastos,\n\nSorry for the very late reply. The component is already released. You can find it under 12|WIP tab. I think it should be very similar to develop a component for passivehaus analysis. What do we exactly need. The area of surfaces by type?\n\nIn any case I think it's a good topic to be added to github as a wish.\n\nThanks,\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "July 18, 2015 at 9:13am", "created_by": "MostaphaSadeghipour", "replies": []}]}, {"body": "\nGreat work and I am glad to  have update working back again! :)\n", "attachments": [], "created_by_name": "Michal Dengusiak", "created_at": "February 27, 2015 at 1:38pm", "created_by": "MichalDengusiak", "replies": []}, {"body": "\nCongratulations Mostapha Chris and all involved. Amazing work that will leave a lasting legacy.\n", "attachments": [], "created_by_name": "Robert Narracci", "created_at": "February 27, 2015 at 3:18pm", "created_by": "RobertNarracci", "replies": []}, {"body": "\nAmazing, thank you guys for all the hard work!\n", "attachments": [], "created_by_name": "Reinier Zeldenrust", "created_at": "March 9, 2015 at 11:32am", "created_by": "ReinierZeldenrust", "replies": []}, {"body": "\nHi Mostapha： Nearly I wan't to make analysis of indoor view.But I don't know how to use the plugin 'Ladybug_View Analysis',can you give me a simple example.thanks\n", "attachments": [], "created_by_name": "Bill Chow", "created_at": "July 16, 2015 at 11:30pm", "created_by": "BillChow", "replies": [{"body": "\nHi Bill,\n\nView analysis is originally designed for outdoor views and not indoor. You can still remove the windows and get it to work. You can find examples if you search the forum but I would suggest you to use David's more recent development. It's more sophisticated than Ladybug's component ([http://www.grasshopper3d.com/photo/field-of-view-component?context=...](http://www.grasshopper3d.com/photo/field-of-view-component?context=latest)).\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "July 18, 2015 at 9:10am", "created_by": "MostaphaSadeghipour", "replies": []}]}, {"body": "\nHi Mostapha,\n\nAnnual Daylight simulations take hours to be done, I am working with Rhino 5 64-bit and trace_dc.exe is 32-bit, is there a way the plunging can be installed in 64-bit to be able to use all my CPU's for the simulations? Any other way you recommend to work around thins will be great too.\n\n\n\nThanks!\n\nBlanca\n", "attachments": [], "created_by_name": "Blanca Dasi Espuig", "created_at": "July 23, 2015 at 6:50am", "created_by": "BlancaDasiEspuig", "replies": []}]}