{"body": "\nHello guys,\n\n\n\nFirst of all congrats on the new version, I am really excited to test the new indoor comfort tools\n\n\n\nHowever, this time I'd like to do it on an actual project. I am trying to design an office tower and split the mass into zones. I keep getting the following message:\n\n\n\n\"Failed to generate the perimeter zones for one floor as the floor's geometry is not accomodated by the script. the floor will be returned as a single zone.\"\n\n\n\nNow, I understand this is a bit of a funky shape, so I tried the same design without any curved surfaces. Still the same error. I seem to remember more difficult spaces in Chris's example to be used with no issues. Is there a way around this?\n\n\n\nI am attaching the definition.\n\n\n\nThanks in advance!\n\n\n\nKind regards,\n\nTheodore.\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1216864", "name": "OfficeTower.gh"}], "created_by_name": "Theodoros Galanos", "created_at": "February 3, 2015 at 11:15pm", "created_by": "TheodorosGalanos", "topic": "Splitting Masses into Zones", "replies": [{"body": "\nHi Theodore,\n\nGlad to hear that you are interested in testing the new comfort tools.  I am just wrapping up the development phase now (I literally just have two features left to add and then it's all good for testing). I can post an example file here once I get it there (it should be today or tomorrow).\n\nAfter struggling with the splitBuildingMasses component for over a month, I realized that it is impossible to write something that is always going to work, especially when Rhino is a surface-based 3D modeler and not a volume or solid-based modeler (I discovered bugs in Rhino during the process of trying to make that component).  This discussion explains this a bit more about the difficulty:\n\n[http://www.grasshopper3d.com/group/ladybug/forum/topics/honeybee-ho...](http://www.grasshopper3d.com/group/ladybug/forum/topics/honeybee-honeybee-intersect-masses-is-removing-the-centroid-of-my?commentId=2985220%3AComment%3A1159978&amp;groupId=2985220%3AGroup%3A658987)\n\nThe splitBuildingMasses component is just meant to help you get your building divided as best as a script can but it's not always going to work and you will always need to take it the rest of the way if your geometry is complex.  And, in the video on splitBuildingMasses, I show you a complex geometry that fails to generate all zones but gives you enough for you to fill in the rest:\n\n[https://www.youtube.com/watch?v=DClON71RuuA&amp;index=11&amp;list=P...](https://www.youtube.com/watch?v=DClON71RuuA&amp;index=11&amp;list=PLruLh1AdY-SgW4uDtNSMLeiUmA8YXEHT_)\n\nI hope that clarifies everything,\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "February 5, 2015 at 8:37am", "created_by": "ChrisMackey", "replies": []}, {"body": "", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "February 5, 2015 at 8:50am", "created_by": "TheodorosGalanos", "replies": [{"body": "\nHi Theodore,\n\nI figured out why your simple geometry is not working.  I noticed that, if I dropped the perimeter depth down to 1, it works and I also realized that the parts of your building jutting out in plan are about 1 meter.  So setting the perimeter depth to a large number like 8 meters causes the offset zones to intersect themselves at these corners where the building just out.  The script does not know how to deal with this case so it just returns the building split by floor.  So, in short, the component is really only good for cases where there is not a lot of crenelation in the wall.\n\nThe comfort map components are ready for beta testing.  You can find an updated example file here:\n\n[https://www.dropbox.com/s/rpty2ff9992ko5n/Indoor%20Temperature%20Ma...](https://www.dropbox.com/s/rpty2ff9992ko5n/Indoor%20Temperature%20Map19.gh?dl=0)\n\nI encourage you to split up your building into many zones and put air walls between them.  If you can, you should also split your surfaces.  This will ensure a higher resolution and a more accurate understanding of the interior micro-climates.\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/hMNECPNor98BtT7i2aYss3vc04c1yEZEUPMlV29qHxBuc*RRJSHSmB0I2hZxtgkvQvxFuD95P7ZAzxWVH1huS6Xe9EJMSM*v/IndoorMicroclimateMap.PNG\" width=\"712\"/>](http://api.ning.com:80/files/hMNECPNor98BtT7i2aYss3vc04c1yEZEUPMlV29qHxBuc*RRJSHSmB0I2hZxtgkvQvxFuD95P7ZAzxWVH1huS6Xe9EJMSM*v/IndoorMicroclimateMap.PNG)\n\n\n\nLet me know if you have any questions.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "February 5, 2015 at 5:20pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nHi Chris,\n\n\n\nThanks for posting the components, I am playing around with them now.\n\n\n\nI have sucessfully run a simulation with large areas of my building solely mechanically ventilated.\n\n\n\nI am trying to run the adaptive comfort models but my computer freezes every time I try to create the mesh. Now, I understand it is my model, it is quite a large building. Is there an option I can choose to make it run faster? I suppose a larger grid size would help. The problem is that computer starts freezing even when I bring the mesh view factor component on the canvas (with nothing selected).\n\n\n\nI'll keep you posted when I actually manage to run the comfort tools. Thanks!\n\n\n\nKind regards,\n\nTheodore.\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "February 5, 2015 at 11:57pm", "created_by": "TheodorosGalanos", "replies": []}, {"body": "\nHi Theodore,\n\nGlad to hear that you are trying out the tools.  It would be good to know more specifics about when the view factor component is causing your GH to freeze.  The component generates a preview of the mesh that it is going to calculate view factors for before you set runIt to true (since actually calculating the view factors is a computationally-intensive process that took 15 seconds to run in parallel for that small test box above - more like a minute for non-parallel).  Are you saying that the component is causing your GH to freeze even before you have plugged HBZones into it?  If that is true, I am pretty stumped as to what the issue is.  Otherwise, I would set a very large gridsize before you plug in your HBZones.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "February 6, 2015 at 7:25am", "created_by": "ChrisMackey", "replies": []}]}], "id": "1216865"}