{"body": "\nGood Morning Chris and Mostapha,\n\n\n\nI follow exactly your video No:18 for constructing custom materials and EP Constructions, and the EP construction doesn t seem to accept the custom material.\n\n\n\nI get the error:\n\n**\"1. layer_1 is not a valid material name/definition.**<br/>**Create the material first and try again.\"**\n\n\n\nAny suggestions?\n\n\n\nThanks a lot!\n\nDimitris\n\n\n\n\n\n\n\n\n\n\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1217831", "name": "EP_Custom_Material.gh"}], "created_by_name": "Dimitrios Papadopoulos", "created_at": "February 5, 2015 at 9:05am", "created_by": "doompop", "topic": "Custom EP Construction not accepting Custom EP Material", "replies": [{"body": "\nHi Dimitri,\n\n\n\nI have the same issue. If I delete the first layer \"layer_1\" then the error disappears but there is no EP Construction created! \n\n\n\nAny ideas? \n\n\n\nThanks\n\nTasos\n", "attachments": [], "created_by_name": "Anastasios Kokkos", "created_at": "February 5, 2015 at 9:11am", "created_by": "AnastasiosKokkos", "replies": [{"body": "\nHi Anastasios,\n\n\n\nNot sure but I bet Chris and Mostapha will have a fix at no time!\n\nDimitris\n\n\n\n\n", "attachments": [], "created_by_name": "Dimitrios Papadopoulos", "created_at": "February 5, 2015 at 10:31am", "created_by": "doompop", "replies": []}]}, {"body": "\nI just fixed this last night. If you update the components it should work fine now. Let me know if still doesn't.\n\n-Mostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "February 5, 2015 at 11:02am", "created_by": "MostaphaSadeghipour", "replies": [{"body": "\nFixed!\n\nThanks a lot!\n\n\n", "attachments": [], "created_by_name": "Dimitrios Papadopoulos", "created_at": "February 5, 2015 at 1:57pm", "created_by": "doompop", "replies": []}, {"body": "\nNice!  Thanks Mostapha!  I should have clarified in the release notes that you can plug a custom construction string into any component that assigns it to a HBZone or HBSrf.  That's great that we can do it with custom EP materials and constructions now.\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "February 5, 2015 at 5:41pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nIndeed fixed! Thanks and thank you for your amazing work so far! I think it would be interesting if we could also produce at the end a bill of materials including costs and factors like Embodied Energy and Carbon, Shadow costs and reports on Environmental Product Declaration formats. I wrote a plug in myself for my thesis but was focused only on steel constructions, assessing financial and environmental performance of Steel structures and producing EPDs for the whole building. I would find it very interesting to see something relevant implemented in Honeybee!\n\n\n\n\n", "attachments": [], "created_by_name": "Anastasios Kokkos", "created_at": "February 5, 2015 at 5:51pm", "created_by": "AnastasiosKokkos", "replies": []}, {"body": "\nHi Anastasios,\n\nThis is a very interesting topic and I want to hear more about your thoughts. EnergyPlus generates a number of outputs related to this topic but I never understood how they really do it not knowing about the source of materials and processes. Do you want to start a new discussion and provide more details about what are you exactly looking for and which libraries did you used for your study?\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "February 7, 2015 at 8:39pm", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nHi Mostapha,\n\n\n\nFirst of all thank you and Chris for your awesome work. Is incredibly helpful. I will start a new discussion and will upload a short move of my plug-in for Grasshopper. Unfortunately is not of use to upload all of the work since is connected with some local databases that apparently will not work properly in every machine (or at least I didn't figure out how to do it).\n\n\n\nAs a short intro:\n\n\n\nWhat I used there is a data set including life cycle data for light -medium and heavy structural steel. The life cycle data are divided according to Environmental Product Declaration scheme (NEN 15804:2012) and reflect the energy used during the different life cycle stages of the product including the potential benefits for recycling/reuse. This kind of data exist for all different kind of material and the advantage of the EPDs is that you can accumulate data from different material/components for each phase and produce a final EPD for your structure (for example for reinforced steel you have EPD for cement and EPD for reinforced steel so you need the volumed of these 2 materials and then you add the EPD results and you have the final EPD for reinforced concrete e.t.c). \n\n\n\nThis is one way to go which is formal and widely used. Part from that as a simpler solution a component calculating Embodied energy and Carbon for each material used in the model would also be great! (I will provide the component for this in the new discussion) \n\n\n\nIn any case, I would be happy to help build something in this direction for Honeybee + Ladybug!\n\n\n\nBest,\n\nTasos\n", "attachments": [], "created_by_name": "Anastasios Kokkos", "created_at": "February 9, 2015 at 4:02am", "created_by": "AnastasiosKokkos", "replies": []}, {"body": "\nThat discussion is extremely interesting.\n\nWould be interesting to see if we can have a comprehensive GH algorithm that takes into consideration source of materials, processes in combination with the EPD, Embodied Energy and Carbon.\n\nLooking forward for those components!\n\nDimitris\n\n\n", "attachments": [], "created_by_name": "Dimitrios Papadopoulos", "created_at": "February 9, 2015 at 8:24am", "created_by": "doompop", "replies": []}, {"body": "\nIndeed it is interesting. For a couple of month ago I searched for something similar. I found these two examples. One of them you can download from food4rhino. It uses a German database that should be quite good if you are working in that area.:\n\n[https://www.youtube.com/watch?v=hVXCc3bSAxc](https://www.youtube.com/watch?v=hVXCc3bSAxc)\n\n[http://www.food4rhino.com/project/tortuga?etx](http://www.food4rhino.com/project/tortuga?etx)\n", "attachments": [], "created_by_name": "daniel nielsen", "created_at": "February 9, 2015 at 2:26pm", "created_by": "arkdanielnielsen", "replies": []}, {"body": "\nInteresting indeed! I'm also looking forward to your discussion. I have couple of questions but I leave them for the new discussion.\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "February 9, 2015 at 8:14pm", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nHi everyone,\n\n\n\nI have some experience in LCA and Carbon footprint analyses. I would love to help in this project. The program daniel reports uses the Otobak database, which is a german free database of building materials. In essence, it is an xml collection of EPD data.\n\n\n\nIt might be a bit outdated. As a personal project I started collecting EPDs of building materials in order for me to be able to quickly assess the environmental impacts of my desings. EPDs report 6 (if I'm not mistaken) LCA environmental indices along with energy metrics. \n\n\n\nMy goal is to extract this information into perhaps a database that could be used for fast calculations. However, since I can't code to save my life I was planning to extract those info from the EPD files (pdfs) by..ehm..copy pasting..heh.\n\n\n\nI can share my data and assist in any way I can with you in this.\n\n\n\nHowever, as a final note, simply adding up EPD results gives a prediction of these metrics which will not be extremely accurate. Further issues need to be considered, like transportation to your location (EPW file can be used for this?), mode of transportation. Also, not all products have EPDs so using a cement EPD is an approximation, although vastly better than using nothing.\n\n\n\nAnyways, excited for this!\n\n\n\nKind regards,\n\nTheodore.\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "February 13, 2015 at 8:28pm", "created_by": "TheodorosGalanos", "replies": []}]}], "id": "1217832"}