{"body": "\nHello everyone,\n\n\n\nI have been working with LB+HB for the last two weeks and I am very impressed of what I can already achieve with limited experience.\n\n\n\nI wanted to ask a question concerning masses, zones and surfaces.\n\n\n\nIn the tutorials, the regular flow described is from mass to zone to surface. This is very helpful in simple designs or where a lot of design options are still in our hands.\n\nI was wondering if there is a quick way to extract information from cases where the design is provided as a big 3d file (e.g. sketch up, rhino).\n\n\n\nAt this point I am mostly interesting in an (automated?) way to extract infromation of the facade materials (e.g. WWR in each orientation) and to quickly also assign information to them (e.g. SHGC, SRI, etc.). Can I assign properties to layers or groups of the drawing?\n\n\n\nSorry if this doesn't make much sense, such a novice in 3d design.\n\n\n\nKind regards,\n\nTheodore. \n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "February 4, 2015 at 9:37pm", "created_by": "TheodorosGalanos", "topic": "Extracting geometry details", "replies": [{"body": "\nHi Theodore,\n\nIt seems like a lot of what you might want to do can be done with native grasshopper components that can calculate the areas of your window breps (if you have them on one layer) and compare them with the areas of your walls (if you have them on another layer).\n\nIf you get the geometry into HBZone format, there is a lot of ways that you can separate the zones (based on orientation or perimeter/core).  Check out the components in the drop-down of the first Honeybee tab and you may find some useful stuff to help you.  You can then use separated zones and run them through different Set EP Zone Construction components if you want to separately change the properties of windows for different cardinal directions.\n\nLet me know if that is clear or if you would need more specific examples.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "February 5, 2015 at 6:18pm", "created_by": "ChrisMackey", "replies": []}], "id": "1217630"}