{"body": "\nHi all,\n\n\n\nI am trying to simulate a houseboat. A zone is partially underwater (2/3 of it) and I was wondering how I could simulate this condition in Honeybee. For now I simulated as underground but the conditions are different and the temperature of the water fluctuates more than the one of the ground. Any thoughts? \n\n\n\nThanks a lot! \n\nTasos\n", "attachments": [], "created_by_name": "Anastasios Kokkos", "created_at": "February 5, 2015 at 12:01pm", "created_by": "AnastasiosKokkos", "topic": "Under water simulation", "replies": [{"body": "\nTasos,\n\nThis is certainly an interesting question.  As far as I know, EnergyPlus doesn't have any specific objects for modeling something submerged in water.  The best that I could recommend is continuing with your underground strategy and use the IDFEditor to change your ground temperatures to be what the water temperature would be (as opposed to the usual ground).\n\nHere's an image showing how you could plug in your own ground temperatures with the IDFEditior and the IDF that Honeybee writes:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/hMNECPNor9-vnYUi1ehd8KLl-YUSKwhsMeCqDN1RSllOzPQb3wlBoCR2U5sLDUUlT084OISGiVwgucEVdYv7ugrvzt817HYn/IDFEditorGround.PNG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/hMNECPNor9-vnYUi1ehd8KLl-YUSKwhsMeCqDN1RSllOzPQb3wlBoCR2U5sLDUUlT084OISGiVwgucEVdYv7ugrvzt817HYn/IDFEditorGround.PNG)\n\n\n\nAlso, since you building is on the water, make sure that you change your terrain to \"Ocean\" or at least \"country\" with the EnergySimulationPar component.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "February 5, 2015 at 5:56pm", "created_by": "ChrisMackey", "replies": [{"body": "\nHi Anastasios,\n\nWhat Chris suggested is the first thing that also came to my mind but I suggest you to send this question to EnergyPlus mailing list or unmethours website ([https://unmethours.com/](https://unmethours.com/)) and let us know if you got any better solution. I think being able to overwrite the the boundary condition of a surface is something that is worth to apply to honeybee in general. I'm not sure if you can do that in EnergyPlus though.\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "February 7, 2015 at 9:03pm", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nHi Chris, Mostapha,\n\n\n\nThanks a lot for your replies. I couldn't check earlier this week but I did today. I am not sure though after I change the temperatures in the IDF editor what happens (should I save as new object?) cause I simulated again and didn't find differences in the results. Indeed is interesting to see how we could do this overwrite through Honeybee. One issue regarding water temperatures throughout the year is that the available data are limited and differ from place to place even within a region. Another interesting point, since the area that is enclosed under water will be a living space is to see how we could simulate the heat gains from the direct sun on the underwater surface, if any, and how we could simulate also the heat exchange between the space and the water body. Would this follow the sae behaviour as the heat exchange between inside and outside air?\n\n\n\nThanks again!\n\n\n\nTasos\n\n\n\n\n", "attachments": [], "created_by_name": "Anastasios Kokkos", "created_at": "February 12, 2015 at 10:13am", "created_by": "AnastasiosKokkos", "replies": []}, {"body": "\n\n\n\n\nYou should see a difference unless the R-Value of your walls is pretty high and conduction is very minimal. We can have a component to overwrite ground temperature but looks like you need to overwrite the values for every single hour?\n\nAnother interesting point, since the area that is enclosed under water will be a living space is to see how we could simulate the heat gains from the direct sun on the underwater surface, if any, and how we could simulate also the heat exchange between the space and the water body. Would this follow the sae behaviour as the heat exchange between inside and outside air?\n\n\n\nSounds like some interesting multi-phase CFD studies unless someone has already come up with an equation to model this. I can tell you that this is not something that you want EnergyPlus to do. The only energy simulation software that might be capable of modeling this to some extent might be transys but I know very little about Transys to make a comment. There are others on the group who can answer to this question.\n\n\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "February 12, 2015 at 9:31pm", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "February 13, 2015 at 6:32am", "created_by": "ChrisMackey", "replies": []}, {"body": "\nChris, Mostapha,\n\n\n\nThank you again for your replies. I indeed overwrote the idf file and imported it to HB. I got slight higher consumptions especially during winter time since I changed the boundary ground/water conditions to be on average 7-10 degrees during winter time. I will not go further since the project I am working on is a floating neighbourhood that will be developed in Amsterdam and not a scientific research, as such the accuracy is adequate for now. I would like to investigate further though since in our region floating houses are being built quite often and submerged volumes are a good solution to the height restrictions there are due to local regulations and structural behaviour of such units. I am using both HB and LB for the overall analysis of the project and I would like to upload chunks of the work once is completed. The new releases are really helpful!  \n\nThanks again for your input! \n\nTasos\n", "attachments": [], "created_by_name": "Anastasios Kokkos", "created_at": "February 13, 2015 at 12:29pm", "created_by": "AnastasiosKokkos", "replies": []}]}], "id": "1218134"}