{"body": "\nHi guys,\n\nfirst of all I'd like to congrats with Mostapha for the new release!\n\nThen, operatively speaking, I'm wondering if it's possible to set up the cooling and heating COP as a parameters for the EPlus simulation.\n\n\n\nthank you very much,\n\nMarco :)\n\n\n", "attachments": [], "created_by_name": "Marco P", "created_at": "February 8, 2015 at 7:13pm", "created_by": "MarcoP", "topic": "Coefficient of Performance (COP)", "replies": [{"body": "\nHi Marco,\n\nThanks for the kind words- However credit goes to all the developers and in particular Chris Mackey for this new release.\n\n\n\nIf you are using EnergyPlus component it is using IdealAirLoads for calculation and you can apply COP values afterward. Chris recently added a new component that let you set up some of the parameters for IdealAirLoads system which might be of use for your project.\n\n\n\nIf you are modeling with OpenStudio and creating a system then check Coil components to set up COP values.\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/nLML9an*avpd*T0aoNgi-70g1dIVnStjX5faKtv9ZkAPZwRht4G*TNGpm8t6lf1w0buI7EZUz2GYaPSUTa1YJ7NnQEISorY0/SetCOP.png?width=721\" width=\"721\"/>](http://api.ning.com:80/files/nLML9an*avpd*T0aoNgi-70g1dIVnStjX5faKtv9ZkAPZwRht4G*TNGpm8t6lf1w0buI7EZUz2GYaPSUTa1YJ7NnQEISorY0/SetCOP.png)\n\nAlso see Dan's comments here: [https://unmethours.com/question/2187/openstudioenergyplus-design-co...](https://unmethours.com/question/2187/openstudioenergyplus-design-cooling-and-heating-loads-0/)\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "February 8, 2015 at 10:31pm", "created_by": "MostaphaSadeghipour", "replies": [{"body": "\nYou're right!\n\nThanks also to all the developers, especially Chris!\n\n\n\nYes I'm using EP for the simulation so that I'll probably set up the model with the setEPIdealAir component.\n\n\n\nMany thanks,\n\nMarco\n", "attachments": [], "created_by_name": "Marco P", "created_at": "February 9, 2015 at 1:21am", "created_by": "MarcoP", "replies": []}, {"body": "\nThank you, guys.  I learned 90% of what I know about Python from you and your code, Mostapha, so a sizable amount of the credit still goes to you.\n\n<br/>Marco, to be clear about how to factor in a COP with the Ideal Air System, you only get raw values of sensible and latent heat to be removed/added to the zone when you run an ideal air system.  This is what is coming out of the Read EP Result component.  To give yourself a rough estimate of how much electricity or gas that this sensible and latent heat corresponds to, you can divide these sensible/latent loads by your COP.  We could have done this automatically for you in the cooling/heating results but we felt that it was very important that users be aware that just dividing by a COP is a very rough way to estimate energy use and so you should do this with the Separate Data component and the native grasshopper Division component.\n\n\n\nLet me know if you have any other questions,\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "February 9, 2015 at 1:00pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nThank you Chris, thanks guys!\n\n\n\nMarco\n", "attachments": [], "created_by_name": "Marco P", "created_at": "February 10, 2015 at 8:08pm", "created_by": "MarcoP", "replies": []}]}], "id": "1220841"}