{"body": "\nHi all,\n\n\n\nI just started working with the new version of Honeybee and I noticed that the heating and cooling results from EnergyPlus are not the same as those obtained with the previous version of Honeybee. I am not modeling an HVAC system, only the default Ideal Loads Air System.\n\n\n\nI'm wondering if anyone might be able to tell me what the major changes have been between the old and new versions of the EnergyPlus components in Honeybee that have caused the heating and cooling results to change.\n\n\n\nThanks,\n\nLindsay\n", "attachments": [], "created_by_name": "Lindsay", "created_at": "February 10, 2015 at 1:05pm", "created_by": "Lindsay", "topic": "Honeybee EnergyPlus Heating and Cooling Results", "replies": [{"body": "\nHi Lindsay,\n\nThis is expected. The new version of Honeybee has couple of enhancements in default system. Check this link for more information: [https://github.com/mostaphaRoudsari/Honeybee/commit/f3801f574511d79...](https://github.com/mostaphaRoudsari/Honeybee/commit/f3801f574511d791745db87c0b1510c702374685)\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "February 10, 2015 at 6:45pm", "created_by": "MostaphaSadeghipour", "replies": [{"body": "\nLindsay,\n\nTo summarize some of the changes that were made to the ideal air loads system:\n\n1) The old Ideal Air System was using a somewhat arbitrarily chosen size and schedules for summer and winter periods.  Now, these schedules and size of the HVAC system are determined from the \"extreme weeks\" in the connected weather file during an auto-sizing run before the main simulation.\n\n2) The old Ideal Air System was an actual ideal air object that had to be connected up to zones with duct objects in a somewhat complicated manner.  Now, the component just uses an Ideal Air System Template, which is a bit more of a standard and cleaner approach.\n\n3) The new Template comes with some adjustable features that you can change with the \"Set Ideal Air Loads Parameters\" component, including heat recovery, air-side economizers, and demand-controlled ventilation.\n\nI hope that helps,\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "February 11, 2015 at 1:24pm", "created_by": "ChrisMackey", "replies": []}]}]}