{"body": "\nHello everyone,\n\n\n\nI am trying to model a quite large building (77 floors) and run the simplest energy plus simulation. The model is quite simple with just mass to zones and solving adjacencies. My simulation period is for 1 day.\n\n\n\nHowever, it never runs the simulation as it gets stuck at writing an .idf file. The cpu and memory usages are quite low, which is strange but also not showing clearly if the process is really frozen.\n\n\n\nIs there really a limit to what we can simulate? Has anyone tested these limits before? Is it some option I have wrong? Can someone maybe try it running the same simulation?\n\n\n\nAlso, if I may I would also like to add a wish on the wishlist (is there such a thing? :)). Is it possible to have parallel for energy plus simulation. I believe having it in different computers is possible by writing the file in each computer and assigning periods to each. Is it possible to assign simulation periods to different cores?\n\n\n\nEdit: I tried without sizing with a .ddy same results.\n\n\n\nThanks in advance.\n\n\n\nKind regards,\n\nTheodore.\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1223054", "name": "Lot_185_Office.gh"}], "created_by_name": "Theodoros Galanos", "created_at": "February 12, 2015 at 4:48am", "created_by": "TheodorosGalanos", "topic": "Computational limitations or?", "replies": [{"body": "\nHi Theodore,\n\n\n\nI have set-up and ran annual simulations for 360 zones with Honeybee with no problem but there are couple of considerations in how you put the model together when you are dealing with so many zones. I can't check your file right now but I hope I can get back to this during the weekend.\n\n\n\nin Energy simulation each time-step is effected by previous time-step so technically what you are thinking about is not a good idea. On the other hand there are part of energy simulation that can be ran in parallel. EnergyPlus started to use parallel cores at some point but then they stopped it for some technical reasons. You can search EnergyPlus email list for more information.\n\n\n\nCheers,\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "February 12, 2015 at 9:23pm", "created_by": "MostaphaSadeghipour", "replies": [{"body": "\nHi Mostapha,\n\n\n\nThank you very much for the help. Being a novice I realized that a complex definition would mess things up (i.e. I would) so I just did the simplest one I could. Perhaps that was the issue.\n\n\n\nAlso, the geometry has curved surfaces. I know energy plus doesn't handle those well but I thought the through honeybee they are approximated. At least I thought that happening for glazing. Might be the issue?\n\n\n\nAs for the parallel issue yes I've seen the discussions. I believe there was research concerning the uncertainty and error in calculations from different idf files. It has something to do with how energy plus warms up I guess.\n\n\n\nWhat if we used overlapping days (e.g. 4 days) on the split idfs? I believe that would lessen the error. Also, of course for my final energy simulation I would just run it for 1 day to get accurate results but for conceptual stage, and very large models, it would be nice to have the speed buff (if possible).\n\n\n\nI'll take a look on the mailing list when I get time. Thanks!\n\n\n\nKind regards,\n\nTheodore.\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "February 13, 2015 at 4:00am", "created_by": "TheodorosGalanos", "replies": []}, {"body": "\nHi Mostapha,\n\n\n\nSorry to revive such an old post but I was wondering if you could shed some lights to the considerations in how we put together a complicated model with many zones.\n\n\n\nI am trying to run a 121 zone building but I keep running out of memory (pc just never writes the .idf file). My computer is quite strong so I am wondering if I'm doing something else wrong.\n\n\n\nThank you in advance!\n\n\n\nKind regards,\n\nTheodore.\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "April 30, 2015 at 4:03am", "created_by": "TheodorosGalanos", "replies": []}, {"body": "\nHi Theodoros,\n\nDid you get this to work? If not what is the latest file that I can check. I don't have access to an strong computer these days but I will do my best.\n\n-Mostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "July 13, 2015 at 2:29pm", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nHi Mostapha, I will have access to the file next week due to holidays.\n\n<br/>Will send it over then. \n\n\n\nKind regards,\n\nTheodore.\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "July 15, 2015 at 8:54am", "created_by": "TheodorosGalanos", "replies": []}]}], "id": "1223055"}