{"body": "\nHi all,\n\n\n\nI am transferring a discussion that already started [here](http://www.grasshopper3d.com/group/ladybug/forum/topics/custom-ep-construction-not-accepting-custom-ep-material?commentId=2985220%3AComment%3A1224099&amp;xg_source=msg_com_gr_forum) regarding the possibility of having an LCA and financial assessment of structures introduced into LB and HB. My initial thoughts are that since we create a list of materials and we assign them to surfaces - volumes the next step could be to have an Life Cycle Analysis and Financial assessment produced.\n\n\n\nThe most common form to produce an LCA into a form that is commonly used and easily communicated is in the form of Environmental Product Declarations (EPDs) that follow ISO 14025:2006. As every form of LCA, EPDs raise a bunch of question regarding their boundaries and the accuracy of the results especially if we include the factor of location. In comparison with other LCA practices though, EPDs have to be followed by Product Category Rules (defining the boundaries of the study) that can be reviewed by external parties if the EPD is to go public. Part from that EPD results reflect each stage of the life cycle of a product including potential benefits from Reuse or Recycling. Finally if you have a system - for example a building - you can add the EPDs of the different subcomponents forming the building and get a final EPD for the building itself - the point where I think HB's functionality is fully aligned.\n\n\n\nThe financial assessment can easily be concluded if one has the price of the material he/she uses. Finally the environmental indicators of the EPDs (LCI, LCIA) can be translated into [Shadow Costs](http://en.wikipedia.org/wiki/Shadow_price) (Shadow costs for Environmental Indicators [here](http://www.ce.nl/publicatie/shadow_prices_handbook_%3A_valuation_and_weighting_of_emissions_and_environmental_impacts/1032)) and added to the final financial assessment as an option. \n\n\n\nI have developed a similar plug-in (in C#) for Grasshopper for my master's thesis last year. The project focused on the comparison between constructing normally and constructing implementing Design for Deconstruction practices in steel buildings. The idea was to compare the two cases based on their environmental and financial performance. In the process I included also options for transportation of the material and for shadow cost, embodied energy and carbon assessment and more. The final outcome can be visualised in Rhino's viewports and exported to excel sheets. The plug-in is connected to local db with EPD data for steel profiles. The same scheme though can be followed for any type of material if we have the right database to connect it to! \n\n\n\nPlease have a look if interested at [the report here!](http://issuu.com/akokkos/docs/computational_modelling_tools_for_t) And let me know if you have any questions!\n\nPlease note that the report includes 3+ chapters dedicated to design for deconstruction practices e.t.c that are irrelevant with the topic but maybe interesting to read:) \n\nAlso if someone is interested in the report I can always send it to you. \n\n\n\n(I will upload a video -runthrough of the plug-in later this week)\n\n\n\nI would be very interested to have these capabilities in LB and HB and happy to help realising it! \n\n\n\nThanks \n\nTasos\n\n\n\n\n", "attachments": [], "created_by_name": "Anastasios Kokkos", "created_at": "February 14, 2015 at 6:07am", "created_by": "AnastasiosKokkos", "topic": "Life Cycle Assessment (EPD) and Financial impact Assessment with HoneyBee", "replies": [{"body": "\nHi Tasos, hi everybody!\n\n\n\nI follow your discussion with great interest and I am looking forward to your plug-in!\n\n\n\nAs part of my Ph.D. project I developed a plug-in that Daniel mentioned earlier in his post ([https://www.youtube.com/watch?v=hVXCc3bSAxc](https://www.youtube.com/watch?v=hVXCc3bSAxc)). Once I have it cleaned up, I would be happy to publish it here. I employed the plug-in for a case study, which can be found [here](http://www.bso14.org/BSO14_Papers/BSO14_Paper_048.pdf).\n\n\n\nUp to now, I haven't worked with ladybug/honeybee yet, I used the ArchSim plug-in by Timur. For the EPDs I accessed the free German [ökobau.dat](http://oekobaudat.de/home.html). Nevertheless, I am very interested in working together to have LCA plug-in compatible with different national databanks or EPDs. I'd be happy to help!\n\n\n\nBest regards,\n\n\n\nAlex\n\n\n\n\n", "attachments": [], "created_by_name": "Alexander Hollberg", "created_at": "February 15, 2015 at 12:23pm", "created_by": "Alex392", "replies": []}, {"body": "\nHi There Anastasios-\n\n\n\nYou know that EnergyPlus and OpenStudio already has the option to perform life cycle assessment, and it has been something I have been looking to put into Honeybee for this year.\n\n\n\nI can't say certainly how to include structural elements inside of a Honeybee analysis, but it is easy to pull out all of the other materials (glass, concrete, insulation) so this gets us part of the way there.  Also, OpenStudio has something called the Building Component Library (BCL)...google it and you will see that having a common BCL would make it possible for anyone to conduct a life cycle assessment.\n\n\n\nAnother idea that I have been thinking of is having a common file format such that any user, anywhere in the world, can provide us with their EPD or other data.  Honeybee could then pull all of this data together at simulation time.  I will write more about this and post my blog on the site.  \n\n\n\nGreat idea though!\n", "attachments": [], "created_by_name": "Chien Si Harriman", "created_at": "February 17, 2015 at 1:55am", "created_by": "ChienSiHarriman", "replies": [{"body": "\nHi Chien Si,\n\n\n\nThanks for the info, I did not know that e+ and OS can handle that. I will certainly try it in the future.\n\n\n\nAs for the common file format, all EPDs are standarized within product categories. This means that there is a product category for Construction Products, and all the EPDs published under it will have exactly the same values and indicators reported.\n\n\n\nPerhaps that can be the format of the file (I hope that I got what you meant and it's not about coding).\n\n\n\nWhat would be invaluable then is a tool to extract the information in the EPD pdfs into this file (format). I have been thinking for something like that myself. In this way, a database could be very quickly populated.\n\n\n\nKind regards,\n\nTheodore.\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "February 17, 2015 at 2:44am", "created_by": "TheodorosGalanos", "replies": []}, {"body": "\nHi Chien Si, Theodoros, \n\n\n\nThank you for your replies. Indeed a common library to input data in EPD form is basically all it takes. Structural components were used only because I wanted to hook up my plugin with another plugin performing structural optimisation that we developed in our university lab. Structural components are again material with properties so the only thing you look for after your modelling is the total volume per material. The \"format\" I used for my tool was basically a local database in visual studio. Easy to work with, populate and handle on servers if needed. The question becomes where will this be stored and if populated by users how do you update and also how do you make sure that the data are robust?  \n\n\n\nI didn't know about the BCL but is a great discovery for me! I am not really using OS and E+ mainly through other programs so these kind of stuff are not often under my radar. \n\n\n\n@Theodoros \n\n\n\nDo you have EPDs in .pdf form? If so with some (or a lot) of manual work we could even copy the data using a pro reader. If anyone has a nice way to do this would be great! \n\n\n\nLooking forward to work on this direction!\n\n\n\nTasos\n", "attachments": [], "created_by_name": "Anastasios Kokkos", "created_at": "February 18, 2015 at 7:23am", "created_by": "AnastasiosKokkos", "replies": []}]}]}