{"body": "\nHello again,\n\n\n\nI have been trying to get this running with no success.\n\n\n\nThe beam radiation component cannot load. In the description it says, the hourly beam gain including ladybug header. I was under the impression this was an input from \"windowBeam energy\" output of the energyplus simulation. If someone can clarify this point.\n\n\n\nAlso, I would be eternally grateful if you have a screenshot of a wired energy shade benefit evaluation, from a zone with multiple windows. I am pretty sure I am doing something wrong with the trees but it's getting late and harder to see mistakes.\n\n\n\nThanks very much in advance!\n\n\n\nKind regards,\n\nTheodore.\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "February 16, 2015 at 7:22am", "created_by": "TheodorosGalanos", "topic": "Energy Shade Benefit Evaluation", "replies": [{"body": "\nHi Theodore,\n\n\n\nIn cases like this you usually want to upload a file so others can check and give you comments.\n\nBTW, have you seen example 14 in Honeybee example files? [https://app.box.com/s/znns0dtewd1tclicx74q](https://app.box.com/s/znns0dtewd1tclicx74q)\n\n\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "February 16, 2015 at 9:28am", "created_by": "MostaphaSadeghipour", "replies": [{"body": "\nHi Mostapha,\n\n\n\nThank you for your response. I am sorry for the incomplete information, it was late, I was getting frustrated with myself, and my file was full of unconnected components while trying to get around this.\n\n\n\nI managed to clean this a bit, with a clear mind. Also, I used to visit the example page regularly, I hadn't seen the example file. Thanks for that. I connected everything ok now.\n\n\n\nThe issue is that in your example, you have 1 window per zone while I have several windows per zone. Also, I have 2 curved surfaces for which the shades are not created for. That seems reasonable since the surface is actually a collection of smaller polygons (I seem to remember Chris mentioning that honeybee automatically does that so energy plus can run). I try to bypass the first issue with the use of a bang tree, assigning the test windows separately. Unfortunately, when I try to connect the first test window, grasshopper completely frozes.\n\n\n\nI am attaching the definition. Please bear in mind my settings are for a full year simulation at the moment, might want to care about that as it is quite intensive to read results.\n\n\n\nThank you very much and sorry again for the lack of info.\n\n\n\nKind regards,\n\nTheodore.\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1225659", "name": "OfficeTower.gh"}], "created_by_name": "Theodoros Galanos", "created_at": "February 16, 2015 at 8:27pm", "created_by": "TheodorosGalanos", "replies": []}, {"body": "\nI'd like to add something relating to curved surfaces in Energy Plus.\n\n\n\nIs it me being a novice or are these results odd? It seems that the zone with the curved surface (west zone) has the highest average temperature which seems quite logical especially since this is a simulation with shades that were NOT created for that surface. But it also seems to have, along with the other curved surface, the lowest glazing surface heat gain. Could it be that the offseting creates odd results or is this normal?\n\n\n\nThese are results from the previous definition.\n\n\n\nSorry, not yet so experienced in energyplus.\n\n\n\nKind regards,\n\nTheodore.\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1225888", "name": "AverageSurfaceTemperature_perspective.jpg"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1225889", "name": "GlazingSurfaceEnergyLossGain.jpg"}], "created_by_name": "Theodoros Galanos", "created_at": "February 16, 2015 at 9:20pm", "created_by": "TheodorosGalanos", "replies": []}]}]}