{"body": "\nHi everyone,\n\n\n\nI have run an annual indoor comfort analysis and I am trying to display the results with the visualize annual results component.\n\n\n\nHowever, 2 of the 3 zones are displaying the results underneath the floors. Do I have to flip some surface? Or is it a cplane issue.\n\n\n\nKind regards,\n\nTheodore.\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "February 16, 2015 at 5:00am", "created_by": "TheodorosGalanos", "topic": "Problem displaying annual indoor comfort metrics", "replies": [{"body": "\nBaking it seems to bypass the problem as the meshes become visible. But it's still annoying.\n\n\n\nI'm sure I'm doing something wrong at some point. Can't really upload definition as it is a really demanding file to run.\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "February 16, 2015 at 5:27am", "created_by": "TheodorosGalanos", "replies": []}, {"body": "\nTheodoros, Attaching the file is always useful to help. Hard to say otherwise ...\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "February 16, 2015 at 7:45am", "created_by": "AbrahamYezioro", "replies": [{"body": "\nSorry Abraham,\n\n\n\nLong night. You are right of course. You can find the file in this discussion.\n\n\n\n[http://www.grasshopper3d.com/group/ladybug/forum/topics/energy-shad...](http://www.grasshopper3d.com/group/ladybug/forum/topics/energy-shade-benefit-evaluation)\n\n\n\nKind regards,\n\nTheodore.\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "February 16, 2015 at 9:43pm", "created_by": "TheodorosGalanos", "replies": []}, {"body": "\nActually,\n\n\n\nAfter updating from github I now can't create the recipe. In the preview of the factor mesh it is obvious the surface of one zone is completely screwed (i.e. like upside down). The comfort recipe component is giving factor mesh info not recognised error.\n\n \n\nI am attaching the definition. Thanks!\n\n\n\nKind regards,\n\nTheodore.\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1225898", "name": "OfficeTower.gh"}], "created_by_name": "Theodoros Galanos", "created_at": "February 16, 2015 at 11:21pm", "created_by": "TheodorosGalanos", "replies": []}, {"body": "\nWell ... not good news from here.\n\nI updated the file to the very last github components. The HB_IndoorViewFactor is failing with 1 warning and 1 error:\n\n1. Getting rid of interior walls has caused the connected zone geometry to not be closed.  Try connecting all zones of your building or all zones for each floor.\n\n1. Solution exception:name 'testPtsInit' is not defined\n\nThe simulation is taking a lot and the results file is pretty big (~200Mb).\n\nThe component i connected for the EP simulation and IndoorViewFactor is the EPWindowShades (as opposed to those you have). Seems to me more correct. But still ... no success.\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "February 17, 2015 at 5:59am", "created_by": "AbrahamYezioro", "replies": []}, {"body": "", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "February 17, 2015 at 10:21am", "created_by": "ChrisMackey", "replies": []}, {"body": "\nHi Chris and Abraham,\n\n\n\nThank you for your replies.\n\n\n\nYe it's a big file, surface and zone data for the whole year. The shading reps are there so I can check the impact of vertical shading on the building (linking it on and off).\n\nI managed to actually make it run now. One of my zones had a double surface on the one side. I found and closed the brep. Not sure if that was the case but at least now it runs. The preview is still bugged though. I tried to check the normals but didn't work (changed all normals and problem is still there). Baking does bypass it as all I want is to visualize and save a .jpg for now.\n\n\n\nThanks for all the help!\n\n\n\nKind regards,\n\nTheodore.\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "February 17, 2015 at 6:23pm", "created_by": "TheodorosGalanos", "replies": []}, {"body": "\nTheodore,\n\nOnce I removed the zone that was not closed in your file and I updated your view factor component to the latest version, all seemed to be good.\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/wdDZeipuIRxi54ElDLI64cEbdhXSyhXxso60NP5uXDnn6Dzns3OePfHRA6sIdrayCa--1aG8mfnr4FnRNYsw218jRWq5ll9S/GoodIndoorTempStudy.PNG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/wdDZeipuIRxi54ElDLI64cEbdhXSyhXxso60NP5uXDnn6Dzns3OePfHRA6sIdrayCa--1aG8mfnr4FnRNYsw218jRWq5ll9S/GoodIndoorTempStudy.PNG)\n\nI think that the preivew issue that you mentioned is the same as the bug that I posted about on the general grasshopper group (see the link).  Hopefully the GH team will fix it in their next version of grasshopper.  As the thread says, you can temporarily fix the problem by turning off the breps previewing in the Rhino scene.\n\n\n\nA note about shading in the comfort map: if you add shading into the E+ simulation, you should be sure to either drop down the transmissivity of the windows in the Adaptive Comfort Recipe component or plug in the shadeBreps of the Window Shade Generator into the additionalShading input of the View Factor component (the latter is more accurate but it takes the view factor component longer to run).  Doing either of these will ensure that direct sunlight falling on the occupants is minimized in the case of shades.  Here's how your image changes when you account for the shades blocking direct sun on occupants:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/wdDZeipuIRyjTkNNtvV77LCBzgJSmr52OACdFuz69hAa5pqULIm3ItsUiOZCZsEm0PiZUIXPRMA9YTgTrocTusQHpp4Wgpcr/ShadesOnOccuants.PNG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/wdDZeipuIRyjTkNNtvV77LCBzgJSmr52OACdFuz69hAa5pqULIm3ItsUiOZCZsEm0PiZUIXPRMA9YTgTrocTusQHpp4Wgpcr/ShadesOnOccuants.PNG)\n\nSee attached GH file.\n\n-Chris\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1227082", "name": "OfficeTower_CWM.gh"}], "created_by_name": "Chris Mackey", "created_at": "February 18, 2015 at 5:38pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nHey Chris,\n\n\n\nThanks for the advice. Can't believe I wasn't accounting for the shades in the adaptive comfort matrices. I guess I thought since they were plugged in the EnergyPlus it was ok. I'm going to redo the simulations now then.\n\n\n\nI do have another question though. How do you think I can manage to put shading devices in glazing with curved geomtry? Would it be possible to use a component and somehow create a single, linear geomtry infront of the window to put the shading devices? If not, do you have any advice on the transmissivity values I can use for those 2 windows in order to 'simulate' their existence?\n\n\n\nThanks alot for the advice!\n\n\n\nHave a nice day.\n\n\n\nKind regards,\n\nTheodore.\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "February 18, 2015 at 9:44pm", "created_by": "TheodorosGalanos", "replies": []}, {"body": "\nHi Chris,\n\nI have a couple of questions regarding your recommendations here above.\n\n1. windowTransmissivity: Can i assume that if i give a value (for instance 0.8) it means that the blinds are covering 80% of the window? This is what i understand from the hing in the input, but want to be sure.\n\n2. The HB_Zones coming out from the EPWindowShades is connected to the runEnergySimulation. The HBZones connected to the IndoorViewFactor come from each individual zone with outdoors facades. Then the output coming from EPWindowShades is also connected here. Are not the shades taking into account twice in this way? Once for the EP simulation and once more for the comfort recipe? I find this a bit confusing ... Just want to understand the logic of the process and calculations.\n\nThanks,\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "February 18, 2015 at 11:23pm", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nHey Abraham,\n\n\n\nThe way I understand the concept of transmissivity is near to the one of transmittance, that is how much incident light the window allows to pass through. I am in no way an expert, but I understand transmittance is used in most glass specifications (VLT) while transmissivity is a value used in Radiance (my limits of knowledge in optics lol). There is actually an approximation of transmissivity from VLT numbers, which is transmissivity=1.09*(visible light transmittance). I feel 0.8 would be the fraction of light allowed, so it would need to be much lower to 'simulate' blinds (if blinds have a transmittance of close to 0). Perhaps what it can be used is the weighted average of the visible area of the window, with a transmittance x, to the area of the blinds (with a transmittance of 0?). Even if this is correct it would be faulty I think. Actually now I am curious to know what calculations are happening when we connect the shading breps. Are they assumed to have a transmissivity of 0?\n\n\n\nFor your second point, I am interested to hear Chris's thoughts.\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "February 18, 2015 at 11:42pm", "created_by": "TheodorosGalanos", "replies": []}, {"body": "\nHi Theodoros,\n\nNo way the windowTransmissivity refers to the properties of the glass/window. Those you get/give when you define the proper material.\n\nThe hint in the AdaptComfRecipe says:\n\nwindowTransmissivity_: An optional decimal value between 0 and 1 that represents the transmissivity of windows around the person.  This can also be a list of 8760 values between 0 and 1 that represents a list of hourly window transmissivties, in order to represent the effect of occupants pulling blinds over the windows, etc. Note that you should only set a value here if you are using this component for indoor analysis where the only means by which sunlight will hit an occupant is if it comes through a window.  The default is set to 0.7, which is the trasmissivity of the default Honeybee glazing construction.\n\nI understand here that the intention is to combine the influence of shading devices as for the amount of sunlight that enters the space. What i see in the hint is that i can define this \"coefficient\" for each hour of the year. In this way is kind of Shading Coefficient for the window That's why i'm asking.\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "February 19, 2015 at 3:46am", "created_by": "AbrahamYezioro", "replies": []}]}], "id": "1225443"}