{"body": "\nHi all,\n\n\n\nI was running a model with HB and E+ and everything was fine. I decided to move the Rhino model into a new file, rebuild and refine my GH on it and add some additional details of material and programs. Now I try to run the E+ calculation and is not runnign giving me different geometry problems every time. I open my previous GH definition with the sam RHino file and runs just fine! I am really puzzled (and sleepless) since I want to run the newer version. \n\n\n\nIn the mean time the construction EP material components seem to have some issues. I can create and save a new material but the latest version of E+ simulation doesn't seem able to find them and turn orange. After I change to existing EP material the problems with the new simulation begin! \n\n\n\nAny ideas? \n\n\n\nThanks!\n\nTasos\n", "attachments": [], "created_by_name": "Anastasios Kokkos", "created_at": "February 20, 2015 at 2:45am", "created_by": "AnastasiosKokkos", "topic": "WIERD ENERGY+ SIMULATION PROBLEM!", "replies": [{"body": "\nHi Tasos,\n\n\n\nIt might be easier to examine the problem if you upload both file, and screenshot your error message in your system..\n\nHave you make sure that you are running with the same unit? It should be running in meter..\n\nAgus\n", "attachments": [], "created_by_name": "Agus Hariyadi", "created_at": "February 20, 2015 at 3:06am", "created_by": "kirpytus", "replies": [{"body": "\nHi Agus,\n\n\n\nProblem just solved with the simulation, I updated the E+ component in the new file and runs fine! (me happy!) The problem with the EP construction though still remains sine the E+ component returns a warning that cannot find it in the library although if I do a EPConstruction decomposition I get back all the values I added to my new material!\n\n\n\nAny  ideas?\n\n\n\nThanks!\n\n\n\nTasos \n", "attachments": [], "created_by_name": "Anastasios Kokkos", "created_at": "February 20, 2015 at 3:09am", "created_by": "AnastasiosKokkos", "replies": []}, {"body": "\nhave you look at this issue? [https://github.com/mostaphaRoudsari/Honeybee/issues/270](https://github.com/mostaphaRoudsari/Honeybee/issues/270)\n\nI think it's similar.. and It should have been fixed by Mostapha..\n\n\n\nAgus\n", "attachments": [], "created_by_name": "Agus Hariyadi", "created_at": "February 20, 2015 at 3:26am", "created_by": "kirpytus", "replies": []}]}, {"body": "\n\n\nhi again,\n\n\n\nI was trying to overwrite some data with the .idf editor in E+ and I get this in result. Tried with both 8-1-0 and 8-2-0 but it doesnt seem to work. I used the 15/02/2015 E+ writer component to produce the .idf which still doesn't run when I input custom material. Any ideas? I really need to work with specific values on my material! Any ideas/ input would be great!\n\n\n\nThanks,\n\nTasos \n\n\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1228001", "name": "Screen Shot 2015-02-20 at 14.31.13.png"}], "created_by_name": "Anastasios Kokkos", "created_at": "February 20, 2015 at 6:34am", "created_by": "AnastasiosKokkos", "replies": [{"body": "\nHi Tasos,\n\n1. Can you share the .idf file with us so we can take a look?\n\n2. Are you using the version on Food4Rhino or the latest version from github?\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "February 20, 2015 at 7:58am", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nTasos,\n\nI have a hunch about what the problem is.  If you drop a new Honeybee_Honeybee onto your canvass or if your Honeybee_Honeybee component does not lie further back on the canvass than your writeToProjectLibrary component, your project material library is overwritten by the copying of Honeybee_Honeybee classes to your system memory.  So you need to send your Honeybee_Honeybee to the back of the canvass by selecting it and hitting Cntrl+B.  Next, try re-run your writeToProjectLibrary component by disabling it and enabling it.  Then, use the run simulation component again and let us know if it works.  If not, upload your GH file.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "February 20, 2015 at 7:51pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nHi Mostapha, Chris,\n\n\n\nThank you both for your answers. Eventually there were two problems:\n\n\n\n1. Whenever I re-open my gh files GH asks me to let ladybug and honeybee fly since all the used components are red. Recomputing or disabling/enabling the two components works but not always, as such I had to use new ones. At one of these times though I had one Honeybee_Honeybee component forgotten on the canvas that did probably overwrite my data. I erased it and send the one in use back as Chris suggested and the simulation ran with my new material!\n\n\n\n2. I am using parallels on a mac where the directory on files that are saved in shared folders between the two systems are quite long and complicated. I was saving my EP calculations to one of them and this seemed to cause badly written .idf files. I moved the target directory to a local (C:\\) file and the EP can now normally read them and re-edit them! \n\n\n\nI am using the latest updates from GitHub, the only paradox in the problem mentioned above is that the readme output of the EP simulation component was giving everytime a different set of severe errors that (in my understanding) reads back from the generated EP file (is that correct?) which is weird since the files were not written properly! \n\n\n\nSo far so good! Thanks again for your replies! \n\n\n\nTasos\n\n\n\n\n", "attachments": [], "created_by_name": "Anastasios Kokkos", "created_at": "February 22, 2015 at 3:46pm", "created_by": "AnastasiosKokkos", "replies": []}]}]}