{"body": "\nHi everyone, I get the following error message \" 1. Getting rid of interior walls has caused the connected zone geometry to not be closed.  Try connecting all zones of your building or all zones for each floor.\" when I connect all my zones to the indoor view factor calculator component (my building is one floor only) . What can be wrong and how do I fix that? \n\nThanks\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1228739", "name": "Base_caseHB.3dm"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1228740", "name": "Base_caseHB.gh"}], "created_by_name": "Ninja", "created_at": "February 21, 2015 at 4:05am", "created_by": "RaniaLabib", "topic": "Error message when I use the indoor view factor calculator", "replies": [{"body": "\nHi CD2005,\n\n\n\nI was getting the same mistake recently. If you created your zones from individual surfaces then the problem is that one zone is probably not closed. You can quickly verify that if you have an open brep in your list of breps. Try hiding all zones and then visualize each zone surface by surface to find the culprit. At least that was the issue in my case.\n\n<br/>Edit: It could also be that a wall is referenced twice in one zone.\n\n\n\nHope that helps!\n\n\n\nKind regards,\n\nTheodore.\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "February 21, 2015 at 4:35am", "created_by": "TheodorosGalanos", "replies": [{"body": "\nHi Theodoros,\n\n\n\nThanks for your response, I checked each individual zone over and over again to make sure they are closed but I still have the same problem. So I decided to just make my building as a one zone building, it is an open plan office building anyway, and I made sure it closed , I used the custom preview component to visualize the zone and looks fine, and still having the same issue. I'm attaching the file that has that one zone. The zone is grouped with orange background. is anyone here in this forum willing to troubleshoot the issue. I think I'm going crazy, I've been up since last night trying to make this work .Thanks in advance. \n\n\n\n\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1229027", "name": "Base_caseHB3.3dm"}], "created_by_name": "Ninja", "created_at": "February 21, 2015 at 12:28pm", "created_by": "RaniaLabib", "replies": []}, {"body": "\nHere is th GH file\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1229116", "name": "One_zone_Base_caseHB.gh"}], "created_by_name": "Ninja", "created_at": "February 21, 2015 at 1:39pm", "created_by": "RaniaLabib", "replies": []}, {"body": "\nHi CD3005,\n\nThanks for reporting and I'm taking a look at your file now.  It might be that not all of your components are up to date.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "February 21, 2015 at 5:09pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nHi Chris,\n\nThanks for your help. What components are you talking about ? Honeybee components or other GH components that exist in my file?. \n\n\n\nRania\n", "attachments": [], "created_by_name": "Ninja", "created_at": "February 21, 2015 at 6:01pm", "created_by": "RaniaLabib", "replies": []}, {"body": "\nCD2005 (sorry I got your name wrong last time and for getting back do late),\n\nThere are three big things that are wrong with your file:\n\n1) Your zones are not closed volumes in the file that I have opened.  This image shows the problem:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/QxYZWE5p2qvSwQkr6ykkmwSFy**FdI0rC0N6bFywDero*b--HxR1gJ-B0UPqd2SXSvEho3Raca-CZqHoRyn*Fk0Zr6lBx8TQ/OpenBreps.PNG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/QxYZWE5p2qvSwQkr6ykkmwSFy**FdI0rC0N6bFywDero*b--HxR1gJ-B0UPqd2SXSvEho3Raca-CZqHoRyn*Fk0Zr6lBx8TQ/OpenBreps.PNG)\n\nIf this is not what you are seeing on your own machine when you hook up your HBZones to a panel, then you have not uploaded the right Rhino and Grasshopper file.\n\n2) You have not run your HBZones through an EnergyPlus simulation.  You need to do this in order to get data with which to construct the indoor temperature map.  I would strongly recommend following along through the first 8 videos of this tutorial series before trying to construct an indoor radiant temperature map of your own project ([https://www.youtube.com/playlist?list=PLruLh1AdY-SgW4uDtNSMLeiUmA8Y...](https://www.youtube.com/playlist?list=PLruLh1AdY-SgW4uDtNSMLeiUmA8YXEHT_))\n\n3) You are using components from the last stable release, which is fine but you should know that there has been a lot of development on the indoor temperature map workflow in the last 20 days (there is now a much cleaner workflow that integrates the air and radiant temperature with comfort alanyses now on the github).  If you imagine using this workflow frequently, I would recommend updating with the Ladybug_Update Ladybug and Hopneybee_Update Honeybee components.  See the attached recent file for how the workflow is currently structured.\n\n-Chris\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1229623", "name": "Indoor Temperature Map20.gh"}], "created_by_name": "Chris Mackey", "created_at": "February 22, 2015 at 2:21pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nChris,\n\n\n\nThank you so much for the tips. I watched the first 12 videos, over the last week. Great videos and an awesome grasshopper plug-in, thanks a bunch.  I grabbed all the new components from github, then tried again, but I still have no luck. So what I did is I modeled the building again in Rhino and reduced the curves then I imported the geometry into GH and used the HoneyBee zone by surfaces component , but I noticed that after I grabbed the new components I get a \"NULL\" if I plug a panel to the final zone.  Finally I decided to model a very simple box and grab all its surfaces to create a zone , and to my surprise I still get \"NULL\" Am I doing something wrong ? here are what I did to create this one zone box\n\n1- modeled a 3d box in Rhino\n\n2- Exploded it\n\n3- In grasshopper I created HB-surfaces ( Floor, Ceiling, 4 individual walls and added I glazing by ratio to one of the walls)\n\nHere is an image, also I attached the file, the box components are grouped with an orange background. Now I'm convinced that I have a bug or something because it can't get easier than creating a zone from a simple box and yet I get a \"NULL\" message. \n\n\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/GutZeHmFpMti-tD3Hyoo*BgqK1uQhbNj9tqnDmU9KhnScGzwpdxATJJMaFyCjfCt9CndI20G-lZipjoxbnWUQfEAwTQ8MqD9/Canvasat234140.png?width=721\" width=\"721\"/>](http://api.ning.com:80/files/GutZeHmFpMti-tD3Hyoo*BgqK1uQhbNj9tqnDmU9KhnScGzwpdxATJJMaFyCjfCt9CndI20G-lZipjoxbnWUQfEAwTQ8MqD9/Canvasat234140.png)\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1230020", "name": "BOX.gh"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1230021", "name": "Base_case_All-zone.3dm"}], "created_by_name": "Ninja", "created_at": "February 22, 2015 at 10:57pm", "created_by": "RaniaLabib", "replies": []}, {"body": "\nHi Rania,\n\n\n\nYou need to flatten the surface inputs in the CreateZone component. That should fix it.\n\n\n\nKind regards,\n\nTheodore.\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "February 22, 2015 at 11:34pm", "created_by": "TheodorosGalanos", "replies": []}, {"body": "\nAnd probably input a name for the zone(s).\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "February 22, 2015 at 11:52pm", "created_by": "AbrahamYezioro", "replies": []}]}, {"body": "\nThank you Theodoros and Abraham, I flattened the inputs and assigned a zone name and that fixed the problem. I thought I'm going crazy.\n\nChris sorry for doubting the plug-in, I thought it had a bug. It turned out it is an awesome plug-in, it has everything I need for this project. \n\n\n\nI have two more questions:\n\n1-  Can I use \" conceptual shading using EC glazing in Energy Plus simulations?  and how do I setup that? \n\n2- Do you have any videos posted that talk about daylighting simulations? or, it would be helpful if someone have a GH definition setup for daylighting workflow and can share the definition with me, I'm interested in DA and glare simulations. I'm currently using Diva, but I love the way HB provide clear and professional visualization. \n\nRania\n\n\n\nRania\n", "attachments": [], "created_by_name": "Ninja", "created_at": "February 23, 2015 at 6:13pm", "created_by": "RaniaLabib", "replies": []}, {"body": "\nOh, and by the way, I was able to get my building to work into one zone that has a closed Berp. However, I had trouble assigning the windows using the \"child and parent component\" so I used the \" glazing based on ratio\" component instead and it worked. Thank you everyone .\n", "attachments": [], "created_by_name": "Ninja", "created_at": "February 23, 2015 at 6:20pm", "created_by": "RaniaLabib", "replies": [{"body": "\nHi Raina,\n\nGlad to hear that things are starting to work out.  So that you are aware of the full range of video tutorial resources, you can find all of my tutorial series here:\n\n[https://www.youtube.com/channel/UCc6HWbF4UtdKdjbZ2tvwiCQ/playlists](https://www.youtube.com/channel/UCc6HWbF4UtdKdjbZ2tvwiCQ/playlists)\n\nAnd Mostapha made a tutorial series on daylight from his workshop at Penn that you can find on this page:\n\n[https://www.youtube.com/user/MostaphaSad/playlists](https://www.youtube.com/user/MostaphaSad/playlists)\n\nIf the child and parent component does not work, it should give you an error about what is going wrong.  If not, make sure that the inputs are not in separate data trees branches (flatten the inputs).  List alignment, list management, and data tree structures are really important for anything in Grasshopper and it might be a good idea to see if you can find some videos explaining these concepts.\n\n\n\nYou can account for shades in your EnergyPlus runs by using the \"Window Shade Generator\" component.  You will have to create your own CSV schedules showing when the blinds are pulled that is aligned with the conceptual shading schedule (see videos 20 and 21 on the HB Energy Modeling playlist).\n\n\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "February 23, 2015 at 7:24pm", "created_by": "ChrisMackey", "replies": []}]}], "id": "1228741"}