{"body": "\nHello everyone,\n\n\n\nI am trying to set up a simulation based on daylight calculations. I have managed to calculate my DA numbers and set a lighting schedule out of that. I could then link this to energyplus and see the result of the schedule.\n\n\n\nMy problem is that in big zones, especially offices, there are multiple lighting zones. Is there a way to simulate this using Honeybee without splitting my zones into sub-zones. This would increase the simulation time I think?\n\n\n\nIs it perhaps possible to put airwalls and then discard them from the simulation. I guess I'd like to know if I can simulate 1 cooling zone that includes 4 lighting zones (as example) in energy plus, at the same time.\n\n\n\nHope this makes sense. Thanks in advance for the input.\n\n\n\nKind regards,\n\nTheodore.\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "February 23, 2015 at 8:35pm", "created_by": "TheodorosGalanos", "topic": "EnergyPlus and Lighting Zones", "replies": [{"body": "\nFor getting separate schedules out of daylighting simulation you just need to split the floor surface into multiple surfaces, so when you are generating the test points each surfaces will be in a separate branch.\n\nI assume in EnergyPlus you need to split your zones anyways if you want to apply different lighting schedules. I'm not sure though - there might be a solution for that if you post your question to (unmethours.com). Nevertheless if you are creating multiple zones with airwalls make sure to set exportAirWalls to False when for daylighting simulation so it doesn't affect the results of daylighting analysis.\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "February 23, 2015 at 8:42pm", "created_by": "MostaphaSadeghipour", "replies": [{"body": "\nThanks for the quick response Mostapha.\n\n\n\nI will give the splitting surface a try and let you know.\n\n\n\nPerhaps you are right I will have to split the zones but it seems to be less accurate as the actual design is an open office.\n\n\n\nThat's why I asked about airwalls, thought they would give the least effect on simulation results.\n\n\n\nKind regards,\n\nTheodore.\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "February 23, 2015 at 8:47pm", "created_by": "TheodorosGalanos", "replies": []}, {"body": "\nI would give unmethours.com a try. There might be solution that we don't know about it. Cheers, - Mostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "February 23, 2015 at 8:57pm", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nHi Mostapha,\n\n\n\nSo I got this response so far:\n\n\n\n\"The Daylighting:Controls object in EnergyPlus allows two different reference points to be used within a zone and the fraction of the total zone lighting that is controlled by each reference point and each reference point can have different illuminance setpoints. This allows some of the flexibility you may be looking for but the two reference points must be controlled the same way (continuous or stepped or continuous/off) and both share the same glare controls as well as the same schedule for what times of the day or year that daylighting controls are active (usually all the time anyway). A second option in EnergyPlus to do daylighting is available with the DElight daylighting objects which allows more reference points but it comes with several limitations described in the InputOutputReference that you should review before trying them.\"\n\n\n\nFor a starting point I would say that two reference points (which I guess mean 2 daylighting zones) should be enough. For very big zones we might as well divide. Unless the DElight objects allow more options.\n\n\n\nI know I'm being lazy, but is the option of two reference points within a zone in the components right now? If not, and if it's possible, I'd love to add it as a wish.\n\n\n\nKind regards,\n\nTheodore.\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "February 24, 2015 at 6:58pm", "created_by": "TheodorosGalanos", "replies": []}, {"body": "\nHi Mostapha,\n\n\n\nI need a bit of assistance on the first point.\n\n\n\nI managed to set a workflow that identifies a daylight zone (for example in my case a zone that has above 3.5% DF). Now I am trying to input the two zones (daylight and non daylight), after transforming the mesh to brep, into the daylight simulation to create the two schedules. However, nothing runs and the simulation starts and ends with almost no error, apart from the windows message of \"WMIC process get commandline\".\n\n\n\nI'm hoping this is simply me connecting things wrong so I'll start with just a screenshot and I'll not trouble you with my file (yet).\n\n\n\nKind regards,\n\nTheodore.\n\n\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1231169", "name": "WMIC error.png"}], "created_by_name": "Theodoros Galanos", "created_at": "February 24, 2015 at 8:24pm", "created_by": "TheodorosGalanos", "replies": []}]}, {"body": "\nHi Theodore,\n\n\n\nI notice that you are trying to conduct energy simulation based on daylight calculation in Honeybee. Actually, I am now trying to do the same thing, but I encountered some difficulties in linking the lighting schedule to the energy simulation in a proper way.\n\n\n\nMy problems are listed here: [http://www.grasshopper3d.com/group/ladybug/forum/topics/read-ep-res...](http://www.grasshopper3d.com/group/ladybug/forum/topics/read-ep-result-results-are-missing-in-the-new-version?commentId=2985220%3AComment%3A1277590&amp;groupId=2985220%3AGroup%3A658987)\n\n\n\nCould you please share some of your experience with me? Thank you in advance!<br/>\n\n\n\nBest,\n\nDing\n\n\n", "attachments": [], "created_by_name": "Ding", "created_at": "April 30, 2015 at 1:36pm", "created_by": "doudou", "replies": []}]}