{"body": "\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/vshXEK8U-ijg5qvBRrUW8opBmYgDK1wv1sTZllgnokJ0mMLbTk56Mb*6nUUnTUR3uREjG0qbKaq5SQq31D7ffJyFlZ5T32*J/sketc01.jpg?width=750\" width=\"750\"/>](http://api.ning.com:80/files/vshXEK8U-ijg5qvBRrUW8opBmYgDK1wv1sTZllgnokJ0mMLbTk56Mb*6nUUnTUR3uREjG0qbKaq5SQq31D7ffJyFlZ5T32*J/sketc01.jpg)HI there guys.\n\n\n\nOur studio is working on a large scale project. A university pavilion. Right now we are at the design development phase and since the begging we are using LB and HB for daylight analysis. One special condition of the project is a concave south west glass façade (north America) that will, for sure, create some solar heat gain because its concentrating solar light on a specific area on the ground.\n\nUsing LB we are able to pin point the location of the sunrays hitting the ground after being reflected by the facade and with HB we can spot potential glare areas. But Now we need to know if this solar heat gain concentrated by the concave facade will create uncomfortable areas on the ground.\n\nIs there a way that I can measure temperature on a given surface that is heated by reflected solar rays or simulate (using LB comfort components) if a person standing on the sunlit area will suffer from the solar heat gain because of that façade.\n\nPlease see image bellow for graphical explanation\n\n\n\nThank you all\n\n\n\ncheers\n\n\n\n\n\n\n", "attachments": [], "created_by_name": "Claudio", "created_at": "February 23, 2015 at 9:00pm", "created_by": "Claudio", "topic": "Surface Temperature under reflected solar heat gain", "replies": [{"body": "\nHi Claudio,\n\nI' am sorry to get back so late.  This week has been busy but I will write a good response this weekend.  This issue seems to be a duplicate:\n\n[http://www.grasshopper3d.com/group/ladybug/forum/topic/show?id=2985...](http://www.grasshopper3d.com/group/ladybug/forum/topic/show?id=2985220%3ATopic%3A1231901&amp;xg_source=msg)\n\nPlease ocrrect me if I am worng.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "February 26, 2015 at 4:29pm", "created_by": "ChrisMackey", "replies": [{"body": "", "attachments": [], "created_by_name": "Claudio", "created_at": "February 26, 2015 at 9:46pm", "created_by": "Claudio", "replies": []}, {"body": "\nHi Claudio,\n\nSorry for taking so long to respond.  Let's post all of the responses here as opposed to the other discussion.\n\nThe issue that you pose here is a difficult one but there are some ways of getting a sense of the conditions on the street by \"hacking\" some of the components.  The \"Outdoor Solar Adjusted Temperature\" component can give you a sense of the MRT delta that a person would feel as a result of the additional solar radiation being reflected onto them from the building.  You are going to have to input different radiation values into this component other than the usual weather file values in order to account for the effects of additional reflected solar radiation off of the facade.  I would start by doing a Honeybee Radiance simulation of the situation in order to get the amount of solar radiation being focused onto that spot.  You should model the glass facades of the building as mirror materials that have a reflectivity equal to that of the glass.  This is effectively what I did for a project that was purposefully attempting to focus sunlight onto an indoor thermal mass with a set of reflective parabolic forms and, as you can see, I was able to successfully model the focusing effect:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/Vfj0TqHwhitQ-UqAL4plYoayYTBtsDhywpZV3G1Q7OtDVPZV64ZokicFga3Ks4jFZAg1CmiHtuDeBEdS-84PglCcKcyiYlQm/SolarFocusing.PNG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/Vfj0TqHwhitQ-UqAL4plYoayYTBtsDhywpZV3G1Q7OtDVPZV64ZokicFga3Ks4jFZAg1CmiHtuDeBEdS-84PglCcKcyiYlQm/SolarFocusing.PNG)\n\n\n\nOnce you have a sense of the differences in radiation around your spot from the Radiance simulation, you can pick one of the larger amounts of radiation, separate it into an estimated diffuse and direct portion, plug in those values to the solar adjusted temperature component and, from there, you can start to get a sense of the MRT delta that someone would feel sitting in the place where the sunlight is being focused.\n\n\n\nUnfortunately, the surface temperature of the ground is so dependent upon the conditions of the previous few hours that it is not going to be easy to calculate it.  The only part of Honeybee that is capable of doing such a temporal calculation is EnergyPlus but, to be honest, I do not trust their solar distribution calculation to accurately model the effects of focusing the sun rays like this.  In your case, I think that you are just going to have to make an educated guess from the amount of solar radiation falling on the ground in comparison to the temperature of a normal outdoor surface.  In any case, the MRT delta from the solar radiation falling directly onto people will probably be much higher than the surface temperature delta so I would start with the above method first).\n\n\n\nKeep me posted on how things turn out.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "February 28, 2015 at 8:13pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nHello Chris,\n\nThank you very much for your answer. It seems clear to me that it’s somehow possible to achieve at least the comfort of a person standing on the target area. Surface temperature I’ll check that later.\n\nAbout the process you propose, I have some questions. I did start the radiance simulation as you described. From there I can get all the cumulative radiation values as KWh/m2. As a grid and also as an image (grid based analysis recipe and image based analysis recipe)\n\nI’ll keep working on this\n\nThank you very much for your help and time. You guys are awesome.\n\n \n\nCheers\n\nClaudio\n\nps: you'll find my definition as it is right now.\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1234486", "name": "radiationtest-001.gh"}], "created_by_name": "Claudio", "created_at": "March 2, 2015 at 8:11am", "created_by": "Claudio", "replies": []}, {"body": "\nHi Claudio,\n\nGrid-based recipes are a good way to go.\n\n1. To be honest, I am not completely certain of the best way to divide up the direct and the diffuse radiation.  Normally, in the condition of a clear sky, you can use this formula to relate diffuse and direct radiation:\n\nDiffRad = 0.17 * (DirRad) * (sin(Solar Altitude))\n\n(formula taken from [http://escholarship.org/uc/item/89m1h2dg#page-6](http://escholarship.org/uc/item/89m1h2dg#page-6))\n\nBecause the radiation is coming from two sources in your case (the sky and the building), this situation is a bit more complex.  I imagine that the overall intensity of radiation is going to matter more than the specific portion of direct and diffuse.  So I would try a case with 75% direct and 25% diffuse and a case with 15% diffuse and 25% direct, accepting that the range between the two as a possible error.\n\n\n\nThe starting MRT that the Outdoor solar temperature adjustor asks for is just what it says it is in the description.  It is the expected MRT in the case that there is no sunlight falling on the person.  In your case, you might start with an assumption that the MRT is close to that of the air at the given hour you are looking at.  You can get a more refined sense of this MRT without radiation by looking at outdoor surface temperature results from an energyPlus simulation.\n\n\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "March 6, 2015 at 7:58am", "created_by": "ChrisMackey", "replies": []}, {"body": "\nHi Chris, Claudio,\n\nI'm trying to do the same thing as you, Claudio. I have a highly reflective facade that bounces rays of the sun to an opposing restaurant. I already made a direct sunlight hour analysis to see what times of the day there are reflections. The thing is that it is hard to asses if those reflections are 'annoying', so next up I made a radiation study using the honey bee daylight simulation. \n\nThe point I want to get at is to find the UTCI (universal thermal climate index) for a person sitting right in front of the restaurant where the rays hit. Here is where I'm stuck as I'm not quite sure how to use the radiation results (kWh/m2) I got from the honey bee daylight simulation. I know I need to use the ladybug outdoor solar temperature adjustor and the ladybug outdoor comfort calculator. I'm just not sure how.\n\nBelow is an exaggerated image of what i'm trying to achieve as proof of concept let's say. The parabolic shape would be the mirror facade (it is flat in reality I'm just exaggerating to see if the honeybee simulation worked) and the mannequin in front is the test person that receives the radiation. \n\nAttached is the accompanying grasshopper file\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/bGawF3RRkacUfa-6-yHLu5ZEbXAsmJcck24J2MhtM*j7EFohsZHo4rgYjeZl6Fr2PGHpXyaKlHJyNU-g*y0WIpqo*KsEMlJL/05.jpg?width=721\" width=\"721\"/>](http://api.ning.com:80/files/bGawF3RRkacUfa-6-yHLu5ZEbXAsmJcck24J2MhtM*j7EFohsZHo4rgYjeZl6Fr2PGHpXyaKlHJyNU-g*y0WIpqo*KsEMlJL/05.jpg)\n\n\n\nYour help is greatly appreciated\n\nThanks in advance,\n\nArie\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1346460", "name": "ComfortableAnalysis_v1.gh"}], "created_by_name": "Arie-Willem de Jongh", "created_at": "August 20, 2015 at 3:41pm", "created_by": "aw", "replies": []}, {"body": "\nArie,\n\nIt must be fate that you posted this as I just had a conversation with a co-worker today about this very phenomenon while we were sitting next to a fully glazed building with sun reflecting off it.\n\nAt the moment, I don't account for these reflections in the thermal comfort maps off of energyplus results (what I would usually recommend for exploring thermal diversity across space).  However, this is absolutely something that you can estimate with the solar adjusted temperature component and some creative use of the Ladybug components.  What you want to do is grab the solar radiation values that you get out of the Honeybee simulation and plug these into the cunSkyMtxOrDirNormRad and diffuseHorizRad inputs of the solar adjusted temperature component.\n\nThe only difficult part is figuring out how to split the radiation between these two, which is going to depend on the specifics of the case you are modelling.  Direct radiation is radiation that shines like a beam or reflects off of a mirror surface while the diffuse radiation is distributed evenly across the sky (at least inside the solar adjusted temperature component).  Depending on where your radiation is coming from, you may want to put more radiation to one of these sources.  Also, if your beam radiation is coming primarily from a mirror surface and not the position of the sun, you will have to \"hack\" the usual use of the solar adjusted temperature component and plug in a location and time of day that produces a sun vector representing where the beam of light is coming from.  Along with this, the direct normal radiation that you should model with Honeybee at a plane that is normal to this sun vector.\n\nIf all that sounds confusing and you just need is a back-of-the-envelope estimate of solar temperature delta, plugging all of the radiation into diffuse should give you a worse-case-scenario that lands you around the right order of magnitude (as I do in the attached GH file).\n\nOnce you have the solar adjusted MRT from this component, you plug it into the UTCI component just like I show in this video:\n\n[https://www.youtube.com/watch?v=5nK-rGfPEBk&amp;index=9&amp;list=PL...](https://www.youtube.com/watch?v=5nK-rGfPEBk&amp;index=9&amp;list=PLruLh1AdY-Sho45_D4BV1HKcIz7oVmZ8v)\n\nLet me know if that is clear.  I should also note that you can only model one hour at a time with this method but, by animating a slider, you can produce a set of animated temperature maps that look like this over the course of the day:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/t3tIV4vY4Jp8rblCpq0cziIUiI4*pB78OeG3cdgJCYXcDqWj-R*I9eVfuNwS0YyDzOpMs9P4nUAbZy4NyMXytWHJhpao2igH/UTCIwithReflections.PNG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/t3tIV4vY4Jp8rblCpq0cziIUiI4*pB78OeG3cdgJCYXcDqWj-R*I9eVfuNwS0YyDzOpMs9P4nUAbZy4NyMXytWHJhpao2igH/UTCIwithReflections.PNG)\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "August 20, 2015 at 9:35pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nForgot to attache the GH file.\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1346732", "name": "ComfortableAnalysis_v1_CWM.gh"}], "created_by_name": "Chris Mackey", "created_at": "August 20, 2015 at 9:43pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nArie,\n\nI just realized in my sleep that there is a much more accurate way to get an MRT Delta from a Honeybee Radiance simulation, although you can do it for only one human geometry and one hour at a time.\n\nAll that you use the solar adjusted temperature component for is to generate a human geometry mesh.  Then, you just run this human mesh through the Honeybee Radiation simulation.  You can use the radiation values that you get out of the simulation to compute an Effective Radiant Field (ERF) using this forumula:\n\nαLW * ERF = αSW * Esolar\n\nFinally, you can convert this ERF to an MRT Delta using this formula:\n\nERF = feff * hr * (MRT - Ta)\n\nBoth formulas are taken from the original paper that I used to make the solar adjusted temperature component:\n\n[http://escholarship.org/uc/item/89m1h2dg#page-4](http://escholarship.org/uc/item/89m1h2dg#page-4)\n\nThis is what it will look like when you get a result with this method:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/t3tIV4vY4Jojj8MNfA9RdzYl4GMIfIYk*XMi0dtpPXJhNPmXU5mMo2obwE1JiO1KStpVwdWlHfNUxBQSQ-RvZ1BDD-fraZ0W/MRTDeltaWithRadiance.PNG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/t3tIV4vY4Jojj8MNfA9RdzYl4GMIfIYk*XMi0dtpPXJhNPmXU5mMo2obwE1JiO1KStpVwdWlHfNUxBQSQ-RvZ1BDD-fraZ0W/MRTDeltaWithRadiance.PNG)\n\nAnd attached is a GH file that will calculate the UTCI for your case.\n\nHope this helps,\n\n-Chris\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1346851", "name": "ComfortableAnalysis_v1_CWM2.gh"}], "created_by_name": "Chris Mackey", "created_at": "August 21, 2015 at 5:19am", "created_by": "ChrisMackey", "replies": []}, {"body": "\nHI Guys,\n\n\n\nGlad that some one else is trying this.\n\n@[Arie-Willem de Jongh](http://www.grasshopper3d.com/group/ladybug/forum/topic/listForContributor?user=11k5duqqypkod). I haven't complete this analysis as we are on working dwgs. But I do need to present the conclusions of this to our client and landscape architect. So far I only managed to illustrate the solar gain using a radiance analysis. Comparing a mat surface vs a mirror like surface and collecting the results from the grid on the target area. But this method does not illustrate the comfort of a person standing there. So I guess what Chris is proposing does work partially. \n\n@Chris:\n\nI've downloaded your Gh file and for some reason I get a error on the output of the mannequin mesh output of the  Solar Temp. Adjustor component. I noticed that all the inputs are empty. Please see attached image.\n\nLB : VER 0.0.60 AUG_15_2015\n\nHB : VER 0.057 AUG-19-2015\n\n[<img class=\"align-left\" src=\"http://api.ning.com:80/files/t3tIV4vY4JoPecoRZgTcc2gufjPe*TSPcbpkUE1nODEO2oCosnqrmKdc9lrUdUoEudYFM2tu3iIDS*2lyV6qhVOScjRVGTeP/Untitled2.jpg?width=721\" width=\"721\"/>](http://api.ning.com:80/files/t3tIV4vY4JoPecoRZgTcc2gufjPe*TSPcbpkUE1nODEO2oCosnqrmKdc9lrUdUoEudYFM2tu3iIDS*2lyV6qhVOScjRVGTeP/Untitled2.jpg)\n\n\n", "attachments": [], "created_by_name": "Claudio", "created_at": "August 21, 2015 at 10:24am", "created_by": "Claudio", "replies": []}, {"body": "\nClaudio:\n\nChange Rhino's tolerance (i.e. 0.001) and it will solve the issue with the mannequin.\n\nInteresting thread.\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "August 21, 2015 at 10:36am", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nHi Chris,\n\nhi guys,\n\nI was trying to find out a proper solution to a problem close to the topic of this discussion(achieve a UTCI of an outdoor area in front of a specific reflective surface);\n\nI have doubts that I want to share with you:\n\n- strange results: if you run the simulation twice(same input data in all the components) you will have different Solar Flux results: how is it possible? please have a look to the first gh file attached.\n\n-if you change the human body with a surface grid(to obtain different values on a give surface of study) and try to change the analysis period  into August for instance, you will see strange values; in some cases there are almost 2 degrees(°C) of difference between two closer grid points(I think we all agree that is a quite weird result, isn't it?)_please have a look and run the simulation of the second gh file attached.\n\nMaybe Radiance is not the proper way to give a solution to our problem? \n\nthank u in advance,\n\nplease let me know what you think,\n\nErn\n\n\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1616299", "name": "ComfortableAnalysis_v1_CWM2_ERN.gh"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1616300", "name": "ComfortableAnalysis_v1_CWM2_GRID.gh"}], "created_by_name": "Ernesto Cesario", "created_at": "October 11, 2016 at 4:59am", "created_by": "ErnestoCesario", "replies": []}]}], "id": "1230499"}