{"body": "\nMostapha and Chris,\n\n\n\nI think there is a bug with the Honeybee Energy Shade Benefit Evaluator component.\n\n\n\nWhen I connect a Ladybud_LegendParameter it changes the minimum and maximum boundaries of the legend, although I have no values plugged in.\n\n\n\nI attach the relevant images and GH file.\n\n\n\nThanks a lot!\n\nDimitris\n\n\n\n\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1231881", "name": "Shade_Benefit_1.jpg"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1231882", "name": "Shade_Benefit_2.jpg"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1231883", "name": "Shade_Benefit_Evaluation_01.gh"}], "created_by_name": "Dimitrios Papadopoulos", "created_at": "February 25, 2015 at 3:12pm", "created_by": "doompop", "topic": "Honeybee Energy Shade Benefit Evaluator BUG", "replies": [{"body": "\nHi Dimitrios,\n\nThanks for reporting.  The changing of the boundaries when you hook up legend parameters was intentional since I imagined users inputting their own boundaries that go along with their custom parameters.  However, I can see now how this can be confusing so I have changed the default to not change the boundaries unless the user inputs custom boundaries into the legend parameters component.\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/njfi925B3DDKjiwv7SPXlNjHkfr9P4viIxHSxymJbubTCQI1XMGlgz0n58fFUeTongd7RlzFdNGpTjeVDz-XbGusaFwUfgLl/FixedShadeBenefit.PNG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/njfi925B3DDKjiwv7SPXlNjHkfr9P4viIxHSxymJbubTCQI1XMGlgz0n58fFUeTongd7RlzFdNGpTjeVDz-XbGusaFwUfgLl/FixedShadeBenefit.PNG)\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "February 28, 2015 at 5:48pm", "created_by": "ChrisMackey", "replies": [{"body": "\nThank you very much!\n\nThanks for turning it back to the old functionality. I personally find the ability of any component to automatically read properties of components ahead of them extremely useful!\n\nI updated to the latest components to test it, but I get this error from runEnergySimulation component: **\"1. Solution exception:global name 'additionalStrings_' is not defined.**\n\nAny advice?<br/>I attach the relevant files.\n\nThank you!\n\n\n\n\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1234851", "name": "Shade_Benefit_Error.jpg"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1234852", "name": "Shade_Benefit_Evaluation_01.gh"}], "created_by_name": "Dimitrios Papadopoulos", "created_at": "March 2, 2015 at 12:14pm", "created_by": "doompop", "replies": []}, {"body": "\nDimitrios,\n\nI added a new input to the \"Run Energy Simulation\" component.  You have to manually drag and drop the new version of this component onto the canvass (using the \"Update Honeybee\" component in this case will not work).\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "March 2, 2015 at 3:54pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nThanks I got it to work!\n\n\n\nI would like to ask a clarification regarding the difference between the **shadeNetEffect** and the **energySavedByShade**. I am not sure when they are kWh/m2 and when kWh.\n\n\n\nI understand the shadeNetEffect to be kWh and the energySavedByShade to be kWh/m2? Is that Correct?\n\n\n\nIf that s the case and I have 100% at the percenttoKeep input, shouldn't that return the shadeNetEffect when multiplying the mass addition of energySavedByShade with total shade area?\n\n\n\nAlso how do you get the legend with Degree-Day/meters2?\n\n\n\nThanks up front!\n\n\n\nDimtiris\n\n\n\n\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1235818", "name": "Shade_Benefit_Analysis.JPG"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1235819", "name": "Shade_Benefit_Evaluation_01.gh"}], "created_by_name": "Dimitrios Papadopoulos", "created_at": "March 3, 2015 at 12:03pm", "created_by": "doompop", "replies": []}, {"body": "\nDimitrios,\n\nThe shadeNetEffect is in kWh/m2 of shade and it gives you results on a cell-by-cell basis of each test shade.\n\nThe energySavedByShade is in kWh and is on a per-shade basis.\n\nI have changed the description of these outputs to incorporate the units.\n\nNote that you should take these values with a grain of salt as the energy savings are only computed by looking at the solar gains for the hours when you are cooling and they do not incorporate the effects of complex things such as thermal lag or accurately account for diffuse radiation.  To understand exactly what your energy savings are from a given shade, you should take the Brep of the shade that you get from the Shade Creator, make it HBContext and re-run the energy simulation with the shade.  Thus, the energy savings numbers that you get from the shade creator are more of a guideline, giving you a relative sense of the savings as shading size changes, rather than a final result.\n\nLegends with Degree-Day/meters2 only happen when you use the \"Comfort Shade Benefit Evaluator\" rather than the \"Energy Shade Benefit Evaluator.\"\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "March 6, 2015 at 9:50am", "created_by": "ChrisMackey", "replies": []}, {"body": "\nChris: Can you confirm that the LB_ComfortShadeBenefitEvaluator works as you stated in the last point of you previous reply?\n\nI'm connecting the output of the SunPath annual hourly data to the temperatures (as recommended in the hint), but the component gives an error (from the python editor):\n\nRuntime error (ArgumentOutOfRangeException): Index was out of range. Must be non-negative and less than the size of the collection.<br/>Parameter name: index<br/>Traceback:<br/>  line 105, in checkTheInputs, \"&lt;string&gt;\"<br/>  line 805, in script\n\nThanks,\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "March 10, 2015 at 5:19am", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nAbraham,\n\nSorry for the confusion with that.  I had changed the internal method used by the component but not the input description.  I have just changed it to the following, which correctly descibes what you should input:\n\n\n\n_temperatures: A stream of 8760 temperature values representing temperature at each hour of the year that will be used to evaluate shade benefit.  This can be the dryBulbTemperature from the 'Import EPW' component, the univeralThermalClimateIndex (UTCI) output from the 'Outdoor Comfort Calculator' component, or the standardEffectiveTemperature (SET) output from the 'PMV Comfort Calculator' component.  If you are using this component to evaluate shade for a passive building with no heating/cooling, this input can also be the indoor temperature of the zone to be shaded.\n\n\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "March 10, 2015 at 4:20pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nThanks Chris,\n\nThis is not the problem, but good that you clarified the definition.\n\nI'm still having the same problem as above. So what i did is to bang windows and shades to pick just one of them each time. It works this way. So i assume there is a problem in the script when there is more than one element to analyze.\n\n... Checking a bit further, the problem is with the amount of windows. It only accepts one, which thinking about it, has a logic of its own. No warning with the amount of shades.\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "March 11, 2015 at 4:26am", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nAbraham,\n\nI probably need to include this somewhere in the component description but the shades and windows are read as a parallel data tree structure.  So, if the shades are not on the same data tree branch as the window that they are shading, the two will not be analyzed together.  I found that data tree structure is necessary when you want to do a shade benefit for a large multi-zone building and I made the \"EnergyPlus Window Shade Creator\" to help make sure that these data trees are correctly aligned for large buildings.\n\nSo, the component does accept multiple windows but each window should be on its own branch with a corresponding set of branches that include the shades of each window.\n\nDoes this make sense?\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "March 11, 2015 at 9:03pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nHi Chris,\n\nMakes completely sense. The thing is that i'm hooking the outputs from the ShadeCreator, for both the windows and the shades. So i assume are branched as needed. Moreover, i know that since picking individual branches fit both of them. Moreover (#2) the same outputs work well with the E+ShadeBenefit.\n\nI'm making a lot of trouble, ah?\n\nThanks,\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "March 12, 2015 at 12:23am", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nAbraham,\n\nI'm sorry to say that I cannot understand the issue that you are having from your description.  Could you post your GH file where you are experiencing the issue or at least a picture?\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "March 16, 2015 at 1:27pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nSorry for that.\n\nI'm using Dimitrius file as a basis for the example.\n\nWhen i connect the output of the EPWindowShades to the LB_ComfortShadeBenefit inputs i'm getting the error i mentioned (See 1 in file). When i exploded the trees for both shades and windows and connect just one branch of each it works (see 2). You can see that both trees corresponds well.\n\nHope it is clear now.\n\nThanks,\n\n-A.\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1243643", "name": "Shade_Benefit_Evaluation_01_AY.gh"}], "created_by_name": "Abraham Yezioro", "created_at": "March 16, 2015 at 3:05pm", "created_by": "AbrahamYezioro", "replies": []}]}]}