{"body": "\nMostapha and Chris,\n\n\n\nI am using the SET Comfort component from your YouTube presentation, but when I plug-in a Analysis Period larger than 5 months the component crashes and the error balloon says: \"1. The calculation has been terminated by the user!\"\n\n\n\nSame behavior if I don t plug-in any Analysis Period.\n\n\n\nIs that a bug or some other logical limitation?\n\n\n\nI attach the relevant images and GH file.\n\n\n\nThanks!\n\n\n\nDimitris\n\n\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1232361", "name": "SET_Temp_1.jpg"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1232362", "name": "SET_Temp_2.jpg"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1232363", "name": "Comfort_Outdoor_SET_01.gh"}], "created_by_name": "Dimitrios Papadopoulos", "created_at": "February 26, 2015 at 11:36am", "created_by": "doompop", "topic": "SET Comfort error when analysis period grater than 5 months.", "replies": [{"body": "", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "February 26, 2015 at 12:35pm", "created_by": "AbrahamYezioro", "replies": [{"body": "\nThanks for reporting Dimitrios and, Abraham, your instincts are very close to the problem.  You are absolutely right to point out that the issue is not with the analysis period but with the data that the analysis period includes.\n\n\n\nTo be perfectly honest with you guys, this is an error that I have know about for a while.  It happens when you have both a very high wind speed and a high metabolic rate is fed into the PMV function, which can happen if you have an hour of your weather file that is in an intense storm and you hook up a high met activity like walking.  The original PMV model was not meant to handle these very extreme cases (being derived from climate chamber tests) and it is only through some mathematical tricks that scientists have found ways of gradually converging on a solution that describes these cases.  Unfortunately, sometimes, this iterative process flies off the handle instead of converging on a solution and so there is another mathematical trick that has to be used to find the solution.  What was happening here was that the initial function was not recognizing when this flying off the handle was happening in order to pass on the results to the other mathematical trick.\n\nI probably should have addressed the issue a while back but I knew that it was an issue in the original code that I got from the ASHRAE model inside the CBE tool ([http://smap.cbe.berkeley.edu/comforttool](http://smap.cbe.berkeley.edu/comforttool)) and it felt a bit wrong to edit code that is a part of the standard.  I see now, though, that it was really just a matter of recognizing that the result was flying off the handle and passing it to the next function so I do not feel so bad about making this change.\n\nAttached you can find your fixed file and an updated PMV and LB_LB component is now on the github.\n\n-Chris\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1233888", "name": "Comfort_Outdoor_SET_01CWM.gh"}], "created_by_name": "Chris Mackey", "created_at": "February 28, 2015 at 9:56pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nHi all! Very interesting.\n\nChris, I have two minor comments that you may want to consider.\n\n1. I think you need to catch the errors either in smaller part of the code or by considering type of exception so you can give a more related warning/error message.\n\n2. You may also want to give a warning to the user in cases that you are using the alternate methodology.\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "March 1, 2015 at 10:14pm", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nWow very interesting!\n\nThank you very much!\n\nWorks great!\n\n\n", "attachments": [], "created_by_name": "Dimitrios Papadopoulos", "created_at": "March 2, 2015 at 12:27pm", "created_by": "doompop", "replies": []}, {"body": "\nMostapha,\n\nTo clarify my comments, the fix that I made here still ensures results that are in line with ASHRAE 55 PMV Standard.  As such, I think it is a bit unnecessary to alert people to the exact method by which the PMV values are reached since the calculation is considered valid by a large scientific consensus and by ASHRAE.  The slight difference in methodology seems to have to do more with historical reasons for how the PMV model was developed and the fact that the human body takes a while to reach equilibrium when in conditions of high wind.\n\nTo clarify further, an iterative method is used to calculate PMV any time that the wind speed is above 0.15 m/s.  The original published PMV model was done in climate chambers and was made to describe indoor environments where wind speeds above this were uncommon.  As people began to adapt the PMV model to help understand outdoor conditions and to develop OUT_SET, an iterative methodology was developed to help calculate values in conditions of high outdoor wind.\n\nLet me know if this is clear,\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "March 2, 2015 at 1:31pm", "created_by": "ChrisMackey", "replies": []}]}], "id": "1232364"}