{"body": "\nHello everyone,\n\n\n\nI am designing an office tower floor which has a series of different vertical glazing and opaque (aluminum) layers.\n\n\n\nIn order to do this I used a chain of add glazing components, separating the layers with different properties. I also used the glazing component to add an aluminum composite panel (any other better way?perhaps setting the whole wall as a panel and then cut the window parts?). Everything seemed to work ok. No errors and in the preview it is clearly visible that the window is separated in layers.\n\n\n\nHowever when I plug them in the create zones component they do not show up. When I plug only them, then only the first glazed surface plugged in shows up. Anything after that won't display.\n\n\n\nAny ideas?\n\n\n\nEdit: Found this [http://www.grasshopper3d.com/group/ladybug/forum/topic/search?group...](http://www.grasshopper3d.com/group/ladybug/forum/topic/search?groupId=2985220%3AGroup%3A658987&amp;q=multiple+glazing), and realized the surfaces are there just not displaying in the create zones component. Will try simulations to make sure.\n\n\n\nKind regards,\n\nTheodore.\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1235338", "name": "OfficeTower.gh"}], "created_by_name": "Theodoros Galanos", "created_at": "March 2, 2015 at 10:00pm", "created_by": "TheodorosGalanos", "topic": "Adding multiple glazing on a single surface", "replies": [{"body": "\nHi Theodore,\n\nUnfortunately your file is missing a lot of geometry. You need to internalize all of it.\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "March 2, 2015 at 10:37pm", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nSorry Abraham,\n\n\n\nAttaching the file now.\n\n\n\nI managed to run the simulation, as I said it was an issue of the layers not being displayed (probably Rhino tolerance?). But after the simulation I got some very strange results. Glazing is shown as walls, walls and the glazing over it are shown in the results, certain walls with glazing are completely ignored, etc.\n\n\n\nI think this workflow, adding glazing one after another, is either wrong or doesn't work. I wish we could do it as the radiance workflow, adding surfaces by type :(\n\n\n\nKind regards,\n\nTheodore.\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1235349", "name": "Office_MultipleGlazing.gh"}], "created_by_name": "Theodoros Galanos", "created_at": "March 2, 2015 at 11:31pm", "created_by": "TheodorosGalanos", "replies": [{"body": "\nHi Theodore,\n\nAt this moment i would say that if you receive any results, take them as garbage :-)\n\nI would recommend you to master the technique you are trying to do with a simple box. It will be a lot easier to understand where the problems are.\n\nAs for your model, as far as i checked the main issue i see is this. E+ walls host the windows. The size of the windows CAN'T cover the whole wall. You need to leave even a very small part of the wall, but never cover it all with the window. You need to leave a frame (all 4 margins) of wall. Your window parts are covering the whole wall, so i think this is the main reason this is not working. But, again, maybe there are more reasons, but you need to fix this first.\n\nAlso check you are not having \"extended\" walls. I've noticed one corner where the wall extends beyond the limits. This is not critical, though.\n\nGood luck,\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "March 3, 2015 at 1:11am", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nHi Abraham,\n\n\n\nThank you for your reply.\n\n\n\nI have actually let it go for now (needed a break) and doing Daylight simulations. Thankfully, there the flow allows to add different types of surfaces.\n\n\n\nAs for your comment I agree, I just thought that the upper part of the wall (the COM1) which is opaque would be enough. The results were indeed garbage, and in the surface analysis it looked as if there was wall (that is COM1) behind the glazing layers. That seemed strange. I will give it a go later with gaps on the edges.\n\n\n\nKind regards,\n\nTheodore.\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "March 3, 2015 at 1:26am", "created_by": "TheodorosGalanos", "replies": []}, {"body": "\nJust keep in mind that your \"COM1\" MUST be the whole wall, not just the upper part. Over it you will\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "March 3, 2015 at 2:59am", "created_by": "AbrahamYezioro", "replies": []}]}], "id": "1235339"}