{"body": "\nHi,\n\n\n\nI'm trying to figure out the best way to add glazing to my model. I want to run energy and daylight factor simulations. If I get it right there are two ways to do this;\n\n- Manually assign glazing properties to certain surfaces\n\n- Glazing by ratio\n\nI have some issues with both methods though. As I'd like to use the excellent SplitBuildingMass and Solve Adjacencies components the first one is complicated. Correct me if I'm wrong, but first I have to make the HBZones, then decompose these zones in order to add glazing to the walls and finally turn the HBSurfaces into HBZones again. As I have multiple levels I have problems making zones of the surfaces and also the model is already quite slow. Is there a better way to manually assign glazing properties to certain surfaces? I've tried adding the window+wall geometry to the directly to the SplitBuildingMass component but, understandably, the Solve Adjacencies component doesn't understand that parts of the walls are windows.\n\nThe second method works great! Using some simple mathematics I'm able to compute the ratio value when I add a certain number of windows with certain dimensions. However, I need the window widths to be correct when I run daylight factor simulations. It would be possible to solve this by calculating what break up distance will result in the correct window width. However, it doesn't seem like it's possible to assign brake up distances for each facade (North, West, South, East) with a list as it is with glazing ratio, window height and sill height. Is there a way around this?\n\nI've attached a image of what happens when I try to add break up distances as a list.\n\n\n\nI would really appreciate some help. If any of you have a suggestion of a different solution for my glazing issue I'm open to new ideas.\n\n\n\nMy only concern is that the calculations will be too slow, I plan to use Octopus to run several simulations for different designs later on. I have a quite good computer, but a i7 doesn't help much with single threaded calculations.\n\n\n\nThanks,\n\n\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1235999", "name": "HB glazing brake up distance as list.png"}], "created_by_name": "Sverker Dahlblom", "created_at": "March 4, 2015 at 1:53am", "created_by": "SverkerDahlblom", "topic": "Add Glazing problems: Break up distance as list", "replies": [{"body": "\nHi Sverker,\n\n\n\nBack to first approach you should make sure that your geometries are in the right branches.\n\n\n\nBack to the image breakupDist_ is item Access, if you want to input a list similar to what you have there you need to graft the inputs. Right now it generates the windows 4 times and that's why everything is slow in your example.\n\n\n\nCheers,\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "March 4, 2015 at 3:35am", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nThanks for you reply Mostapha.\n\n\n\nI have my doubts regarding the first approach, I can't figure out a good way to input glazing geometries to the Solve Adjacencies component (SA). I can add the exterior walls with glazing to it by using the wall and window geometry and AddHBGlz component, but the SA doesn't seem to understand the inputs (duplicated exterior walls etc.). As mentioned earlier it should be possible to solve this by decomposing the zones, adding glazing to the walls and finally turn the HBSurfaces into HBZones again but it seems like a very complicated solution.\n\nIt would be really great if there was a way to add window geometries to the Solve Adjacencies component!\n\n\n\nAs for the second approach I must admit that I don't fully understand data management in Grasshopper. Anyways, I tried to graft the data but the result is the same, see the attached image. But you're saying that it should be possible to feed breakUpDist_ with a list of values?\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1236264", "name": "HB glazing brake up distance as list grafted.png"}], "created_by_name": "Sverker Dahlblom", "created_at": "March 4, 2015 at 6:38am", "created_by": "SverkerDahlblom", "replies": [{"body": "\nSo, I've discarded the methods above and replaced the SplitBuldingMass component with a number of native GH components. By doing so the workflow is more straight-forward (Geometry-&gt;HBSurface-&gt;HBSrfWGLZ-&gt;HBZones) and It should work better when the design gets more complicated.\n\nI've come across a new problem I that I haven't faced before though, the Decompose Based On Type outputs are strange... In PrintSceen1 the Solve Adjacencies component is previewed and it looks like everything is working as it should. But the Decompose component only show the roof and a couple of the walls (PrintScreen2)? What have I done wrong?\n\nI've also attached the GH model.\n\n\n\nThanks again for your help!\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1237819", "name": "PrintScreen1.png"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1237820", "name": "PrintScreen2.png"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1237821", "name": "HBZones problem.gh"}], "created_by_name": "Sverker Dahlblom", "created_at": "March 6, 2015 at 2:48am", "created_by": "SverkerDahlblom", "replies": []}, {"body": "\nHi Sverker,\n\nIt was not that difficult to implement list access for break up distance based on cardinal direction.  I meant to do this in the initial implementation of the input but I was just too lazy at the time.\n\nYou can get the new glazing ratio component by syncing with the github.  Let me know if this will solve your problem.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "March 11, 2015 at 11:53pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nGreat work Chris! I'll try out the updated glazing by ratio component when I get a chance.\n\nAs mentioned, I've decided to use 'addHBGlz' instead and it works fine now. I think the problems in my previous reply had to do with the data management, grafting/flattening the geometries affected how 'SolveAdjecencies' acted. I got it working by solving adjacencies in two steps, firstly for each floor and secondly for the whole building. Not as neat but it works fine.\n\nI have another question though: Each time I start up Rhino+Grasshopper my custom constructions has disappeared from the EP construction library and I have to re-add them. Sometimes they also disappear when I've had the model open for a long time. Is there a way to store them permanently in the lib? I don't fully understand if they are stored locally or not?\n\nAlso, are there some documentation on Daylight Factor? The simulation works perfectly, it's a really great feature that it support multiple cores and has a quality setting! Priceless when trying out multiple designs. But I cant wrap my head around how to set north and location (or .epw)?\n\n\n", "attachments": [], "created_by_name": "Sverker Dahlblom", "created_at": "March 12, 2015 at 3:06am", "created_by": "SverkerDahlblom", "replies": []}, {"body": "\nSverker,\n\nI am glad that you got your issue fixed.  As for your question, the \"Add To EP Construction Library\" component only copies the construction to the memory of the Grasshopper document.  As such, it is deleted when you close the file and you have to leave the \"Add To EP Construction Library\" components in the GH file to ensure that the construction is written the next time that you open the file.  If you drag and drop an new HB_HB component onto the canvass, it overwrites the construction library in your memory so you have to make sure that any HB_HB component is in the back of the canvass (select it and hit \"Cntrl + B\" to send it to the back) and you might have to re-run the construction components to write them back to the memory.\n\nTo add constructions permanently to your library, you must add them to the userCustomEPLibrary.idf file in the C:\\ladybug folder (you might also have to add them to C:\\Users\\YourUserName\\AppData\\Roaming\\Ladybug).\n\nDaylight factor is something that Mostapha could speak more about.  Generally, I have found it to not be as useful or meaningful as Daylight Autonomy or even point-in-time Illuminance.  Just the ratio of indoor light to outdoor light doesn't tell me what it means for the visual comfort of a person.\n\nMostapha should correct me if I am wrong but I do not think that you can change the North for daylight simulations at present since Radiance does not seem to have a North input that you can change.  In the future, I think that Mostapha was planning to add a North input that would rotate all of your geometry before exporting it.  Again, I should emphasize that this last part is my inference.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "March 16, 2015 at 1:50pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nAlso, are there some documentation on Daylight Factor? The simulation works perfectly, it's a really great feature that it support multiple cores and has a quality setting! Priceless when trying out multiple designs. But I cant wrap my head around how to set north and location (or .epw)?\n\n\n\nDaylight factor is a geometrical calculation and won't change based on orientation or climate, that's why you don't have an input for north or epw file.\n\n\n\nFor the rest of daylight simulations (except annual) you can rotate the sky.\n\n\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "April 4, 2015 at 8:12pm", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nThanks for clarfying about the North, Mostapha.  I realize that you can rotate the CIE sky but not the others.\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "April 6, 2015 at 11:15am", "created_by": "ChrisMackey", "replies": []}]}], "id": "1236000"}