{"body": "\nIt's about studio project. I want to exam the advantages of green roof, but I don't know how to make the construction. Is there anyone know how to do it?\n", "attachments": [], "created_by_name": "Chenyang", "created_at": "March 10, 2015 at 2:01pm", "created_by": "Chenyang", "topic": "How to simulate below grade architecture? How to make a green roof in Honeybee?", "replies": [{"body": "\nHi Chenyang,\n\n\n\nIf you want to examine the energy benefits of a green roof in the interior then create a construction material with the same U value (and other values whose influence you want to test) as this of the green roof you are planning to use. If you want to elaborate more then try to create different layers with values reflecting the values of the layers that form your green roof. If you want to examine benefits related to the exterior environment like heat-islands or comfort then the simulation of a green roof must done with another level of detail which I don't really know. Regarding the interior though I have already used these solutions and work pretty accurately! \n\n\n\nHope it helps!\n\n\n\nTasos\n", "attachments": [], "created_by_name": "Anastasios Kokkos", "created_at": "March 10, 2015 at 5:54pm", "created_by": "AnastasiosKokkos", "replies": [{"body": "\nThank you\n", "attachments": [], "created_by_name": "Chenyang", "created_at": "March 10, 2015 at 8:00pm", "created_by": "Chenyang", "replies": []}, {"body": "\nHi Chenyang, I forwarded a couple of emails from EP discussions on modeling green roof to you. It would be great if you can share your final findings here. We may create a parametric Green Roof construction for Honeybee. Looks like there is also and example file in EnergyPlus example files for modeling Green roof.\n\n\n\nFor modeling a building with surfaces underground move your model to -z and Honeybee will assign ground as the boundary condition. Alternatively you can assign ground boundary condition to the surface manually.\n\n\n\n[<img class=\"align-center\" src=\"http://api.ning.com:80/files/ec4fSw8DDIxKIM6GHLkSPe92a8bYuGiiUnQMMewbEYcpwRSXos1-jUzGOL4XLk9szOKSUbyiASHMlVdkG27kwVmltysZDkXt/ground_boundaryCondition.png\" width=\"675\"/>](http://api.ning.com:80/files/ec4fSw8DDIxKIM6GHLkSPe92a8bYuGiiUnQMMewbEYcpwRSXos1-jUzGOL4XLk9szOKSUbyiASHMlVdkG27kwVmltysZDkXt/ground_boundaryCondition.png)\n\nHi Tasos, on that note, do you have an example of different layers of Green roof that you can share?\n\n\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "March 11, 2015 at 9:26pm", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nI was doing a very brief research on this a while back and I came across an interesting article:\n\n\n\nEnergy Simulation of vertical greenery systems, Wong et al. 2009, Energy and Buildings.\n\n\n\nIt was interesting for two reasons. One, it gave an example of U calculation of a typical green wall system (values could be similar for a green roof) which allows for the simulation of greenery over a wall or roof material. The system was something like the below (with the interesting r-values attached):\n\n\n\nLAYER                            R-value\n\nOutside air film\n\nTurfing                             0.360\n\nSubstrate (0.1m)             1.923\n\nAir gap (0.1m)                 \n\nWall\n\nInside air film\n\nThe second reasons was an equation they were using to calculate the shading coefficient of the greenery. In the literature, the leaf density is usually correlated with the shading coefficient of the greenery, which makes sense. This isn't as interesting for green roofs but it does provide a simple way to simulate green walls over fenestration. The correlation equation between LAI and SC was this one:\n\n\n\nShading coefficient (y) = -0.3043 x Leaf area index (x) + 0.8112\n\n\n\nI used this equation in a couple of examples to calculate the SC of vertical green walls.\n\n\n\nHope this is interesting.\n\n\n\nRegards,\n\nTheodore.\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "March 12, 2015 at 12:43am", "created_by": "TheodorosGalanos", "replies": []}, {"body": "\nHi Mostapha, all, \n\n\n\nNice feedback and very interesting topic!\n\n\n\nThe layers of a green roof depend always on the type (extensive, graveled, paved, intensive) that has to do with the type/size of vegetation and the substrates you need to use for each type and of course from the manufacturer. I am attaching [a link](http://www.knaufinsulation.co.uk/media/786396/2_5-green-roofs.pdf) to an example manufacturer where there is an explanation of potential layers and options. Also please check this [link](http://www.optigruen.de/fileadmin/contents/Prospekte/1_Planungsunterlage/Optigruen-Planungsunterlage.pdf) (in German) for an extremely elaborated breakdown of greenroof types and material used for each type. Finally this [report](http://www.fsec.ucf.edu/en/media/newsletters/brpost/winter2006/ASHRAEJeffSonne.pdf) from Ashrae Journal in 2006 that claims that Green roofs are expected to have various R values across their span from R-17 in the middle to R-38 at the edges. Based on the last paper I would say that is indeed very difficult to simulate one very precisely and I don't know if there is a good reason to do so if you know the layers and R-values of each layer and you want to evaluate potential benefits in an early design stage.\n\n\n\nUnfortunately I havent done any similar simulation in HB but I am planning to for the project I work on. I will probably stick to this level of detail though and will not try to elaborate further. I did simulate some green roofs with Ecotect some 3-4 years ago and the results were at least as expected!\n\nHope this helps! \n\n\n\nTasos  \n", "attachments": [], "created_by_name": "Anastasios Kokkos", "created_at": "March 12, 2015 at 5:16am", "created_by": "AnastasiosKokkos", "replies": []}, {"body": "\nChenyang,\n\nFor below-grade buildings, any Honeybee Zone or Surface that is below the Rhino Origin is assumed to be underground by default.  If you have a ground condition that is not planar, you can use the \"EPBC_\" input of the createHBSrfs component to set the condition of any honeybee surface to be next to the ground like so:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/YIi6je0KpJPElkT7Mm6Ptx-MX9TjN*uZbyu7bPDER2WM7PSR7h6LpElP-UoqQ439PH8j62FFBY72SsC*E-fujInIkX10nt2y/Ground.PNG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/YIi6je0KpJPElkT7Mm6Ptx-MX9TjN*uZbyu7bPDER2WM7PSR7h6LpElP-UoqQ439PH8j62FFBY72SsC*E-fujInIkX10nt2y/Ground.PNG)\n\nFor the green roof, Tasos's method is probably all that you really need to account for most of the effect that you would have with a green roof.  I should note that recent versions of EnergyPlus include a green roof material, which helps account for the fact that you get transpiration of the plants on the roof in hot conditions, creating a cooler surface than you would have otherwise.  In my experience, the use of this material has a negligible effect on the simulation when you already have a lot of insulation in the roof.  Sill you can account for it by putting in a custom text string for the green roof into the EnergyPlus Construction component like so:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/YIi6je0KpJM21C08zqcpSzWO4yOFyAfcIsUufhUq8kuvZwrVB4tHY87Dlex187IaMyRoJkX9D-1rYCmto*Wz3E9v9Dynnzti/RoofVeg.PNG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/YIi6je0KpJM21C08zqcpSzWO4yOFyAfcIsUufhUq8kuvZwrVB4tHY87Dlex187IaMyRoJkX9D-1rYCmto*Wz3E9v9Dynnzti/RoofVeg.PNG)\n\nYou can find a GH file attached that includes the green roof text string in a panel.\n\n-Chris\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1240874", "name": "Earth and Veg.gh"}], "created_by_name": "Chris Mackey", "created_at": "March 11, 2015 at 11:06pm", "created_by": "ChrisMackey", "replies": []}]}], "id": "1239909"}