{"body": "\nHi all,\n\n\n\nI am trying to create a house/unit with a semi-basement and an attic floor. I created (or tried to) Air Walls between the \"basement\" zone and the \"1st floor zone\" and between the \"3rd floor zone\" and the \"Attic floor\" as I named them. I then assign materials, schedules, properties etc but from the analyses I understand that the Air Walls are not considered Air walls but normal ceilings/floors. To double check I ran a Daylight analysis on the \"basement's\" surface to examine if I had any daylight. Unfortunately answer is none. I also check my E+ which also showed that there is no Air Walls in the analysis. I went through all available tuttorials and discussions and followed what is in the example files. Profoundly is something that I am missing and due to overtime (I am modelling 47 of them with different geometries)  I cannot see. \n\n\n\nI am attaching my gh definition in case someone can have a look and check what am I doing wrong or reading wrong or using wrong in there! \n\n\n\nFinally I am trying to use the **HB_Add InternalMass to Zone **component which needs to be re-instantiated every time I open my definition, else is giving a warning or error! \n\n\n\nThanks in advance!\n\n\n\nTasos\n\n\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1240237", "name": "AIRWALL_Construction_EP&RADanalysis.gh"}], "created_by_name": "Anastasios Kokkos", "created_at": "March 10, 2015 at 5:39pm", "created_by": "AnastasiosKokkos", "topic": "AirWalls E+ and Daylight Analysis (and InternalMass problem?)", "replies": [{"body": "\nHi Tasos,\n\nI'm not going to be very helpful here but ... you just have a lot of work to do to make it work right. Right now the file is pretty messy.\n\nYou need to work at HB_Surface label, rather than full zones in order to assign the constructions you want to the proper geometry. Hope this is clear to you.\n\nThe daylighting is not showing you what you want to see becouse it is not supposed to do so. The EP materials you assign are for (of course) E+ and not for Radiance. So if you don't see \"the light\" it doeasn't mean in this case, that the definitions are right or wrong for E+ (in this case they are wrong).\n\nSorry for this but there is so much work to do here that i don't have the time to be more helpful.\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "March 11, 2015 at 1:30am", "created_by": "AbrahamYezioro", "replies": [{"body": "\nHi Abraham,\n\n\n\nThank you for your reply. I think assigning the right material or not is not influencing the daylight analysis basic results. Does it? For the basement I am trying to get results for, the daylight penetration is 0 for any given height till I reach the defined \"Air Wall\" I tried to create. Once I exceed this height I get results back as expected and I follow step by step the examples for Air Wall definition that Chris has provided. Please if you do find the time to indicate the mistake on my definition I would be grateful! In any case thank you for the input! \n\n\n\nI am attaching again the gh definition and two screenshots. The first is the Daylight analysis for 1.45m offset from the basement level (so 5 cm under the defined \"Air Wall\") and the second is the same analysis for 1.55m offset from the basement level (so 5cm over the defined \"Air Wall\"). I think is obvious that the \"Air Wall\" is not considered as an \"Air Wall\" but as a normal geometry! \n\n\n\nBest\n\nTasos\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1240301", "name": "AIRWALL_Construction_EP&RADanalysis.gh"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1240302", "name": "1,55m offset from Basement level.png"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1240303", "name": "1,45m offset from Basement level.png"}], "created_by_name": "Anastasios Kokkos", "created_at": "March 11, 2015 at 7:47am", "created_by": "AnastasiosKokkos", "replies": []}, {"body": "\nHi Tasos,\n\nWhat i'm saying is that the AirWall E+ material definition is not good for radiance simulations (in this case your daylight tests). For this, you need to define RADMaterials. But this is not going to help anyway becouse those are two different definitions. In this sense your figures are misleading you, even though the conclusion is correct.\n\nFrom what i checked this morning you are assigning the same E+ materials (or constructions) to all the surfaces (walls, floors, etc). So that's why in my opinion you need to decompose the zones in their surfaces to enable the assignment of different materials.\n\nI don't know how much time you have to get this done, but if you have some, i would start with a simple case of, maybe, two floors (zones), where you can be sure the materials assignment is what you expect the to be.\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "March 11, 2015 at 8:07am", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nTasos,\n\nYou bring up an important issue that needed to be changed since the addition of air walls in the last release.  Mostapha had originally put in an option to \"removeInteriorWalls\" on the daylighting simulation component to help in cases where interior walls were just for the partitioning of thermal zones and not meant to be real solid walls.\n\nIn full implementation of air walls in the last release, I only changed how air walls worked for thermal simulations and did not change anything with regards to daylighting.  I have just changed this \"removeInteriorWalls\" on the daylighting simulation component to be \"removeAirWalls\" and I have set the default to remove air wall surfaces (you can change this by setting \"removeAirWalls\" to True).\n\nIf you sync with the github, you will be able to get the new daylighting simulation component that does this.\n\nAs for the Add InternalMass to Zone component, I am afraid that I do not understand the problem.  What is the warning message that you are getting each time?\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "March 11, 2015 at 10:01pm", "created_by": "ChrisMackey", "replies": []}]}, {"body": "\nJust a quick comment until I find some time to take a closer look to your file. Honeybee assigns AIRWALL only to walls. It was intentional not to let user set all adjacent surfaces to airwalls by mistake.\n\n-Mostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "March 11, 2015 at 9:11pm", "created_by": "MostaphaSadeghipour", "replies": [{"body": "\nHi all,\n\n\n\nThanks a lot for your replies! I tried the new Components! They now seem to work fine. The \"Solve Adjacencies\" component assigns Air Wall to both Walls and Floors now (which I think would be great to have as an option with the assignment of an integer as input, for example: \"1\" : Remove/assign to Horizontal surfaces \"2\" : Remove /assign to Vertical surfaces \"3\" : Remove/assign to both or something similar). As for the Daylight component, indeed you can now \"exportAirWalls\" or not, is this right Chris? Or you meant another component? In any case if I set this to False I get the expected results! Also there, a small note, the default is set to True although at the description says that the default is set to False. Non-sense detail but I just noticed!\n\n\n\nFinally for the \"Add InternalMass\" component the error I am getting whenever I re-open the gh file is that the Index is out of range which probably implies that the component keeps the information of the surfaces stored even if you run it again or something similar? And the warning I get is that some geometries are not Completely inside the zones which is also fixed once I drag n drop a new component on the canvas (for this one I am really puzzled!)! in Any case a new component solves both issues but still! \n\n\n\nLast question probably not for this topic but very close. If I set the \"IsCondintioned\" from the Building2Masses component to True and then I set my conditions manually for each zone, is it overwritten or not? Or I should keep it to False and then assign condition my zones?\n\n\n\nThanks again for all your input!\n\n\n\nTasos \n", "attachments": [], "created_by_name": "Anastasios Kokkos", "created_at": "March 12, 2015 at 5:55am", "created_by": "AnastasiosKokkos", "replies": []}, {"body": "\nTasos,\n\nI'm glad the components are working well for you.\n\nYou can set the walls to air walls and the floors/ceilings to be a different construction by using two solve adjacencies components in tandem and a \"separateByFloor\" component like so:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/E-eiwesnIS10-2IgQdjp*kFAPHy3gfC4gw6LuCd19tLReFfQx*qnr3IDvu5cz0bTtyyY*V8UBW5F7HPucSzY6MR77Cpv4nBC/SolveAdjacenciesInTandem.PNG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/E-eiwesnIS10-2IgQdjp*kFAPHy3gfC4gw6LuCd19tLReFfQx*qnr3IDvu5cz0bTtyyY*V8UBW5F7HPucSzY6MR77Cpv4nBC/SolveAdjacenciesInTandem.PNG)\n\nI prefer this method since it seems to be more in the spirit of grasshopper component-based workflows and allows you to change the constructions of the floors/ceilings with the second solve adjacency component.\n\nThanks for finding the bug in the default ExportAirWalls.  I just uploaded a fixed version to the github.\n\nThe warning that the \"Add Internal Mass\" component is giving you is telling you that you should make sure that each of your individual surfaces lies completely inside a zone.  If a surface spans between two or more zones, the component doesn't know which zone to assign the surface to.  The component is not copying anything to memory or storing any information.  What might be happening is, if you are changing the tolerance of your Rhino model or have internalized geometry created with a different Rhino model tolerance, the function that calculates whether the surfaces are inside a zone does not use the right tolerance.  I also know that this \"surface inside brep\" function was apparently buggy on McNeel's end and that I should re-write this function soon.  If you upload your file with the issue, I will try to improve it.\n\nI am not sure which components you are using but the \"IsConditioned\" will be overwritten by a more downstream component that has the \"IsConditioned\" input.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "March 16, 2015 at 2:14pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nHello\n\n\n\nI have a similar case to Tasos, and I want to know what is the best way to model Air Wall for daylighting simulation. Is the best way to assign a glass with 100% transmittance to those special walls?\n\nWhat is the most efficient way to select those air walls (which do not exist and I used them to separate thermal zones) in a model with multiple zones? I have just created one floor and my goal is to create 6 floors finally. \n\n\n\nThanks for your help\n\nLadan\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1644430", "name": "CCC_Honeybee_Gridbased_22_11_16.gh"}], "created_by_name": "Ladan GD", "created_at": "November 22, 2016 at 1:10pm", "created_by": "LillyGD", "replies": []}, {"body": "\nIf the construction is set to AIR WALL then just set exportAirWalls_ input in daylighting component to False not to export them to Radiance.\n\n\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/21oynV1A7zIyi7r9-nCUGV6EN4ailMRYUaqXqS4rbmID9MioWfmNzmQKZU0eMyAgA8nP5diY9XPT*TVdjwOgtNViDa3n*eU9/airwalls.png?width=721\" width=\"721\"/>](http://api.ning.com:80/files/21oynV1A7zIyi7r9-nCUGV6EN4ailMRYUaqXqS4rbmID9MioWfmNzmQKZU0eMyAgA8nP5diY9XPT*TVdjwOgtNViDa3n*eU9/airwalls.png)\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "November 22, 2016 at 1:30pm", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nMostapha,\n\n\n\nWould you please also tell me how I can pick interior surfaces and change them to airwalls? No all my interior surfaces are airwalls and I don't know what is the efficient way to find those walls?\n\n\n\nThanks \n\nLadan\n", "attachments": [], "created_by_name": "Ladan GD", "created_at": "November 23, 2016 at 10:48am", "created_by": "LillyGD", "replies": []}, {"body": "\nHi Ladan,\n\nI believe you already know who to select those walls that you want to turn into interior walls. Once you do that, you can use Honeybee_createHBSrfs to turn it into an airwall. The resulting HBSurface will have to be connected to Honeybee_createHBZones component eventually.\n\nDevang\n", "attachments": [], "created_by_name": "Devang Chauhan", "created_at": "November 23, 2016 at 10:54am", "created_by": "devang", "replies": []}, {"body": "\nThank you I'll try that and let you know if I had any further issues. I appreciate your help.\n\n\n\nLadan\n", "attachments": [], "created_by_name": "Ladan GD", "created_at": "November 23, 2016 at 3:49pm", "created_by": "LillyGD", "replies": []}]}]}