{"body": "\nHi,\n\n\n\nI have a model where I need to add custom glazing and properties to some zones.\n\n\n\nCurrent process: I take BREPs that I turn into HB Surfaces, then I add the glazing BREP to get HB Surfaces with Glazing, and ultimately I get HB Zones.\n\n\n\nProblem: I'd like to solve adjacencies between these zones.\n\n\n\nBut the Honeybee_IntersectMasses component, as stated in the code: \"only works with raw Rhino brep geometry and not HBZones.  Use this component before you turn your breps into HBZones\".\n\n\n\nSo considering I have already turned my raw Rhino geometry to HBZones, is it possible to intersect them then?\n\n\n\nOr should I do the intersection using all my initial surface BREPs, and explode that, select to find the relevant surfaces and start the \"Current process\" stated above again?\n\nIf so, is there an easy way to select the relevant surfaces after the intersection process?\n\n\n\nI would like to avoid running the intersection tool, baking the geometry in Rhino and start the process, and this is not my final design and therefore I'd like it to stay linked to Rhino if possible.\n\n\n\nThanks for any help you can provide,\n\nJulien\n\n\n\n\n", "attachments": [], "created_by_name": "Julien Marrec", "created_at": "March 23, 2015 at 4:57am", "created_by": "JulienMarrec", "topic": "Intersect when creating Zones from individual surfaces", "replies": [{"body": "\nHave you tried the SolveAdjacencies component?\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "March 23, 2015 at 7:58am", "created_by": "AbrahamYezioro", "replies": [{"body": "\nAs far as I can tell, the SolveAdjacencies component doesn't intersect. It requires pre-intersected geometry to match between zones, doesn't it?\n\n\n\n\n\n\n\n\n", "attachments": [], "created_by_name": "Julien Marrec", "created_at": "March 23, 2015 at 8:08am", "created_by": "JulienMarrec", "replies": []}, {"body": "\nHmmm ... You are right.\n\n\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "March 23, 2015 at 1:54pm", "created_by": "AbrahamYezioro", "replies": []}, {"body": "", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "March 24, 2015 at 8:58am", "created_by": "ChrisMackey", "replies": []}]}, {"body": "\nHi Julien, I'm not sure if I fully understand your question but here is an example file based on my understanding.\n\n\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/qhmaNpdkdBsxTcCxImDK3OJuW3EEB36GXTEFVvGY3b9SzVPz08qD78J1QZ9zDlLcpy1uCCHEsDwGJpR4eXTvc9rTX2mc2BtF/addCustomGlazing.png?width=721\" width=\"721\"/>](http://api.ning.com:80/files/qhmaNpdkdBsxTcCxImDK3OJuW3EEB36GXTEFVvGY3b9SzVPz08qD78J1QZ9zDlLcpy1uCCHEsDwGJpR4eXTvc9rTX2mc2BtF/addCustomGlazing.png)\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1249289", "name": "addCustomGlazing.gh"}], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "March 24, 2015 at 9:19am", "created_by": "MostaphaSadeghipour", "replies": [{"body": "\nThat is what I meant yes. I had too many surface to do this, it requires adding way too much modules and it's hard to find the correct item (is there an actual way aside from trial and error?).\n\n\n\nSo I did like Chris said, I intersected, baked, and did the whole process after that. Hopefully I won't regret it too much once I had to change something :)\n\n\n\nThanks to you both.\n", "attachments": [], "created_by_name": "Julien Marrec", "created_at": "March 24, 2015 at 9:35am", "created_by": "JulienMarrec", "replies": []}, {"body": "\nJulien,\n\nI just re-read your original comment and my response and realize that I was not so helpful.  I am sorry about that.\n\nI am afraid that you are going to have to use trial and error to find the surface that you want glazing on if your glazing surfaces are custom with the AddHBGlz component.  If you can get the window geometry that you want with the Glazing Based On Ratio component, this component will only create windows on surfaces that are exterior so you could build up your zones, solve adjacencies on them, and then run them through the glazing based on ratio component to ensure that only the non-intersected surfaces get glazing.\n\nI hope that this helps,\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "March 31, 2015 at 5:49pm", "created_by": "ChrisMackey", "replies": []}]}]}