{"body": "\nGreetings everyone,\n\n\n\nMy name is Nita and I am working on my masters thesis using LB and HB to optimize parametric external shades(integrated to the facade) for an apartment tower in Germany.\n\nMost of the sources and papers I found are using either GenOpt or GenerativeComponents etc. for Multi-objective optimizations, but few of them use Grasshopper to find the optimum values for multiple parameters combination.\n\nI used Galapagos so far only for simple solutions, mostly connected to solar radiation, PVs, external fixed shades etc.But I always used it with one value and never connected it with Energy Plus, Diva or LB at the same time.\n\nThe Galapagos fitness input when contain multiple parameters is uses the average, this however doesn't lead to the best or optimum solution I believe.\n\nThe approach I was planning to use was to conduct parametric study, combine parameters one by one and then 'find' the optimal solution(s) by combining best cases.Considering the large number and range of iterations I assumed the process will be time consuming and decided to try the MOO.\n\nWhat I aim to include several parameters and variations which are most crucial when designing(optimizing) an energy efficient facade while optimizing the geometry of the shades! \n\nAnd I am aware of the problems on various scales a design optimization might raise..and its scary :) \n\nThe results I want to achieve are to fulfill a certain criteria for energy use(in kWa/sqm/a), visual comfort(in DF) and thermal comfort(in PMv and tempratures).\n\n \n\n- My question is does anyone of you know how can I link and design this definition and the GA optimization framework ? \n\n\n\nThank you for reading :D\n\nyour help will be very much appreciated...\n\n\n\nCheers,\n\nNita\n\np.s. So far I have geometries and all definitions needed for energy simulation, comfort and daylighting...I also have no idea if gene pool, or goat optimizer can be used somehow :(.\n\n\n", "attachments": [], "created_by_name": "Nitë", "created_at": "March 31, 2015 at 7:23am", "created_by": "Nita", "topic": "Multi Objective Optimization - LB+HB+Galapagos", "replies": [{"body": "\nNita,\n\nYou should have a look at Octopus. This is a Multi-Objective optimization in GH. Since i see you started to use some other optimization plugins i suppose you'll manage with Octopus.\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "March 31, 2015 at 7:45am", "created_by": "AbrahamYezioro", "replies": [{"body": "\nMany thanks Abraham.\n\nI was not informed that such a plugin exist (blushing face).Will definitely try it asap,and possibly return back with more questions :(\n", "attachments": [], "created_by_name": "Nitë", "created_at": "March 31, 2015 at 8:01am", "created_by": "Nita", "replies": []}]}, {"body": "\nNita,\n\nAs I understand it, Galapagos requires a single number input to guide the optimization. The trick is developing a fitness function that balances the multiple objective parameters into one value. I have found that this is tough because energy , glare, view quality, daylight autonomy and aesthetics cannot be directly compared. How many units of view are worth a 10% reduction in energy? Somewhere along the line the user needs to make a subjective call on how to balance these objectives, which throws off the accuracy of any optimization.\n\nAs far as the GH code in concerned, I think you would needs to weigh each objective with coefficients and sum them into one final number. This would be a custom script that normalizes all outputs, multiplies by a weighting factor, then sums them all together.\n\n \n\nI'm curious how others get past the inability of optimization scripts to truly balance dissimilar objectives. I think the solution lies in avoiding optimization altogether. I ran into the idea of Pareto efficiencies while exploring a similar question. Take a look here:\n\n[http://en.wikipedia.org/wiki/Pareto_efficiency](http://en.wikipedia.org/wiki/Pareto_efficiency)\n\nIf you iterate through a variety of options (possibly using Galapagos to run fewer options) and then review the entire landscape of solutions, you may be able to find a Pareto frontier that identifies many solutions that maximize most of your objectives. You can also use something like Pollinator to better navigate the solution landscape.\n\n[http://www.grasshopper3d.com/group/ladybug/forum/topics/new-develop...](http://www.grasshopper3d.com/group/ladybug/forum/topics/new-development-pollination-for-exploring-multi-dimensional-data)\n\n \n\nI've struggled with this issue for a while and was hoping someone would have a better answer. I'm all ears.\n\n-Leland\n", "attachments": [], "created_by_name": "Leland Curtis", "created_at": "March 31, 2015 at 7:54am", "created_by": "LelandCurtis", "replies": [{"body": "\nLeland,\n\nNot giving a better answer, but without saying this is the best, Octopus creates a pareto front rather than giving a \"best\" solution. So it allows the personal flavors for choosing solutions, granting it is in the front.\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "March 31, 2015 at 8:30am", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nAbraham,\n\n\n\nI didn't see your post when I wrote mine. Octopus sounds like what I've been looking for. Thanks for sharing!\n", "attachments": [], "created_by_name": "Leland Curtis", "created_at": "March 31, 2015 at 8:41am", "created_by": "LelandCurtis", "replies": []}, {"body": "\nThank you Leland.\n\nSeems Octopus will serve us well.\n\n\n\nCheers,\n\nNita\n", "attachments": [], "created_by_name": "Nitë", "created_at": "April 8, 2015 at 6:54am", "created_by": "Nita", "replies": []}]}, {"body": "\nHi, \n\n\n\nIt is not multi-objective but nice to start with it :)\n\n\n\n[http://www.grasshopper3d.com/profiles/blogs/the-solar-dance](http://www.grasshopper3d.com/profiles/blogs/the-solar-dance)\n\n\n", "attachments": [], "created_by_name": "Igor Mitrić Lavovski", "created_at": "March 31, 2015 at 2:01pm", "created_by": "Igor425", "replies": [{"body": "\nThank you Igor.\n", "attachments": [], "created_by_name": "Nitë", "created_at": "April 8, 2015 at 6:54am", "created_by": "Nita", "replies": []}]}]}