{"body": "\nHello everybody, \n\nI am running lately some studies about external glare/veiling Glare.\n\nI found really difficult to play with Radiance glass material because cannot input a  selectivity to it. how can I sort out this problem?\n\nI used 2 different glass transmittance and i get higher luminance value on the external facade for the glass with higher transmittance, which does not make much sense to me.\n\nAny hint on that?\n\nI added a picture as well to show which is the effect that i am looking to replicate.\n\nThanks!\n\nAmedeo\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1254317", "name": "photo.JPG"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1254318", "name": "GlassTramittance0.8.jpg"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1254319", "name": "Glasstrasmittance0.6.jpg"}], "created_by_name": "amedeo scofone", "created_at": "April 1, 2015 at 5:26am", "created_by": "amedeoscofone", "topic": "Reflective Glass in Radiance", "replies": [{"body": "\nHi Amadeo\n\nI'm not an expert on this but from what I understand reflections on glass are very dependent on context. In your case the images out of Radiance has no context what so ever so it s normal that no reflection is displayed by the software. Perhaps you could model some context bldgs. as well as some interior geometry and compare the results. Also a more oblique POV will give  a more pronounced Fresnel effect therefore more reflections. From what I can see in your example image the glass unit seams to have quite amount of reflections, if your glare study is for an exterior POV then a mirror like material will give better results\n\nGood luck\n\nclaudio\n", "attachments": [], "created_by_name": "Claudio", "created_at": "April 1, 2015 at 7:09pm", "created_by": "Claudio", "replies": []}, {"body": "\nHi Amadeo,\n\nI'm not sure if I can fully understand the question but I hope Caludio's answer help. Generally speaking if you are trying to compare the luminance values for two renders you can use FalseColor images.\n\n-Mostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "April 4, 2015 at 11:33am", "created_by": "MostaphaSadeghipour", "replies": [{"body": "\nAmadeo,\n\nI also cannot tell what the exact issue is and what the images are pictures of.\n\nI can say that, if you are more interested in modeling the reflective behavior of glass in the outdoors rather than the transmittance to the interior, you might be better off using a mirror material as the default glass Radiance material does not really have speculatirty to it.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "April 6, 2015 at 9:08pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nHi everybody! thanks for your replies! Sorry for the delay in replying but I've been on leave.\n\nMy main interest is actually in identifying Glare caused by a glazed  facades given a context, so i would probably go for a mirror material then. It is a bit strange though because I noticed that if you use a cloudy sky you will see reflections on the glass, but not for the same condition run with a sunny sky.\n\nThanks!\n\nbye\n", "attachments": [], "created_by_name": "amedeo scofone", "created_at": "April 8, 2015 at 3:59am", "created_by": "amedeoscofone", "replies": []}]}, {"body": "\nHello guys! do you have any idea how to evaluate Disability glare with radiance? I bumped into [this](http://content.yudu.com/Library/A2ldt5/MondoArcDecJan201314/resources/127.htm) and I cannot understand how they calculate the Illuminance falling on the eye based on Luminance images.\n\nany thoughts on that? The only thing i thought about is a different post processing of evalglare but I am not so sure about it.\n\nBest\n", "attachments": [], "created_by_name": "amedeo scofone", "created_at": "July 8, 2015 at 4:13am", "created_by": "amedeoscofone", "replies": [{"body": "\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/ZNt8FIknlRNIXPsmVrWBv9ea4hUAoXbOAEyLMG0SeDAoFVzDggxEc8PYVeVgNztp5URGfbD0lHq7vdCu7ZflwWo*brBHjfYi/glareAnalysis.jpg?width=721\" width=\"721\"/>](http://api.ning.com:80/files/ZNt8FIknlRNIXPsmVrWBv9ea4hUAoXbOAEyLMG0SeDAoFVzDggxEc8PYVeVgNztp5URGfbD0lHq7vdCu7ZflwWo*brBHjfYi/glareAnalysis.jpg)Hi Am\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "July 8, 2015 at 11:20am", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nHi Amedeo,\n\nYou can use glare analysis component to run glare analysis.\n\nYou can set the image-based analysis recipe to render luminance values instead of illuminance and use that for the glare analysis.\n\nWe have an example for glare analysis in Honeybee examples where you can see the whole process.\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "July 8, 2015 at 11:21am", "created_by": "MostaphaSadeghipour", "replies": []}]}]}