{"body": "\nHello,\n\n\n\nI need to use a grid of sensor points with a particular tree structure. I created then a mesh based on these points and used it as input in Honeybee. I would like then to unflatten the Honeybee output results using the original points as a guide. However the testPts output does not correspond to the mesh vertices but rather to the center of the mesh faces. Is there a way to use the vertices of the input mesh as sensor points?\n\n\n\nThanks,\n\n\n\nGiuseppe\n", "attachments": [], "created_by_name": "Giuseppe Peronato", "created_at": "April 9, 2015 at 1:32am", "created_by": "GiuseppePeronato", "topic": "Custom sensor points", "replies": [{"body": "\nIf you are using the Generate_test_points from Honeybee, this generates points based upon mesh face centres.\n\nYou could make your own mesh to feed into the analysis recipes instead. Try deconstructing the mesh and feeding in the vertices into test points.\n", "attachments": [], "created_by_name": "James Ramsden", "created_at": "April 9, 2015 at 4:28am", "created_by": "JamesRamsden", "replies": [{"body": "\nThanks. This works great for Honeybee.\n\nUnfortunately, I actually intended to use the Environmental Analysis tools in Ladybug (sorry for the mistake in my former post). I would like to use the SunlightHoursAnalysis component but it only accepts Mesh or Brep input, not directly the test points.\n", "attachments": [], "created_by_name": "Giuseppe Peronato", "created_at": "April 9, 2015 at 4:55am", "created_by": "GiuseppePeronato", "replies": []}, {"body": "\nHi Giuseppe, There are workarounds for this issue. If you search the group you should be able to find some solutions. Regardless can you send a simple example and why do you want the values to be calculated for mesh vertices and not mesh faces?\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "April 9, 2015 at 8:27am", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nHi Mostapha,<br/>thank you for your reply.<br/>I would like to keep the data structure I created with the DivideSurface component. This is probably not the optimal solution, but I want to organize the test points by lines (along either u or v direction). My data tree is then structured as {building;surface;line).<br/>I tried to create a mesh for each surface but the mesh faces cannot be unflattened as the vertices.<br/>I attach the file. I hope it is clear.<br/>Any help would be much appreciated.\n\nGiuseppe\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1259924", "name": "testpoints_line.gh"}], "created_by_name": "Giuseppe Peronato", "created_at": "April 9, 2015 at 9:22am", "created_by": "GiuseppePeronato", "replies": []}, {"body": "\nHi Giuseppe,\n\nI checked your file and I admit that I still couldn't understand what are you exactly trying to do but two comments in general. 1. Output of sunlight hours component is already grafted based on input mesh faces so you should be able to match the data. 2. You can use Grasshopper's unflatten component to graft the data of a faltten list based on a grafted reference input.\n\nHope it helps,\n\nMostapha \n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "April 11, 2015 at 9:25am", "created_by": "MostaphaSadeghipour", "replies": []}]}]}