{"body": "\nHey Guys,\n\n\n\nI have a typical floor plan that we are trying to analyze to determine different glazing ECMs (glazing type and WWR). I'm noticing that the results from the Ideal Air Loads runs are showing very high heating demand (~350kWh/sm/year for example with a 2009 IECC glazing construction), also with the cooling demand high as well but not as equally outrageous (~50 kWh/sm/year). We were expecting something in the 25-30 kWh/sm/year range for heating and cooling loads each.  I've double checked all inputs and they seem to be legit. Any idea for these high loads? So perplexed.\n\nI was hoping to be able to add a mechanical system to the model to get actual energy demand, not just the load.  When I used the component to change the mechanical system to one of the other off the shelf systems, the total thermal energy demand was not affected at all.  Was this because I did not have an air side and a plant side component plugged into the mech override component? What I was hoping to be able to do was to set a base off the shelf mech system, similar to the E+ example files that come with the E+ download.  Am I missing something?\n\nAlso, it seemed to consistently get errors when reading the surface data from the glazing.  I was unable to determine if this was causing the heating error.\n\nWe've modeled all of the zones around the perimeter as conditioned, and the core and plenum as unconditioned.  The floors are modeled as adiabatic.  Attached is the model and the gh script.   \n\n\n\nAny help would be awesome. Thanks, Patrick\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1263295", "name": "Resi Floor Plate Study.7z"}], "created_by_name": "Patrick Keeney", "created_at": "April 14, 2015 at 7:11pm", "created_by": "PatrickKeeney", "topic": "very high heating demand", "replies": [{"body": "\nPatrick --\n\nI suspect the culprit is some surface normal issues. Look at the error file generated by E+ to see if the window or wall geometry are facing each other (not desirable) and not outwards as they should be (you can also check the orientation in grasshopper using Vector Display).  You will need to flip their orientation before E+ is able to treat these surfaces as proper windows/walls. Once these surfaces are oriented outwards you should see changes in energy use as E+ will be able to recognize the window geometry.\n\n--J\n", "attachments": [], "created_by_name": "JPE", "created_at": "April 15, 2015 at 8:17pm", "created_by": "JPE", "replies": [{"body": "\nThanks J for your response.\n\nI had a look at your suggestions.  Several notes:\n\n1. I switched the simulation from \"Full Interior &amp; Exterior\" solar distribution to run on \"Full Exterior\" solar distribution.  This switch did get all of the severe E+ errors to disappear.  Also, it initially got the glazing surface results to read.  Then I ran the simulation a second time and the results disappeared again.  Any idea why the surface results disappear the second go round?  \n\n2.  As for the surface normals, the normals of the surfaces coming out of the \"Glazing Based on Ratio\" component do seem to be oriented both in the correct direction, both oriented outward. See the image below.  I've also tested it using the Child Surface method with the \"addHBglz\" component, and all of those surfaces are also correctly oriented outward.  When I rerun both simulations, the surface data still does not read surface results for the glazing (it does read the surface results from opaque portion of the wall).   \n\n[<img class=\"align-left\" height=\"308\" src=\"http://api.ning.com:80/files/rhqcRsJl7aRfhBxK**a1nS13OkYE6YorU-0gWwSdFVaIqAjE-10rwfKo*maFj*4LOb78H*hU2muxSB1Ia1xe3tKuEvs-2Jcg/GlazingSurfaceNormals.JPG?width=721\" width=\"607\"/>](http://api.ning.com:80/files/rhqcRsJl7aRfhBxK**a1nS13OkYE6YorU-0gWwSdFVaIqAjE-10rwfKo*maFj*4LOb78H*hU2muxSB1Ia1xe3tKuEvs-2Jcg/GlazingSurfaceNormals.JPG)\n\n\n\n3. 3.Lastly, any suggests for getting an off the shelf mech system hooked up so the results will read as End Use Energy Consumption, rather than the Ideal Air Loads?  Any suggestions would be great!\n\nThanks for your help.\n", "attachments": [], "created_by_name": "Patrick Keeney", "created_at": "April 17, 2015 at 3:26pm", "created_by": "PatrickKeeney", "replies": []}, {"body": "\n1. If you have concave surface EP won't be able to run Full interior and exterior analysis.\n\n2. Honeybee should take care of normal directions for you (evenif the input is in the wrong direction), if it doesn't that can be a bug. Can you upload a simple example where this fails and I will take a closer look.\n\n3. Have you tried OpenStudio components? There you can set-up couple of default systems. Here are the videos on how to get started:\n\n<iframe _origwidth=\"560\" frameborder=\"0\" height=\"267\" src=\"https://www.youtube.com/embed/59dYNzKzk7Y?list=PLEN8tvi60spMx7iTZ1N30iRJ8YnobdGsE&amp;wmode=opaque\" width=\"475\"></iframe>\n\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "April 19, 2015 at 7:09am", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nThanks Mostapha. These are very helpful.\n\n\n\nThis might be a very simple question, but I followed along w/ the tutorial and get an error from the \"Honeybee- Export to Open Studio\" component, stating Solution Exception: fuel type.  I can't seem to find any components to input a fuel type. Am I missing something?  Thanks. \n\nAny help would be great.  Thanks. \n", "attachments": [], "created_by_name": "Patrick Keeney", "created_at": "April 23, 2015 at 10:45am", "created_by": "PatrickKeeney", "replies": []}, {"body": "\nPatrick,\n\nDo you still have the issue with the latest version? If you can send me an example file I should be able to get it fixed for you.\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "July 13, 2015 at 8:09am", "created_by": "MostaphaSadeghipour", "replies": []}]}]}