{"body": "\nHi everyone,\n\n\n\nI haven't been active in the forum for a while. It seems that a lot of updates have happened to the tools which is amazing.\n\n\n\nI am wondering if someone can help me with some new errors I am having from Energy Plus.\n\n\n\nI made a simple building with around 20 zones. I spent a lot of time in drawing this so it should be ok when it comes to tolerance issues. In any case it is MUCH better than other models I've simulated.\n\n<br/>However I get around 3700 lines on my output and a total of 73 warnings and 38 severe errors.\n\n\n\nThe warnings have to do with the message \"one of the surfaces has less than 3 identical coordinates and has been removed\". The errors are various, ranging from FenestrationSurface erros due to invalid building surfaces, adiabatic surfaces cannot have windows or doors (even though I believe I did not set any surfaces as adiabatic), adjacent surface not found, etc. I attach my file and by running the simulation you can see the range of errors.\n\n\n\nI am still running EP 8.1 btw, should I update to the new version?\n\n\n\nI will start looking into my open zones. It is true I have some walls with holes (more like ventilation shafts) but I thought it would be ok. Also, I don't know for the life of me why I get surfaces with such a small area or why surfaces are removed. I tried to play with tolerance, and the above errors are with minimum value of 0.1. Many more come with 0.001.\n\n\n\nAny insight would be appreciated. Also, do you think it would be possible to have some kind of component that can pinpoint the surfaces that give the error. Atm I can only see hexa names and not sure how I can select them.\n\n\n\nThank you very much in advance!\n\n\n\nKind regards,<br/>Theodore.\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1266750", "name": "TicketingAdmin.gh"}], "created_by_name": "Theodoros Galanos", "created_at": "April 18, 2015 at 11:25pm", "created_by": "TheodorosGalanos", "topic": "Energy Simulation errors", "replies": [{"body": "\nSeems I overestimated both my design skills and eyesight. Had an invalid brep. Going over the design now, managed to close the breps (most of them). I now get an error while solving adjacencies \"number of windows doesnt match between (hexa name)  and hexa name surfaces\".\n\n\n\nI am still getting the severe error of adiabatic surfaces. Is there something I am missing since the only place I see where I can assign adiabatic is in solve adjacencies.\n\n\n\nThanks in advance.\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "April 19, 2015 at 12:34am", "created_by": "TheodorosGalanos", "replies": [{"body": "\nAttaching the new file.\n\n\n\nThanks.\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1266850", "name": "TicketingAdmin.gh"}], "created_by_name": "Theodoros Galanos", "created_at": "April 19, 2015 at 12:53am", "created_by": "TheodorosGalanos", "replies": []}]}, {"body": "\nTheodore,\n\nYour issues are not related to E+'s version. No need to update it.\n\nThough, unless Chris identifies the tolerance issue i would suggest to build zone by zone and see what you get. This way you can be sure you are doing fine.\n\nThe model is so complicated to check that i can't dedicate much more time to see. Also use the HB_decomposeByType so you can visualize if you are getting what you think you should get.\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "April 19, 2015 at 1:08am", "created_by": "AbrahamYezioro", "replies": [{"body": "\nThanks Abraham.\n\n\n\nAt least one issue is out.\n\n\n\nI managed to clean the file a bit. Not the structure unfortunately but the geometry variables. I cleared internal and external walls appropriately. In the preview component though I can see three main issues:\n\n1. 3 Window surfaces are listed as internal windows even though they are on external surfaces. I don't know how I can define a window as internal in honeybee. Tried changing the normals but didn't work. This is an EP option so is the idf editor the only way?\n\n\n\n2. 2 surfaces show up on external surfaces even though they are internal.\n\n\n\n3. A whole zone (the grouped zone on the left, corridor) is not previewed. It is the only zone I cannot manage to close. And I am not sure why it is open. In the preview there is a weird thing however. The wirefreme looks bended somehow.\n\n\n\nDespite all the above, the same errors keep coming up. Specifically the adiabatic surfaces cannot have windows or openings I do not understand. I realize that a surface like \"ground\", \"ceiling\", or \"floor\" cannot have openings but I checked and all of them are wall surfaces. And finall the outside boundary condition error. I'm stomped. And I can't but help feeling it's some stupid mistake I made and I can't see.\n\n\n\nThank you all in advance.\n\n\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1266857", "name": "TicketingAdmin.gh"}], "created_by_name": "Theodoros Galanos", "created_at": "April 19, 2015 at 2:12am", "created_by": "TheodorosGalanos", "replies": []}, {"body": "\nSee attached.\n\nLook for RED groups. There i've found issues that don't know how to solve.\n\nHard to see ... but you'll manage, i'm sure.\n\n-A.\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1267015", "name": "TicketingAdmin_AY.gh"}], "created_by_name": "Abraham Yezioro", "created_at": "April 19, 2015 at 4:24am", "created_by": "AbrahamYezioro", "replies": []}]}], "id": "1266751"}