{"body": "\nHey guys,\n\n\n\nI am new to honeybee and have tried to model a house with 2 energy zones, one zone for roof area, and one zone for the area below the roof.\n\nI would like to calculate the zone energy use for those 2 zones.\n\n\n\nHowever, I simply can not get the simulation going correctly. Zones always goes wrong and end up in BREPS instead of 2 zones.\n\n\n\nI wonder if the way I have modeled the house went wrong. I followed the Chris Mackey tutorial, and maybe there is something I missed.\n\n\n\nWould be really really grateful if anyone can help me out, cause I am really almost desperate...\n\n\n\nMany many thanks in advance...:D\n", "attachments": [], "created_by_name": "AngelXU", "created_at": "April 19, 2015 at 2:12pm in ", "created_by": "AngelXU", "topic": "Zone Energy Use Problem...Desperate...", "replies": [{"body": "\nHi Angel, You need to flatten _HBSurfaces input when you are using createHBZone. Also you should break-down your model and define each floor as a separate zone (similar to Chris's videos).\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/HMrNkLH2ZKMEngg4AnJ0D0yKUI656L5dh*ZPBVju8sy3eVq4PL2gH-eLF0CJVxX9EIUbTyyuMvHcAPmmxdmhGhwQdBe*7WgD/flattenInputSurfaces.png?width=721\" width=\"721\"/>](http://api.ning.com:80/files/HMrNkLH2ZKMEngg4AnJ0D0yKUI656L5dh*ZPBVju8sy3eVq4PL2gH-eLF0CJVxX9EIUbTyyuMvHcAPmmxdmhGhwQdBe*7WgD/flattenInputSurfaces.png)\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "April 19, 2015 at 4:58pm", "created_by": "MostaphaSadeghipour", "replies": [{"body": "\nMostapha and Angel,\n\nI have just decided that the HBSurfaces input should be flattened by default since I have found that it is rare that I have a case where I do not want to do this.  Also the HBSrfs are usually coming as a grafted list already:\n\n[https://github.com/mostaphaRoudsari/Honeybee/commit/dfaad5d7d059f8e...](https://github.com/mostaphaRoudsari/Honeybee/commit/dfaad5d7d059f8ef2bb03547ed314d849667782d)\n\nI hope this helps some users out in the future.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "April 20, 2015 at 11:48pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nHi Angel,\n\nSorry for responding so late.  I updated your GH file to the latest version, which gives you a better summary of the error report.  My diagnosis is that all of the roof geometry is running though E+ but the \"ImportIDF\" component is having trouble rebuilding the geometry from the IDF because the Rhinocommon \"JoinBreps\" function is really buggy (It's an issue on McNeel's end that goes back to the fact that rhino is a surface modeler and does not do operations of joining things into solids well).\n\nMore important than the ImportIDF is that the solar distribution function is not running correctly in your file and you can see this as a comment bubble in the attached GH file.  You should break up the roof into a few zones that are not concave if you want this to be correct.  Lastly, you forgot to solve adjacencies on you zones so I added that in.\n\n-Chris\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1278873", "name": "HouseSimulationCWM.gh"}], "created_by_name": "Chris Mackey", "created_at": "May 2, 2015 at 12:46pm", "created_by": "ChrisMackey", "replies": []}]}]}