{"body": "\nCould acoustic simulations be a cool thing to have in grasshopper, maybe a part of Ladybug/Honeybee? I think so!\n\nI have tried Pachyderm ([http://www.food4rhino.com/project/pachyderm?etx)](http://www.food4rhino.com/project/pachyderm?etx)) but it could be nice if it were in the same workflow of HB energy/daylight simulations. So it was possible to have a even more holistic analysis of a design.....\n", "attachments": [], "created_by_name": "daniel nielsen", "created_at": "April 19, 2015 at 12:45pm", "created_by": "arkdanielnielsen", "topic": "Acoustic simulations", "replies": [{"body": "\nHi Daniel, I have a draft email (now probably for months) to send to Arthur and ask him if he is interested in some sort of collaboration but I haven't sent it out, waiting for a time that I feel confident that I can follow up with him on a timely manner. Do you know him? and have you talked to him about this? Maybe you have to push us to start the conversation.\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "April 19, 2015 at 4:28pm", "created_by": "MostaphaSadeghipour", "replies": [{"body": "\nHi,\n\nI have talked with him last august/September. There is a GH version, that I got, but I have never had the time to try it out more deeply. I did not talked with him about the idea of having it as a part of LB/HB. But I think it would be obvious if it were. Mainly it is only about applying other kind of material properties than for DL and Energy sim.\n\nSend the email ;)\n\n/daniel\n", "attachments": [], "created_by_name": "daniel nielsen", "created_at": "April 20, 2015 at 12:36am", "created_by": "arkdanielnielsen", "replies": []}, {"body": "\nHello. Sounds good. Thanks. We can also write a converter to Pachyderm if he wants to keep the plugin under the current name in a separate tab.\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "April 20, 2015 at 8:32am", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\n*Surprise - it's a small world!!*\n\nI think there is a good opportunity here. We should speak some more. The difficulty is that right now Pachyderm is changing a lot, but I hope to have things nailed down soon. As Daniel mentioned above, I have begun a PachydermGH plugin which will also be open-source, and maybe, if your project can support a GPL license, we can integrate the two together...\n\nThe grasshopper plugin works well, but there are some things about running acoustics simulations in grasshopper which so far seem clumsy, and which I am not yet satisfied with.\n\nI could definitely use some help from a more experienced grasshopper than myself for these things... I hope that I hear from you.\n", "attachments": [], "created_by_name": "Arthur", "created_at": "April 21, 2015 at 6:06am", "created_by": "Arthur", "replies": []}, {"body": "\nHahaha. Well done! It's indeed a small world and it is (almost) a sphere so there are so many possibilities to connect two points with a straight line. :)\n\nLet's talk! We can figure out the license part I think. I've already planned a couple of calls for this weekend but I assume we can still find a spot for this one. I will follow up the conversation by email and will include Daniel.\n\n\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "April 21, 2015 at 4:45pm", "created_by": "MostaphaSadeghipour", "replies": []}]}, {"body": "\nHi there !\n\nit's Oscar, actively working with acoustics in GH. I have developed several patches that are used in my daily work in room acoustics. These patches could be somehow integrated in the this project, but lets discuss first!\n\nI can let you know my email adresse by message if you are interested.\n\noscar\n\n\n\n\n\n\n\n\n", "attachments": [], "created_by_name": "Oscar", "created_at": "April 22, 2015 at 7:51am", "created_by": "Oscar26520", "replies": [{"body": "\nHi Oscar! Sure... Please message me your email address.\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "April 22, 2015 at 4:10pm", "created_by": "MostaphaSadeghipour", "replies": []}]}, {"body": "\nHi guys,\n\nIs this moving forward? I would be interested in running acoustic simulations within Grasshopper.\n\nRegards,\n\nAle\n", "attachments": [], "created_by_name": "Alejandro Pacheco Diéguez", "created_at": "June 10, 2016 at 6:47am", "created_by": "3ahr35r8m5dl1", "replies": [{"body": "\nThere is no active development for integration to Honeybee but you can use [Pachyderm](http://www.food4rhino.com/project/pachyderm?ufh) to run Acoustic analysis in Grasshopper.<br/>\n\n\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "June 10, 2016 at 7:51am", "created_by": "MostaphaSadeghipour", "replies": []}]}], "id": "1267267"}