{"body": "\nHi All,\n\n\n\nI was working through an automated slider run of a radiance illuminance analysis. It was running over night and was stopped for a reason I am not sure of, potentially a forced restart by windows. Now I cannot get radiance to complete a run and the octree is not being generated. I have uninstalled and reinstalled Rhino, Grasshopper, Honeybee/Ladybug, and radiance to no avail. Any ideas? Screenshot of the error below. It was running fine...Won't run on even the simplest of models. Thanks.\n\n\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1269398", "name": "octree error.docx"}], "created_by_name": "Ed Clark", "created_at": "April 22, 2015 at 4:20am", "created_by": "EdClark", "topic": "Octree erroe", "replies": [{"body": "\nHi Ed,\n\n\n\nHad a similar error a few days ago. If memory serves me well the error is produced when any of your surfaces do not fit in octree.  I do not know what type of geometry you are running but if it is a building/room try to include an outside ground plane that stretches beyond your current walls/boundaries. Not sure this will fix it, as my error was a truncate error, but worth to try.\n\n\n\nAlso, perhaps uploading your definition will get you better advice from experts of the forum.\n\n\n\nKind regards,\n\nTheodore.\n\n\n\n\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "April 22, 2015 at 4:35am", "created_by": "TheodorosGalanos", "replies": [{"body": "\nAlso, this issue might happen from polygons on top or near each other. It really depends on the type and quality of the geometry. Try disconnecting surface by surface and running the daylight simulation to find out the culprit.\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "April 22, 2015 at 4:52am", "created_by": "TheodorosGalanos", "replies": []}]}, {"body": "\nAn unrelated point - you mention an 'automatic slider run'. Did you download something to help you automatically move the sliders? I downloaded something like this from this site ages ago and can't remember where I downloaded it from. If you did, and you can remember, can you let me know? Cheers!\n", "attachments": [], "created_by_name": "James Ramsden", "created_at": "April 22, 2015 at 5:01am", "created_by": "JamesRamsden", "replies": [{"body": "\nThanks for the replies. I will give them a try. The odd thing was that it was working fine and a colleague who is using the same model is not having issues. Automatic was may be a misused term, I just automated/animated the slider natively.\n", "attachments": [], "created_by_name": "Ed Clark", "created_at": "April 22, 2015 at 5:09am", "created_by": "EdClark", "replies": []}, {"body": "\nJames,\n\nSearch for Polinator and you'll find an example using the automized sliders. Also one of the HB has it. It is based on a piece of code developed by David rutten, as far as i remember.\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "April 22, 2015 at 5:20am", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nYes. It is a C# component which I modified from what David has originally developed.\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "April 22, 2015 at 4:09pm", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nThat's the one! I knew it was kicking around somewhere. And Mostapha - thanks also for your work on this component - it has been remarkably useful in me working on parametric studies.\n", "attachments": [], "created_by_name": "James Ramsden", "created_at": "April 24, 2015 at 4:41am", "created_by": "JamesRamsden", "replies": []}]}, {"body": "\nHi Ed,\n\nIf you check the folder you should find a file that is named as yourProjectName_Init.bat - If you run that file you should be able to see the error. The init file creates the .oct file from sky file, material files and geometry so it can fail in case any of the files has an error.\n\nMostapha\n\n\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "April 22, 2015 at 4:09pm", "created_by": "MostaphaSadeghipour", "replies": []}]}