{"body": "\nHello,\n\nI am a novice user of you awesome plug-in. Currently I am using it in a project for which the corresponding weather data file for its specific location is not freely available. I found out that Whitebox Technologies sells IWEC2 historical weather data files (BINM, EPW (plus DDY file), and FIN4 text formats) for that particular location, but only in a year range from 2001 to 2012. Is this time frame reliable enough for running simulations using LB. Thank You!\n", "attachments": [], "created_by_name": "Roland D. Sandoval", "created_at": "April 23, 2015 at 1:52pm", "created_by": "RdSand", "topic": "Weather data files outside US and time frame reliability", "replies": [{"body": "\nHi Roland,<br/><br/>Most Typical meteorological year data sets (1,2,3) have data range of 30 years, with TMY3 also having 14 range for some locations. IWEC has minimum range of 12 years. But not all years were taken into account from this range. <br/>So the larger the range, the better the weather sample, but I would say if you can't find better than that, 10 year range will do the job.\n", "attachments": [], "created_by_name": "djordje", "created_at": "April 23, 2015 at 3:07pm", "created_by": "djordje", "replies": [{"body": "\nHi Djordje,\n\n\n\nThank you for your answer. So, if I purchase the 2012 historical year file, it contains average weather data from the las 12 years, would this be enough?\n\nAnother option White Box Technologies gives is generating a composite-year historical weather data files, which is to compose a single file joining multiple periods through switchover dates (i.e. from 1/1/2001 to 5/15/2001 with 5/16/2004 to 12/31/2004), which seems to be a good option when no complete years are available. However in my case, as all years are complete do you think composing a month by month file through the 12 year available period (using a month from each year consecutively) could be a better option?\n", "attachments": [], "created_by_name": "Roland D. Sandoval", "created_at": "April 24, 2015 at 9:57am", "created_by": "RdSand", "replies": []}, {"body": "\nHi,<br/><br/>I have just checked White Box Technologies website, and looks like I was wrong.<br/>Historical weather data is an 8760 hour record of weather data for particular year. So when they say \"year range from 2001 to 2012\" it literally means they have an hourly annual data for each of 2001 to 2012 years. I would say that this kind of data is not suited for simulations we are performing.<br/>On composite year historical data, you can't simply concatenate months from different years. [Users Manual for TMY3 Data Sets](http://www.nrel.gov/docs/fy08osti/43156.pdf), section \"2 Procedures for Developing TMY3\" provides an insight into different methods by which months from particular years were picked and concatenated to form TMY datasets.\n", "attachments": [], "created_by_name": "djordje", "created_at": "April 25, 2015 at 4:33pm", "created_by": "djordje", "replies": []}, {"body": "\nHo Roland,\n\nIt looks like Djordje has got your issue covered but I just wanted to make sure that you were aware that there are a lot of non-DOE epw files available here if you create a yahoo account and join the E+ group:\n\n[https://groups.yahoo.com/neo/groups/EnergyPlus_Support/files/Meteon...](https://groups.yahoo.com/neo/groups/EnergyPlus_Support/files/Meteonorm_Weather_Files/)\n\nThere might be something there that is closer to what you are looking for than the DoE site.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "May 2, 2015 at 12:59pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nHi Everyone,\n\n\n\nWhat if WeatherAnalytics and White Box Technologies are not the options available. Is there any way to generate weather data for locations without a DOE weather file?\n\n\n\nChris,\n\nCan dragonfly help?\n\n\n\nThanks,\n\nDevang\n\n\n\n\n", "attachments": [], "created_by_name": "Devang Chauhan", "created_at": "November 11, 2016 at 10:32am", "created_by": "devang", "replies": []}]}]}