{"body": "\nHi Mostapha and Chris,\n\n\n\nI found that the following results of the new \"read EP Result\" component are missing.\n\ntotalEnergy:<br/> totalThermalEnergy: <br/> thermalEnergyBalance: <br/> cooling: <br/> heating: \n\nBut the old version of  \"read EP Result\" component still works.\n\n\n\nCould you please look into it and let me know if there is anything wrong with my energy model? \n\n\n\nThank you in advance!\n\nBest,\n\nDing\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/nBD8FQWarq8gHxmB7nXYt-4bs5D-18HIQBB8Q7s65v5AduPNN-1ijxAuXDdxos45kI4XbZ5HEAl*tQxfNzNHtSF8vfygqcmu/readEPResult.png?width=750\" width=\"750\"/>](http://api.ning.com:80/files/nBD8FQWarq8gHxmB7nXYt-4bs5D-18HIQBB8Q7s65v5AduPNN-1ijxAuXDdxos45kI4XbZ5HEAl*tQxfNzNHtSF8vfygqcmu/readEPResult.png)\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1272119", "name": "text5.gh"}], "created_by_name": "Ding", "created_at": "April 24, 2015 at 9:47am", "created_by": "doudou", "topic": "\"read EP Result\" - results are missing in the new version", "replies": [{"body": "\nHi Ding!\n\nIt's because your using an old component to generate EP results. I updated the component and it works as expected.\n\nAlso all the default schedules and constructions will be assigned by Honeybee components. You don't need to re-set them to default as you are doing in the file.\n\nMostapha\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1273857", "name": "text5_updated.gh"}], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "April 26, 2015 at 11:41pm", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nHi Mostapha,\n\n\n\nThank you! I did not notice the new release of the components. I have updated them and it works now.\n\n\n\nIn addition, considering that the function of \"daylight control\" or \"daylight threshold\" for energy simulation is not available so far ([http://www.grasshopper3d.com/group/ladybug/forum/topics/hb-daylight...](http://www.grasshopper3d.com/group/ladybug/forum/topics/hb-daylight-setpoint-bug)), I have to set up the energy simulation based on an annual daylight simulation. Hereby, I have some questions as follows.\n\n\n\n- **As for the lighting schedule (in csv format) generated from the \"annual Profiles\" in the \"read Annual Results I\" component in daylight simulation, how can I link it (instead of the default lighting schedule) to the succedent energy simulation? Could you please show this in my GH files?**\n\nI could imagine how to make \"customized\" EP constructions and EP loads and link them to the simulation. But, as for EP schedules, I can not figure out how the energy simulation can receive and recognize a \"customized\" EP schedule (i.e. from csv files). I am asking this because the light schedule generated by daylight simulation is in csv format, and also because the schedules provided by Honeybee are limited to some specific building type (i.e. office, retail etc.). But the schedules of some other type of buildings are not included, like the schedules of sports buildings.\n\n\n\n**- In the attached csv file (which is generated <strong>from the \"annual Profiles\"** in the \"read Annual Results I\" component in daylight simulation), why the **electric **lighting is still partially \"on\" even when the \"occupancy\" shows \"0 (absent)\"?</strong>\n\nFor instance, \"Row 16, 64....\" in the csv file. As I understand, the electric lighting is partially/fully \"on\" only when the both of the following conditions are met, namely, there are people in the space and the illuminance level from daylight is below the threshold. Am I right?\n\n \n\n**- Is**** the above mentioned procedure a proper way to calculate the energy use for electric lighting when there is a lighting dimming system (the <strong>electric **lighting may be continuously adjusted in proportion to the amount of daylight available)? </strong>\n\nApart from the above mentioned way of calculating the energy use for electric lighting, I also made other two ways for comparison showed in the attached image. But, the outcomes are very different. Which do you think is the most proper way to calculate the energy use for electric lighting when there is a lighting dimming system?\n\n\n\n\n\n\n\n \n\nThank you very much in advance!\n\n\n\nBest,\n\nDing\n\n \n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1277592", "name": "unnamed_0_space_0_intgain.xlsx"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1277593", "name": "3 ways to calculate energy use for electric lighting.png"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1277594", "name": "text6.gh"}], "created_by_name": "Ding", "created_at": "April 30, 2015 at 1:28pm", "created_by": "doudou", "replies": [{"body": "\nHi Ding,\n\nGlad that everything's good with the ReadEPResult component.  I removed totalEnergy since it was not really correct to draw an equivalence between the thermal (heating/cooling) energy and the electric (light and equipment) energy.\n\nTo use you annual daylight result in an E+ simulation, all that you have to do is connect the annualProfiles csv file path to the lighting schedule of the \"Set EnergyPlus Zone Schedules\" component.  This will assume that you have auto-dimming lights in your zone and so this procedure is correct so long as this is what your final building will have.  I can't tell what your three methods are in the image but, if you sum up the electric lighting results of the E+ simulation, this will give you a correct indication of your electric lighting energy use.  You can find more on how to create and assign your own csv schedules in these two videos:\n\n[https://www.youtube.com/watch?v=_MRK_RxvD3o&amp;list=PLruLh1AdY-SgW...](https://www.youtube.com/watch?v=_MRK_RxvD3o&amp;list=PLruLh1AdY-SgW4uDtNSMLeiUmA8YXEHT_&amp;index=21)\n\n[https://www.youtube.com/watch?v=b7ZQ5sazwrU&amp;list=PLruLh1AdY-SgW...](https://www.youtube.com/watch?v=b7ZQ5sazwrU&amp;list=PLruLh1AdY-SgW4uDtNSMLeiUmA8YXEHT_&amp;index=22)\n\nAs for the occupancy/lighting situation, usually you are not supposed to have the lights on when occupancy is 0 but I think that daysim is interpreting that particular hour you point out in the excel file as a lunch hour where the occupants would conceivably leave the lights on.  If you want to be more precise, I think that the \"Daysim Occupancy Generator Based on List\" would give you better results.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "May 2, 2015 at 1:49pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nHi Chris,\n\n\n\nThank you so much for the very helpful tutorial and your explanation! But, I have still one more question just to make sure I understand right regarding the \"total energy\". \n\n\n\nConsidering that the \"totalEnergy\" has been removed from the \"read EP result\" component, but what shall we do if we still want to obtain the simulation result of the \"total energy\" ? - Is that true that the sum of the thermal (heating/cooling) energy and the electric (light and equipment) energy obtained from the \"read EP result\" component is equal to the \"total energy\" used by the zone?\n\n\n\n\n\nIn addition, is it expected to integrate the \"daylight threshold\" function to the EP simulation again in near future ? Just for curious. \n\n\n\nThank you again!\n\n\n\nBest,\n\nDing\n\n\n\n\n\n\n", "attachments": [], "created_by_name": "Ding", "created_at": "May 3, 2015 at 7:41am", "created_by": "doudou", "replies": []}, {"body": "\nHi Ding,\n\nTo give a slightly theoretical/philosophical answer, I removed the total energy output because the second law of thermodynamics places energy in a hierarchy from most concentrated/ordered/high exergy/low entropy to dispersed/disordered/low exergy/high entropy.  AC or DC electricity is a very highly ordered form of energy and thus is very valuable while thermal energy is a very disordered form of energy and thus not so valuable (or just much easier to obtain).  Accordingly, it is really not correct to draw an equivalence between thermal and electrical energy, which is what you are doing when you add them together.\n\nYou can always use the \"Separate Data\" component and the native grasshopper math components to add the E+ results together but I wanted users to be aware that this is not a method favored by the scientific community.\n\nFrom what I understand, the daylight threshold had never really been implemented on the back end.  We might do this at some point.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "May 3, 2015 at 10:17pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nJust wanted to add to what Chris said, that take into account the COP you expect from your system (even though it is an IdealSystem) if you want to add the thermal loads (Heating, Cooling) to the electrical energy (lighting, equipment).\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "May 3, 2015 at 10:56pm", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nHi Abraham,\n\n\n\nThanks a lot for your reply!\n\n\n\nI have incorporated the COP in my test model ([http://www.grasshopper3d.com/group/ladybug/forum/topics/discrepancy...](http://www.grasshopper3d.com/group/ladybug/forum/topics/discrepancy-of-the-results-of-energy-use-for-electric-lighting)), before adding the thermal loads (Heating, Cooling) to the electrical energy (lighting, equipment). Could you please also see the above link and let me know if I did it in a proper way?\n\n\n\nThank you again!\n\nBest,\n\nDing\n", "attachments": [], "created_by_name": "Ding", "created_at": "May 4, 2015 at 10:56am", "created_by": "doudou", "replies": []}, {"body": "\nHi Ding,\n\nLooks about right.\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "May 4, 2015 at 12:01pm", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nHi Chris,\n\n\n\nThank you so much for the detail explanation! It helps a lot! \n\nAs Abraham mentioned above, I think what I should do is to take the COP into account before adding the thermal loads (Heating, Cooling) to the electrical energy (lighting, equipment), in order to calculate the amount of electricity required for the predicted thermal loads (Heating, Cooling), which depends on the selected energy source and the COP.\n\nBest,\n\nDing\n\n\n", "attachments": [], "created_by_name": "Ding", "created_at": "May 4, 2015 at 10:49am", "created_by": "doudou", "replies": []}, {"body": "\nDing,\n\nThe COP method is a decent way of estimating your electrical energy and thank you, Abraham, for pointing that out.   Just make sure that the fuel types for both your heating and cooling systems are electricity (if you have natural gas for heating, for example, this comparison won't work).  Also, keep in mind that this method is a rough estimate and that the actual COP of a system can vary depending on how it is operated.  You should land in the right ballpark with this simple multiplication method, though.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "May 17, 2015 at 1:13pm", "created_by": "ChrisMackey", "replies": []}]}], "id": "1272120"}