{"body": "\nHi everyone,\n\nI have a question about DGP. I want to assess the DGP at a certain point in my building caused by the facade across the street. What I have done is running the annual DGP simulation, then removing the building on the other side and then run it again. Then I subtracted both results to get the DGP produced by the building.\n\nI got a suggestion (copied below) at the Radiance mailing group about a more accurate way to identify the amount of glare produced by a specific object:\n\n**\"One option is to run the evalglare program with the -d and -c parameters.**<br/>**&gt; evalglare -d -c check.hdr image.hdr**\n\n**This will do two things:**\n\n**(*1*) the -d option will give you a list of all contrast-based glare sources, including reflections from your facade;**\n\n**(*2*) the -c option will colour the separate contrast-based glare sources randomly in the check.hdr file. You can even plug the values from 1 into the contrast half of the DGP equation.\"**\n\nCan this be done with Honeybee?\n\nI was also advised to avoid simplified methods to calculate DGP:\n\n**\"And just to be sure - don't use any of the existing simplified methods to calculate DGP (they are not based on a full rendering), because they are based on illuminance calculations using rtrace -I - in that case you will miss the specular reflection of the sun\"** \n\nI am not sure if the annual glare simulation from \"Honeybee_Annual Daylight Simulation\" component uses one of these simplified methods. Maybe someone can clarify that.\n\n\n\nThanks in advance,\n\nAlejandro \n", "attachments": [], "created_by_name": "Alejandro Pacheco Diéguez", "created_at": "April 27, 2015 at 1:49am", "created_by": "3ahr35r8m5dl1", "topic": "Identify glare from a specific glare source", "replies": [{"body": "\nAlejandro,\n\nMostapha could provide a much better answer here but I know that the \"glareCheckImage\" that you get out of the Glare Analysis component should be the same thing that the radiance mailing group is talking about.  If you look at this image, you will see colors that indicate \"glare sources\" and, if there are colors around/on the building you are studying, this should give you a sense of whether the building is responsible for the glare.  I am afraid that you are probably going to have to stick with this qualitative analysis since the subtracting of DGP values doesn't sound like an accurate method.  The one quantitative thing that you can say is that, if the DGP with the building present is greater than 0.45, you definitely have some glare issues that you should address.\n\nAs for the simplified methods, I am 99% positive that Honeybee is not using these.  I can at least assure you that the Glare Analysis component is using a full rendering.  I have heard of people making very rough estimates of whether glare is possible from illuminance values and it sounds like that is what the radiance group is referring to.  You should definitely not compute a DGP value from just illuminance, though, as that is bound to be inaccurate.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "May 2, 2015 at 2:15pm", "created_by": "ChrisMackey", "replies": []}], "id": "1273951"}