{"body": "\nI want to output the simulation data into Json format, can you tell me how to do it? I am building data visualization in D3.js \n\nThank you,\n\nVinu\n", "attachments": [], "created_by_name": "Vinu Subashini", "created_at": "April 27, 2015 at 6:25pm", "created_by": "VinuSubashini", "topic": "Simulation Data as Json Output", "replies": [{"body": "\nHi, I haven't tried it myself yet but you can use openrefine I think. \n\n[http://openrefine.org/](http://openrefine.org/)\n\n[http://multimedia.journalism.berkeley.edu/tutorials/google-refine-e...](http://multimedia.journalism.berkeley.edu/tutorials/google-refine-export-json/)\n\nFor exporting to Json directly from grasshopper without saving it to excel first, I don't know.\n\nFor uploading the simulation data onto a collaborative web app that designs a json scheme (assuming that is what you are looking for), I don't know yet. If anyone knows I would be happy to know more about it.\n", "attachments": [], "created_by_name": "Youngjae chung", "created_at": "April 27, 2015 at 10:07pm", "created_by": "YOUNGJAECHUNG", "replies": []}, {"body": "\nThank you YoungJae,\n\nD3.js has excel utilities.js that converts the data to json format but on the other hand, D3. Js is able to read a csv file too,... after separating the strings from the simulation data through the examples shown in the videos, can I still export the value with zone names to csv? I have been using excel/read/write but since the simulation output is a csv file, is it possible to send a clear ‘ only numerical value’ without strings (but I need zone names)? \n\n\n\nThank you,\n\nVinu\n", "attachments": [], "created_by_name": "Vinu Subashini", "created_at": "April 28, 2015 at 12:19am", "created_by": "VinuSubashini", "replies": [{"body": "\nHi Vinu,\n\n\n\nYou can use Python's json library to do it. For creating .csv file check this post: [https://github.com/mostaphaRoudsari/Honeybee/issues/279#issuecommen...](https://github.com/mostaphaRoudsari/Honeybee/issues/279#issuecomment-74621002)\n\n\n\nYou can send the data with zone names and then filter data on D3 side. check for \"filter\" in javascript.\n\n\n\nAlso I'm curious to know what are you trying to do. Are you trying to create a set of visualization for a specific work or is it for more generic purpose (e.g. interactive energy simulation results visualization?) I'm planning to do more work in that area soon as an extension for Ladybug+Honeybee, and there might be areas that we can work together.\n\n\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "April 28, 2015 at 8:27am", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nHi Mostapha,\n\nThankyou, I am going to try the .csv from the link you sent.\n\nMy research is on understanding how inhabitants interact with building and its element (The topic name is “Lightweight look ahead options: An eco-dialect between building, its inhabitants and designers”).  And how their interaction affects the energy use in the buildings. I am building an interactive interface (html/d3.js) that allows the inhabitants to choose their actions in any given instance that affects their comfort.  I am using lady/bug honeybee to run the simulation on the backend. In the process of their choice the inhabitant is able to see visual data on how their action affects their comfort in time. May be the study might reveal model of inhabitants interaction. I have explored different tools but I find ladybug/honeybee meets most of the requirements I need for modelling. I will send more details through email.\n", "attachments": [], "created_by_name": "Vinu Subashini", "created_at": "April 28, 2015 at 12:41pm", "created_by": "VinuSubashini", "replies": []}]}]}