{"body": "\nHello everyone,\n\n\n\nI recently started to go into more detailed energy simulations with HB due to a project. I had a question (in a long line of questions to come I'm sure :( ) about the natural ventilation component.\n\n\n\nI apologize if this is quite trivial. In the natural ventilation type, there is an option for mechanical (fan-driven) ventilation (which is what interests me atm). The tooltip requests a design flow rate for the area. Is this done through the \"Set EP Zone Loads\" component and the ventilationperArea option? And what would happen (i.e what would be the default option) if I simply input a ventilationperArea without using the NV component?\n\n\n\nThanks in advance!\n\n\n\nKind regards,\n\nTheodore.\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "April 29, 2015 at 9:45pm", "created_by": "TheodorosGalanos", "topic": "Natural Ventilation Component", "replies": [{"body": "\nTheodore,\n\nSorry for the late reply.  I think that starting with fan driven ventilation is a good idea as the window-based auto-calculations are fairly simple at the moment and really only good for a few zones at a time (we're currently working on implementing the whole airflow network, which will allow you to evaluate really complicated cases).  To clarify, you set the _fanFlowRate on the set EP Airflow component here:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/-FxrWMrAPzgXXFIljp1SATv-uLyvQj5b2GNlKXCSQzjgA6mODUJfAgt3kF0EL11VMxhmT5mlMz79Avp0jb*X1PXqgEwUcoPa/FanFlowRate.JPG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/-FxrWMrAPzgXXFIljp1SATv-uLyvQj5b2GNlKXCSQzjgA6mODUJfAgt3kF0EL11VMxhmT5mlMz79Avp0jb*X1PXqgEwUcoPa/FanFlowRate.JPG)\n\nThis flow rate is meant to be the total outdoor air flow rate in m3/s that you want to enter the zone when the indoor temperature rises above the \"minIndoorTempForNatVent_\" (it is not divided by the floor area).  This fan flow is completely separate from the \"Set EP Zone Loads\" component, in which case the ventilationperArea values that you input here refer to the minimum outdoor air that you want to come in through the mechanical ideal air heating/cooling system.  Iif your zone is not conditioned, these ventilationperArea values will have no effect.  The minimum ventilationperArea is built into the default ideal air systems to ensure that the occupants do not suffocate or (more likely) smell each other's body odors.  In contrast, the fan-driven natural ventilation on the set EP Airflow component is done to cool down the space instead of using a traditional mechanical cooling system.\n\nLet me know if this clarifies everything.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "May 2, 2015 at 3:51pm", "created_by": "ChrisMackey", "replies": [{"body": "\nHi Chris,\n\n\n\nThank you very much for the response. I admit it frustrates me how novice I am in energy plus. Just a couple of questions if I may. You say that ventilationperArea (in the ep zone loads) will have no effect if the zone is not conditioned. My interest mainly here is to set up mechanical ventilation in non-conditioned zones (e.g. warehouse spaces). By your description this seems to be the case of fandrivenventilation in the NatVent component. Would that be a right guess? And could I input a schedule for this type of ventilation somewhere in honeybee (sorry can't check the component in this pc right now).\n\n\n\nFinally, what would the EP settings assigned to zones in models where only simple parameters were set? For example, what happens to a zone I only assign as non-conditioned in the create zone component? Is it assigned any type of ventilation by EP? Again, I promise I'll go for some EP training so that I won't bother you so much with technical questions!\n\n\n\nThank you so much!\n\n\n\nKind regards,\n\nTheodore.\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "May 2, 2015 at 6:58pm", "created_by": "TheodorosGalanos", "replies": []}, {"body": "\nTheodore,\n\nYour assumptions are correct.  This is the component that you should use to set up fan ventilation in an unconditioned warehouse. You will see an openingAreaFractionalSchedule on the Nat Vent / Air Flow component and you can use this to set the fraction of fan power that you want applied at each hour (if you use the CSV schedule component to make a schedule for the fan).  You can also just use the more common situation of having the fans turn on when the indoor temperature rises above a certain minIndoorTempforNatVent.\n\nIf the zones are unconditioned, the only airflow going into the zone infiltration, which is usually very small by default (just the air that flows through small cracks in the walls).  So your default unconditioned zones will probably overheat a lot.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "May 2, 2015 at 7:47pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nHey Chris,\n\n\n\nThanks for the response! Will adjust my model accordingly. I think you are right the temperature setting would be more logical.\n\n\n\nKind regards,\n\nTheodore.\n\n\n\n\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "May 2, 2015 at 7:56pm", "created_by": "TheodorosGalanos", "replies": []}, {"body": "\nHi Chris,\n\n\n\nGot a question (again). After setting up the fan driven ventilation in the component, do I input it in the set ep zone loads component to set up the ventilation rate or is that not required. I know how much the total zone air flow should be but I'm not sure if I should input that in the fan flow rate or in the ventilationperarea of the zone.\n\n\n\nAs a side note, is there an ideal load mechanical ventilation system? Ugh, I know the previous sentence might be terribly wrong but I wonder if there is an easy, EP default, way of setting up MV flow rates in different spaces. If not I guess I will input the minimum rates by ASHRAE.\n\n\n\nThanks in advance.\n\n\n\nKind regards,\n\nTheodore.\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "May 3, 2015 at 8:48pm", "created_by": "TheodorosGalanos", "replies": []}, {"body": "\nTheodore,\n\n1) You set the flow rate of the fan-driven ventilation on the EP Airflow component.  Not the zone loads component.\n\n\n\n2) You have an ideal air mechanical system if you have set the \"isConditioned\" input to \"True\" when you first create the zone.  If you set it to false, there is not active cooling or heating that will happen.\n\n\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "May 17, 2015 at 1:38pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nHi Chris!\n\n\n\nThanks for your reply. It makes sense. Would it be very wrong of me, in cases where I do not want to model mechanical systems, to \"isConditioned\" On and then edit the thermostats in a way that the AC part of my ACMV will never work?\n\n\n\nI know it's lazy and creates bad models perhaps but it would be a nice way to start in first phases when I do not have the information (or the will) required to go in detailed mode.\n\n\n\nThanks!\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "May 17, 2015 at 6:39pm", "created_by": "TheodorosGalanos", "replies": []}, {"body": "\nHello Chris! I am using this component \"Set EP natural ventilation\" for natural ventilation, but I don't know exactly how to connect it to my model. I have a 5 room model, and all the zones are connected to the solve adjacencies component. I tried to connect all the 5 zones to the \"_HB ZONES\" at \"Set EP natural ventilation\", but it does not worked, and I got this error: 1. Solution exception:Cannot create instances of Brep because it has no public constructors\n", "attachments": [], "created_by_name": "Iris Loche", "created_at": "February 23, 2017 at 6:56am", "created_by": "IrisLoche", "replies": []}]}], "id": "1277007"}