{"body": "\nHi everyone,\n\nThis question isn't really related to Ladybug, it is a Radiance question. I know there are a lot of daylighting experts here that will be willing to help me out. \n\nHow do I define a glass material in Radiance with transmissivity =0.75 and reflectance= 0.16?\n\nI've never had to include reflectance values in my projects before, so I used to model this glass material like this:\n\n\n\n\n\nvoid glass SinglePane<br/>0<br/>0<br/>3 0.75 0.75 0.75\n\n\n\nHowever, this time I need to account for reflectance.\n\nThanks\n\n\n\nRania\n\n\n\nvoid glass SinglePane<br style=\"color: #454545; font-family: Arial, 'Helvetica Neue', Helvetica, sans-serif; line-height: 16.8999996185303px; xg-p: static !important;\"/>0<br style=\"color: #454545; font-family: Arial, 'Helvetica Neue', Helvetica, sans-serif; line-height: 16.8999996185303px; xg-p: static !important;\"/>0<br style=\"color: #454545; font-family: Arial, 'Helvetica Neue', Helvetica, sans-serif; line-height: 16.8999996185303px; xg-p: static !important;\"/>3 0.962 0.962 0.962\n", "attachments": [], "created_by_name": "Ninja", "created_at": "May 2, 2015 at 3:03am", "created_by": "RaniaLabib", "topic": "Radiance glass material", "replies": [{"body": "\nRania,\n\nSomeone with some more knowledge might correct me here but I am pretty sure that the simple glass material in Radiance does not distinguish between reflected and absorbed portions of light (I believe the assumption is that all light that does not pass through is reflected).  The Trans Material component should help you if you need to account for tansmissivity and reflectivity values that do not add to 1.  Something like this might fit your situation:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/-FxrWMrAPzgeLZmAQBTgRh0pADyMXUayWdFeYWFA9XJKrL922m8LPsisNKxTglOYB*7M-BNT4DDfLCP3c3yfLLwx7UHoKMdz/TransMAterial.JPG\" width=\"560\"/>](http://api.ning.com:80/files/-FxrWMrAPzgeLZmAQBTgRh0pADyMXUayWdFeYWFA9XJKrL922m8LPsisNKxTglOYB*7M-BNT4DDfLCP3c3yfLLwx7UHoKMdz/TransMAterial.JPG)\n\nI would check what the material looks like in a radiance rendering just in case.  Also, if you are only looking at glass just from an outdoor condition, I usually use a simple mirror material to capture the general specular properties of the glass that I am interested in since there's no need to go through the extra work of simulating light on the interior of the building.\n\nI hope that this helps,\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "May 2, 2015 at 5:58pm", "created_by": "ChrisMackey", "replies": [{"body": "\nHi Chris\n\nI have a problem ... my aim is to calculate DGP in honeybee\n\nI should simulate a double glazed window which has a different reflection from inner and outer surface to evaluate impact of various inner reflection in DGP value ... with which component i can simulate this window ??<br/><br/>\n\nShould i model 2 surfaces for this window or not ??<br/><br/>Regards\n", "attachments": [], "created_by_name": "sufia", "created_at": "May 7, 2016 at 1:34pm", "created_by": "sufia", "replies": []}, {"body": "\nSufia,\n\nIf you are just concerned about glare on the indoors, than model your material according to the properties of the interior side of the inner pane of glass.  Make sure that the total transmission of the glass is equal to both the inner and outer panes together.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "May 16, 2016 at 1:38pm", "created_by": "ChrisMackey", "replies": []}]}, {"body": "", "attachments": [], "created_by_name": "Alejandro Pacheco Diéguez", "created_at": "May 2, 2015 at 11:30pm", "created_by": "3ahr35r8m5dl1", "replies": []}, {"body": "\nChris and Ale,\n\nThank you guys for your help. I'm working on two projects right now, one of them studies the glare caused by PV panels, I think I'm going to use a mirror material for the PV panels. The other project is to examine interior daylighting conditions based on changes to an exterior lightshelf and ceiling material. I think I'm going to use the trans material for this project, I'll test run the trans material as you suggested.\n\n\n", "attachments": [], "created_by_name": "Ninja", "created_at": "May 4, 2015 at 5:09pm", "created_by": "RaniaLabib", "replies": []}]}