{"body": "\nHello Mostapha, Chris and everyone,\n\nI am trying to simulation the energy demands of a one-zone room with a dimension of 3(w)*4 (d)*3(h). I am new in this area, so I have some questions about the simulation model, and I would be very grateful if you could help me to have a look.\n\n1. The air change rate is assumed to be 0.5 times per hour and the infiltration rate is 0.1 times per hour, so I sum these two values and set the converted infiltration rate per area as 0.0005 m3/s-m2. I don’t know whether it is appropriate to sum these numbers and input them together in the “infiltration rate per area” part?\n\n2. I found in the latest version, there is a component called “air flow”, which can edit natural ventilation, but if I set minIndoorTempForNatVent equal to the heatingSePt as you showed once in the forum, the simulation result of heating is ridiculous high (like 7000 kwh/m2a). If the minIndoorTempForNatVent value is set to be a little higher than the heatingSePt, the heating result looks much normal (like 200 kwh/m2a). I don't know whether there is anything wrong with my model or settings, and hope you could help me.\n\n3. I want to add the cooling and heating COP values (2.8 and 0.8) in my simulation process. I have noticed that in the forum, you mentioned that the new component \"setEPIdealAir\" can help to add COP, but I am still very confused about how exactly it works. I would be very grateful if you could show me again here.\n\n4. I tried to change the WWR and the U-value of the wall, but I found the results of cooling and heating (especially cooling) vary little, which is not supposed to be like that. I guess there should be something wrong...\n\n \n\nThat's all for my questions.\n\nThank you so much for your time in advance. I would be very grateful if you could help me in this model. It would be very helpful for my work.\n\n \n\nThank you again!\n\nCheers,\n\nYao\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1280250", "name": "5.gh"}], "created_by_name": "Yao Lv", "created_at": "May 4, 2015 at 12:51pm", "created_by": "YaoLv", "topic": "Questions about honeybee in natural ventilation and COP setup", "replies": [{"body": "\nanyone can help me?\n", "attachments": [], "created_by_name": "Yao Lv", "created_at": "May 6, 2015 at 1:48am", "created_by": "YaoLv", "replies": [{"body": "\nYao,\n\n\n\nI am very sorry that no one got back to you on your issue in a reasonable time frame.  I know that many of us were busy with things at the end of the academic semester when you sent this and it is our fault that it fell through the cracks.\n\nTo answer your questions:\n\n\n\n1. With the current capabilities in Honeybee, there are three possible ways by which air enters a zone and each has its own separate set of inputs.  These three are:\n\n   1) Infiltration\n\n   2) Ventilation through the HVAC System\n\n   3) Natural Ventilation\n\nThe reason for having these three separate set of inputs is because each of these has a separate reason for why the air is entering the zone:\n\n   1) Infiltration - This is air flow into the zone through cracks in the walls that you cannot control.\n\n   2) Ventilation through the HVAC System - This is additional ventilation that you do to ensure that occupants have enough fresh air to breathe and that smells do not accumulate.  Note that ventilation through the mechanical system can only happen if the zone is conditioned so, if you wanted to adequate minimum ventilation in a completely passive zone, you have you use the third option below (or boost up your infiltration to an acceptable level).\n\n   3) Natural Ventilation - This is ventilation, usually at high volumes, that you are doing to cool down the zone in place of using mechanical cooling.\n\nYou can set the first two (infiltration and ventilation through the mechanical system) with the 'Set EnergyPlus Zone Loads' component.  For the case that you describe, you should not add the two together but input them like so:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/Ja6gu*i0lR78IPR0KbjA3MoggblMs1v1gg5iYB4*AuqLUm5mcQ6lvNIKq9KfX-e51hY4lssB0f5EPNW*P5YRY1VTPoERNGTf/SettingInfiltration.PNG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/Ja6gu*i0lR78IPR0KbjA3MoggblMs1v1gg5iYB4*AuqLUm5mcQ6lvNIKq9KfX-e51hY4lssB0f5EPNW*P5YRY1VTPoERNGTf/SettingInfiltration.PNG)\n\nI am assuming that the minimum ventilation to ensure occupants have enough fresh air is 0.5, in which case, you don't need to add the two but can subtract the infiltration from the mechanical ventilation.  I have included Abraham's awesome converter components from ACH to m3/s-m2, which should make things easier in your case.  For natural ventilation, you have to use the \"Set EP Airflow\" component.\n\n\n\n2. Oh gosh, I did not realize that I had said that in the videos.  As you have stated, you are absolutely right that you want to leave a bit of room between your heating setpoint and your minTemperatureForNatVent.  I know that there currently is not a video on the Set EP Airflow and I will make this clear when I put up a video on it soon.  I should also probably take out the example of an infiltration schedule from the videos too since I know that was the best the components could offer in terms of air flow at the time.  I usually leave at least 2 C between my heating setpoint and the minimum temperature for natural ventilation (usually my heating setp is 20C and nat vent setpoint is somewhere between 22-26C depending on how tightly controlled temperature needs to be in the space).  This is the case, unless I am crafting some special type of summertime night flushing scheme where I will use the HVACAvailabilty input on the 'Set EnergyPlus Zone Schedules' to shut down the heating system for part of the year.  To clarify again what happened in your case, setting the minTempForNatVent to the heating setpoint will mean that windows immediately open once the heating setpoint is reached, causing the heating system to immediately turn back on after it has just been turned off.  Over time, you have this rapid oscillation between heating and opening windows that just blows through a ton of energy.\n\n\n\n3. You cannot use the 'Set Ideal Air Loads Parameters' to account for a COP.  By definition an ideal air system does not include a COP (ideal air is the type of HVAC system that the 'Run Energy Simulation' component uses).  Ideal air systems can only tell you the heat removed or added to the zone by the system - NOT the values of electricity or fuel that it might take to add or remove this heat.  If you want to obtain a rough estimate of your heating and cooling with those COPs you can post-process the results using the native grasshopper division component like so:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/Ja6gu*i0lR7Cov96-l7HJM7xCGizZ4vXWtJLRMOJF1EtHZT90VNd3PwItNyQL2ncKCeI-Py3fnzgE4gARUF2McqJGB2Of36h/CoolingCOP.PNG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/Ja6gu*i0lR7Cov96-l7HJM7xCGizZ4vXWtJLRMOJF1EtHZT90VNd3PwItNyQL2ncKCeI-Py3fnzgE4gARUF2McqJGB2Of36h/CoolingCOP.PNG)\n\nWe did not include a formal Honeybee component to perform this division operation because we want you to be aware of what is going on.  This division gives you a rough estimate of the energy but it is not as accurate as modelling a complete HVAC system.  We are currently building out the capability to do this with the OpenStudio component.  I have attached a file with the native GH division for you.\n\n\n\n4. Looking at your file, it makes sense that the constructions in general would not change the simulation much since you only have a single side of the box that is not adiabatic.  However, I imagine that the bigger reason why the simulation is not changing much is that the constructions I see that you are using have poor R-values for the heating-dominated climate that you are working in.  Try just making a no-mass material and boost up the R-value to a high amount (maybe something crazy like 15) and you will see the maximum cutting of heating energy you can get by making a thick envelope.\n\n\n\nSorry again that no one got back to you in a good time frame but I also realize this discussion took a long response.  In the future, it might be better to break this up into a few discussions with more focused topics.  That way, the people who know the individual topics you brig up can get back to you individually much faster.\n\n-Chris\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1324872", "name": "5_CWM.gh"}], "created_by_name": "Chris Mackey", "created_at": "July 13, 2015 at 12:06pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nWow Chris that image on the 3rd point really humbled me. Can't believe I was getting my Building Energy Intensity numbers from the raw output of the E+ component for so long. Seems I was overestimating everything by a high margin. Well, live and learn. If only we lived so much :)\n\n\n\nKind regards,\n\nTheodore.\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "July 15, 2015 at 9:02am", "created_by": "TheodorosGalanos", "replies": []}, {"body": "\nYes, I am sorry if the COP stuff was never made clear in the videos.  I really need to be explicit at some point that not all forms of energy are created equal and that electrical energy is very different than thermal energy.  Energy qualities such as this difference can matter just as much if not more than the energy quantities in many cases.  All of this goes along with more of a consciousness about the second law of thermodynamics that I know is just starting to take hold in our field.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "July 15, 2015 at 5:52pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nHello Chris,\n\nThank you so much for your thorough reply and the model! It helps me a lot! One thing that I need to clarify is that, for point 2 about the setpoint temperature, you didn't say that in any of your video. I just saw it once in the reply of one question in our forum and maybe it was not your reply, so I am so sorry for my misleading statement. It was not your mistake at all!<br/>Thanks again for all your help and the amazing software and all the videos!\n\nCheers,\n\nYao\n", "attachments": [], "created_by_name": "Yao Lv", "created_at": "August 5, 2015 at 4:21am", "created_by": "YaoLv", "replies": []}]}], "id": "1280251"}