{"body": "\nHi,\n\n\n\nI am interested saving a bunch of views for rendering and then process them through a custom batch file.\n\n\n\nIs it possible to capture viewport coordinates and view direction from Rhino viewport in Honeybee ? I know that it is possible to create renderings through Honeybee_Run daylight simulation. Is there a way to bypass the whole rendering process and only extract the view files instead ?\n\n\n\nTypical configuration of a view file looks like this (vp and vd correspond to viewpoint and view-direction respectively):\n\nrvu -vtv **-vp** -5.412320 -343.990701 15.513205 **-vd** 0.205170 0.978726 0.000000 -vu 0.000000 0.000000 1.000000 -vv 35.0 -vh 69.1823210963438 -vo 0.0 -va 0.0\n\n\n\nThanks\n", "attachments": [], "created_by_name": "Sarith Subramaniam", "created_at": "May 6, 2015 at 8:49pm", "created_by": "sarith", "topic": "Radiance view file from Rhino Viewport", "replies": [{"body": "\nHi Sarith, If you haven't already figured it out here is how you can do it.\n\n\n\nHoneybee has a function exportView that does export the views. You can easily modify the function to do what you need: ([https://github.com/mostaphaRoudsari/Honeybee/blob/master/src/Honeyb...](https://github.com/mostaphaRoudsari/Honeybee/blob/master/src/Honeybee_Honeybee.py#L2446-L2578))\n\n\n\nIn case you don't want to deal with the code, you can connect multiple view names to imageBased recipe. Then only set writeRad to True. All the views will be written in the file in the rpict line and you can copy-paste them into your file.\n\n\n\nHope it helps,\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "June 12, 2015 at 4:32pm", "created_by": "MostaphaSadeghipour", "replies": [{"body": "\nThanks Mostapha. I did figure it out from your source code a while ago.\n\n\n\nBy the way, the Feb_01_2015 version of RunDaylightSimulation does not have an output node for HDR files.Is that intentional ?\n\nI was able to \"fix\" mine by adding an output of the same name referred to in the source code.\n", "attachments": [], "created_by_name": "Sarith Subramaniam", "created_at": "June 13, 2015 at 3:27pm", "created_by": "sarith", "replies": []}, {"body": "\nHi Sarith,<br/> It's definitely not . Results output should be renamed after the simulation and outputs the files. I checked with the latest version and it works fine on my system so I assume it has been fixed at some point. Thanks for reporting!<br/> Mostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "June 21, 2015 at 5:09pm", "created_by": "MostaphaSadeghipour", "replies": []}]}]}