{"body": "\nHello Mostapha and Chris,\n\n\n\n1) I am running an energy analysis for a high rise residential building.\n\nMy intention is to run the analysis for 4 different mixes of apartment types that repeat multiple times. The multiply the results by N number of how many types each floor typologies repeats in the tower.\n\n(In this example I have only 2 of the 4 floor types.)\n\n\n\nThe algorithm is very case specific so I built all the walls, ceilings etc etc.\n\n\n\nTo calculate the energy consumption I try it with two different ways:\n\nA) Use an runEnergySimulation component for each of the floors\n\nB) Use one runEnergySmulation component for both the floors.\n\n\n\nand i get different results each time.\n\n\n\nCould you please let me know which of the two processes gives correct results?\n\n2) Also I have noticed that for the MidRise apartments there is no Stair program, which I guess goes back to the previous question of why Energy+ doesn't have this for residences. My general question is what would be the best program option for the Core of a residential building?\n\n\n\nThanks,\n\nDimitris\n\n\n\n\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1282094", "name": "Energy_Multiple.jpg"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1282095", "name": "Energy_Single.jpg"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1282096", "name": "GH_High_Rise.jpg"}], "created_by_name": "Dimitrios Papadopoulos", "created_at": "May 7, 2015 at 10:17am", "created_by": "doompop", "topic": "Multiple Energy+ components analysis", "replies": [{"body": "\nTo reply to myself, the one with the multiple components (option A) is the correct one since it gives the same results as if each option is run independently.\n\n\n", "attachments": [], "created_by_name": "Dimitrios Papadopoulos", "created_at": "May 7, 2015 at 12:38pm", "created_by": "doompop", "replies": [{"body": "\nI would say that connected is the actual performance of the building. I am guessing you have guessed so, thus this discussion [http://www.grasshopper3d.com/group/ladybug/forum/topic/show?id=2985...](http://www.grasshopper3d.com/group/ladybug/forum/topic/show?id=2985220%3ATopic%3A1282243&amp;xg_source=msg)\n\n\n\nI had a similar issue my self simulating semi-detached houses linked to one another. The context surfaces in Honeybee wasn't really doing the job (also was failing but that was due to geometry on my side). I think one model for both floors should handle the energy transfers correctly. And for sure the results (at least for the bottom floor) should be different.\n\n\n\nKind regards,\n\nTheodore.\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "May 10, 2015 at 7:41pm", "created_by": "TheodorosGalanos", "replies": []}]}]}