{"body": "\nHi everyone,\n\n\n\nIs there a way that I can run annual glare analysis in HB?\n\n\n\nThanks\n\nRania\n", "attachments": [], "created_by_name": "Ninja", "created_at": "May 8, 2015 at 5:02pm", "created_by": "RaniaLabib", "topic": "Is it possible to run an annual glare analysis simulation?", "replies": [{"body": "\nHi Rania, The short answer is yes. You can use Honeybee DS Parameters to set it up. Just keep in mind that daysim method for calculating annual glare is simplified and based on what you're trying to do it may or maynot be the right tool to use.\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "May 9, 2015 at 3:07am", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nHi Mostapha, many thanks for your prompt response. Based on your response I changed my mind and I'm going to use the point on time glare analysis. However, the glare analysis simulation fails I'm not sure what the reason is. I'm going to attach my files it would great if anyone here can help me out. I've grouped the glare components together and gave them a green background color.\n\n\n\nThanks in advance.\n", "attachments": [], "created_by_name": "Ninja", "created_at": "May 9, 2015 at 8:01am", "created_by": "RaniaLabib", "replies": []}, {"body": "\nHere are the files\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1283099", "name": "Final_Project.3dm"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1283100", "name": "High_Ref_Glazing_AY.gh"}], "created_by_name": "Ninja", "created_at": "May 9, 2015 at 8:02am", "created_by": "RaniaLabib", "replies": [{"body": "\nHi Rania,\n\nIt works for me after i updated the components\n\nTry that, but expect a lot of run time with the settings you have (high quality and 4 bounces).\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "May 9, 2015 at 9:25am", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nHi Abraham,\n\nThanks for checking the file for me. I don't know if you remember, but you helped me setting up the Ray_trace component in this file few weeks ago, hence the file name ends with AY:)\n\nThis file is going to drive me nuts, I updated the components using the HB_update component, this didn't fix the problem, then I tried downloading the components from Github and dragged them to Grasshopper, this didn't work either. any suggestions? what method did you use to update the components? I can't even pinpoint which component is causing the problem.\n\n\n\n\n", "attachments": [], "created_by_name": "Ninja", "created_at": "May 9, 2015 at 4:30pm", "created_by": "RaniaLabib", "replies": []}, {"body": "\nHi Rania,\n\nOf course i remember :-)\n\nThe way i update is practically the same i saw you did in the file. But i ask to update the file instead all components. For all components i go the github, download the HB/LB.zip and replace in the UserObjects folder (manually). I know that using the update component can do the same, but i don't mind going there and see/read what components got updated lately.\n\nAs for your file, i didn't understand if it works or it didn't. As i said, i updated the file and changed the resolutions to low quality, ab 2 and size 240. It works for me.\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "May 9, 2015 at 10:27pm", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nHi Abraham,\n\nThe file works fine now, all I did is I replaced the \"create_HB_surface\" components with \" HB_context\" components. The renderings and the false color images look fine. \n\n\n\nThanks again.\n\n\n\nRania\n", "attachments": [], "created_by_name": "Ninja", "created_at": "May 10, 2015 at 11:35am", "created_by": "RaniaLabib", "replies": []}]}]}