{"body": "\nChris and Mostapha,\n\n\n\nHoneybee keeps crashing Rhino, when trying to either assign glazing from percentage, or get zone attributes or decompose by type.\n\n\n\nAs described in my precious Discussion it is happening when having somewhere around more than 100 zones.\n\n\n\nSo I tried to just perform the operations on some or even one of all the zones, after I solve their adjacency but it still crashes.\n\n\n\nI attach the files for you to check.\n\n\n\nThanks,\n\nDimitris\n\n\n\n\n\n\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1289280", "name": "Honeybee_Zones_Crashing.jpg"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1289281", "name": "Honeybee_Zones_Crashing.gh"}], "created_by_name": "Dimitrios Papadopoulos", "created_at": "May 18, 2015 at 9:59am", "created_by": "doompop", "topic": "Honebee Keeps Crashing Rhino", "replies": [{"body": "\nHi Dimitri,\n\n\n\nI had a somewhat similar experience recently. While Rhino did not crash in my case, after assigning glazing percentages my zones would be come open breps. The reason was an internal Rhino bug. I am not sure if that happens in your case as well.\n\n\n\nThe way I used to debug/visualize the issue was to close all previews and open the add glazing component preview. Then, when playing with glazing ratios you will notice that after some value the surfaces will get all funky (top part is chopped, edges are irregular) which leads to open breps. The only \"solution\" was to allow the maximum (in my case maximum was the intention of the exercise) ratio I could before that happened, so that I could get closed breps. I wonder if in your case this happens simultaneously in 100 zones and it (or solving adjacencies on them) crashes Rhino.\n\n\n\nSorry I don't have a better solution. Hope this helps.\n\n\n\nKind regards,\n\nTheodore.\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "May 18, 2015 at 7:59pm", "created_by": "TheodorosGalanos", "replies": [{"body": "\nThank you very much for the suggstion Theodor,\n\n\n\nBut the problem is that I can t even reach to the point of creating any windows. The minute I connect the zones after solving the last adjacencies, Rhino just crashes in 5 seconds.\n\n\n\nDimitris\n\n\n", "attachments": [], "created_by_name": "Dimitrios Papadopoulos", "created_at": "May 19, 2015 at 12:08pm", "created_by": "doompop", "replies": []}]}], "id": "1289282"}