{"body": "\nHi,\n\nI've been struggling with this for a while, so i'm opening this discussion.\n\nI'm trying to get an Indoor map for a single zone in a building. I'm following the updated example (number 15).\n\nAttached a file with the issues i want to ask.\n\nI'm defining a zone from a rhino model. I've built. rebuild and rebuild this model since at the end of the line all the time i was getting an open brep as the HB_zone definition. I'm still getting this (See 1 in the file). But the E+ simulation runs. Just for checking i imported the idf file. In this case the zone is Closed (Weird. See 2 in file).\n\nAfter this simulation the IndoorViewFactor component is failing with either of those two warnings:\n\n1. When the input to the distFromFloor input is a panel i get this (see 3 in file):\n\n1. The distFromFloor_ is greater than the height of one or more of the zones.\n\nI remember that there was a problem when the zone was not on the ground, but it was fixed. So i don't understand the warning.\n\n2. When the same input is a slider i get this (see 4 in file):\n\n1. One of your continuous closed air volumes has an overlapping edge that is causing it to not read as a solid. <br/> Bake the closedAirVolumes output and do a DupBorder command on the polysurface to see the buggy edge. <br/> Rhino's solid operations are buggy. Hopefully McNeel fix this one soon.\n\nI cleaned the model from those overlapping edges, but still, is not working.\n\n\n\nAny words of wisdom?\n\n\n\nThanks,\n\n-A.\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1291168", "name": "AngelHouse.gh"}], "created_by_name": "Abraham Yezioro", "created_at": "May 20, 2015 at 10:41pm", "created_by": "AbrahamYezioro", "topic": "Open/Close Brep and IndoorViewFactor issue", "replies": [{"body": "\nHi Abraham,\n\n\n\nCan't open the file from here but I did run into this error (number 2) recently myself. Hope my response is relevant.\n\n\n\nThe dupborder command did recognise the problem (highlighted the edges). What I did to fix it was to use the native merge command in Rhino for the two surfaces of the border highlighted. I then refreshed the breps and that closed my volume.\n\n\n\nDon't know if that helps.\n\n\n\nP.S.: Are you using a glazing by ratio component? Found that it also breaks volumes sometimes.\n\n\n\nKind regards,\n\nTheodore.\n\n\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "May 21, 2015 at 3:25am", "created_by": "TheodorosGalanos", "replies": [{"body": "\nThanks Theodoros.\n\nYesterday i tried the dupborder option with no success. But the weird thing happended after your reply.\n\nI baked again and did the dupborder and it showed a very tiny difference between one window and the parent wall (east facade). But, the way i'm creating the windows is this case is that i'm having the whole surface of the wall (no trimmed window) then i add the window surfaces with the HB_addHBGlz. It is supposed to work \"clean\" since it is geometry independent on my side. But it is the HB_addHBGlz the one that is creating the small hole.\n\nThen i tried to change the model Tolerance to 0.001 (instead the default 0.01). It didn't solve the issue but instead it created a new one on the Southern facade, where the windows were a (really) bit apart from the parent surface. To make it short, i aligned the southern windows, the east facade still have the small gap, but now i get the ClosedBrep zone and the IndoorViewFactor component is now working ... weird (but good).\n\nThanks,\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "May 21, 2015 at 6:15am", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nInstinctively I would say it's Rhino's fault. I've had a lot of issues with adding glazing to my surfaces. It seems that Rhino (guessing) is bugging out in some surfaces, above certain glazing ratios. In the preview seems like whole parts of the wall disappear while the windows seem like the are pushed outside but still connected at the wall.\n\n\n\nTolerance has never done anything for me. Do you have to update the definition or smth?\n\n\n\nRegards,\n\nTheodore.\n\n\n\n\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "May 21, 2015 at 6:58am", "created_by": "TheodorosGalanos", "replies": []}, {"body": "\nNo need to update. Once i change the tolerance value i re-executed the HB_Surface components. The whole chains was too after that by itself.\n\nFrom my case you can see that the tolerance can help and spoil (solved the dupborder and spoiled the glazing surface). On other cases i've felt the \"impact\" of it.\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "May 21, 2015 at 7:22am", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nAbraham and Theodore,\n\nThanks so much for posting this.  That warning about overlapping edges and the corresponding closed air volume output was something that I put in really recently to help me debug certain complex geometry cases so it is great to see that you are finding cases where it is relevant.\n\nThe distFromFloorOrSrf error that you were getting with a panel input was a bug.  I have just fixed it in the attached file.\n\nI tried re-projecting the window geometry onto the wall surface and this seemed to fix everything related to the glazing.\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/d5hxC5etmnmMDJhwez0u4sa1qyyfwPhsH13Duy7JIQ*Pg2wiiR3atY-hjxZYkWnarIe7g4ftd4Mp6TXD4zZLjloXAyvAVZuf/ComfortMapWorking.JPG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/d5hxC5etmnmMDJhwez0u4sa1qyyfwPhsH13Duy7JIQ*Pg2wiiR3atY-hjxZYkWnarIe7g4ftd4Mp6TXD4zZLjloXAyvAVZuf/ComfortMapWorking.JPG)\n\nUnfortunately, the geometric freedom of Rhino can sometimes make it easy to have surfaces that appear to be in the same plane but differ by small barely-noticeable amounts.  Re-creating the geometry should usually fix these cases.\n\n-Chris\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1295866", "name": "AngelHouse_CWM.gh"}], "created_by_name": "Chris Mackey", "created_at": "May 26, 2015 at 2:06pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nThanks Chris,\n\nJust for you to know. I needed to change the Tolerance so the \"status\" of the zone changed from open to closed brep. Otherwise the HB_IndoorViewFactor didn't generate the viewFactorMesh output.\n\n\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "May 27, 2015 at 3:03am", "created_by": "AbrahamYezioro", "replies": []}]}]}