{"body": "\nMay I ask how the radiant temperature map is calculated?\n\n\n\nWhat's the formula for the calculation and what's rationale behind it?\n\n\n\nThanks!\n", "attachments": [], "created_by_name": "Grasshope", "created_at": "May 24, 2015 at 7:12am", "created_by": "Grasshope", "topic": "what's the rationale behind radiant temperature map?", "replies": [{"body": "\nHi Grasshope,\n\n\n\nI believe there are a number of posts in the forum by Chris that will contain some of the information you are looking for.\n\n\n\nThen, the best place to look would be the DOE site where Energy Plus is detailed. I believe the way to calculate radiant temperature will be there.\n\n\n\nKind regards,\n\nTheodore.\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "May 24, 2015 at 7:52pm", "created_by": "TheodorosGalanos", "replies": [{"body": "\nGrasshope,\n\nSince the last stable release, I have discontinued the radiant temperature map component.  This is mostly because it was calculating a thermal map based only on the radiant environment (leaving out air temperature) and, as such, I did not want people thinking that it was a representation of the complete thermal environment according to EnergyPlus.\n\nSince then, I have replaced this radiant component with a complete thermal comfort map workflow and you can get all of the components to build these complete maps by syncing with the github.  You can find an updated example file for these thermal comfort maps here:\n\n[https://app.box.com/s/11abiyglfuaigd3tay85hqtbzi2iymue](https://app.box.com/s/11abiyglfuaigd3tay85hqtbzi2iymue)\n\nThis discussion has the most recent documentation on how the maps are calculated and this is where I will post my full thesis document once I get the text in a bit better shape:\n\n[http://www.grasshopper3d.com/group/ladybug/forum/topics/initial-doc...](http://www.grasshopper3d.com/group/ladybug/forum/topics/initial-documentation-of-thermal-maps)\n\nPlease post any questions that you have about the thermal map calculation there.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "May 26, 2015 at 6:34pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nDear Chris, thank you very much for the clarification! will check the information as provided.\n", "attachments": [], "created_by_name": "Grasshope", "created_at": "May 27, 2015 at 7:15am", "created_by": "Grasshope", "replies": []}]}], "id": "1293591"}