{"body": "\nHi,\n\n1-I was trying to calculate luminance values from the HDR of tif image, may be through a grid-on image with the luminance values?\n\n2- Also I was trying to calculate the CIE Colour Rendering Index, any thoughts if this is doable through HoneyBee??\n\n\n\nThanks!\n\n\n\n\n", "attachments": [], "created_by_name": "Dalia Hafiz", "created_at": "May 26, 2015 at 9:20am", "created_by": "DaliaHafiz", "topic": "calculating luminance from image", "replies": [{"body": "\nHi Dalia,\n\n1. Honeybee doesn't have a component for that, but it's pretty straightforward to do it using Radiance's PValue ([http://radsite.lbl.gov/radiance/man_html/pvalue.1.html](http://radsite.lbl.gov/radiance/man_html/pvalue.1.html)). If you are more comfortable using an interface then try wxFalseColor ([http://tbleicher.github.io/wxfalsecolor/](http://tbleicher.github.io/wxfalsecolor/)).\n\n\n\n2. Not possible at the moment.\n\n\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "July 11, 2015 at 8:37am", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nHi Mostapha,\n\n\n\nI'd like to share an experience here, and perhaps a workflow that might be interesting to some. I've been messing around with rhendering lately. I find that realistic renderings are great tools in trying to display sustainable building attributes and advantages. One of the interesting areas of intersection between rendering and LB/HB is daylighting of course.\n\n\n\nThe workflow I'm doing is something of a 'on-site' daylighting analysis. This consists of actual site visits, that being an empty lot or a room in some building, and using digital cameras to take a number of HDR images in order to compose an HDR dome (at a certain time of day ofc). This dome then can be used to light your scene (e.g. an interior viewpoint of a room) in most renderers thereby creating not only a nice photorealistic result (due to the native HDR quality) but also a photometrically accurate result (i.e. shadows, glare, and luminance 'as is' on site)!\n\n\n\nNow, most renderers can output this as an HDR image which can then be linked to HB, allowing for some environmental analysis of rendered images. Linking these two workflows, both taking place within Rhino, is quite valuable in my opinion. As a sanity check, this would work with the current components handling HDRs no? Finally, a feature in HB like the one described Dalia, while not necessary, would enchance this workflow. Or is anyone out there working on porting wsFalseColor? :)\n\n\n\nKind regards,\n\nTheodore.\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "July 18, 2015 at 11:02pm", "created_by": "TheodorosGalanos", "replies": []}, {"body": "\nHello\n\n\n\nI had a similar problem and tried to use the wxFalseColor but I cant get it to work. Im not very familiar with Python at all so I probably doing something wrong.\n\n\n\nI drag and drop the wxFalseColor into Python, but then I havent figured out how to import the hdr. photo.\n\nI tried to drag in the hdr file into python and I tried to type \"python wxfalsecolor.py [image.hdr]\", but then I get \"SyntaxError: invalid syntax\"\n\n\n\nI know this should be simple, but i cant get it to work. How do I open the program and open an HDR in it?\n", "attachments": [], "created_by_name": "Mads Jeppesen", "created_at": "January 4, 2017 at 6:21am", "created_by": "MadsJeppesen", "replies": [{"body": "\nDownload the exe file and then run it. There is an open hdr button.\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/BWHXRC*DO7lT5if8ln-F1jcVquGws8mzR9NOPNM6AsYBBNthqCvhNoP-GRdJE46r5wpvYP8jV*HHdl*JxKQAOZkFXee6NMF8/wxfalsecolor.PNG\" width=\"612\"/>](http://api.ning.com:80/files/BWHXRC*DO7lT5if8ln-F1jcVquGws8mzR9NOPNM6AsYBBNthqCvhNoP-GRdJE46r5wpvYP8jV*HHdl*JxKQAOZkFXee6NMF8/wxfalsecolor.PNG)\n\n\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "January 4, 2017 at 11:34am", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nThanks Mostapha\n\n\n\nThats better approch.\n\nHowever I get the problem when i open a file that i get:\n\n\"Error reading pixel values\n\ncommand not found in search path 'p-value'\"\n\nThe program opens the HDR and makes it visible to the right, but when ever i press something and \"updated fc\" or \"apply pcond\" i get an error.\n\n\n\nWhat is wrong with hdr file? I made it Grasshopper with Honeybee and i tried to make some new renders with same problems.\n", "attachments": [], "created_by_name": "Mads Jeppesen", "created_at": "January 4, 2017 at 12:30pm", "created_by": "MadsJeppesen", "replies": []}, {"body": "\nIt doesn't have to do with the image. wxFalseColor can't find radiance files. You have to either add radiance to your system path or copy wxfalsecolor to c:\\radiance\\bin where radiance utilities are installed.\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "January 4, 2017 at 8:56pm", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nPerfect! Thanks alot!\n", "attachments": [], "created_by_name": "Mads Jeppesen", "created_at": "January 5, 2017 at 1:47am", "created_by": "MadsJeppesen", "replies": []}]}]}