{"body": "\nI've been trying to create a model of a space with variable skylight placement, scaling, form, number, and orientation, that can be manipulated by Octopus based on several different properties measured by Honeybee.<br/><br/>Currently, I have the space modeled with the desired flexibility and successfully turned into a number of HBZones, which appear to work correctly with both the Annual Daylight and Daylight Factor Simulations (these are the only two I have tried so far, but eventually I want to add Energy Simulations as well).\n\n\n\nThe roof is modeled with significant (and arbitrary) thickness so that the skylights have depth, and I can manipulate the material of those wall surfaces since that will affect how light is dispersed into the space. However, I cannot figure out how to control the material of the glazing, because that is added after the point where I was able to set the material for those walls.\n\n\n\nThe only way I found that seemed like it may give me the opportunity to change those materials was to decompose all of the zones with any glazing then completely reassemble them after applying the material. That presented a few issues: firstly, it seemed more like a very long work around than the correct way to do it; secondly; it seemed to require that each srf be fed back through a createHBSrfs component again before createHBZones was able to use it and I'm not sure if this reprocessing loses any of the properties that were already assigned; and finally, with an indeterminate number of skylights the components seem to treat the trees inconsistently (particularly dealing with the difference between passing one object and passing multiple objects), which is an issue that I have already had to come up with a questionable work around for elsewhere.\n\n\n\nI have attached the code (which will require Heteroptera in order to work fully). It seems like it's set up correctly and providing accurate results, but please let me know if I have made a mistake in what is here already, and I would appreciate it if anyone could help me figure out the best way to add the ability to manipulate the glazing material or restructure the definition to include that option.\n\n\n\nThank you!\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1311288", "name": "VariableSkylights.gh"}], "created_by_name": "Thomas Powers", "created_at": "June 18, 2015 at 4:03pm", "created_by": "ThomasPowers", "topic": "Changing Glazing Material", "replies": [{"body": "\nHi Thomas,\n\nYou can use Honeybee_Set Radiance Materials to set up skylight material without decomposing the zone. Is that what you are looking for?\n\n\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/pX4h1nu50oE1-vhYRDVi1Au8o2OQlS5TUy1OEkD70gRlsSfw-OMM-PF*-ms-nF1W6t6LZvorayQRinzod4sy*CxfWho93jDb/setRadianceMaterial.jpg\" width=\"675\"/>](http://api.ning.com:80/files/pX4h1nu50oE1-vhYRDVi1Au8o2OQlS5TUy1OEkD70gRlsSfw-OMM-PF*-ms-nF1W6t6LZvorayQRinzod4sy*CxfWho93jDb/setRadianceMaterial.jpg)\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "June 19, 2015 at 3:49am", "created_by": "MostaphaSadeghipour", "replies": [{"body": "\nYes, That is exactly what I was trying to find. Thank you\n", "attachments": [], "created_by_name": "Thomas Powers", "created_at": "June 22, 2015 at 7:33am", "created_by": "ThomasPowers", "replies": []}]}], "id": "1311289"}