{"body": "\nHi,\n\nI have two doubts:\n\n\n\nThank you,\n\nVinu\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1321082", "name": "glazingDoubt.PNG"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1321083", "name": "modelDoubt.gh"}], "created_by_name": "Vinu Subashini", "created_at": "July 6, 2015 at 4:49pm", "created_by": "VinuSubashini", "topic": "Glazing ratio Clarification and comparing simulation datas", "replies": [{"body": "\nHi Vinu,\n\n\n\n1. It's because how you modeled the surface. I just remodeled it (deleted the surface and cap the geometry) and it works as expected.\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/KWPY3KRntMxvcEtt5rbQ6o7vQdHzTqMbx2SVsQnyk0tgIgvmW6Kx1oOhN-Y91Vf21vXkOPrZC5Y80eNmd87ulnoXVxzs5UPs/Window_Perspective.png\" width=\"716\"/>](http://api.ning.com:80/files/KWPY3KRntMxvcEtt5rbQ6o7vQdHzTqMbx2SVsQnyk0tgIgvmW6Kx1oOhN-Y91Vf21vXkOPrZC5Y80eNmd87ulnoXVxzs5UPs/Window_Perspective.png)\n\n2. I'm not sure if I understand the question. You can run all the cases that you want one by one and then import the results all together. What is exactly your problem/doubt?\n\n\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "July 6, 2015 at 5:41pm", "created_by": "MostaphaSadeghipour", "replies": [{"body": "\nHi Mostapha,\n\n Thank you, I don't want the opening at the lower end at all. I will try deleting the surface and cap the geometry. Should I just rebuild the model to the specific window dimensions I need? regarding my second doubt I sent you a message.\n\nthank you once again!\n\nVinu\n", "attachments": [], "created_by_name": "Vinu Subashini", "created_at": "July 6, 2015 at 7:44pm", "created_by": "VinuSubashini", "replies": []}, {"body": "\nHi Vinu,\n\n1. To clarify with the sill height, this input works on a surface-by-surface basis and is not absolute to the zone (that could easily create conditions where the input glazing ratio did not match the actual geometric glazing ratio produced).\n\nYou probably want to use the addHBGlz component for your case and make a custom window surface (perhaps doing so parametrically with native GH components if you still want to be able to change the glazing ratio).  I think this addHBGlz component will be particularly helpful if you sync with the Honeybee github since Mostapha just put in the capability to plug in an entire zone to this component a few days ago.  Now that you can plug in an whole zone and the component will automatically figure out which surface of the zone the window should be belong to.  Immensely useful for cases like yours.\n\n2. Are you looking to evaluate the effect of the blinds on thermal performance or on daylight?\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "July 6, 2015 at 8:32pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nHi Chris,\n\n[<img class=\"align-left\" src=\"http://api.ning.com:80/files/KWPY3KRntMxYBZ35YF4AsHbPdXT1*hdRNxkWhR8ApbQEULM8cPD0sy5TwQhYTkh0SAxyP*g9s2DQo7usXkZrY8tr5KuU8WMk/img001.jpg?width=721\" width=\"721\"/>](http://api.ning.com:80/files/KWPY3KRntMxYBZ35YF4AsHbPdXT1*hdRNxkWhR8ApbQEULM8cPD0sy5TwQhYTkh0SAxyP*g9s2DQo7usXkZrY8tr5KuU8WMk/img001.jpg)\n\n        \n\nI have an interface in html where people can choose how they feel, I following the pmv 7 scale model. Hot, warm, slightly warm, neutral, slightly cool, cool, cold. When they make their choice of expressions, I am predetermining the options and sending it to grasshopper/ladybug(like a schedule). I know I can do this option as each case but I am wondering whether I can program to run the simulation through all options or if you have any other way to go about it, could you let me know? I am not an expert at programming but I am learning. \n\nThis is what I messaged Mostapha too and I have attached my research abstract to give you an overview of what I am doing. \n\n<br/>Thank you Chris and Mostapha!\n\n<br/>Vinu\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1321614", "name": "lwlaAbstract.png"}], "created_by_name": "Vinu Subashini", "created_at": "July 7, 2015 at 12:09am", "created_by": "VinuSubashini", "replies": []}, {"body": "\nHi Vinu,\n\n1. Chris means to update your components to the latest version (which lives on github). You can use update components to update your components or you can download it manually from Github. Here is an example for the new version of the component ([http://www.grasshopper3d.com/group/ladybug/forum/topics/is-there-a-...](http://www.grasshopper3d.com/group/ladybug/forum/topics/is-there-a-quick-way-to-add-a-window-to-a-surface-of-a-zone?commentId=2985220%3AComment%3A1316675&amp;groupId=2985220%3AGroup%3A658987)).\n\n\n\n2. Thank you for sharing the image and the abstract. It's an interesting approach. I'm not sure if I understand how the feedback loop works but here is my 2 cents based on my current understanding.\n\nIf the geometry is not changing in your case I think the best approach for you is to export the idf file once from Honeybee, and then run your cases from the command line in the server.\n\nIn this case you will have one main .idf file which looks for some .csv files as the schedule. Now you can re-write the csv file and run the simulation from the command line and parse the results back.\n\nBased on the number of your scenarios you may want to have a couple of idf files for different cases and run them all in parallel. That should give you a better performance.\n\nI hope I understand your problem right! Feel free to continue the conversation here if you have any other questions.\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "July 8, 2015 at 2:45pm", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nHi Mostapha,\n\nHow to connect many idf files and run them all in parallel?\n\nVinu\n", "attachments": [], "created_by_name": "Vinu Subashini", "created_at": "September 14, 2015 at 6:25pm", "created_by": "VinuSubashini", "replies": []}, {"body": "\nThere is no component in Honeybee to do this but you can develop your own. Here is a code example that Honeybee uses to run multiple daylight simulations at the same time: [https://github.com/mostaphaRoudsari/Honeybee/blob/master/src/Honeyb...](https://github.com/mostaphaRoudsari/Honeybee/blob/master/src/Honeybee_Honeybee.py#L1895-L1913)\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "September 22, 2015 at 4:48pm", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nRelated: [http://www.grasshopper3d.com/group/ladybug/forum/topics/running-sev...](http://www.grasshopper3d.com/group/ladybug/forum/topics/running-several-e-simulations-at-a-time?commentId=2985220%3AComment%3A1366863&amp;groupId=2985220%3AGroup%3A658987)\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "September 22, 2015 at 7:44pm", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nThank you for the example model!\n", "attachments": [], "created_by_name": "Vinu Subashini", "created_at": "September 23, 2015 at 3:51pm", "created_by": "VinuSubashini", "replies": []}, {"body": "\nQuestions/Suggestions:\n\n\n\nHow many users are going to interact with the interface at the same time? That may change the architecture of your system. You may need to run much more simulations at the same time - I also think there might be solutions to pre-run the simulations.\n\nOne of the feedback that I was always thinking to give to an occupant is to tell them the effect of their decision also in $. For example if you can tell them by bringing the thermostat down for 2 degrees and tolerating a higher comfort range they will save X amount of money in the year that might make people thinking about it in a different way. Energy and comfort metrics are so abstract for the majority of the occupants!\n\n\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "July 8, 2015 at 2:49pm", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\n1. Thank you, I am updating the model!\n\n2. Yes the geometry is not changing, I am going to run them parallel, it  looks like the best plan. Initially it's going to be for one person and then I will be adding for multiple occupants/users interaction. Yes I agree with your idea too, thank you!!! trade-offs is also part of the design but it is still conceptual. Will keep you posted about the work. \n", "attachments": [], "created_by_name": "Vinu Subashini", "created_at": "July 9, 2015 at 1:30pm", "created_by": "VinuSubashini", "replies": []}]}]}