{"body": "\nHello everyone!\n\n\n\nI am considering setting up a small research project which will focus on developing components useful for environmental analysis, always closely related to the built environment and most of the times in internal building performance.\n\n\n\nI was wondering if I could brainstorm with you on what would be useful or needed at the time.\n\n\n\nI would love to develop these as a complement to Ladybug/Honeybee as well, but given the tools are so highly developed at the moment it was hard for me to find a direction that would prove useful.\n\n\n\nAny ideas would be very welcome!\n\n\n\nMostapha/Chris, if something like that started would it be possible to have a cooperation on testing and/or developing within LB/HB?\n\n\n\nThank you very much in advance!\n\n\n\nKind regards,\n\nTheodore.\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "July 15, 2015 at 9:05am", "created_by": "TheodorosGalanos", "topic": "Research Project Ideas!", "replies": [{"body": "\nTheodore,\n\n\n\nI'm not sure the following is applicable to what you are considering, but maybe my issue inspires a cool thought. Let me know what you think.\n\n \n\nOne of our major problems with energy models is that they require so much detailed information to be accurate (building form, materials, system design assumptions) that it is hard to use them during conceptual design, when they can best influence major design decisions. Often the range of potential assumptions are so large we introduce huge error while outputting misleadingly precise numbers. This data, if not properly understood, is dangerous. Ideally, we would iterate through the max, min, and expected value of all input assumptions to gather a cloud of data that represents all likely outcomes, rather than a single assumption. This would then allow us to gather useful info without requiring accurate inputs.\n\n \n\nThis workflow can be built using honeybee components, but we have little direction on what inputs are most critical for various climates, or what those ranges should be. A study that focused on the sensitivity of the energy model to various inputs could help our teams focus on nailing down critical elements first, without wasting time refining parameters that don't really matter. Perhaps a pattern will emerge for typical building types in various climates that can help guide design teams.\n\n \n\nPerhaps you could develop a module to identify which major parameters (solar gain, infiltration, U-values) are most likely to have the greatest impact on an energy model based in various climates. I'm imagining the passive strategy tool already developed in HB, but focused on refining our energy model assumptions based on weather data. If we knew which parameters are likely to be most impactful, or the range of error we should expect at a given stage of a project, it might help us better use energy modeling information in the early stages of design.\n\n \n\nIf anyone else has found a way past this problem, please let me know!\n", "attachments": [], "created_by_name": "Leland Curtis", "created_at": "July 15, 2015 at 10:03am", "created_by": "LelandCurtis", "replies": [{"body": "\nHi Leland,\n\n\n\nI have been thinking about this since I started working in this sector. I am working in a quite specific environment (the tropics) where definitely different parameters affect building performance than in other places. \n\n\n\nMy idea, which I haven't been able to follow up, is to make a performance-based matrix for building construction. It would be a simple matrix, dividing a building to its main components (e.g. ACMV, envelope, massing, glazing, etc.) and then dividing those components to their elements (e.g. chiller types, AHUs, WWR, U values, thickness, etc. etc.). \n\n\n\nBy itself this isn't that ground breaking, I imagine there have been hundreds of these papers around. My idea, in order to actually make this a performance-based tool as I mentioned, was to connect all this to Life Cycle Analysis. In essence, LCA could be used to inform both on the 'supply side' of things, that is environmental assessment of manufacturing, transportation, construction, and implementation of the different types of components and elements, and on the 'demand side' of things, that is operational performance analysis of buildings.\n\n\n\nIn this way we could get some kind of matrix which could be quickly used to form strategies on early stage design. However, to do this, in a meaningful timeframe, we would need two things:\n\n\n\n1. Some kind of database of construction materials, product solutions, and systems (EPDs seem the obvious candidate here).\n\n2. Some kind of meta analysis of data from actual operating buildings.\n\n\n\nThe first is quite easy, or at least doable (I have around 250 EPDs from a 2-day searching 'trip' online). The second is much harder, this data is usually sensitive. But perhaps, for the sake of early design, research data can be used here to draw general conclusions.\n\n\n\nNow, linking this to LB/HB. Do you mean a kind of component that outputs templates for different buildings and/or climates? Perhaps a template that would then set the different options for the different elements? Or maybe, this would be more valuable I think, a component indicating which elements should be investigated (in a parametric way) allowing for quick generation of different models?\n\n\n\nKind regards,\n\nTheodore.\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "July 16, 2015 at 1:26am", "created_by": "TheodorosGalanos", "replies": []}]}, {"body": "", "attachments": [], "created_by_name": "Igor Mitrić Lavovski", "created_at": "July 15, 2015 at 10:04am", "created_by": "Igor425", "replies": [{"body": "\nHi Igor, \n\n\n\nWhile that is a nice idea I fear I don't really believe in wind energy, especially in conjuction with the built environment.\n\n\n\nI won't take it off the mental list I'm preparing but it wouldn't be a priority am afraid. Unless you believe otherwise?\n\n\n\nKind regards,\n\nTheodore.\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "July 16, 2015 at 1:15am", "created_by": "TheodorosGalanos", "replies": []}]}, {"body": "", "attachments": [], "created_by_name": "Igor Mitrić Lavovski", "created_at": "July 15, 2015 at 3:31pm", "created_by": "Igor425", "replies": []}, {"body": "\nHi Theodore,\n\nThank you for starting this discussion. Back to similar questions my first answer is what are you really interested to do in this area? What is the topic that jumps on your nerves and you think should be done in a better way? I think that's what you should be doing for your first development. It shouldn't be hard to get started with development for Ladybug and Honeybee and so far we had a good experience with several developers who joined us.\n\nIf I want to answer my question above based on what I can see down there, you're really interested in LCA. That could be one of the options that we really need some help there. There is an on-going effort for LCA to connect Honeybee to Tortuga ([https://github.com/moethu/Tortuga#tortuga](https://github.com/moethu/Tortuga#tortuga)). If you like I can put you in touch with the team so you can get involved and help them with the process.\n\n\n\nHere is the list of other topics that we currently need help with:\n\n- Implementing AFN for EnergyPlus [Honeybee]\n\n- Implementing 3Phase daylight simulation [Honeybee]\n\n- Finishing Implementation of HVAC systems with OpenStudio\n\n- Connection to OpenFoam for CFD simulation [Butterfly] - I'm planning to restart the process now that OpenFoam will have a Windows version and the initial project is outdated. I need some people with CFD simulation expertise and good knowledge of OpenFOAM \n\n- Data visualization There is so much to be done here. Interactive web based data visualization is something critical that we are still missing from the process. I have started some work but never had enough time to get something really useful done more than epwmap and pollination\n\n\n\nAgain I think you should first answer the question about what is the topic that has been bothering you for a long time and you feel excited enough to solve it to stay up all night and figure it out!\n\n\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "July 16, 2015 at 8:34am", "created_by": "MostaphaSadeghipour", "replies": [{"body": "\nHi Mostapha,\n\n\n\nThank you so much for the response. You are right I should have started with the gaps, it's usually where new things come from.\n\n\n\nI feel the thing I would like to implement most in this kind of interface is CFD. We have done some code development and we are actualy now in the process of developing a simple interface for openfoam (Linux) that would help us streamline our simulations (which are usually one of a certain number of standard scenarios. I believe CFD to be as important as energy simulation for the built environment (perhaps even more for indoor comfort) but it's much harder for people to access. In that light, I would love to help in anyway I can in the Butterfly project. My programming skills are quite bad (although I'm home-schooling myself lately) but I do have a somewhat good understanding of openfoam/cfd. I have to admit though didn't realize there would be a Windows version, any chance we can get foam extend? Anywayds, if you go for it let me know!\n\n\n\nOther parts I would feel there is a gap you already mentioned:\n\n1. Visualization. Actually my home schooled programming is on javascript and d3.js. There is so much data out there concerning building operations and it's very hard to transform them to information useful for us or owners/clients. I am hoping to start a small research project soon on D3.js. My idea is to develop a kind of system in which data (presumably databases) can be 'thrown in' a D3 site which would then transform this data into a series of graphs, plots, etc., into a more structured representation. An example I'm thinking here is EMS data outputs.\n\n\n\n2. LCA. This however is a frustrating part. My main expertise is in LCA but that doesn't mean I like the world of (especially commercial) LCA. While there are a ton of wonderful people to help you (lca-list is amazing for example) there are close to none open data for LCA. Also, one of its biggest disadvantages is it's geographic relevance (never site specific) which is quite important for the construction industry. But with the popularity EPDs are getting lately and the easy way they can be used for simple LCAs I think it's time for some development here as well. So I wouldn't mind the introduction, if the people over there require some assistance.\n\n\n\n3. Easy use of detailed ACMV (sorry for the tropical term) simulations. I get quite frustrated when I have to use DesignBuilder for detailed simulations, the program is just so limiting in the design capabilities. That is why I am so excited for the Openstudio components getting back on track!\n\n\n\nP.S.: Hadn't heard of 3 phase daylight simulation, sounds so cool! \n\n\n\nKind regards,\n\nTheodore.\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "July 16, 2015 at 9:54am", "created_by": "TheodorosGalanos", "replies": []}, {"body": "\nHi Theodore,\n\n\n\nSounds great! Let's start getting you involved in Butterfly then. I will create a github repository so we can communicate effectively. The new version for OpenFOAM for Windows is pretty new and is [available only by request](https://twitter.com/openfoam?original_referer=http%3A%2F%2Fwww.openfoam.com%2Fnews%2F&amp;profile_id=212604814&amp;tw_i=616617240155303936&amp;tw_p=embeddedtimeline&amp;tw_w=348369787212140544). There are also alternate options for Windows such as this one: [http://www.cfdsupport.com/openfoam-for-windows.html](http://www.cfdsupport.com/openfoam-for-windows.html)\n\n\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "July 19, 2015 at 6:00am", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nSounds good Mostapha.\n\n\n\nI already contacted openfoam for the windows version, hoping they are liberal in sharing it.\n\n\n\nI was thinking. The most difficult part usually, at least in terms of opensource software availability, is grid generation. While most solvers are free good grid generators are not, and extremely expensive. Is Rhino up for this job? Really haven't given it much though as of now, will try and look into it myself\n\n\n\nAnyways, exciting stuff!\n\n\n\nKind regards,\n\nTheodore.\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "July 19, 2015 at 7:37pm", "created_by": "TheodorosGalanos", "replies": []}, {"body": "\nHi Theodore,\n\n\n\nHere you go &gt; ([https://github.com/mostaphaRoudsari/Butterfly](https://github.com/mostaphaRoudsari/Butterfly)) Do you have a github account?\n\n\n\nI talked to Stefan and he will be also helping with the project. Right now he sent me an example for a simple room with two windows which will be the first case to complete.\n\n\n\nI wonder if you can help with the 2D part development. Let's get a very simple 2D case exported to OpenFOAM. Do you have an example file that runs with no issues?\n\n\n\nBack to grid, we will be using OpenFOAM's meshing plugins such as snappyHexMesh ([http://cfd.direct/openfoam/user-guide/snappyhexmesh/](http://cfd.direct/openfoam/user-guide/snappyhexmesh/)) and visualize it back into Rhino.\n\n\n\nLet's continue the conversations on github. I need to contact a couple of more people who can probably help us with the development and testing, and then we can have the kick-off meeting at some point on hangout/skype.\n\n\n\nCheers,\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "July 21, 2015 at 8:13am", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nHi Mostapha,\n\n\n\nYes I do: TheodoreGalanos\n\n\n\nSounds good. I mainly deal with 3D cases but I'm sure I can get a simple 2D example from OpenFoam. By the way internal cases can be more complicated than external, we can also start from a simple external as well. I have more of those.\n\n\n\nSnappyHexMesh it is then, makes for an easier transition for me. Whole other science the meshing though. Rhino is also excellent for stl creation to feed into snappy. Anyways, I'm blabering again, we'll talk more on github. Will get the case running. Excited!\n\n\n\nKind regards,\n\nTheodore.\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "July 21, 2015 at 8:54am", "created_by": "TheodorosGalanos", "replies": []}, {"body": "\nHi Theodore,\n\nThanks. I added you to the repository!\n\nOutdoor examples are good too and is what we initially did for the other project but for the first template I want to keep it as simple as possible so we don't need much power for development and testing. My laptop won't even be able to generate the mesh and load it for an outdoor study! That's why I think we should start with 2D and indoor 3D first and once the workflow is developed we'll move to outdoor analysis.\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "July 21, 2015 at 10:58am", "created_by": "MostaphaSadeghipour", "replies": []}]}]}