{"body": "\nI have some shades generated using the **EPWindowShades** component (see image 1).\n\n\n\nHowever, they're not shown when using the **shadings** output node in the **Decompose by Type** component. (image 2)\n\n\n\nCan anybody kindly advise why this doesn't work?\n\n\n\nThanks!\n\n\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/vr8e9vI-HyOL0LRg*lVHiq05egl8POXA3a2vjmE0cBPyuI6l*GqXJMTGaCCJNbaRKJBImlwXdOoaJC5s5kQF73LicVGEDr*Q/01.PNG?width=750\" width=\"750\"/>](http://api.ning.com:80/files/vr8e9vI-HyOL0LRg*lVHiq05egl8POXA3a2vjmE0cBPyuI6l*GqXJMTGaCCJNbaRKJBImlwXdOoaJC5s5kQF73LicVGEDr*Q/01.PNG)[<img class=\"align-full\" src=\"http://api.ning.com:80/files/vr8e9vI-HyPJ-FVnhE89A-fPwAVyozj4Gcvx5Earx9sdHkTV--M40xOTN2-9jeptG2RuRw3b5I*usBRzDBaI7au-2RttyNkN/02.PNG?width=750\" width=\"750\"/>](http://api.ning.com:80/files/vr8e9vI-HyPJ-FVnhE89A-fPwAVyozj4Gcvx5Earx9sdHkTV--M40xOTN2-9jeptG2RuRw3b5I*usBRzDBaI7au-2RttyNkN/02.PNG)\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1332421", "name": "tut_test_v039_ZJ.gh"}], "created_by_name": "Grasshope", "created_at": "July 25, 2015 at 11:15pm", "created_by": "Grasshope", "topic": "shades generated by Window Shades Generator are not shown by Decompose by Type", "replies": [{"body": "", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "July 26, 2015 at 12:24am", "created_by": "AbrahamYezioro", "replies": [{"body": "\nSee attached, so it is more clear ... hopefully.<br/>-A.\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1332320", "name": "tut_test_v039_ZJ_AY.gh"}], "created_by_name": "Abraham Yezioro", "created_at": "July 26, 2015 at 12:28am", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nThank you very much, Abraham!\n\n\n\nI also got similar understanding reading the notation of the **EPWindowShade** component which is to generate shading control definition for a window, rather than creating shading geometry specifically. \n\n\n\nThe shadeBreps geometry output from this component can be used as HBContext object, but it will lose all the shading control definition and become pure obstruction geometry.\n\n\n\nSo, we either use the **EPWindowShade** component to define blinds for windows, or use the shading geometry created as HBContext geometry, but not both at the same time such as the the case in your GH file which will create **double shading** for a window.\n\n\n\nAm I correct?\n", "attachments": [], "created_by_name": "Grasshope", "created_at": "July 26, 2015 at 1:02am", "created_by": "Grasshope", "replies": []}, {"body": "\nNot quite.\n\nThe case i sent don't use \"double\" shading. Notice that the i didn't use any further the output of the HB_EPWindowShades component.\n\nBut if i will i can have both (Blinds andexternal shades).\n\n\n\nYou can have some control in the external shades applying transparence schedule to the context component. There is a very good video tutorial from Chris on this one.\n\n\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "July 26, 2015 at 1:26am", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nPardon me, Abraham, for not noticing that in your GH file the **HBObjWShdes** output of the **EPWindowShade** component is not used as the input for **Energy Simulation** component!\n\n\n\nThis begs another questios: What does the **shadings** output in the **decomposeByType** component refer to?\n\n\n\nIn OpenStudio, shading surface (or overhang) can be generated for individual window surface based on projection factor. Is this type of shadings that can be shown using the **decomposeByType** component?\n\n\n", "attachments": [], "created_by_name": "Grasshope", "created_at": "July 26, 2015 at 2:01am", "created_by": "Grasshope", "replies": []}, {"body": "\nI assume (but i might be wrong) that those shadings are geometry WHEN you use the ZoneData inputs for the HB_EPWindowShades. then, instead of Blinds the component creates Shading Devices.\n\nAgain, this is my assumption. I didn't try doing the simulation and inputting those.\n\nA more educated response will come from Chris on this respect.\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "July 26, 2015 at 2:07am", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nHey Guys,\n\n\n\nI am sorry that I am so late to the discussion and I really should have stepped in to make things clear earlier.  It seems like you figured out generally how the component is supposed to work and I will just clarify some of the details.  I will also note that I do not know what the **shadings** output of the **decomposeByType **component is supposed to do as Mostapha put it there a long time ago and I was not sure what his intentions were. Going down a list of clarification points:\n\n\n\n1) You are right that you should either connect up the shade breps to the **EPContext** component or just plug the **HBObjwShades** into the **RunSimulation** component (never do both).  However, connecting the breps to the **EPContext** component is greatly undesirable for two reasons: It will make the simulation run much longer and the energyPlus calculation will not account for the surface temperatures of the blinds (it will assume they are the same temperature as the outdoor air, which is very wrong in a lot of cases).  When you connect up the **HBObjwShades** to run the simulation, EnergyPlus will understand the blinds as abstract objects defined only by a numeric parameterization and not as actual geometry.  This enables the calculation to run fast and is also enough of a description that E+ can calculate the temperature of the blinds, thereby accounting for the heat that can be re-radiated from the blinds to the indoors when they get hot in the sun.  This more desirable way of running the blinds was how I imagined the component being run most of the time and I mostly included the shadeBreps so that you have a visual of what you are simulating.\n\n\n\n2) When you use the more desirable **HBObjWShades** to approximate your blinds, you should use the **blindsSchedule** input in order to tell E+ when the shades are pulled (this is instead of the **transShcedule** on the **EPContext** component).\n\n\n\n3) The **zoneData** inputs on the **EPWindowShade** component are meant to help in an entirely different workflow, which evaluates shade benefit based on energy simulation results.  I apologize if it seems confusing to have two major uses of the component in one but we have so many Honeybee components right now and I did not want to make 2 separate ones when they seemed so similar.  See this example file to see how to do energy shade benefit ([https://app.box.com/s/oi64zoj5u1slz494grzhgmdkx7yie9jo](https://app.box.com/s/oi64zoj5u1slz494grzhgmdkx7yie9jo)).\n\n\n\nOk.  I think that clears up everything that I know. Now to the part that I do not.  As I said, Mostapha put in the **shadings** input there a long time ago and I do not know what his intentions were.  Abraham, as you know, I am about to do a major revision of the **EPWindowShade** component to make it compatible with OpenStudio, include drapes/generic shades in addition to blinds, and I also should figure out how to do electrochromic glazing.  I can easily include all of the visualized shades as output from the **decomposeByType** component when I do this.  However, I do not want to interfere with other intentions Mostapha had when he put the input in.  If he could confirm that this was in-line with his vision for the **shadings** output, I will implement it soon.\n\n\n\n-Chris\n\n\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "August 1, 2015 at 9:15am", "created_by": "ChrisMackey", "replies": []}, {"body": "\nThanks Chris,\n\nAs usual, very thorough answer.\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "August 1, 2015 at 10:41am", "created_by": "AbrahamYezioro", "replies": []}]}]}