{"body": "\nHi all,\n\n\n\nIn creating new schedules for the buildings here in NZ, I have found that there is no way for me to save these schedules to the EP schedule library as you can to the construction library.\n\n\n\nIs there a way this could be added to Honeybee, assuming that you would be able to create new building programs?\n", "attachments": [], "created_by_name": "Elzine Braasch", "created_at": "July 29, 2015 at 4:47pm", "created_by": "ElzineBraasch", "topic": "WISH: Creating and Adding new Schedules to the EP Library", "replies": [{"body": "\nHi Elzine,\n\n\n\nThere are couple of discussions on the same topic. You actually can add any standard EnergyPlus schedule to Honeybee. All you need to do is to copy your schedules into \"userCustomEPLibrary.idf\" and they will be loaded automatically once you let the Honeybee fly next time. Finally you can use \"Honeybee_Call from EP Schedule Library\" component to find the new schedules inside Grasshopper.\n\n\n\nYou can find \"userCustomEPLibrary.idf\" under Ladybug's default working directory.\n\n\n\nHope it helps,\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "July 31, 2015 at 4:42am", "created_by": "MostaphaSadeghipour", "replies": [{"body": "\nMostapha,\n\nIt will be true to say that what you wrote will work ONLY with schedule files (and maybe compact schedules) and that the pointer in the\"userCustomLibrary\" will be to such files?\n\nThe reason i'm asking is that usually schedules in E+ are linked one to another (Yearly, weekly, daily/ hourly). If i add those to the library and i call one of them in GH it will also wrote the linked ones?\n\nope i'm asking this properly. Sounds confusing ...\n\nThanks,\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "July 31, 2015 at 10:20am", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nCompact schedules is working fine. Also it copies the TypeLimits.\n\nNot clear if other type of schedules will also work.\n\nI'll try and i'll report. But if there is a more educated answer before ... bless you :-)\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "July 31, 2015 at 11:56am", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nOk,\n\nI tested with different schedule types (compact and yearly, and of course files). I can say that so far it is working fine with me. It works as Mostapha explained above (copying the relevant schedules - all linked ones) to the userCustomLibrary.\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "August 2, 2015 at 3:19am", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nThis is awesome thanks guys, I have been perusing the forums for a bit to see if I can find topics discussing adding new schedules but I clearly must have missed them!\n\n\n\nThis works for me, thank you again!\n", "attachments": [], "created_by_name": "Elzine Braasch", "created_at": "August 2, 2015 at 4:15pm", "created_by": "ElzineBraasch", "replies": []}, {"body": "\nAbraham,  thanks for testing all of this.  To be honest, I never realized all of the flexibility that Mostapha built into the userCustomLibrary.  Elly, I can confirm that you have not missed topics on the forum and you are really one of the first to explore these awesome features in depth. Mostapha, your anticipation of people's needs in the way that you set up Honeybee never ceases to amaze me.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "August 3, 2015 at 7:45am", "created_by": "ChrisMackey", "replies": []}, {"body": "\nFor some reason when I used the userCustomLibrary to add new schedules to honeybee, the idf file that was written wrote some parts in the wrong lines.\n\n\n\nWould you be able to direct me to the documentation that explains the way userCustomLibrary works, as I assume it must write the added objects to a master template file? I cannot find the names of the new schedules in any of the master template idf files which are within the ladybug directory, so cannot check if it has simply copied the objects wrong.\n\n\n\nI've attached the idf testing file which had been written. The schedules have all been written over well, but for some reason one of the added schedules via userCustomLibrary has found itself in amongst the ScheduleLimitTypes of the idf file?\n\n\n\nCould this be because honeybee works with version 8.1 and we have 8.2 installed at the university as the EnergyPlus version?\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1338435", "name": "Office_Test.idf"}], "created_by_name": "Elzine Braasch", "created_at": "August 4, 2015 at 10:50pm", "created_by": "ElzineBraasch", "replies": []}, {"body": "\nIt will be helpful to upload the custom library.\n\nThere is no further documentation beyond what is in the hint of the component or what you can find in the group discussion.\n\nHB is working now with E+ 8.3, so probably you are using an \"old\" version. Don't think it is related but ...\n\nWhat i've noticed is that in the created IDF the Yearly schedule is named accordingly to the Library, but the dependent schedules (week, hour) received  different names than those in the library.\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "August 5, 2015 at 1:00am", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nI second Abraham's suggestion. Can you also upload the original schedule. That way we can trace the issue.\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "August 5, 2015 at 7:43am", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nElly,\n\nAs Abraham and Mostapha say, we will need both your userCustomLibrary and your GH file to know exactly what is happening.\n\nGenerally, when you let Honeybee_Honeybee fly, it copies all of the schedules in the OpenStudioMasterTemplate and the userCustomLibrary to the memory of Grasshopper so that they can later be used to write the IDF.  So there is not other place that Honeybee is writing these things except your final IDFs.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "August 5, 2015 at 7:00pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nAh, I've had a closer look into the userCustomLibrary and the schedules I was trying to copy over.The schedule type limits for \"Any Number\" or \"Number\" do not have lower or high limits assigned to them and these must not be copying over as expected when writing the idf.\n\n\n\nAttached is the idf model which I am extracting the idf data from. This idf is from a phd study here in New Zealand, \"An Exploration of the feasibility of converting the New Zealand commercial building stock to be net zero energy\" by Shaan Cory.\n\nThe gh is a draft of the template set up.\n\n\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1339026", "name": "Template_Office.gh"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1339027", "name": "userCustomEPLibrary.idf"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1339028", "name": "Schedules_Example.idf"}], "created_by_name": "Elzine Braasch", "created_at": "August 5, 2015 at 11:25pm", "created_by": "ElzineBraasch", "replies": []}, {"body": "\nWell. Th eproblem was with those two schedules you mentioned (anynumber and number). Fixed them and the simulation runs well, and the schedules are written well in the simulated idf.\n\nI updated the file to the last version og HB+LB. The old components i marked with a cross line so you can tell.\n\nFYI, all the materials/constructions you want to use are not in your library.\n\nAlso added some geometry since your file was missing it.\n\nAttached the library fixed and the rest of the files.\n\n-A.\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1339051", "name": "Template_Office_AY.gh"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1339052", "name": "userCustomEPLibrary.idf"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1339053", "name": "NZ_Office_Test.idf"}], "created_by_name": "Abraham Yezioro", "created_at": "August 6, 2015 at 1:40am", "created_by": "AbrahamYezioro", "replies": []}]}]}