{"body": "\nHi, I am getting some strange results from Ladybug. <br/> We are currently working on a project of an industrial facilty in Recife in Brazil, and I am creating some shadows diagrams for a presentation.<br/> <br/> The results look fine in the morning, but when I set the time after 12pm, the angle of the shadows start to look strange, not corresponding with the position of the sun in the sunpath. <br/> <br/> I took two screenshots to illustrate the problem. The first one uses the Rhino sun for shading (with the correct location data), and the second uses Ladybug Sunlight analysis.<br/> <br/> Would love to know what you guys from the forum thinks about it.<br/> <br/> Is it a bug? A mistake I made? Just the wrong impression from the sun path being so small and close??<br/>\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1334973", "name": "FROM_RHINOSUN.png"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1334974", "name": "FROM_LADYBUG.png"}], "created_by_name": "Edson Maruyama", "created_at": "July 31, 2015 at 2:51pm", "created_by": "EdsonMaruyama", "topic": "Weird results from Ladybug", "replies": [{"body": "\nHi Edson,\n\n\n\nIt doesn't look like a bug to me. We just need to make sure your inputs are the same for Rhino and Ladybugs's sunpath. Are Rhino and Ladybug giving you the same long and lat for sun?\n\nDid you apply the same rotation angle to both?\n\n\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "August 4, 2015 at 2:05pm", "created_by": "MostaphaSadeghipour", "replies": [{"body": "\nEdson,\n\nIf you upload a GH file with your comparison between the two, I can check it to see if the inputs are the same.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "August 5, 2015 at 7:23am", "created_by": "ChrisMackey", "replies": []}]}]}