{"body": "\nHello Mostapha,\n\n\n\nFirst off, thank you for the awesome open source tool and all the support you've rendered!\n\n\n\nMy question: I have been using Ladybug to calculate solar radiation for a base case window and then the solar radiation reduction with different shading types. Everything seemed to be working great until an engineer compared the values I was getting with the values she calculated (same geometry and weather file (Mountain View, CA) for June 21st all 24 hours) using IES. I'm attaching my grasshopper definition (geometry internalized), the weather file I'm using and an excel file showing the solar radiation values (highlighted) from both IES and Grasshopper. I assume that Ladybug's calculation process has been vetted and compared to other known procedures/methods, so can anybody shed some (sun) light on what's going on? The engineer would like to know how the solar radiation is calculated, I assume with radiance, is this correct?\n\n\n\nAlso, when I set the analysis period on June 21st from 15hr - 16hr and from 16hr - 17hr the Ladybug_Radiation_Analysis component gives the nebulous error message: \"1. Solution exception:index out of range: 12\"\n\n\n\nThank you in advance,\n\n\n\nDustin\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1335211", "name": "USA_CA_Mountain.View-Moffett.Field.NAS.745090_TMY3.epw"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1335212", "name": "shading_study_test_case.gh"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1335213", "name": "IES and Grasshopper Comparison.xlsx"}], "created_by_name": "dustin", "created_at": "July 31, 2015 at 5:59pm", "created_by": "dustin836", "topic": "Ladybug solar radiation results don't agree with IES Virtual Environment 2014...", "replies": [{"body": "\nHi Dustin. Be careful when comparing with IES. IES includes ground reflectance by default, which Ladybug does not. You can uncheck ground reflectance in the settings of IES. Doing this should give you the same result with both IES and Ladybug. Hope this helps.\n", "attachments": [], "created_by_name": "Örn Erlendsson", "created_at": "July 31, 2015 at 6:12pm", "created_by": "OErnErlendsson", "replies": [{"body": "\nThanks for the quick response, Örn. That's a good suggestion, but the thing that's weird is that the differences between IES and grasshopper aren't linear, i.e. over the course of each hour the delta between the two methods varies (see the attached spreadsheet). Either way, I'll confirm with the engineer that ground reflectance is turned off. Thank you.\n", "attachments": [], "created_by_name": "dustin", "created_at": "July 31, 2015 at 6:17pm", "created_by": "dustin836", "replies": []}, {"body": "\nI would suggest to use Honeybee (which uses Radiance under the hood) for comparative studies with IES.\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "August 4, 2015 at 2:02pm", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nThanks for replying, Mostapha, are you implying that the results from the Ladybug Radiation Analysis component aren't accurate?\n\n\n\nI'm not sure how to set up solar radiation analysis with Honeybee - here's what I have so far (attached screenshot). Can you tell me which components I'm missing?\n\n\n\nThank you.\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/*k9pHGBCHsk8gWwbQqbLycAuGXHc79WeV6ScZn-SRqDLcIrKGHSVt9ERjRm5m1up*eg6Syex6IK5j58sFuikVKBcK*d--P*h/Honeybee_screenshot.png?width=721\" width=\"721\"/>](http://api.ning.com:80/files/*k9pHGBCHsk8gWwbQqbLycAuGXHc79WeV6ScZn-SRqDLcIrKGHSVt9ERjRm5m1up*eg6Syex6IK5j58sFuikVKBcK*d--P*h/Honeybee_screenshot.png)\n\n\n", "attachments": [], "created_by_name": "dustin", "created_at": "August 4, 2015 at 2:28pm", "created_by": "dustin836", "replies": []}, {"body": "\nHi Dustin. Accuracy is always relative. Ladybug's radiation analysis has it's own limitations as it is mentioned in components description.\n\nThis component allows you to calculate the radiation fallin on input _geometry using a sky matrix from the selectSkyMxt component.<br/>This type of radiation study is useful for building surfaces such as windows, where you might be interested in solar heat gain, or solar panels, where you might be interested in the energy that can be collected.<br/>This component is also good for surfaces representing outdoor spaces (such as parks or seating areas) where radiation could affect thermal comfort or vegetation growth.<br/>No reflection of sunlight is included in the radiation analysis with this component and it should therefore be used<br/>neither for interior daylight studies nor for complex geometries nor for surfaces with high a reflectivity.<br/>For these situations where the reflection of light is important, the Honeybee daylight components should be used instead of this one.\n\n\n\nYou can check example for Grid-based analysis to see how you can run a radiation analysis with Honeybee &gt;\n\n[https://app.box.com/s/znns0dtewd1tclicx74q/1/1637772428/14467170836/1](https://app.box.com/s/znns0dtewd1tclicx74q/1/1637772428/14467170836/1)\n\n\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "August 4, 2015 at 2:36pm", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nDustin,\n\n\n\nDifferences in radiation results are most likely the result of the number of light bounces in the simulation, as Orn and Mostapha mention.  Other reasons for difference could be in the sky files that each use.  I don't know what type of sky IES is using but you can get a visualization of the Ladybug radiation sky using the sky dome component (in attached GH file and image below).\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/x7p0yuCwu9uCO65D11ZCGsc22rVjlr1KtH7S2cg2nbGcg1g4EdI2ldt9elrTbbemvXLEtIFNbOeWxpXUqyqbkrvkemgOVlJz/LadybugSky.PNG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/x7p0yuCwu9uCO65D11ZCGsc22rVjlr1KtH7S2cg2nbGcg1g4EdI2ldt9elrTbbemvXLEtIFNbOeWxpXUqyqbkrvkemgOVlJz/LadybugSky.PNG)\n\nYou can see the sky used in honeybee radiation studies by using the \"watch the sky\" component and the \"HDR to GIF\" component.\n\n\n\nIf the grid sizes of the analysis are very coarse in one of the cases, this can also cause discrepancies.  As Mostapha says, accuracy is always relative and the best tools I find are usually the ones that give you the most control over whether you want high accuracy or fast calculation speed.\n\n\n\nThe error that you were getting for the radiation study was a bug (albeit a very weird one that only happens when all of your radiation study results are the same value).  It has been fixed in the attached file.\n\n\n\n-Chris\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1338642", "name": "shading_study_test_case_CWM.gh"}], "created_by_name": "Chris Mackey", "created_at": "August 5, 2015 at 8:15am", "created_by": "ChrisMackey", "replies": []}, {"body": "\nChris,\n\nThanks for the debugging help.\n\nWhich component did you fix? Radiation_analysis or Analysis_period?\n\n\n\nAlso, can you explain why if I \"flip\" a surface (change the direction of the normal through the rhino command line) the radiation values change? I was expecting the radiation value to go to zero. That is one side gives a value when exposed to the sun and the value would go to zero when this same side is turned away from the sun due to flipping the surface and it being hidden by context...\n\n\n\nThank you\n", "attachments": [], "created_by_name": "dustin", "created_at": "August 10, 2015 at 10:39am", "created_by": "dustin836", "replies": []}, {"body": "\nDustin,\n\nThe bug I fixed was in Ladybug_Ladybug and had to do wit the function that creates the legend for all of the other components that use legends.\n\nWhen I flip the surface in your file, I get zero radiation:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/6Tyx6FS0AhePPc5NIf9KcJlKIFk5tjIGRRiSaWGv9DUpLds7VutCkZveOI923SSudT5Xu9iVpyPVF1oX9HulrOn3Ii7nydqF/ZeroRad.PNG\" width=\"576\"/>](http://api.ning.com:80/files/6Tyx6FS0AhePPc5NIf9KcJlKIFk5tjIGRRiSaWGv9DUpLds7VutCkZveOI923SSudT5Xu9iVpyPVF1oX9HulrOn3Ii7nydqF/ZeroRad.PNG)\n\nYou must be doing something wrong.  Maybe make sure that the surface is flipped in grasshopper instead of Rhino.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "August 15, 2015 at 1:26pm", "created_by": "ChrisMackey", "replies": []}]}], "id": "1335214"}