{"body": "\nHi,\n\nFirst of all, great work on these plugins - much fun to work with them.\n\nTo verify the method to calculate hourly radiation on surfaces, I tried to compare the results of EPlus (what I would traditionally use) and to those of Ladybug.\n\nI was hoping they would match (or be at least close), but they seem off. The two analyzed surfaces are facing west so there should be no radiation in the morning, but the Ladybug method shows otherwise - unexpectedly.\n\nI use the same weather data file and geometry (I import the DXF file from EPlus to rhino).\n\nFor some time I have been trying to figure out why these results don't match, but I am at a loss.\n\nI have attached both the DXF file (simple geometry of a surface with an overhang faced west), a weather data file (Jerusalem in this case), the grasshopper file and an excel sheet with the results from both software (I use TT toolbox to write to an excel).\n\n\n\nAny thoughts on what I might have done wrong?\n\n\n\nMany thanks,\n\nGuus\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1339712", "name": "Comparison Eplus vs Ladybug.zip"}], "created_by_name": "Guus Gooskens", "created_at": "August 7, 2015 at 4:21am", "created_by": "GuusGooskens", "topic": "Unexpected results ladybug on hourly radiation on surfaces", "replies": [{"body": "\nHi Guus,\n\n\n\nI would run the comparison between Ladybug and Honeybee (Radiance) and not EnergyPlus. EnergyPlus sky model is simplified and is not the best reference for comparison. Claudio did a validation study while ago ([http://www.grasshopper3d.com/group/ladybug/forum/topics/data-reliab...](http://www.grasshopper3d.com/group/ladybug/forum/topics/data-reliability?commentId=2985220%3AComment%3A1046187&amp;groupId=2985220%3AGroup%3A658987)).\n\n\n\nAlso back to radiation from west in the early morning, it is possible in case the sky is diffuse. You can use watchTheSky component in Honeybee or Ladybug_SkyDome to see what exactly is happening each hour in case of radiation distribution in the sky.\n\n\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "August 14, 2015 at 9:39pm", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nGuus,\n\nYou did not internalize the geometry in your GH file and you did not include a Rhino file with the correct referenced geometry (the dxf is not what GH references).  As such, I cannot run your file to see how you are using the components.  You also did not include any E+ run in your GH file and so I do not know what you are simulating for comparison.\n\nGiven the temporal discrepancy of the results, I would guess that you are not running the two with the same context geometry (or you did not use the same north vector for your E+ run and Ladybug study or something like that).\n\nI will also say that the Ladybug Radiation Study is meant for outdoor cases without intricate geometry as the calculation does not account for bounces of light (it is just meant to be a quick simulation to help inform early stages of design about orientation and exterior shading).  If you need a high accuracy simulation of radiation that includes bounces of light, you should use the honeybee daylight components.  This example file will get you started: [https://app.box.com/s/ssag6914u9z8sk1ik1b4qmy20m97ae0n](https://app.box.com/s/ssag6914u9z8sk1ik1b4qmy20m97ae0n)\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "August 15, 2015 at 4:28pm", "created_by": "ChrisMackey", "replies": []}]}