{"body": "\nHi, I've updated my LB+HB, but the sun path component is still giving a warning.\n\n\n\nAm I missing sth here?\n\n\n\nWhat do we need to pay attention when updating LB+HB using the update components for both of them?\n\n\n\nThanks!\n\n\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/NQs0dYxvfMVanI*2*WmAOCoasHyKPbAncekN298MpiaoZ8GpkkHYo6wMAx1feH0AuC210D31Edh2-aSPoF-R4xLFhsQQS6Mp/Picture1.png?width=750\" width=\"750\"/>](http://api.ning.com:80/files/NQs0dYxvfMVanI*2*WmAOCoasHyKPbAncekN298MpiaoZ8GpkkHYo6wMAx1feH0AuC210D31Edh2-aSPoF-R4xLFhsQQS6Mp/Picture1.png)\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1342647", "name": "sun_path.gh"}], "created_by_name": "Grasshope", "created_at": "August 13, 2015 at 1:35am", "created_by": "Grasshope", "topic": "[solved] sun path component warning", "replies": [{"body": "\nGrasshope,\n\nRe-insert the component. Worked for me.\n\nThe component was updated recently changing some of the outputs. That's why for such a cases there is need of reinserting.\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "August 13, 2015 at 2:02am", "created_by": "AbrahamYezioro", "replies": [{"body": "\nThank you, Abraham!\n\n\n\nHowever, I wonder if a manual replacement is needed in this case, does it defeat the purpose of using the update components for Honeybee and Ladybug?\n", "attachments": [], "created_by_name": "Grasshope", "created_at": "August 13, 2015 at 10:29am", "created_by": "Grasshope", "replies": []}, {"body": "\nYes it is.\n\nIf you search in the group you'll find that this issue has been discussed plenty.\n\nIn the development of the components sometimes they change the amount of input/output items. When that happen there is no other option than reinserting such components!!\n\nFortunately normally they are not so many.\n\nNow, think about the alternative. Would you prefer to do that for ALL updated components. I'm sure you are not.\n\nSo i think we all should be thankful with Mostapha and Chris for bringing this update possibility, EVEN when there are cases when you have to do some of the work yourself.\n\nHopefully in the future they will overcome this issue. Or maybe any of us will collaborate to find the proper solution. What do you say?\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "August 13, 2015 at 11:16am", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nGrasshope,\n\nYes, it is required in this case as I added a new feature that changes the legendPar on the sunpath to be able to accept data trees of different parameters for different streams of connected annualHourlyData.\n\nAs Abraham says, we can only automate the changing of the python code inside the components.  We can't automatically change the inputs and outputs of the component and so, when these inputs or outputs change, you have to do the work yourself.  And, even if we could automate this changing of inputs/outputs, your updated components with changed inputs/outputs would still probably not work since we may add a new input and this shifts all of the other inputs on the component down such that previously connected inputs are now connected to a different input.  We don't change these inputs/outputs often but asking you to replace them manually when it happens is just a part of the many responsibilities that come with the power of syncing to the github.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "August 15, 2015 at 2:07pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nDear Abraham and Chris, thank you very much for the detailed clarification!\n\n\n\nHowever, I still got this type of warning for the Import epw component every time I open the GH file attached, although I have updated ladybug and honeybee, re-inserted ladybug-ladybug and honeybee-honeybee, replaced the import epw component manually and reconnect it with other components, and restarted Rhino and Grasshopper ...\n\n\n\nReconnect the panel component with import epw component or disable-enable the import epw component can make the warning goes away, but it'll come back next time I open the file...\n\n\n\nCan you kindly advise what else I shall do to prevent this warning from showing up again?\n\n\n\nThanks!\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/2cgQuBR1CogtELqr9zDLC5PwKD2YresiwexfsZfiPddvEZSyk8IeyN11HfajjVH27OzytfJslBYGBZYkWNElur*yivyw*ZYw/01.PNG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/2cgQuBR1CogtELqr9zDLC5PwKD2YresiwexfsZfiPddvEZSyk8IeyN11HfajjVH27OzytfJslBYGBZYkWNElur*yivyw*ZYw/01.PNG)[<img class=\"align-full\" src=\"http://api.ning.com:80/files/2cgQuBR1Coj9L9eWo28utdzQ0gOvMyqTDXoSFEg50jEs62QcyeC76Hxhnn-OEGzQiNJssbaN80zGgIy62LSPbl8F0NWUiDFH/02.png?width=721\" width=\"721\"/>](http://api.ning.com:80/files/2cgQuBR1Coj9L9eWo28utdzQ0gOvMyqTDXoSFEg50jEs62QcyeC76Hxhnn-OEGzQiNJssbaN80zGgIy62LSPbl8F0NWUiDFH/02.png)\n", "attachments": [], "created_by_name": "Grasshope", "created_at": "August 16, 2015 at 8:55am", "created_by": "Grasshope", "replies": []}, {"body": "\nGrasshope,\n\nThis is a different issue but update. The warning is telling you to let the LB fly first.\n\nFor those cases just select the LB_LB and HB_HB and send them to the back (ctrl+B). And save the file. Next time you open the file it should execute FIRST KB_LB and HB_HB so the other components won't complain.\n\nIf you stay in the same session, disable/enable LB (ctrl+E) and then do the same for the importEPW (and other that are complaining about letting LB fly).\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "August 16, 2015 at 9:43am", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nThanks for explaining, Abraham.  I really have to make a video that explains the update process.\n\n\n\nGrasshope,\n\nTo clarify about when you need to manually update a component:\n\nYou only have to manually update a component if the inputs/outputs have changed since a previous version.  Ladybug_Ladybug and Honeybee_Honeybee should almost never have such a change and so there is no need to drag it onto the canvass again.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "August 16, 2015 at 1:45pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nThank you, Chris, for the detailed clarification! \n", "attachments": [], "created_by_name": "Grasshope", "created_at": "August 17, 2015 at 8:09am", "created_by": "Grasshope", "replies": []}, {"body": "\nThank you, Abraham, for explaining the \"send to the back\" operation to solve the problem I encountered!\n\n\n\nMay I ask why send a component to the back will ensure it is executed first next time the GH file is open? (Maybe I should ask this on the general Grasshopper forum, anyway, glad to hear your advice!)\n", "attachments": [], "created_by_name": "Grasshope", "created_at": "August 17, 2015 at 8:13am", "created_by": "Grasshope", "replies": []}, {"body": "\nWhen you open a GH it starts executing from the \"older\" component to the newer (simplistically saying). So in your case sometimes it executes first, say, the runE+ before the LB_LB/HB_HB and that's why they give errors: becouse some of the definitions in the \"home\" library are missing.\n\nSending those to the back means that they will be the \"older\" and will be executed first.\n\nVery rough explanation but i hope it helps.\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "August 17, 2015 at 8:35am", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nYes, definitely helpful, Abraham!\n\n\n\nSo, to ensure the core library components LB_LB and HB_HB are executed first, let's make them look \"older\" as they are \"senior\" by putting them in the back stage so that they'll walk to the front stage first the next time the curtain is unveiled ... (I think I need to get some sleep...)\n", "attachments": [], "created_by_name": "Grasshope", "created_at": "August 17, 2015 at 8:43am", "created_by": "Grasshope", "replies": []}]}]}