{"body": "\nI am learning the psychometric chart component in ladybug. When I the \"wind speed\" output from the EPW file and input it into the \"annualhourlydata\" input on the psychometric chart component I am getting an error. When I graft that input the graph appears, but the component still has an error.\n\n\n\nAlso, the passive strategy list component had been functioning properly for me, but now it is causing errors with the psych chart component as well. I've tried loading new components and reconnecting, but the issue still persistants. Any direction would be appreciated.\n\n\n\nThanks,\n\n\n\nRauland\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1342974", "name": "environmental_psychrometric.gh"}], "created_by_name": "Rauland Schaat", "created_at": "August 13, 2015 at 3:33pm", "created_by": "RaulandSchaat", "topic": "psych chart error", "replies": [{"body": "\nSome of the items in the ActivityList are causing problems. If you change the Sleeping\" to Sitting\" it will work. Though, i suppose, some of the internal conditions of the component are falling out of the calculations. I'm sure Chris will check this soon. In the meantime: change activities.\n\nI updated to the latest version. Attached.\n\n**-A.**\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1343097", "name": "environmental_psychrometric_AY.gh"}], "created_by_name": "Abraham Yezioro", "created_at": "August 13, 2015 at 8:43pm", "created_by": "AbrahamYezioro", "replies": [{"body": "\nRauland,\n\nThank you for finding this.  It was a bug that was occurring because, when a person's metabolic rate starts to get very low (ie. when they are sleeping) they start to desire very warm temperatures (around 26-27 C).  However, with the way you are using the psych chart, the comfort polygon is showing you the air temperatures that are comfortable when the radiant temperature is the default 25C (lower than the desired temperature for a sleeping person).  As a result, the desired air temperatures end up being very high (around 30C) so that the sleeping person, overall, feels like it is 27C.  When you blow this very warm 30C air onto a person, it can actually cause them to feel warmer than without any air movement since the means by which the person is loosing the most heat is to the radiant environment (imagine trying to cool a person with a hair dryer).  This causes the \"occupant use of fans\" polygon to overlap with the comfort polygon like it does here at a metabolic rate of 0.8:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/6Tyx6FS0AhfdzeCZ2qULboISevb55C6mBXrIhhUkHwp7YanY4Z-8awgenRLSMokp44ZqAshDXSUH2sVpC0JR855m6IZhxr0F/WindCoolingOverlapwithLowMetRate.PNG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/6Tyx6FS0AhfdzeCZ2qULboISevb55C6mBXrIhhUkHwp7YanY4Z-8awgenRLSMokp44ZqAshDXSUH2sVpC0JR855m6IZhxr0F/WindCoolingOverlapwithLowMetRate.PNG)\n\nBy the time that you get down to sleeping metabolic rates of 0.7, the \"use of fans\" polygon completely overlaps with the comfort polygon, meaning that the use of wind is not at all helpful.  I hadn't considered this originally and so this was causing the component to fail.  I have fixed this in the attached file by not generating an \"occupant use of fans\" polygon whenever this complete overlap occurs.\n\n-Chris\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1343842", "name": "environmental_psychrometric_CWM.gh"}], "created_by_name": "Chris Mackey", "created_at": "August 15, 2015 at 2:55pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nGreat,\n\n\n\nThank you.\n\n\n\n-Rauland\n", "attachments": [], "created_by_name": "Rauland Schaat", "created_at": "August 15, 2015 at 8:46pm", "created_by": "RaulandSchaat", "replies": []}, {"body": "\nHey Chris,\n\n\n\nWith the new updates most of the Ladybug components work great, but I am getting an error with the sunpath I cant seem to resolve. Any ideas?\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1345672", "name": "environmental_sunpath.gh"}], "created_by_name": "Rauland Schaat", "created_at": "August 19, 2015 at 11:49am", "created_by": "RaulandSchaat", "replies": []}, {"body": "\nRauland,\n\nWe cannot always guarantee that the newer ladybug/honeybee components will be backwards compatible.  Whenever you update the user objects in your Ladybug toolbar and then go to edit a GH file that has older components, you will likely encounter errors.  You can try to update all of the components on your GH canvass to the gituhub version by using the updateThisFile input on the \"Update Ladybug\" components but this will not work for components where the inputs or outputs have changed between the new/old version.  So, for these types of components, you need to insert them manually.  This was the case with your sunpath and I have manually replaced it with an up-to-date version in the attached file.\n\n-Chris\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1360298", "name": "environmental_sunpath_CWM.gh"}], "created_by_name": "Chris Mackey", "created_at": "September 12, 2015 at 11:26am", "created_by": "ChrisMackey", "replies": []}]}]}