{"body": "\nHello,<br/><br/>Firstly, I would like to thank all the developers for the great plugins!<br/><br/>I am trying to import a simple gbXML file generated by the GrizzlyBear into the DesignBuilder, however it keeps asking for the missing U-values (image) even though for the window material, Uvalue is defined inside the XML (image).<br/><br/>Maybe anybody knows what can be the reasons for that?\n\n\n\nMoreover, I am trying to export a geometry comprising an AIR WALL partition, and I would like DesignBuilder to recognize it as virtual partition (or hole), for both horizontal and vertical surfaces.\n\nDo you know why is this happening and how to solve it?\n\n\n\nThank you in advance!!\n\n\n\n\n\n[<img class=\"align-center\" src=\"http://api.ning.com:80/files/bGawF3RRkae7UA4E9DAGx0grbYvUna9Gy3YC8Cq8RUWTxpAuNWSrEx8XzSz*pmKv5JHhpG8*rmaORQ-IZnROVS2n66XQofh1/Capture.PNG?width=750\" width=\"750\"/>](http://api.ning.com:80/files/bGawF3RRkae7UA4E9DAGx0grbYvUna9Gy3YC8Cq8RUWTxpAuNWSrEx8XzSz*pmKv5JHhpG8*rmaORQ-IZnROVS2n66XQofh1/Capture.PNG)\n\n\n\n[<img class=\"align-center\" src=\"http://api.ning.com:80/files/bGawF3RRkafdzSF*dcQGHSo5L-6ML5j3PxmR094rdgQHTjEGHomOkKkNrFBIOVwgMyVhsg7RtSIokJU1g6DAduxs25yKe-6*/Capture2.PNG\" width=\"675\"/>](http://api.ning.com:80/files/bGawF3RRkafdzSF*dcQGHSo5L-6ML5j3PxmR094rdgQHTjEGHomOkKkNrFBIOVwgMyVhsg7RtSIokJU1g6DAduxs25yKe-6*/Capture2.PNG)\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1346273", "name": "gbxml_export.gh"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1346274", "name": "testXML_tas.xml"}], "created_by_name": "Antonio D'Aquilio", "created_at": "August 20, 2015 at 7:24am", "created_by": "AntonioDAquilio", "topic": "Design Builder cannot import gbXML generated by GrizzlyBear", "replies": [{"body": "\nAntonio,\n\nI can't say that I have steady access to DesignBuilder but maybe I can test your case in my company's office one day after work.  I can say that, generally, you will get a much more robust response from the ladybug community if your gbxml issues are framed in an OpenStudio context (being free and open source).  So, if you are able to replicate your problems in OpenStudio, we can probably solve them much more quickly.\n\nI can also confirm that a \"virtual partition\" is an invention of DesignBuilder and is not something that EnergyPlus intrinsically understands (or, rather, a \"virtual partition\" can mean a lot of different things to EnergyPlus depending on how it is input).  So, if DesignBuilder is not interpreting the air walls as virtual partitions now, it seems unlikely that the situation will change unless the DesignBuilder team makes their software more amenable to gbxml's format.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "August 23, 2015 at 1:25pm", "created_by": "ChrisMackey", "replies": [{"body": "\nHi Antonio,\n\nI don't have access to DesignBuilder but tried to import it into OpenStudio and it works fine. There are some warnings about surfaces with less than 3 points which is a different issue.\n\n\n\nDid you try to contact DesignBuilder team about this issue? I'm curious to know their input.\n\n\n\nI second Chris's comment about virtual partitions. I'm not sure if there is such a thing in gbXML definition at all.\n\n\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "August 23, 2015 at 1:59pm", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nMostapha and Chris, thank you for your fast reply.\n\n\n\nI have tried to contact the DesignBuilder team for this, but the problem is that the import of gbXML is not working perfectly I am afraid. My main goal was to make the natural ventilation simulation through DB. I am trying to find another way to simulate natural ventilation, and regarding this I have posted another discussion.\n\nIf you want you can have a look here: [http://www.grasshopper3d.com/group/ladybug/forum/topics/interzone-a...](http://www.grasshopper3d.com/group/ladybug/forum/topics/interzone-airflow-rate-for-a-large-volume?xg_source=activity)\n\nI hope someone can help me.\n\n\n\nThank you very much again.\n\nAntonio\n", "attachments": [], "created_by_name": "Antonio D'Aquilio", "created_at": "September 9, 2015 at 10:19am", "created_by": "AntonioDAquilio", "replies": []}]}], "id": "1346275"}