{"body": "\nHello,\n\nI am modeling a room to find out the best dimensions of the window in south elevation,\n\nPrincipally, in a specific WWR (window to wall ratio), There must be a balance between thermal energy and electric light, but in all conditions, the cooling load is much higher than heating and electric energy, I tested the algorithm for winter and again the cooling was higher than heating! I changed the materials but it was ineffective.\n\nWhat's the problem? Did I make mistake somewhere in writing the algorithm?\n\nThanks,\n\nFahimeh\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1349291", "name": "4-1.gh"}], "created_by_name": "Fahimeh Motazedian", "created_at": "August 26, 2015 at 10:29am", "created_by": "FahimehMotazedian", "topic": "Unusual High cooling loads", "replies": [{"body": "\nFahimeh,\n\n\n\nIts possible for a space to be in a cooling mode during the winter. E+ balances the following loads:\n\n-solar heat gain\n\n-heat transfer through the glass\n\n-heat transfer through all other facades\n\n-internal program loads (people, plug loads, electric lighting, etc.)\n\n-infiltration\n\n \n\nThe heat transfer through the glass/faced and infiltration will be positive or negative depending on the exterior condition, but the internal loads and solar gain will always be positive. If the internal loads and solar loads are greater than the façade heat transfer and infiltration loss, you will need to cool the space.\n\n \n\nI recommend reviewing each of the loads listed above, particularly the internal loads settings. It is likely that one of these is too high, resulting in cooling all year.\n", "attachments": [], "created_by_name": "Leland Curtis", "created_at": "August 26, 2015 at 10:46am", "created_by": "LelandCurtis", "replies": [{"body": "\nLeland said it all. I want only to add one comment.\n\nThere must be a balance between thermal energy and electric light\n\nThe energy for electric light in EnergyPlus (at least the way it is set-up in Honeybee) will be calculated based on lighting schedule. If you want to see the effect of light-shelf in electric lighting energy you have to run and annual daylight analysis and use the generated schedule to overwrite lighting schedule in energy simulation.\n\n\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "August 28, 2015 at 2:16am", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nThanks Mostafa,\n\nI had used the lighting schedule of annual daylight simulation, but when I changed the count of sensor points, nothing changed in results. I think it shows that something was wrong.\n", "attachments": [], "created_by_name": "Fahimeh Motazedian", "created_at": "August 29, 2015 at 12:33pm", "created_by": "FahimehMotazedian", "replies": []}, {"body": "\nThanks Leland, I am working on it to find out the problem,\n\nbut it seems that I have paid attention to all the matters you said, but cooling load and total thermal energy is much high in this location (Tehran/Iran) and is not comparable to light energy, so we can not find a appropriate WWR in which light is equal to thermal load. the algorithm says the smaller the window, the less energy use!\n", "attachments": [], "created_by_name": "Fahimeh Motazedian", "created_at": "August 29, 2015 at 12:30pm", "created_by": "FahimehMotazedian", "replies": []}, {"body": "\nHi Fahimeh\n\n\n\nI am looking at your file and trying to work out what could be going wrong. To me that actually makes sense in most cases the smaller the windows the less energy used as the U-value of windows is (usually) much higher than surrounding walls.\n\n\n\nAs you will see the U-value of your window is 3.6 while the U-value of your wall is 0.38 smaller than a tenth of the U-value of the window. Given these materials I would think that even with no windows (and lighting required all the time) less energy would be used than having windows.\n\n\n\nWhat is the minimum WWR required for building codes in Tehran? Or what is the minimum natural day lighting that you think would be suitable? I would work your optimisation from there.\n", "attachments": [], "created_by_name": "Anton Szilasi", "created_at": "August 31, 2015 at 4:29am", "created_by": "AntonSzilasi", "replies": []}, {"body": "\nHi Anton,\n\nThanks for your comment.\n\nYou are right, That's the reason exactly,\n\nMaybe even the best window material can't compete with the wall material (?) in some regions with hot and dry climate.\n\nI took 30-40 % WWR for my research at last.\n\nThanks\n", "attachments": [], "created_by_name": "Fahimeh Motazedian", "created_at": "August 31, 2015 at 9:16am", "created_by": "FahimehMotazedian", "replies": []}, {"body": "\nThe window material can't compete with wall material in most climates I imagine - but of course you cant have a building with no windows thats only for data centres!\n", "attachments": [], "created_by_name": "Anton Szilasi", "created_at": "August 31, 2015 at 9:36am", "created_by": "AntonSzilasi", "replies": []}, {"body": "\nYes,\n\nThanks a lot :)\n", "attachments": [], "created_by_name": "Fahimeh Motazedian", "created_at": "August 31, 2015 at 10:01am", "created_by": "FahimehMotazedian", "replies": []}]}]}