{"body": "\nThe list of passive strategies that feed into the phychrometric chart is very helpful, but after having a conversation with a colleague, I'm curious if there is a way to include additional strategies beyond the 5 included?  For comparison, we've been utilizing Climate Consultant for a similar purpose on occasion.  \n\nThanks!\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1354856", "name": "2015-08-19_PASSIVE_STRATEGIES_2.png"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1354857", "name": "climate consultant.png"}], "created_by_name": "sean.mckeever", "created_at": "September 4, 2015 at 2:51pm", "created_by": "seanmckeever", "topic": "Passive Strategy List - Psych Chart", "replies": [{"body": "\nHi Sean,\n\n\n\nThank you for your post.  The short answer is that I am absolutely willing to put in more strategy polygons to the chart if there is a good case for them.\n\n\n\nThe long answer is that, even though I implemented this polygon-plotting feature on the Ladybug Psych Chart, I am very skeptical of it as a good method for using the psychrometric chart in a design process.  Personally, I feel that the way we should really be testing strategies with the psych chart is by running an energy simulation with the feature in question and plotting the temperature/humidity results on the chart as I do in this video:\n\n[https://www.youtube.com/watch?v=0DK6_9qzq3w&amp;list=PLruLh1AdY-Sho...](https://www.youtube.com/watch?v=0DK6_9qzq3w&amp;list=PLruLh1AdY-Sho45_D4BV1HKcIz7oVmZ8v&amp;index=8)\n\n\n\nThis said, I understand that we don't always have enough information in early design to build a small energy model but we still need a back-of-the-envelope idea of strategies to explore.  And, so long as we clearly know the limits of some of these strategies (like evaporative cooling being clearly defined by a line of constant enthalpy), I can accept this polygon-plotting as a suitable method.  However, some of the limits of the climate consultant polygons make absolutely no sense to me (or they at least need to be re-worded to reflect what the polygons are actually showing).  As an example, the \"Sun Shading of Windows\" polygon of Climate Consultant has always seemed to arbitrary to me.  The question of whether or not you want shading is intricately tied to the glazing ratio and orientation of your building and it just seems wrong to generalize this very complex variable as a single polygon separate from any real geometry.\n\n\n\nStill, if anyone makes a good case for a new polygon here, I will implement it.  I will admit that I am on the sidelines about a passive solar polygon as well as a 2-stage evaporative cooling polygon.  If someone explains a good method for defining these polygons with a good reason for the thresholds (ie. what radiation value should be used to define solar heating potential), I will most likely be on your side.\n\n\n\nThe adaptive comfort ventilation polygon on the new Climate Consultant sounds like it is useful and I can implement it if anyone seconds a demand for it here.\n\n\n\nI will also say that \"Humidification Only\" and \"Dehumidification Only\" polygons already exist on the current Psych chart if you plug in a text string that says these words to the passiveStrategies input of the chart.  I didn't end up putting them on the PassiveStrategyList component because they seemed really obvious to me and not so useful.  I can easily add them in to the StrategyList component if anyone seconds a demand for it here.\n\n\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "September 8, 2015 at 10:28pm", "created_by": "ChrisMackey", "replies": [{"body": "\nHey Chris,\n\nThank you for the great explanation. I think adding the items that you mentioned are pretty useful. Not everybody in the world can really read the chart so I see it as a helpful feature to educate users.\n\n\n\nI also want to add that I emailed Climate Consultant team about their logic behind the polygons and they had their own reasons not to share it. That could be helpful next to their help file. I'm not sure what their algorithms exactly doing.\n\n\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "September 10, 2015 at 8:47pm", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nMostapha,\n\nThanks for the support and for the info about the Climate Consultant team's response.  I added in \"Humidification Only\" and \"Dehumidification Only\" polygons to the Passive Strategy List (see attached).\n\nAlthough I am open to the idea of having polygons for adaptive comfort, passive solar, and indirect evaporative cooling, I think that I will still need a bit of convincing about how to implement these.  For example, how should I deal with how the adaptive model changes with increased wind speed?  Should I have two adaptive comfort polygons?  Also, I am guessing that passive solar has to account for the solar radiation in the EPW file in some way.  Finally, what is the equivalent of a line of constant wet bulb temerpature for indirect evaporative cooling and where does it come from?\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "September 13, 2015 at 5:17pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nForgot to attach the file.\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1360701", "name": "NewPsychChart3.gh"}], "created_by_name": "Chris Mackey", "created_at": "September 13, 2015 at 5:18pm", "created_by": "ChrisMackey", "replies": []}]}]}