{"body": "\nHi there\n\n\n\nI'm running annual analysis to find peak values of solar radiation. With honeybee i can run the radiance simulation on 500pts in roughly 20 seconds. However, I'm using 5 minuttes to load the annual data into grasshopper.\n\n\n\nI think the grasshopper (1 core mode) way of reading these annual results is a bottleneck here. I was wondering if its possible through python or an external part of honeybee to make some statistics on the annual datas.\n\n\n\nSuch as:\n\n- Num of hours above a certain value (returns one value per point)\n\n- Max value (returns one value per point)\n\n- Date of the max value (returns one value per point)\n\n- 75% percentile of max value (returns one value per point)\n\n\n\nAs it is now, people use the accomulated annual data to get an idea of energy usage, but I think we need to include these peak values to get an idea on if our ventilation/cooling system is good enough. I know Energyplus can do this simulation, but looking at pure solar gains is good for early phase and facade designs.\n\n\n\nBest, Mathias.\n", "attachments": [], "created_by_name": "Mathias s n", "created_at": "September 4, 2015 at 7:33am", "created_by": "Mathiassn", "topic": "Peak annual values", "replies": [{"body": "\nHi Mathias,\n\nHow do you load annual data into Grasshopper? 5 minutes sounds like so much for 500 points. Are you using \"Honeybee_Read All the Hourly Results from Annual Daylight Study\"?\n\nIn any case once you have it in Grasshopper you can run all the post processing pretty fast. I mean you don't need to import them every single time. Is that make sense?\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "September 4, 2015 at 1:32pm", "created_by": "MostaphaSadeghipour", "replies": [{"body": "\nMathias,\n\nA GH file would be really helpful to understanding what you are asking here.  Are you talking about a simulation of radiation for peak cooling or are you talking about illuminance values from an annual daylight simulation?\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "September 7, 2015 at 3:20pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/NO5p8TYffu00ZTzsiNB5-2fNsgdGggvNzS*7cA7qa1eA56aoHDFSnqFwjFEZ5TkVotIalMZymA4Q7MzFXjDAFIKonuGfPek5/screen.PNG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/NO5p8TYffu00ZTzsiNB5-2fNsgdGggvNzS*7cA7qa1eA56aoHDFSnqFwjFEZ5TkVotIalMZymA4Q7MzFXjDAFIKonuGfPek5/screen.PNG)Sorry there was some other things also in the calculation. But here for 800 points I'm using 1.7 minutte just loading the data into GH. In the meanwhile I'm only using 15 seconds on the simulation itself. I think using some external script that can run multicore, we should be able to speed up this process. I'm looking for the peak radiation in each point (w/m2).\n\n\n\nSo if this \"external script\" could find the max of each point before importing to mono-core grasshopper framework. That would be great. Postprocessing in grasshopper is also quite slow with 800x8760 values.\n", "attachments": [], "created_by_name": "Mathias s n", "created_at": "September 8, 2015 at 7:32am", "created_by": "Mathiassn", "replies": []}, {"body": "\nHi Chris,\n\nI'm digging through the GH/Ladybug discussions and came across Mathias's question, which is exactly the question I wanted to ask. Is there a way in Ladybug (rather than Honeybee) to output the peak solar irradiation values on each analysis point on a surface rather than the annual cumulative solar irradiation? The cumulative value is great for understanding PV output, for example, but for early phase facade design, having this visual of peak solar reduction from shading devices, for example, is a very useful capability. If you have any further thoughts on this, I'd be keen to hear them. This was one calculation that was quite straightforward in Ecotect, so I'm hoping it's not too difficult to implement in Ladybug if it hasn't been done so already. (Sorry, I don't have a GH file to share!)\n\nThanks!\n\nIrene \n", "attachments": [], "created_by_name": "Pau Martin", "created_at": "April 6, 2017 at 4:44pm", "created_by": "29znrrp0u4jsd", "replies": []}]}], "id": "1354812"}