{"body": "\nHello,\n\nI have a new problem that I have been trying to find a solution for it for about a week, but I didn't succeed. \n\nDuring running galspagos with honeybee, the rhino stops working, it may happens after 10 minutes or 2 hours.\n\nI have attached a picture of the error.\n\nI would really appreciate it if someone could help me. \n\nThanks in advance.\n\n\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1355213", "name": "20150902_132243.jpg"}], "created_by_name": "Fahimeh Motazedian", "created_at": "September 5, 2015 at 4:45am", "created_by": "FahimehMotazedian", "topic": "Appcrash, fault modul opennurbsx64.dll", "replies": [{"body": "\nHi Fahimeh,\n\nThis can be because of Rhino, Galapagos or Honeybee. You should report this under [Errors and Bugs](http://www.grasshopper3d.com/forum/categories/errors-bugs-and-oversights/listForCategory) with an example file so hopefully David can re-generate the error and tell you why this is happening. I'm not sure if David will see the error here.\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "September 5, 2015 at 11:49pm", "created_by": "MostaphaSadeghipour", "replies": [{"body": "\nThanks Mostafa,\n\nOk, I will write there with an example.\n\nFahimeh\n", "attachments": [], "created_by_name": "Fahimeh Motazedian", "created_at": "September 5, 2015 at 11:55pm", "created_by": "FahimehMotazedian", "replies": []}, {"body": "\nHi Mostafa,\n\nI wrote my problem in this link:\n\n[http://www.grasshopper3d.com/forum/topics/appcrash-error?commentId=...](http://www.grasshopper3d.com/forum/topics/appcrash-error?commentId=2985220%3AComment%3A1355849&amp;xg_source=msg_com_forum)\n\nUnfortunately, David couldn't help me find the problem, at least he suggests waiting to see if it will crashes on Rhinoceros 6 and that's a long time for me.\n\nDo you have any other suggestion for me with this file? Is there any other way to get the results (I want to find the best angle and dimension of a lightshelf in every hour on some specific days). It took a long time for me to learn Hb and it's not logical to leave in this stage inconclusive.<br/>Thanks\n\n\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1355761", "name": "5-1.gh"}], "created_by_name": "Fahimeh Motazedian", "created_at": "September 6, 2015 at 11:49am", "created_by": "FahimehMotazedian", "replies": []}, {"body": "\nHi Fahimeh.\n\nI checked your file and I'm confused what you're trying to do. Are your goal is only to model a room and optimize it for daylight or is it going to be also an energy model at some point? Is the size of the room stays the same during the whole study?\n\nIn any case you need to model light-shelves as separate surfaces and not part of the zone.\n\n\n\nAlso there is also so many extra components in your definition. I would only leave the components which are critical to the study for an optimization case as you need to run so many cases.\n\n\n\nLet me know what are you exactly trying to do and we'll look for alternate solutions.\n\n\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "September 7, 2015 at 7:03am", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nHi Mostafa,\n\nThanks for looking at my file,<br/>I didn't understand why lightshelf shouldn't be a part of the zone.<br/>Using the components such as TT toolbox, was because I wanted to save results in any stage that Rhino stops working, so exported data to excel, it can be deleted, not important.\n\nMy final goal is to build and find the mechanism of dynamic lightshelf,\n\nan exterior lightshelf that its angle is variable, and an interior lightshelf that its length is variable, the room and the window stays the same during the hole study.\n\nfor this, there are 2 ways (If I am making a mistake, let me know):\n\n1. to optimize lightshelves based on desired illuminance in each hour.\n\n2. to optimize lightshelves based on thermal and lighting energy in each hour.\n\nSimulation will be repeated in some days as sample for expanding to the whole year.\n\nI am doing the first step (although I wrote an algorithm for the second one, but I thought it takes longer time and the appcrash possibility is higher than the first one)<br/>Hope that explanation was good and enough,\n\nthanks a lot\n\nFahimeh\n", "attachments": [], "created_by_name": "Fahimeh Motazedian", "created_at": "September 7, 2015 at 9:58am", "created_by": "FahimehMotazedian", "replies": []}, {"body": "\nMostafa,\n\ndid you read my comment? Do you have any idea?\n", "attachments": [], "created_by_name": "Fahimeh Motazedian", "created_at": "September 12, 2015 at 9:48am", "created_by": "FahimehMotazedian", "replies": []}]}], "id": "1355214"}