{"body": "\nDear Expert,\n\n \n\nI created a set of custom materials for a E+ simulation that I then used to define a set of EPCostructions. Once added to the E+ library, I checked the UValue constructions (with HB call from EP library) in W/m2K which did not correspond to the values calculate by me using the standard equation U=1/R with R= Σ thickness/conductivity. I tried the calculation both with and without the external and internal resistivity (Rse, Rsi) but the results are in any case different.\n\nThe results are the same only if I set in each materials that compose the construction 0 for density and specific heat, that means a construction without mass.\n\nUnfortunately, I did not find any literature about! Could you explain how HoneyBee (or perhaps E+) does the U-value calculation?\n\n\n\nThank you in advance.\n\n\n\nCheers,\n\nGiuseppe\n", "attachments": [], "created_by_name": "Giuseppe De Michele", "created_at": "September 9, 2015 at 2:32am", "created_by": "GiuseppeDM", "topic": "UValue EPConstruction calculation", "replies": [{"body": "\nGiuseppe,\n\nIt will be nice if you upload a file with your problem pointing out where the problem is. In this case also, what are the expected results and what are those that you get.\n\nI don't have access right now to GH but as I recall the results of the U don't show the influence of the air layers but they are definitely taken into account during the simulation. There is a component, don't remember which one, that you can ask for the U with those air layers.\n\nHope this is your \"problem\", meaning there is no problem.\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "September 9, 2015 at 3:35am", "created_by": "AbrahamYezioro", "replies": [{"body": "\nAbraham,\n\nyou said right, it was my \"problem\" or better my error. I made a mistake assigning the materials name. I have the same material in different construction, so that I gave the same name at this material for each construction even though the thickness was different and here my error. The same material with different thickness require a different name.\n\n\n\nThank you again.\n\nGiuseppe \n", "attachments": [], "created_by_name": "Giuseppe De Michele", "created_at": "September 9, 2015 at 4:58am", "created_by": "GiuseppeDM", "replies": []}, {"body": "\nAbraham is right [as usual]. check EPMaterialAux class to see how Honeybee calculates U-Values for materials and constructions:\n\n[https://github.com/mostaphaRoudsari/Honeybee/blob/master/src/Honeyb...](https://github.com/mostaphaRoudsari/Honeybee/blob/master/src/Honeybee_Honeybee.py#L3168-L3243)\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "September 9, 2015 at 8:10am", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nHi Mostapha,\n\nthanks for the link, which confirms what said yesterday. <br/>\n\n\n\nCheers,\n\nGiuseppe\n", "attachments": [], "created_by_name": "Giuseppe De Michele", "created_at": "September 10, 2015 at 2:48am", "created_by": "GiuseppeDM", "replies": []}]}], "id": "1357076"}