{"body": "\nI've been using Ladybug View Analysis to determine whether a feature within a city (like the Space Needle in Seattle) is visible from points on a building, like so:\n\n[<img class=\"align-full\" height=\"287\" src=\"http://api.ning.com:80/files/Uf5Jdma8M30SapC2U-ZrdnzV0tupo6ylAmQYwTqH-Smu0nvv0-r1pPmw0xkc1R2JDQ4RHUJYef8i7VX6pgZZbkO6JDhQNhko/viewshed3d.jpg?width=750\" width=\"621\"/>](http://api.ning.com:80/files/Uf5Jdma8M30SapC2U-ZrdnzV0tupo6ylAmQYwTqH-Smu0nvv0-r1pPmw0xkc1R2JDQ4RHUJYef8i7VX6pgZZbkO6JDhQNhko/viewshed3d.jpg)\n\nThis works technically, but if I am testing to see if people inside the building can see the feature, it breaks down. This is because the test point on the surface of the building does not care if the angle between the test vector and the vector to the feature is too great to actually be visible from inside. I drew a diagram to demonstrate what I mean:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/Uf5Jdma8M33c6IvRcOKzC5eFt-zrgQg27nXz4lpU-1rEMHiyRiuSA35SF7f1oYCVgwAXAr4C5jv7Heb9ORkAx9AKRfWqwgo9/4143_001.jpg?width=750\" width=\"750\"/>](http://api.ning.com:80/files/Uf5Jdma8M33c6IvRcOKzC5eFt-zrgQg27nXz4lpU-1rEMHiyRiuSA35SF7f1oYCVgwAXAr4C5jv7Heb9ORkAx9AKRfWqwgo9/4143_001.jpg)In theory,I would like to test to see if the angle between vectors is above a certain degree (likely just a \"good enough\" average based on window width and wall depth), and to register any test vector above that angle as obstructed.\n\nI feel like, with enough kludging in python, this would be achievable, but the scripting for Ladybug is daunting to an amateur like me. Does anyone have any ideas how to get this to work either within the python code or by manipulating the results?\n\nThanks,<br/>Shane\n", "attachments": [], "created_by_name": "Shane Simon", "created_at": "September 14, 2015 at 5:40pm", "created_by": "ShaneSimon", "topic": "View Angle within View Analysis component?", "replies": [{"body": "\nHi Shane,\n\nThis is a fairly complex question could you please attach your GH file? Once you've attached it I'll try to get back to you with an answer by the end of next week.\n", "attachments": [], "created_by_name": "Anton Szilasi", "created_at": "September 18, 2015 at 9:04am", "created_by": "AntonSzilasi", "replies": []}, {"body": "\nHi Shane,\n\nThis is a great suggestion. Since the view analysis is very subjective it is really hard to come up with a solution that address all the issues. If I remember right the very first version of Ladybug actually had a viewAnalysisPar that would let you to set the viewFieldAngles. Also all the view points used to be weighted based on the angle.\n\nThe feedback was that this is not the right way of measuring the view. For example people can turn their head around, and also they don't really seat perpendicular to the window. In many offices the layout is to sitting parallel to the window and in the case you will be actually seeing the point in the off angle. Then I removed the input and added waiting factor, but there are cases like yours that it won't be useful.\n\nAll said I personally can see the value of having a field of view input or an output for all the angles which can be used to remove the points afterwards.\n\nLet me know your thoughts.\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "September 22, 2015 at 5:24pm", "created_by": "MostaphaSadeghipour", "replies": [{"body": "\nHi Mostapha,\n\n\n\nThanks for replying. I think in a residential situation the acute angle is a bigger issue than offices since rooms and windows are smaller in residential areas. What I guess I'm trying to simulate is someone standing a foot or two from their window, drinking their morning coffee and enjoying their view of the nearby mountain or body of water or whatever landmark is interesting in the area. I realize I'm sort of using the component backwards, but it is really useful in the context I'm applying it in, it is just returning un-realistic results in some situations (where the space needle is 98 degrees off the normal of the window, for example).\n\n\n\nThe weighting factor could also be folded into this, views closer to normal get more weight for example. In my firm I'm asked to produce this analysis a lot, but I hate giving caveats about this angle issue. It also returns counter-intuitive results, making our shaping of the building seem less impactful than it really is.\n\n\n\nAnyways, that is my 2 cents. I might bone up on my vector maths and see if I can't crack it.\n\n\n\nThanks!\n\nShane\n", "attachments": [], "created_by_name": "Shane Simon", "created_at": "September 30, 2015 at 7:35pm", "created_by": "ShaneSimon", "replies": []}, {"body": "\nHi Shane,\n\nI just wanted let you know that Chris has recently added a number of new functionalities to the view component that addresses some of your concerns about calculating the view. [It's still under development](http://www.grasshopper3d.com/group/ladybug/forum/topics/sky-view-factor-vs-vertical-sky-component?commentId=2985220%3AComment%3A1434773&amp;groupId=2985220%3AGroup%3A658987) but I thought you might be interested to give it a try.\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "January 10, 2016 at 5:36pm", "created_by": "MostaphaSadeghipour", "replies": []}]}, {"body": "\nSo I finally decided to take a crack at fixing this issue, and created a bundle which plugs in to the back-end of the ViewAnalysis component. It takes a acceptable viewing angle from the analysis' surface normal (ie, 70 degrees from normal will result in a 20 degree non-viewable angle, or the \"user defined\" note in the sketch in the original post). The view angle is a cone, so it doesn't mimic the new view angle component for Ladybug which alters the cone based on up/right/left/down.\n\n\n\nIt returns the analysis mesh (in black and white, but that is just a gradient component in the bundle), viewStudyResult and averageView. I've found this makes a huge difference when analyzing a buildings view potential to features and landmarks.\n\n\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/7XbQiMj5TFOf1*6ExboJL0TS-LSx4nWpzN-c8*luJNjbjmyNnT6g10uqK*WP89LDFLnNU*gj0TYYGBDnQ57oou-PQgq0eanG/2017061311_23_14GrasshopperViewanalysisRestrictedAngle.png?width=721\" width=\"721\"/>](http://api.ning.com:80/files/7XbQiMj5TFOf1*6ExboJL0TS-LSx4nWpzN-c8*luJNjbjmyNnT6g10uqK*WP89LDFLnNU*gj0TYYGBDnQ57oou-PQgq0eanG/2017061311_23_14GrasshopperViewanalysisRestrictedAngle.png)\n\n<img class=\"align-full\" src=\"http://api.ning.com:80/files/7XbQiMj5TFPOVoq1vxHgKnUSrNQypljAUSxgjJz-17KOw4wrZcv4tPxifKZ6kfPQfmNoeuRq61TI85zjDyf5XT28zFl-bvtA/2017061311_22_23UntitledRhinoceros5.0CommercialPerspective.png?width=721\" width=\"721\"/>\n\nThis seems to work great for my particular use case. If anyone has ideas to improve performance (it is kinda slow) or other comments, I'd like to hear them.\n\n\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1768602", "name": "View analysis - Restricted Angle.gh"}], "created_by_name": "Shane Simon", "created_at": "June 13, 2017 at 12:26pm", "created_by": "ShaneSimon", "replies": []}], "id": "1361876"}