{"body": "\nHi All!\n\n\n\nI am currently creating a file which will allow for a parametric simulation of a 2 storey building. I will be adding the myslider component to the parametric sliders once I have the file working. As is, I have a file which works to run a daylight simulation, create a lighting schedule and then use this to run an energy plus simulation (ParametricTest_Single).\n\n\n\nThe file is using custom made schedules and constructions for the NZ context (userCustomLibrary.idf)\n\n\n\nMy issue now is that I want to split the zones according to orientation (interior and perimeter), run daylight simulation for the grids within the individual zones, create a lighting schedule based on the DA result for each zone and then combine the zones again to run an energy simulation. However, I believe my workflow must be incorrect to do this, as I cannot get it to work. It simply comes up with a \"Solution exception: index out of range: 0\". This is in the Splitzones_issue file.\n\n\n\nAny suggestions? Much appreciated for any help!\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1361910", "name": "SplitZones_Issue.gh"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1361911", "name": "ParametricTest_Single.gh"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1361912", "name": "userCustomEPLibrary.idf"}], "created_by_name": "Elzine Braasch", "created_at": "September 14, 2015 at 5:29pm", "created_by": "ElzineBraasch", "topic": "Coupling Daylight and Energy Simulations - issues in splitting zones to create individual lighting schedules", "replies": [{"body": "\nHi Elzine,\n\n\n\nSorry that no one has got back to you about solving your issue. I am trying to work out whats going wrong with your file now. Which components are giving you this error? Is it the Run Energy Plus simulation and the Honeybee Read EP result component? That is what I am getting.\n\n\n\nI am however having trouble with your building constructions. Simply some of them don't exist when I open your file on my machine. Since your work flow is so complicated and I'm having trouble with it can I suggest that you show me how your work flow is meant to work over Skype? \n\n\n\nThis would make it easier for me to work out whats going wrong. You can add my skype on - anton.szilasi\n\n\n", "attachments": [], "created_by_name": "Anton Szilasi", "created_at": "September 18, 2015 at 9:22am", "created_by": "AntonSzilasi", "replies": [{"body": "\nHi Anton!\n\n\n\nThank you for the reply, apologies for my late one.\n\nYes my issue is with the Run EnergyPlus simulation component, it has a \"Solution exception: index out of range: 0\" issue which only seems to happen if I split my zones individually to provide different schedules to them.\n\n\n\nMy building constructions are in the userCustomlibrary idf file, you need to replace this file with your own one in your ladybug folder where you store your OpenStudioMasterTemplate idf file. This idf was created by Mostapha to enable us to easily use constructions from our old idf files without having to try and construct them all manually in honeybee. Similarly with schedules.\n\n\n\nSure I can discuss it over skype, however I am in NZ so our time zones would make it tricky to organise a time and I am currently trying to get Rhino on my laptop at home from the university to allow me to skype and show my screen to my supervisor (who is currently in England).\n\n\n\nI will take some screenshots of where my problems are and perhaps annotate the gh file a bit more to make it easier to follow what I am doing.\n", "attachments": [], "created_by_name": "Elzine Braasch", "created_at": "September 22, 2015 at 4:06pm", "created_by": "ElzineBraasch", "replies": []}, {"body": "\nHi Elzine,\n\n\n\nAfter I updated the userCustomlibrary.idf (I wasn't aware of this capability) I could work out what you were trying to do with your GH file. I believe that I've solved it, it was a bug in the component Honeybee_Set Ep Zone Interior Construction.\n\n\n\nI have to get this fix synced with github so until I do if you need another  Honeybee_Set Ep Zone Interior Construction component just copy the components in this GH file!\n\n\n\nLet me know if this GH file is what you wanted,\n\n\n\nCheers\n\n\n\nAnton\n\nuserCustomlibrary\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1367473", "name": "SplitZones_Issue AJZ 23.09.2015.gh"}], "created_by_name": "Anton Szilasi", "created_at": "September 23, 2015 at 5:56pm", "created_by": "AntonSzilasi", "replies": []}, {"body": "\nYeh the userCustomLibrary is brilliant! I am still trying to work out how to make my own building programs though... Can't quite see in the master template how I should be duplicating the process of all the various schedules for the current template programs.\n\nYes I have noticed in a quick QA demonstration that the interior construction component was duplicating my surfaces, but just noted it down. I'll endeavour to ask about these bugs in the future.\n\n\n\nThanks for the help!\n", "attachments": [], "created_by_name": "Elzine Braasch", "created_at": "September 24, 2015 at 9:33pm", "created_by": "ElzineBraasch", "replies": []}]}, {"body": "\nHi Elzine,\n\nI didn't test your file but Honeybee does take care of generating different lighting schedules for different zones. testPointGenerator graft the points for each testSurface automatically which will be used to generate several schedules. I attached a simple example for your reference.\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/3FLLVGZOVWKPEs8rYgTDW*3WT5-hX9raHUS98pWzrUHwYL1il*S*BoNsnjk9HBi7bmldzpAm8h6SYyyHW1bNoDQFmfx9SBzP/s.png?width=721\" width=\"721\"/>](http://api.ning.com:80/files/3FLLVGZOVWKPEs8rYgTDW*3WT5-hX9raHUS98pWzrUHwYL1il*S*BoNsnjk9HBi7bmldzpAm8h6SYyyHW1bNoDQFmfx9SBzP/s.png)\n\nMostapha\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1366845", "name": "multipleZoneSchedule.gh"}], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "September 22, 2015 at 6:25pm", "created_by": "MostaphaSadeghipour", "replies": [{"body": "\nHi Mostapha,\n\n\n\nOh excellent! I'm a newbie to Daysim but my supervisor, Dr. Michael Donn, has pointed me to some simple exercises to give me a crash course. Seems I've been over complicating the creation of the lighting schedules.\n\n\n\nCheers,\n\n\n\nElzine\n", "attachments": [], "created_by_name": "Elzine Braasch", "created_at": "September 24, 2015 at 9:30pm", "created_by": "ElzineBraasch", "replies": []}, {"body": "\nHi Mostapha,\n\n\n\nI have simplified my file to only do a daylight analysis on the perimeter zones to determine their lighting schedules, however the run component is having a runtime error issue \"pop off of list\"? I am unfamiliar with this error.\n\n\n\nThe component supplied in your example file works to provide test points, and should from my knowledge work...\n\nAre you able to look at the file and see what is causing this issue?\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/RVyZE3N-GnYGa0ePYR0h39SSSUB7FjYMKbxhe0pPwWoQZr5XzWT3C8if3YmkLBiwjPxvHF9*vzqK0K3o5BRrqKo6D81ycqsf/Screenshot2015092914.01.50.png?width=721\" width=\"721\"/>](http://api.ning.com:80/files/RVyZE3N-GnYGa0ePYR0h39SSSUB7FjYMKbxhe0pPwWoQZr5XzWT3C8if3YmkLBiwjPxvHF9*vzqK0K3o5BRrqKo6D81ycqsf/Screenshot2015092914.01.50.png)\n\nElzine\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1370172", "name": "Parametric_PerimeterCore_Daylightingissue.gh"}], "created_by_name": "Elzine Braasch", "created_at": "September 28, 2015 at 8:18pm", "created_by": "ElzineBraasch", "replies": []}, {"body": "\nHi Elizine \n\nIt seems to me that you've connected a statFILE to epw file input try this one\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1370519", "name": "Parametric_PerimeterCore_Daylightingissue AJZ 9.29.2015.gh"}], "created_by_name": "Anton Szilasi", "created_at": "September 29, 2015 at 6:19am", "created_by": "AntonSzilasi", "replies": []}, {"body": "\nHaha thanks Anton, theres the problem with trying to connect things zoomed right out!\n", "attachments": [], "created_by_name": "Elzine Braasch", "created_at": "September 29, 2015 at 3:12pm", "created_by": "ElzineBraasch", "replies": []}]}]}