{"body": "\nhello to everyone\n\n\n\ni want to ask you just 1 thing:\n\n- is it possible to do a water wall that has mass and trasparency?\n\n   (and, obviously, calculating his temperature in a specific time and space?)\n\n\n\nIt's both a window and a wall, so i want to use that in order to gain light and thermal mass.\n\n\n\nif you know, please answer me.\n\nThank you very much\n\nDavide\n", "attachments": [], "created_by_name": "Davide Scialò", "created_at": "September 18, 2015 at 11:56am", "created_by": "DavideScialo", "topic": "Water Wall", "replies": [{"body": "\nHi Davide,\n\nI have never done something similar with EnergyPlus so I'm not sure. I would post this question to (unmethours.com). If EnergyPlus is capable of modeling evaporation effect from a surface then you should be able to also do it with Honeybee but as I said I'm not sure if energyplus has a module for that.\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "September 22, 2015 at 5:39pm", "created_by": "MostaphaSadeghipour", "replies": [{"body": "\nDavide,\n\nAs I understand it, EnergyPlus does not have a special type of material for this case but, if I were you, I would model it as a custom triple-pane window with really massive thick glass material for the center pane that has properties that match those of water.  Use the HB Glass material for this:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/5GMft5nqv7A9BH*RGamtqdemwGjqKjnHX7pjdv7Ucx1S7JNORa8JYR7aYEpvS8y7jVD3e2D5ls0QKsMmBtHYAjUWSU6e3zwu/GlassMaterial.JPG\" width=\"442\"/>](http://api.ning.com:80/files/5GMft5nqv7A9BH*RGamtqdemwGjqKjnHX7pjdv7Ucx1S7JNORa8JYR7aYEpvS8y7jVD3e2D5ls0QKsMmBtHYAjUWSU6e3zwu/GlassMaterial.JPG)\n\nYou won't capture any of the convective behavior that the water might exhibit but it will give you an idea of what a massive transparent wall might do to the thermal performance of the building.\n\nAs is the case with any good and open simulation tools, the limit of what you can do with it is just a function of how willing you are to get deeper into the model assumptions and how large of a margin of error you are willing to accept with certain behaviors.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "September 24, 2015 at 6:51pm", "created_by": "ChrisMackey", "replies": []}]}], "id": "1364385"}