{"body": "\nHi All!\n\n\n\nAs a quick question for Chris and Mostapha, and anyone else who knows, I am trying to run a parametric iteration study, but it is going to take a long time for them all to run if it can only run one energy and daylight simulation at a time.\n\n\n\nIs there a way to run the idfs created as a group run like what energyplus launcher can do with native energyplus?\n", "attachments": [], "created_by_name": "Elzine Braasch", "created_at": "September 22, 2015 at 4:25pm", "created_by": "ElzineBraasch", "topic": "Running several E+ simulations at a time?", "replies": [{"body": "\nNot with the current interface of Honeybee. It will wait for each simulation to be over and then runs the next simulation. If you don't wait for the simulation to be over then the resultReader component will fail.\n\nThere are of course solutions to run files in parallel, and then post process the results. Is this what you're looking for?\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "September 22, 2015 at 6:34pm", "created_by": "MostaphaSadeghipour", "replies": [{"body": "\nHi Mostapha, thanks for the reply!\n\nYeh, I'd like to create a bunch of the files and then process the results afterwards. Is there a short tutorial or example file of this process working which I could work through? \n", "attachments": [], "created_by_name": "Elzine Braasch", "created_at": "September 22, 2015 at 7:18pm", "created_by": "ElzineBraasch", "replies": []}, {"body": "\nA good example to start is how honeybee does it for Daylighting ([https://github.com/mostaphaRoudsari/Honeybee/blob/master/src/Honeyb...](https://github.com/mostaphaRoudsari/Honeybee/blob/master/src/Honeybee_Honeybee.py#L1895-L1913)).\n\nVinu [has the same issue apparently](http://www.grasshopper3d.com/group/ladybug/forum/topics/glazing-ratio-clarification-and-comparing-simulation-datas?page=1&amp;commentId=2985220%3AComment%3A1366750&amp;x=1#2985220Comment1366750). Maybe you should team up for this one.\n\nI think a good approach would be adding this option to \"Honeybee_Re-run IDF\" component. It already does create a batch file for a single file. You only need to make it work for multiple files.\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "September 22, 2015 at 7:44pm", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nYes, I will share when I figure it out, if you would like to collaborate Elzine shoot me an email @ vinu.arch@gmail.com\n", "attachments": [], "created_by_name": "Vinu Subashini", "created_at": "September 23, 2015 at 4:11pm", "created_by": "VinuSubashini", "replies": []}, {"body": "\nHi Vinu and Elzine,\n\n\n\nI can create this functionality for you if you like. Let me know if you would like me to code this for you both.\n\n\n\nRegards\n\n\n\nAnton\n", "attachments": [], "created_by_name": "Anton Szilasi", "created_at": "September 23, 2015 at 6:10pm", "created_by": "AntonSzilasi", "replies": []}, {"body": "\nHi Anton,\n\nThat would be great if you could code it! Do we need to give any other details?\n\n\n\nVinu\n", "attachments": [], "created_by_name": "Vinu Subashini", "created_at": "September 24, 2015 at 3:01pm", "created_by": "VinuSubashini", "replies": []}, {"body": "\nHi Anton!\n\n\n\nI'm literally just learning python coding so if you are already able to code this then that would be great! My university has a processing lab of computers which they are giving me access to to run the parametric study and fully use honeybee/ladybug. I do feel like I need to get my head around coding to better understand it as my supervisor is having me do demo's of the program for other students and external consultants to introduce them to the capabilities of parametric design! Exciting times, but having this ability would greatly help the practicality of it within research for sure.\n\n\n\nMuch appreciated if you are able to do this!\n", "attachments": [], "created_by_name": "Elzine Braasch", "created_at": "September 24, 2015 at 4:57pm", "created_by": "ElzineBraasch", "replies": []}, {"body": "\nHi Elize and Vinu,\n\n\n\nSorry for not getting back sooner I will have a crack at this tonight by adding the functionality that Mostapha suggested to the Honeybee_Re-run IDF component. Could either you and Vinu make an example file for me to test this component on?\n\n\n\nSome things might be easier on Skype my time is anton.szilasi I'm in Portugal at the moment but moving to US central time in the next month to 6 weeks.\n", "attachments": [], "created_by_name": "Anton Szilasi", "created_at": "September 29, 2015 at 6:41am", "created_by": "AntonSzilasi", "replies": []}, {"body": "\nHi Anton,\n\nSorry for the late reply, was in a workshop. I could skype next week, will you be in US by then? I live in pacific time. We could arrange a time to skype!\n\n\n\n\n", "attachments": [], "created_by_name": "Vinu Subashini", "created_at": "October 2, 2015 at 12:07pm", "created_by": "VinuSubashini", "replies": []}, {"body": "\nHi Vinu,\n\n\n\nI've already created the component post a group run example file here and I'll test it with your example file. before I release the component.\n\n\n\n\n", "attachments": [], "created_by_name": "Anton Szilasi", "created_at": "October 3, 2015 at 5:06am", "created_by": "AntonSzilasi", "replies": []}, {"body": "\nHi Vinu\n\n\n\nWhere abouts in the pacific are you?\n\nI am currently making up a quick little parametric example to post on for Anton, just testing if the parametric works currently but will have it up soon.\n", "attachments": [], "created_by_name": "Elzine Braasch", "created_at": "October 5, 2015 at 8:56pm", "created_by": "ElzineBraasch", "replies": []}, {"body": "\nHi Anton,\n\n\n\nApologies for the late reply on this, I have been trying to sort out some parametric runs. Please find attached a quick example file of some parameters set up to run parametrically. I have only joined 2 up to the mysliders component to make it quicker.\n\n\n\nSimply just want to see if you can make it create all the idfs and then run them all in parallel to each other - instead of having to wait for one to finish before the next can begin.\n\n\n\nCheers,\n\nElzine\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1373787", "name": "Parametric_Anton.gh"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1373788", "name": "userCustomEPLibrary.idf"}], "created_by_name": "Elzine Braasch", "created_at": "October 5, 2015 at 10:21pm", "created_by": "ElzineBraasch", "replies": []}]}], "id": "1366608"}