{"body": "\nHey Mostapha,<br/><br/>I'm a colleague of Patrick Chopson and Sandeep Ahuja. We've been working on a HB model for a residential tower in Oakland, CA where we are trying to meet Human Comfort code requirements so we won't have to provide a cooling system for the tower. I'm modelling each unit individually on a typical floor (see gh script) then extrapolating the results throughout the building. Window dimensions, % opening, and horiz/vert shaders can all be manipulated to try to meet code requirements.<br/><br/>The model, however, is having a few issues...<br/><br/>1. Shaders - We want to employ both horizontal and vertical shaders to the glazing, but the shade generator can only apply one shader per window. Instead I'm including both shaders as HBContext. Is there a fundamental problem with that?<br/><br/>2. zoneProgram issue - I'm trying to specify all of my zones as residential (preferably high-rise tower, but only option is MidRise Apartment), however when I do for some reason it doesn't stick to the HBZone and defaults to OpenOffice. Is that a problem? If so how can I fix it?<br/><br/>3. Bldg Articulation (SW 1-BED) - I've noticed that jogs in exterior face of a zone throws an error (sun rays incident on multiple surfaces) so I've separated the single zone into two using an airwall as the partition. But when I run the simulation the results (see output chart) mirror that of the exterior temperature, so the analysis must not be working properly?\n\n\n\nThe main issue is that I'm not entirely confident with the results I'm getting. I ran multiple iterations on the South Studio (see pdf in zip) and the results are significantly different than any independent verification through other energy modelers.\n\n\n\nIf we can get this to work properly it would be HUGE to convince Oakland's building department that the simulation is accurate. It would be great to chat about this if you have an available window...<br/><br/>Thanks man!<br/><br/>Jeremy Bamberger\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1375027", "name": "HB Human Comfort.rar"}], "created_by_name": "Jeremy Bamberger", "created_at": "October 7, 2015 at 11:20am", "created_by": "JeremyBamberger", "topic": "Human Comfort Analysis issues", "replies": [{"body": "\nHi Jeremy\n\n\n\nStrangely I can't download the file you posted, could you please email it to ajszilasi@gmail.com and I'll take a look.\n\n\n\nRegards,\n\n\n\nAnton\n", "attachments": [], "created_by_name": "Anton Szilasi", "created_at": "October 8, 2015 at 4:01am", "created_by": "AntonSzilasi", "replies": [{"body": "\nHi Jeremy. Ning doesn't like .rar files. Can you upload the file as a zip file?\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "October 8, 2015 at 11:09am", "created_by": "MostaphaSadeghipour", "replies": []}]}], "id": "1375028"}