{"body": "\nHi,\n\nI've been preparing this discussion for some time now.\n\nI was in doubt if continue this [discussion](http://www.grasshopper3d.com/group/ladybug/forum/topics/hobeybee-hourly-solar-radiation) or start a new one. So here we are: a new one.\n\nThere are 2 issues that are bothering me with the radiation results, specially when comparing the results from LB with those of HB.\n\nIssue 1: Results so different.\n\nIn the attached file upper part to the right of the canvas you see both definitions (LB and HB). The images obtained show results so different that i can't find a logic explanation (2.46 vs 41 kWh/m2 for the same period of time). I believe that LB are in the OK range. HB are to high for just 5 hrs of calculation. I don't believe the material definition are making such a big difference (though i tried to have them similar).\n\n\n\nIssue 2: Can't get annual grid based calculations plotted.\n\nIn the attached, right side at the bottom. I get the calculation, but after connecting the results to the HB_readAllTheDSHourlyResults it takes ages to calculate and at the end rhino crashes. Can be that this is a memory problem? Or there is a way to make this work (total annual radiation for GridBased simulation)? For now i disabled the component, but i just wonder ...\n\n\n\nWords of wisdom for both issues will be appreciated.\n\n\n\nThanks,\n\n-A.\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1375321", "name": "05_SunlightHourAnalysis_CrossTower-V0_Honeybee_Done_01.gh"}], "created_by_name": "Abraham Yezioro", "created_at": "October 7, 2015 at 10:35pm", "created_by": "AbrahamYezioro", "topic": "Radiation Results - LB & HB", "replies": [{"body": "", "attachments": [], "created_by_name": "Claudio", "created_at": "October 8, 2015 at 6:11am", "created_by": "Claudio", "replies": [{"body": "\nI hope i'm doing something wrong. The alternative is much less desirable ...\n\n\n\nAnother thing i've noticed. In the file i attached, when i send only one hour in HB (say from 10 to 11) the radiation image is black, like nothing is in there. It required at least 2 hours.\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "October 8, 2015 at 6:33am", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nHi Abraham. I will check your file as soon as I can. Back to part 1 I assume that you're already using a climate-based sky? Otherwise it's expected.\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "October 8, 2015 at 11:06am", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nHmmmm ...\n\nI'm using HB_genCumSky.\n\nThe reason is that i want to get the whole year radiation (or any other desired analysis period). The hint for this sky says to use it ONLY for radiation analysis, since it is using the Gencumulativesky.\n\nThe HB_genClimateBasedSky asks for specific month/day/hour.\n\nI'm getting the feeling that, in effect, i'm doing something wrong ...\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "October 8, 2015 at 11:23am", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nYou're probably doing it right. I guess the difference is coming from gencumulative sky vs gendaymtx. I know that gendaylit (climate-based sky) and gendaymtx match for hourly tests that I have done.\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "October 8, 2015 at 1:57pm", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nHmmm is it me or this discussion started by Abraham got hijacked.\n\nRobert please dont take this badly but I think you should start your own discussion topic aside from this one. Maybe is too late now but I think is fair enough to say that.\n\nBack to Abraham discussion.  It is interesting to know that there is a difference in the gendaymtx vs gendaylit returns different results. I'm still not able to see the definition but I will when I get back home..traveling right now so I'm n my phone\n\n\n\ncheers\n", "attachments": [], "created_by_name": "Claudio", "created_at": "October 8, 2015 at 6:22pm", "created_by": "Claudio", "replies": []}, {"body": "\nHi Claudio. Don't worry. I'm checking the file right now and will have a definite answer soon. That was my hypothesis. Let me check and I will update the discussion.\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "October 8, 2015 at 6:26pm", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nClaudio,\n\nI'm not trying to \"hijack\" anything. Yesterday I posted an issue about radiation calcs and Abraham invited me to a thread he was opening because he thought my issue was germaine. If i jumped on the wrong thread sorry but serious? \"hijack\"?\n\n\n", "attachments": [], "created_by_name": "Robert Narracci", "created_at": "October 8, 2015 at 6:39pm", "created_by": "RobertNarracci", "replies": []}, {"body": "\nYeah you are right Robert. No Hijack then, My sincere public apologies\n\ncheers\n", "attachments": [], "created_by_name": "Claudio", "created_at": "October 8, 2015 at 6:52pm", "created_by": "Claudio", "replies": []}, {"body": "\nall cool bro!\n", "attachments": [], "created_by_name": "Robert Narracci", "created_at": "October 8, 2015 at 6:53pm", "created_by": "RobertNarracci", "replies": []}, {"body": "\nHmmm #2.\n\nJust to be sure about the status of this thread.\n\nRegarding question 1: The definition is fine and the problem comes from gencumulativesky? I see in the [DIVA](http://diva4rhino.com/user-guide/simulation-types/radiation-maps)site that they show \"proudly\" the radiation renders. I assume they are doing right ... should i? Just can't get so far where is the \"leak\" in this one.\n\nAs for question 2: any recommendations?\n\n\n\nThanks,\n\n-A.\n\nP.S. Just now i see Mostapha's answer from 3 hours ago that he is checking. So sorry for writing this \"in the middle\" of this process.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "October 8, 2015 at 9:46pm", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nany way I can move my stuff into a new thread?\n", "attachments": [], "created_by_name": "Robert Narracci", "created_at": "October 9, 2015 at 6:16am", "created_by": "RobertNarracci", "replies": []}]}]}