{"body": "\nHello Guys,\n\n\n\nI always try to get HB and LB up to date even when there is no official release. On the other side I do the same for the EP application. Is it safe then to delete previous version of EP just work with the latest. In a sens you do get the most up to date weather files.\n\n\n\nAny thoughts or bad experiences\n\n\n\nThank you all \n", "attachments": [], "created_by_name": "Claudio", "created_at": "October 8, 2015 at 7:01pm", "created_by": "Claudio", "topic": "Energy plus updates is it safe", "replies": [{"body": "\nClaudio,\n\nYou need to be aware o fthe changes in the software (in this case E+). Maybe it is changing something that will affect your results ad this can be very bad/good. Usually before the update i do some tests to see if i get different results. In such  case i try to understand why it happens and/or if the changes are significant.\n\nIf you are a developer first thing you need to know if the new version is changing the format (or otherwise things) of the IDF so you can release updates of your own software that will be able to run the new version (in this case HB).\n\nJust to clarify your last sentence. Weather files are not updating with E+. Unless new standards in those files they are the same through time.\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "October 8, 2015 at 9:37pm", "created_by": "AbrahamYezioro", "replies": [{"body": "\nThank you Abraham,\n\nAs a method for working with daylight and energy simulations, I created a simple geometry sort of a generic box (space) that we use plot ideal results which are then compared against the results  coming out of a given project. I will use this method to see if there is any differences between different versions of EP.\n\nThanks for the tip\n\n\n\nYou are right about my last sentence.\n\n\n\ncheers\n", "attachments": [], "created_by_name": "Claudio", "created_at": "October 9, 2015 at 9:02pm", "created_by": "Claudio", "replies": []}]}]}