{"body": "\nHi,\n\nQuestion: Would it be correct to say that the VSC component calculation can also be interpreted as Sky View Factor?\n\nMaybe it is the hour, but i'm getting confused here.\n\nThanks,\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "October 11, 2015 at 3:06pm", "created_by": "AbrahamYezioro", "topic": "Sky View Factor vs Vertical Sky Component", "replies": [{"body": "\nAbraham,\n\n\n\nI like your idea of using VSC to calculate a Sky View Factor. Unfortunately, because VSC is affected by glazing properties and reflected light, the same sky view could result in different VSC values if the model material properties change.\n\n \n\nIf you removed all of your glass and calculated a single ray (ab-0) run under uniform sky conditions, that might work. I never use VSC, so I might be off here, but that sounds reasonable. What do you think?\n\n \n\n-Leland\n", "attachments": [], "created_by_name": "Leland Curtis", "created_at": "October 12, 2015 at 7:32am", "created_by": "LelandCurtis", "replies": [{"body": "\nThanks for the \"support\" Leland :-)\n\nAt least i see that someone else sees the logic behind the thinking.\n\nVSC is the only DL component that doesn't have a radParameters input. The ab setting for this calculation is set to 1, so one bounce is OK, no matter the properties of the materials (even mirror glazed).\n\nSo i think the component can be also used for SVF.\n\nJudge Mostapha?\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "October 12, 2015 at 8:18am", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nBTW,\n\nThe Shadingmask gives a point in space SVF, but having a map of this parameter is nicer and probably more useful for design/research purposes.\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "October 13, 2015 at 9:44pm", "created_by": "AbrahamYezioro", "replies": []}, {"body": "", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "October 14, 2015 at 5:27am", "created_by": "ChrisMackey", "replies": []}, {"body": "\nThanks Chris,\n\nIn the meantime i've been doing some tests with the Shadingmask component just to compare results with the VSC's. So far no good correlation. The differences are pretty big, sometimes beyond 15-20%.\n\nBeing the SVF a completely geometrical calculation (no sky influence) i was hopping the results will be in the same order of numbers (also played with the resolution of the Shadingmask but no improvement). Makes me think that maybe the -ab = 1 in the VSC is the cause. So maybe for SVF this parameter should be set to 0, as Leland said ...?\n\n\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "October 14, 2015 at 11:53am", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nHi all, The methodology for the component as mentioned in description is based on this Radiance post ([http://www.radiance-online.org/pipermail/radiance-general/2006-Sept...](http://www.radiance-online.org/pipermail/radiance-general/2006-September/004017.html)). The post suggests ab=1 for some technical reasons but it's not really convincing.\n\nAbraham. Can you post results of your study? That might be helpful to understand what's going on.\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "October 16, 2015 at 7:20am", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nHere you go Mostapha.\n\nYou'll get the map on the ground surface. There i plot the VSC results.\n\nAfter that i check random points with the ShadingMask (manually).\n\n-A.\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1380106", "name": "06_CrossTower_V0+VSC_Internalise.gh"}], "created_by_name": "Abraham Yezioro", "created_at": "October 16, 2015 at 10:19am", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nHi Chris,\n\nI'm checking the version of LB_viewAnalysis you released today. I see the option of SVF (great).\n\nIn the process the component gives an error (red component) regarding the viewPtsWeights missing (line 526). I solved it temporary changing the variable name for \"1\". I see that this variable shows in some other places as a parameter but not as a variable influencing the calculations. So i assume it can be deleted from the component.\n\n\n\nI'll keep checking and will report results here.\n\nThanks,\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "January 5, 2016 at 10:09pm", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nOK. I've been checking a bit the viewAnalysis regarding the SVF.\n\nThe results vary a bit from those of the LB_shadingMask (1-2%), which a see a s good consistency. This is great. I can say that the VSC doesn't show a good agreement with this SVF, so even though the logic can be similar they don't converge.\n\n\n\nFor consistency between the viewAnalysis and shadingMask the viewResolution_ and the _skyDensity_ inputs, accordingly, represent the same resolution value? The first part of the description says so, but just want to be sure. Maybe the input name can be similar (i assume that viewRessolution applies only to SVF analysis)?\n\nThanks,\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "January 6, 2016 at 12:53am", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nAbraham,\n\nThe error was a bug that I have just fixed:\n\n[https://github.com/mostaphaRoudsari/ladybug/commit/de15d1dd2b5411ec...](https://github.com/mostaphaRoudsari/ladybug/commit/de15d1dd2b5411ecdf6f03bad86ecec3c39cea64)\n\nThank you, as always, for finding these issues before anyone else does.\n\nThe results with the view component should be equivalent to the LB_shadingMask as I am using the exact same method of projecting vectors to the center of the sky patches.  The only thing that I can think might be causing the 1-2% discrepancy is that Mostapha might be accounting for the areas of the sky patches and I am just assuming that each sky patch is of equal area to the others.  If anyone has any strong feeling about accounting for the areas of the sky patches, let me know and I can work it in.  I know that Tregenza originally divided them that way to have as equal areas as possible so I thought that I might be safe with the assumption.\n\nThe skyDensity and viewResolution inputs are the same parameter from the perspective of the LB_LB component that generates the patches/vectors.  I used the more general term \"viewResolution\" since I am using the evenly distributed vectors for other types of view analysis (like spherical view) and not just sky view.\n\nHow far off is the agreement with the VSC component?  Radiance is going to use the stoichastic method, which is going to be different than projecting the same evenly distributed view vectors.  If it's really far from a high resolution view study, maybe we need to look into the HB_VSC code.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "January 8, 2016 at 4:02pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nHi Chris,\n\nThe error was not fixed. I'm still having this:\n\nRuntime error (UnboundNameException): name 'viewPtsWeights_' is not defined<br/>Traceback:<br/>  line 531, in script\n\nwith the Jan 8 version. You left in line 531 the variable viewPtsWeights, which is not in the inputs anymore. For now i changed the code giving \"1\" instead the variable, so the component can run, but i know that viewPtsWeights shows in other places.\n\nThe differences with VSC go between 5 to 20% or more (depending if the sample point is more exposed to the sky). This is really far away.\n\nI'm good with the other explanations.\n\n\n\nThanks,\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "January 9, 2016 at 1:29am", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nI'm attaching the example i'm using for this case.\n\n-A.\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1434774", "name": "06_CrossTower_V0+VSC_Internalise.gh"}], "created_by_name": "Abraham Yezioro", "created_at": "January 9, 2016 at 1:30am", "created_by": "AbrahamYezioro", "replies": []}]}]}