{"body": "\nHi all!\n\n\n\nThe refractive index (1.52 for glass and 1.4 for ETFE) as input for radiance simulation:\n\nWhich influence does it have for daylight simulation? Why is it relevant and has to be considered?\n\n\n\nDaniel\n", "attachments": [], "created_by_name": "Daniel Podmirseg", "created_at": "October 13, 2015 at 1:05am", "created_by": "DanielPodmirseg", "topic": "REFRACTIVE INDEX - principal question", "replies": [{"body": "\nRefractive index of a material indicates how light would behave when it passes through that material. Since Radiance is a physically based renderer, it's pretty to see this phenomenon in action.\n\nThe image on the upper right shows a table made of a material with refractive index of 1.5 (typical for glass) while the one below it shows a table made out of air (air has a refractive index of 1). The other two are wood and aluminum.\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/2RR8Hh9pEHgrOLT8rPOTaFVcIXRNb7M2M45OQCClat8Rr2JJBbS3tR-juYiEg0UI8VVLMMbtXSxYe3h8aKjzUG1IlzUuph2J/1014201522717PM.jpg?width=721\" width=\"721\"/>](http://api.ning.com:80/files/2RR8Hh9pEHgrOLT8rPOTaFVcIXRNb7M2M45OQCClat8Rr2JJBbS3tR-juYiEg0UI8VVLMMbtXSxYe3h8aKjzUG1IlzUuph2J/1014201522717PM.jpg)\n", "attachments": [], "created_by_name": "Sarith Subramaniam", "created_at": "October 14, 2015 at 12:30pm", "created_by": "sarith", "replies": [{"body": "\nThat's what I call a powerful reply. Thank you very much for this strong pictures.\n\n\n\nThe question though is if there is any relevance regarding daylight simulation with honeybee. I tested glass with different RI and got the same results.\n\n\n", "attachments": [], "created_by_name": "Daniel Podmirseg", "created_at": "October 15, 2015 at 2:31am", "created_by": "DanielPodmirseg", "replies": []}, {"body": "\nThe decision to model a dielectric material really depends on whether the dielectric materials in your simulation have any significant thickness associated with them. The use of dielectric materials leads to an increase in simulation time.It is one of the reasons why Radiance has a glass material which is optimized for thin surfaces. For most daylighting calculations it rarely makes computational sense to model dielectric materials. For example, Glazings almost always should be modeled with the glass material.\n\nThere are several applications, however, where you need to use dielectrics. For example, to model water or a glass bricks. See the images [here](https://unmethours.com/question/11541/how-does-one-correct-errors-related-to-truncated-images/) and [here](http://www.radiance-online.org/community/workshops/2015-philadelphia/presentations/day2/McNeil_glassblock.pdf) .\n", "attachments": [], "created_by_name": "Sarith Subramaniam", "created_at": "October 15, 2015 at 2:12pm", "created_by": "sarith", "replies": []}]}]}