{"body": "\nIs it possible to extract information to a very fundamental level from an idf file using Honeybee ?\n\nFor example can I extract the visible transmittance of a glazing from an IDF file without having the original geometry data ? I know how to do it with scripting but I was wondering if there is a possible workflow within Honeybee which can get me that information.\n\n\n\nFor example...\n\n\n\nIDF FILE ---&gt; HB_Import IDF --&gt; HB_Decompose Zone --&gt; ........ Visible Transmittance of Glazing ?\n\n\n\n\n\nThanks,\n\nSarith\n\n\n", "attachments": [], "created_by_name": "Sarith Subramaniam", "created_at": "October 11, 2015 at 3:23pm", "created_by": "sarith", "topic": "Reverse engineer an idf file with honeybee ?", "replies": [{"body": "\nHi Sarith, In theory it should be possible but there are couple of challenges.\n\n1. importIdf component is not stable. I initially wrote it as a hack/proof of concept so it doesn't catch everything.\n\n2. You need an extra script to return glazing construction. This one is very easy.\n\n3. You need to have an algorithm to calculate the value for multi-layer glazing. Window does that but the version to run from the command line wasn't free. There might be still a way to do that though. Rob somehow does it for OpenStudio. Also there are different glass types in EnergyPlus.\n\n\n\nHere is the workflow:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/pip6g4jx0sc2pzTAozZJ3TMjCaAR2DIlK6XXTPUxh8ofPEKPgt1U3YARaZOCoGyGdFvGjyddHjaxCAkSD-goUkKrT3KohNHx/getEPTransValue.png?width=721\" width=\"721\"/>](http://api.ning.com:80/files/pip6g4jx0sc2pzTAozZJ3TMjCaAR2DIlK6XXTPUxh8ofPEKPgt1U3YARaZOCoGyGdFvGjyddHjaxCAkSD-goUkKrT3KohNHx/getEPTransValue.png)\n\n\n\n\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1380204", "name": "getEPGlassTrans.gh"}], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "October 16, 2015 at 8:18am", "created_by": "MostaphaSadeghipour", "replies": [{"body": "\nHi Mostapha,\n\n\n\nThe importIdf component did crash a few times.\n\nAs a workaround, I tried using [eppy library](https://github.com/santoshphilip/eppy) for extracting information from IDF files and then feeding it into a Honeybee/Ladybug workflow. Eppy is a little clunky (and perhaps buggy as well) but does the job most of the times. I have a few IDF files with versions ranging from 8.0 to 8.3 and since there doesn't seem to be a whole lot of backward compatibility in versions, its been a grind trying to get everything in one place..Thanks for the gh file! I will try to write a custom script by expanding it.\n\n\n\nSarith\n", "attachments": [], "created_by_name": "Sarith Subramaniam", "created_at": "October 16, 2015 at 4:24pm", "created_by": "sarith", "replies": []}]}], "id": "1377312"}