{"body": "\nHi All,\n\n\n\nI have a couple of questions regarding 2 \"Severe errors\" retrieved from the component Run Energy Simulation. The problem is that apparently E+ finds some surfaces to be degenerate. Specifically, in the extensive error log from E+, I found that the vertices belonging to those surfaces are considered collinear and therefore the surfaces are turned into degenerate and most likely discarded as not useful. However, the analysis runs and I can get results.\n\nActually I am not sure if this problem is going to lead to unreliable results. Did anybody have this problem? Is it really going to affect the results?\n\nSecond question: since the errors log from E+ indicates the IDs of the degenerate surfaces, is it possible to know to which surfaces those IDs belong to? This would be needed in order to check if there is really something wrong in the geometry, even though it looks completely fine in both GH and Rhino.\n\n\n\nI attach the GH script. I hope someone can help with this.\n\n\n\nThank you!\n\nAntonio\n\n\n\n[<img class=\"align-center\" src=\"http://api.ning.com:80/files/pip6g4jx0sfMWH24NTiHpMbyGEEC6w38P7k-Dx5wRVFVdteU17GVEp89-4WogxW2k3oKa1IoRU0R8vL0vKar3o8RhILrn1jx/scriptdeg.JPG?width=750\" width=\"750\"/>](http://api.ning.com:80/files/pip6g4jx0sfMWH24NTiHpMbyGEEC6w38P7k-Dx5wRVFVdteU17GVEp89-4WogxW2k3oKa1IoRU0R8vL0vKar3o8RhILrn1jx/scriptdeg.JPG)\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1379984", "name": "testDegenerateSurf.gh"}], "created_by_name": "Antonio D'Aquilio", "created_at": "October 16, 2015 at 7:08am", "created_by": "AntonioDAquilio", "topic": "EnergyPlus/Honeybee Degenerate surfaces", "replies": [{"body": "\nAntonio,\n\n\n\nI do not know what the degenerate surface error from EnergyPlus means but I know that you should be able to find out either by searching for the error through the EnergyPlus documentation:\n\n[http://bigladdersoftware.com/epx/docs/8-3/input-output-reference/](http://bigladdersoftware.com/epx/docs/8-3/input-output-reference/)\n\n\n\nOr by posting the question to this awesome forum of EnergyPlus experts:\n\n[https://unmethours.com/questions/](https://unmethours.com/questions/)\n\n\n\nTo identify the degenerate surfaces, you can use the \"label zone surfaces\" component to label each surface of your HBZones with its name (in the rhino scene) and you can use this to find the buggy ones.  Upon thinking about your issue and knowing that I have run into similar situations myself, I have realized that it would be really useful to have a component that searches and pulls out the surfaces of a zone based on their names.  I have added this as an issue to the github and I will try to implement it at some point:\n\n[https://github.com/mostaphaRoudsari/Honeybee/issues/386](https://github.com/mostaphaRoudsari/Honeybee/issues/386)\n\n\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "October 17, 2015 at 10:57am", "created_by": "ChrisMackey", "replies": [{"body": "\nChris,\n\n\n\nThank you for the suggestions. I'll try to find the bug in my model and ask in the E+ forum. To be honest I think that the problem is somewhere in the E+ tolerances, but it is hard to find a solution for that.\n\nGlad to hear that you are going to implement the surface check in the future.\n\n\n\nCheers,\n\nAntonio\n", "attachments": [], "created_by_name": "Antonio D'Aquilio", "created_at": "October 18, 2015 at 5:15am", "created_by": "AntonioDAquilio", "replies": []}, {"body": "\nHi Antonio,\n\n\n\ndid you get some news about degenerate surface from E+ forum?\n", "attachments": [], "created_by_name": "Ernesto Cesario", "created_at": "May 3, 2016 at 4:11am", "created_by": "ErnestoCesario", "replies": []}, {"body": "\nDegenerated surfaces are surfaces with 2 points (lines). It happens if you have very tiny surfaces in your model. Check the model and remove tiny surfaces by finding the area od the surfaces and the problem will be solved.\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "May 3, 2016 at 6:46am", "created_by": "MostaphaSadeghipour", "replies": []}]}]}