{"body": "\nHello fellow ladybuggers.\n\n\n\nAs a new user of ladybug I find it difficult to understand what all these awesome graphs and charts mean. I can try and make some sense out of all this, but I feel like I just don't have enough knowledge and experience on how to translate all this juiciness into meaningful conclusions that I can later on give my fellow architects or colleagues (better in a gentle manner, so their brains won't go to space).\n\n\n\nCan anyone suggest the books or maybe videos on YouTube or just share their experience here. I think it will be helpful to any new ladybugger.\n", "attachments": [], "created_by_name": "Tim", "created_at": "October 25, 2015 at 10:11pm", "created_by": "Timur582", "topic": "Learning materials on how to interpret and understand ladybug analysis data.", "replies": [{"body": "\nHi Tim , \n\nthese videos for Mostapha &amp; Chris will help you to understand how to use ladybug &amp; honeybee plugin :\n\n[https://www.youtube.com/channel/UCX0holrRypJilkFo-Dv4JsQ](https://www.youtube.com/channel/UCX0holrRypJilkFo-Dv4JsQ)\n\n[https://www.youtube.com/channel/UCc6HWbF4UtdKdjbZ2tvwiCQ](https://www.youtube.com/channel/UCc6HWbF4UtdKdjbZ2tvwiCQ)\n\nfrom my point of view, I think  you will need to read about basics of environmental design to know what you need to analyse ,  why and what will you get from this analysis you have done  . \n\ntry also to understand the inputs &amp; outputs of every Icon you use to avoid mistakes or errors . \n\nwish you all the best,\n\nMona \n\n\n", "attachments": [], "created_by_name": "mona rezk", "created_at": "October 26, 2015 at 7:21am", "created_by": "monarezk", "replies": [{"body": "\nHi Tim,\n\n\n\nAs Mona said videos are a great place to start. We also started this two premiers for Ladybug and Honeybee that you may find useful:\n\n[https://www.gitbook.com/book/mostapharoudsari/ladybug-premier/details](https://www.gitbook.com/book/mostapharoudsari/ladybug-premier/details)\n\n[https://www.gitbook.com/book/mostapharoudsari/honeybee-premier/details](https://www.gitbook.com/book/mostapharoudsari/honeybee-premier/details)\n\n\n\nThe components are connected to [Hydra](http://hydrashare.github.io/hydra/) where you can find some examples for each component.\n\n\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "October 26, 2015 at 7:48pm", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nHi Mostapha,\n\nI've subscribed to your and Mackey's channel long time ago. Ladybug is pretty user friendly and intuitive. My problem is in how to give meaningful explanation to my colleagues when I show them ladybug's charts and graphs (btw, they love them). Thanks for the suggestions, Mona and you are right, I will google about. Any good books that you could recommend to start with?\n", "attachments": [], "created_by_name": "Tim", "created_at": "October 26, 2015 at 9:18pm", "created_by": "Timur582", "replies": []}, {"body": "\nHi Tim , \n\nCan you give me an example of what you need to explain ? \n\nfor example if you need to know more about psychrometric chart , please find attached a file explain it ( sorry I can't remember the file source ) \n\nis this what you mean by \" meaningful explanation \" ? \n\nRegards \n\nMona\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1388655", "name": "About the Psychrometric Chart.docx"}], "created_by_name": "mona rezk", "created_at": "October 28, 2015 at 6:08pm", "created_by": "monarezk", "replies": []}, {"body": "\nHey Mona,\n\nCurrently I don't have any specific questions, I encounter them on the way and then try to google and see if I can make sense out of it. But to be honest, I could post any single analysis chart here and hear what experienced users can say, maybe start a session where users can help each other?\n\nThanks for the doc, nice to have a written explanation under your hand. Also, maybe [this](https://www.youtube.com/watch?v=wLk_HHCQOzQ) will be useful for somebody. Started out with this video myself, turns out ladybug uses simplified psychometric chart, maybe for good XD\n", "attachments": [], "created_by_name": "Tim", "created_at": "October 28, 2015 at 10:06pm", "created_by": "Timur582", "replies": []}]}], "id": "1385971"}