{"body": "\nHello, forum.\n\n\n\nTrying to update ladybug and honeybee. So, removing old version gives me an error: 1.Solution exception:WindowsError\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/WLDrVkQ1qFVvKh*9M1XTNm8-R5xq2z1vAHzl2kL8wgz1upvec8ZAkB9uLX4pFtdAO-KXp1kM6HQPfIuLFhtgmDMB22tuSXlP/error.PNG?width=540\" width=\"540\"/>](http://api.ning.com:80/files/WLDrVkQ1qFVvKh*9M1XTNm8-R5xq2z1vAHzl2kL8wgz1upvec8ZAkB9uLX4pFtdAO-KXp1kM6HQPfIuLFhtgmDMB22tuSXlP/error.PNG)\n\n\n\nThere is one thing I did when I put a load of LB&amp;HB files the first time in UserObjects folder, I've put them in their own folder for the neatness sake. Could this be the reason? And is it ok if I manually delete the old files and replace them with the new ones?\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/WLDrVkQ1qFWBk66fYZhkihWND3X7MCh9osWYzuEoO3gEodDcvIbQa3KrP507CLp9tJtk2gbV2MWpQdz4mMLrfuQpCT25UT-x/directory.PNG?width=540\" width=\"540\"/>](http://api.ning.com:80/files/WLDrVkQ1qFWBk66fYZhkihWND3X7MCh9osWYzuEoO3gEodDcvIbQa3KrP507CLp9tJtk2gbV2MWpQdz4mMLrfuQpCT25UT-x/directory.PNG)\n\n\n\nP.S. I run Win10\n", "attachments": [], "created_by_name": "Tim", "created_at": "October 27, 2015 at 12:44am", "created_by": "Timur582", "topic": "Remove old version error", "replies": [{"body": "\nTim,\n\nAll components must be at the level of User Objects directory and on their own!!\n\nNormally i do what you are asking: I throw the new version files onto the directory, replacing the existing ones.\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "October 27, 2015 at 4:35am", "created_by": "AbrahamYezioro", "replies": [{"body": "\nThank you Abraham,\n\n\n\nI've replaced the stuff, everything works fine.\n\n\n\nBut I get the point of the component that does this for you, people usually have all the .ghusers from other plugins mixed together, which can be confusing sometimes and whoooops, deleted something else.\n\n\n\nAnyway, just wanted to be 100% sure it is ok and nothing tricky is happening under the hood, thanks.\n", "attachments": [], "created_by_name": "Tim", "created_at": "October 27, 2015 at 5:10am", "created_by": "Timur582", "replies": []}, {"body": "\nHi Tim and Abraham, Removing files manually is fine and that's what the component does. The issue of having them in a sub-directory is mainly with the update component. Update components don't look into sub-directories. There are solutions to make it work for all the cases. If you think it's something that we should consider feel free to add an issue on github.\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "October 27, 2015 at 7:44am", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nHey Mostapha\n\nI've used update ladybug component recently and it worked fine.\n", "attachments": [], "created_by_name": "Tim", "created_at": "October 27, 2015 at 7:48am", "created_by": "Timur582", "replies": []}, {"body": "\nHa! I got lucky then. I should check the code again and see how I'm doing it! ;)\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "October 27, 2015 at 8:20am", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nHey Mostapha,\n\nI was updating .ghusers in the office and noticed that pasting them on top didn't overwrite all the files, this reminded me of the same problem when I used update ladybug component. There are like three or four .ghuser files left after the cleanup.\n\nI would like to know are these ok to remove, because you made new components that integrated them or these are more like completely done and nothing to add so they don't get updates???\n", "attachments": [], "created_by_name": "Tim", "created_at": "October 27, 2015 at 7:44pm", "created_by": "Timur582", "replies": []}, {"body": "\nHi Tim. The way the update component works is first to try to remove the current version, which it assumes is located in root of userobjects directory and then copies the new version. If you have moved them from the root folder then it will generate duplicate userobjects. We can change the code to handle cases like yours but my suggestion for now is to have the userobjects in the root folder until we apply the changes. If you use update component you don't need to use remove old version, since it does it by default.\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "October 28, 2015 at 7:27pm", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nGot it.\n\nPersonally I'm for flexible components that check your subdirectories and serve you tea, but you guys have your own schedule, so won't poke you about it. Everything works fine now, it can be done any time your team has nothing to do. Thank you for response, Mostapha.\n", "attachments": [], "created_by_name": "Tim", "created_at": "October 29, 2015 at 9:28am", "created_by": "Timur582", "replies": []}]}]}