{"body": "\n**Release Notes - November 8th 2015**\n\n**Ladybug 0.0.61 and Honeybee 0.0.58**\n\n \n\nWe are all pleased to announce public release of Ladybug 0.0.61 and Honeybee 0.0.58. Download the new versions from our usual portal at food4Rhino:\n\n[http://www.food4rhino.com/project/ladybug-Honeybee?ufh](http://www.food4rhino.com/project/ladybug-Honeybee?ufh)\n\nBefore addressing the changes in the software itself, we would like to announce the start of two new resources that have been added to help everyone learn and share knowledge across our community.\n\n \n\n**NEW RESOURCES**\n\n**GH Example File Sharing** - After recognizing how important example files are for sharing knowledge and capabilities in our community, we have initiated a github-based platform for sharing Grasshopper definitions called Hydra:<br class=\"kix-line-break\"/>[https://hydrashare.github.io/hydra/index.html<br class=\"kix-line-break\"/>](https://hydrashare.github.io/hydra/index.html)While the database of files is a little over 50 files at the moment, it is hoped that this will become THE forum where much of collective knowledge is exchanged and shared into the future.  As you can see by clicking on any of the examples, you now are able to get a high-res visual of both the Rhino scene and the GH canvas without having to download files to your machine.  Furthermore the search functionality through the database enables you to quickly and easily see all that our community has contributed on certain subjects (just by searching “shade” or “wind” for example).<br class=\"kix-line-break\"/>In addition to other files that have been contributed, you can find all of the original Ladybug examples here:<br class=\"kix-line-break\"/>[https://hydrashare.github.io/hydra/index.html?keywords=LBExampleFiles<br class=\"kix-line-break\"/>](https://hydrashare.github.io/hydra/index.html?keywords=LBExampleFiles)And all of the original Honeybee examples here:<br class=\"kix-line-break\"/>[https://hydrashare.github.io/hydra/index.html?keywords=HBExampleFiles<br class=\"kix-line-break\"/><br class=\"kix-line-break\"/>](https://hydrashare.github.io/hydra/index.html?keywords=HBExampleFiles)\n\n**LB+HB Documentation** - While our historical practice of including all documentation within component descriptions may have sufficed up until this point, we have since recognized that an online database of all this documentation would be helpful.  Now, you can search for key terms throughout the entire documentation of the project in our beautiful online documentation database created by Mostapha:<br class=\"kix-line-break\"/>[https://www.gitbook.com/book/mostapharoudsari/ladybug-primer/details<br class=\"kix-line-break\"/>](https://www.gitbook.com/book/mostapharoudsari/ladybug-primer/details)[https://www.gitbook.com/book/mostapharoudsari/honeybee-primer/details<br class=\"kix-line-break\"/><br class=\"kix-line-break\"/>](https://www.gitbook.com/book/mostapharoudsari/honeybee-primer/details)\n\nAnd now, onto the major changes and enhancements in the software:\n\n \n\n**LADYBUG**\n\n**Photovoltaics Components** - Based on original code from NREL’s PVWatts ([http://pvwatts.nrel.gov](http://pvwatts.nrel.gov/)), Djordje Spasic and [Jason Sensibaugh](http://sensij@yahoo.com) have built a set of 5 components that perform detailed estimate of the electricity generated by Rhino/Grasshopper surfaces when populated with Photovoltaics (PV) modules.<br/>Components allow definition of losses and shading, finding optimal tilt and orientation angles, analysing performance, energy value, consumption and emissions of the PV system.<br class=\"kix-line-break\"/><br class=\"kix-line-break\"/>\n\n**Enhanced Solar Envelope** - [Boris Plotnikov](http://www.grasshopper3d.com/profile/BorisPlotnikov?xg_source=activity) has contributed a solar envelope component that is not only much faster and more stable than the previous component but also allows you to input the geometries of buildings for which you would like to ensure solar access.  This enables customization of the solar envelope to specific urban contexts in a manner that the previous envelope did not.  The component also features a “solar access” option that draws the envelope above which a given site receives sun from a set of sun vectors. An example file can be found here:<br class=\"kix-line-break\"/>[http://hydrashare.github.io/hydra/viewer?owner=boris-p&amp;fork=hydra&amp;id=SolarEnvelope<br class=\"kix-line-break\"/><br class=\"kix-line-break\"/>](http://hydrashare.github.io/hydra/viewer?owner=boris-p&amp;fork=hydra&amp;id=SolarEnvelope)\n\n**Adaptive Comfort Chart** - To assist with understanding the variations of the adaptive comfort model, an Adaptive Comfort Chart component has been added that functions in a similar manner to the psychrometric chart for the PMV model.  In addition to granting a visualization of the adaptive standard itself, the chart is also particularly helpful for displaying the results of energy simulations in relation to the comfort polygon.  The chart is based off of the UC Berkeley Center for the Built Environment’s Comfort Tool ([http://comfort.cbe.berkeley.edu/](http://comfort.cbe.berkeley.edu/)) ([https://github.com/CenterForTheBuiltEnvironment/comfort_tool](https://github.com/CenterForTheBuiltEnvironment/comfort_tool)).  An example file can be found here:<br class=\"kix-line-break\"/>[http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;fork=hydra_2&amp;id=Adaptive_Comfort_Chart<br class=\"kix-line-break\"/><br class=\"kix-line-break\"/>](http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;fork=hydra_2&amp;id=Adaptive_Comfort_Chart)\n\n**Full Support for US + European Thermal Comfort Standards** - Ladybug now supports the ability to model any of the variations of the Adaptive/PMV models for both the US (ASHRAE) and European (ISO) standards.  This includes varying thresholds of percentage of people dissatisfied (PPD), varying thresholds for humidity ratios, the ability to use either a monthly average or daily running mean temperatures in the adaptive model, and even some functions that are not yet a part of these standards but are referenced widely in thermal comfort research.  Such widely referenced functions include the ability to apply the adaptive model’s method to conditioned or mixed-mode buildings as well as the application of the adaptive model to times of the year when it is considered too cold by ASHRAE and the ISO for an adaptive standard.  All of these variations on the standards can be accessed through the new “PMV Comfort Parameters” and “Adaptive Comfort Parameters” components.  As a final nod to dual support for US/European standards, it is now possible to view the psychrometric chart as a Molier i,x diagram.<br class=\"kix-line-break\"/><br class=\"kix-line-break\"/>\n\n**EPWMap** - After years of struggling with the text-based indexing of the DOE’s epw file database, it is now possible to search for weather files using a map interface and search bar thanks to Mostapha’s recent web interface built with D3 and GoogleMaps ([http://mostapharoudsari.github.io/epwmap/](http://mostapharoudsari.github.io/epwmap/)).  From here on out, the Ladybug “Download EPW” component will direct you to this interface.<br class=\"kix-line-break\"/><br class=\"kix-line-break\"/>\n\n**“RunItAll” Released as “Fly”** - In preparation for future features that will assist with exploring of large multidimensional design spaces, this release of Ladybug includes a component by the name of “Fly” that is meant to run through all of the combinations of a given set of sliders.  Those who follow this forum closely might recognize it as a reincarnated version of a component called “RunItAll” that appeared in some older example files. You can find an example file here: [http://hydrashare.github.io/hydra/viewer?owner=mostaphaRoudsari&amp;amp...;](http://hydrashare.github.io/hydra/viewer?owner=mostaphaRoudsari&amp;fork=hydra_1&amp;id=Parametric_Daylight_Analysis)<br class=\"kix-line-break\"/><br class=\"kix-line-break\"/>\n\n**Shade Benefit Evaluator Validated + Published** - After a long process of testing, the key functions within the comfort and energy shade benefit evaluator components have been validated against several similar software and energy modeling tools.  A paper published to the SimAUD conference regarding this validation can be found here: [https://www.dropbox.com/s/tvdj6d2giswurew/SIMAUD_Paper12.pdf?dl=0](https://www.dropbox.com/s/tvdj6d2giswurew/SIMAUD_Paper12.pdf?dl=0).  Special recognition goes to Panagiotis Samaras, who ran many of these intensive tests for his thesis.  Along with this validation, there are a few more variables that have been exposed to allow more freedom of running the shade benefit functions including the use of higher sky resolutions and multiple shade benefit test regions for a given shade. <br class=\"kix-line-break\"/><br class=\"kix-line-break\"/>\n\n**Color Gradient Library** - After realizing that several of us wanted quick access to common color gradients that we frequently plug into the Legend Parameters component, we have now added a component called “Color Gradient Library” to do just this.  An image displaying all of these gradients can be found here:<br class=\"kix-line-break\"/>[https://github.com/mostaphaRoudsari/ladybug/blob/master/resources/gradients.jpg<br class=\"kix-line-break\"/>](https://github.com/mostaphaRoudsari/ladybug/blob/master/resources/gradients.jpg)And an example file showing how to use the library can be found here:<br class=\"kix-line-break\"/>[http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;fork=hydra_2&amp;id=Color_Library<br class=\"kix-line-break\"/>](http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;fork=hydra_2&amp;id=Color_Library)If you feel that there is a common gradient that is currently missing, feel free to start a discussion on our GH group about it and we should include it soon.<br class=\"kix-line-break\"/><br class=\"kix-line-break\"/>\n\n**Solar Time Available** - The Ladybug Sunpath now includes an option to display solar time, which many have found to be more intuitive and easy to work with when designing with solar geometry.  Solar time is also useful for minimizing an east vs west bias that can develop in sunlight hour studies without having to generate sun vectors at very small timesteps.<br class=\"kix-line-break\"/><br class=\"kix-line-break\"/>\n\n**Monthly/Daily Totals for Hourly Data** - The Ladybug “Average Data” component now includes the ability to total the values for months and days (as opposed to timply averaging them).  This is useful particularly when you want to get monthly or daily values of total energy or visualize these totals on the monthly bar chart.<br class=\"kix-line-break\"/><br class=\"kix-line-break\"/>\n\n**Increased IP Functionality** - This release of Ladybug includes several more features that assist with converting data for an IP audience including the ability to view an IP Psychrometric or Adaptive Chart by plugging in temperature values in Farenheit as well as a number of and new converter components for the following: Wh to BTU, R-Value SI to R-Value IP, m/s to mph, Liters to Gallons.  Note that Honeybee is still largely SI (requiring your Rhino model to be in meters to run energy simulations).<br class=\"kix-line-break\"/><br class=\"kix-line-break\"/>\n\n**Mesh-to-Hatch and Future BakeIt Plans** - Given that the current BakeIt_ option has only been implemented on a few components with relatively minimal use, it has been decided that future implementations of BakeIt_ will provide not just a means of recording parametric results in the Rhino scene but will also support a full pathway to vector-based programs (like Illustrator and Inkscape).  As such, BakeIt_ will place text in the Rhino scene as actual editable text (not meshes) and colored meshes will be output as groups of colored hatches (so that they appear as color-filled polygons in vector-based programs).  In order to give those interested in this future capability a chance to experiment at the present, a “Mesh-To-Hatch” component has been added to the Extra tab.\n\n<br/> <br/>\n\n**HONEYBEE**\n\n**Fully Functional Microclimate Maps** - Finally, after a long and arduous thesis followed by a couple of months of bug-fixing, Chris Mackey is pleased to announce that the ability to produce high resolution temperature maps from EnergyPlus results is complete.  Together, these maps account for four key variables that produce microclimatic diversity in and around buildings - MRT variation from different surface temperatures, solar radiation shining directly on occupants, average air temperature diversity, and air temperature stratification.  In addition to using these 4 variables to produce high-resolution visuals of temperature, it is also possible to produce maps of thermal comfort by using any of the three primary thermal comfort models in Ladybug (PMV, Adaptive, and Outdoor (UTCI)).  Support currently exists to produce maps for both indoor and outdoor conditions and, while the temperature values and indoor comfort values currently produced are highly accurate, the outdoor wind speeds are calculated using the simplified assumptions of EnergyPlus and will be revised to enable more accurate accounting for the effects of wind on outdoor comfort in the next stable release. The whole workflow is broken down into eight components that can all be found under the 9 | Energy Energy tab. For some videos showing some time-lapse thermal renderings made from these tools see this video playlist:<br class=\"kix-line-break\"/>[https://www.youtube.com/playlist?list=PLruLh1AdY-Sj3ehUTSfKa1IHPSiuJU52A<br class=\"kix-line-break\"/>](https://www.youtube.com/playlist?list=PLruLh1AdY-Sj3ehUTSfKa1IHPSiuJU52A)For the full 150-page documentation of the tools produced for Chris’s thesis, see this link:<br class=\"kix-line-break\"/>[https://www.dropbox.com/s/k4r4rd279y4td9n/Mackey_Thesis.pdf?dl=0<br class=\"kix-line-break\"/>](https://www.dropbox.com/s/k4r4rd279y4td9n/Mackey_Thesis.pdf?dl=0)Finally, if you want to dive in and produce some comfort maps for yourself, you can find an example file here for indoor maps:<br class=\"kix-line-break\"/>[http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;fork=hydra_2&amp;id=Indoor_Microclimate_Map<br class=\"kix-line-break\"/>](http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;fork=hydra_2&amp;id=Indoor_Microclimate_Map)And an example file here for outdoor maps:<br class=\"kix-line-break\"/>[http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;fork=hydra_2&amp;id=Outdoor_Microclimate_Map<br class=\"kix-line-break\"/><br class=\"kix-line-break\"/>](http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;fork=hydra_2&amp;id=Outdoor_Microclimate_Map)\n\n**Thermal Autonomy / Thermal Comfort Percent** - In addition to the new thermal mapping capabilities, this release includes the ability to use these maps to calculate a series of spatial thermal comfort metrics that are meant to mirror the metrics currently used to evaluate daylight (daylight autonomy, UDI, etc.).  Specifically, these metrics are the following:<br class=\"kix-line-break\"/>Thermal Comfort Percent - The percentage of occupied time that a given point in space is thermally comfortable.<br class=\"kix-line-break\"/>Thermal Autonomy - The percentage of occupied time that a given point in space is thermally comfortable without the addition of any heating or cooling energy.<br class=\"kix-line-break\"/>Overheated Hours - The percentage of occupied time when a given point is space is too hot to be thermally comfortable.<br class=\"kix-line-break\"/>Underheated Hours - The percentage of occupied time when a given point is space is too cold to be thermally comfortable.<br class=\"kix-line-break\"/>All of these metrics can be accessed through the “Thermal Autonomy Analysis” component and you can find an example file here:<br class=\"kix-line-break\"/>[http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;fork=hydra_2&amp;id=Comfort_Autonomy<br class=\"kix-line-break\"/><br class=\"kix-line-break\"/>](http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;fork=hydra_2&amp;id=Comfort_Autonomy)\n\n**Energy Balance Visualizations** - In order to help understand the flow of energy through Honeybee energy models, it is now possible to completely reconstruct the energy balance calculation of EnergyPlus from the energy simulation results.  This is facilitated by the new EnergyPlus “Construct Energy Balance” component and some new features added to the monthly bar chart.  See here for an example:<br class=\"kix-line-break\"/>[http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;fork=hydra_2&amp;id=Energy_Balance<br class=\"kix-line-break\"/><br class=\"kix-line-break\"/>](http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;fork=hydra_2&amp;id=Energy_Balance)\n\n**More Geometry Control for Glazing** - In order to make it faster to assign several different types of glazing geometries to your energy models, the “AddHBGlz” can now be used to add glazing surfaces to HBzones (not just HBsurfaces).  Furthermore, the “Glazing Based on Ratio” component now contains several more inputs that enable you to customize window geometry on orthogonal surfaces, including the ability to set the horizontal distance between windows and the ability to split windows vertically into a lower view window and higher daylight window.<br class=\"kix-line-break\"/><br class=\"kix-line-break\"/>\n\n**Earth Tube Capability** - Thanks to the efforts of Anton Szilasi, it is now possible to assign earth tubes to your energy models in order to test the potential of this powerful passive strategy.  See here for an example file:<br class=\"kix-line-break\"/>[http://hydrashare.github.io/hydra/viewer?owner=antonszilasi&amp;fork=hydra&amp;id=HB_EarthTube<br class=\"kix-line-break\"/><br class=\"kix-line-break\"/>](http://hydrashare.github.io/hydra/viewer?owner=antonszilasi&amp;fork=hydra&amp;id=HB_EarthTube)\n\n**North Input For Annual Daylight** - After the toil of having to rotate your model any time you wanted to run an annual daylight analysis, we are happy to announce that the annual daylight recipe now contains a working “North” input.<br class=\"kix-line-break\"/><br class=\"kix-line-break\"/>\n\n**Honeybee Object Transforms** - After realizing that many of us wanted to construct energy models of multi-story buildings by duplicating and moving zones, this capability is now easily facilitated with a set of three components to duplicate and transform your HBObjects.  Specifically, this includes a component to move (translate) your HBObject, mirror (reflect) your HBObject, and rotate your HBObject.  Using these components ensures that any properties that you have assigned to your original HBObject will be present in the transformed HBOjbect, allowing you to build large energy models very quickly. The three components can currently be found under the WIP tab.\n\n \n\nAnd finally, it is with great pleasure that we welcome [Boris Plotnikov](http://www.grasshopper3d.com/profile/BorisPlotnikov?xg_source=activity) to the team. As mentioned in the above release notes, Boris has added a highly advanced solar envelope component to the project.\n\n \n\nAs always let us know your comments and suggestions.\n\n \n\nEnjoy!\n\nLadybug+Honeybee development team\n\n \n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "November 9, 2015 at 2:12am", "created_by": "ChrisMackey", "topic": "Release Notes - November 9th 2015 - Ladybug 0.0.61 and Honeybee 0.0.58", "replies": [{"body": "\nCongratulations, Ladybug+Honeybee development team!\n\n\n\nThank you very much for your amazing work and contributions!\n", "attachments": [], "created_by_name": "Grasshope", "created_at": "November 9, 2015 at 10:41pm", "created_by": "Grasshope", "replies": []}, {"body": "\nCongrats for the work!!\n", "attachments": [], "created_by_name": "Francesco De Luca", "created_at": "November 10, 2015 at 6:42am", "created_by": "FrancescoDeLuca", "replies": []}, {"body": "\nThis is all amazing Thank you for the hard work\n", "attachments": [], "created_by_name": "amedeo scofone", "created_at": "November 10, 2015 at 7:55am", "created_by": "amedeoscofone", "replies": []}, {"body": "\nGreat stuff!!\n", "attachments": [], "created_by_name": "Samuel de Vries", "created_at": "November 21, 2015 at 7:11am", "created_by": "SamueldeVries", "replies": []}, {"body": "\nGreat work!\n", "attachments": [], "created_by_name": "Tom", "created_at": "December 11, 2015 at 7:07am", "created_by": "Tom659", "replies": []}], "id": "1396611"}