{"body": "\nHi \n\nThank you for your great program. I was wondering how to calculate the ASE with honeybee. I can get the grid based percentage of time over 1000 lux over the year but this is not exactly what ASE is, do you have any suggestions how it can be calculated using the honeybee components?\n", "attachments": [], "created_by_name": "Mahsa Zomorodian", "created_at": "November 13, 2015 at 1:23pm", "created_by": "MahsaZomorodian", "topic": "ASE CALCULATION", "replies": [{"body": "", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "November 13, 2015 at 4:48pm", "created_by": "ChrisMackey", "replies": [{"body": "", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "November 13, 2015 at 4:50pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nthank you for your relpy, Sda and ASE are the metrics implemented in LEED v4. There is a document on this\n\n[http://solemma.net/DIVADay/2014/11%20-%20DIVA%20Day%202014%20-%20LE...](http://solemma.net/DIVADay/2014/11%20-%20DIVA%20Day%202014%20-%20LEEDv4%20Panel%20Discussion.pdf)\n\n [https://www.ies.org/store/product/approved-method-ies-spatial-dayli...](https://www.ies.org/store/product/approved-method-ies-spatial-daylight-autonomy-sda-and-annual-sunlight-exposure-ase-1287.cfm)\n\nActually I tried to calculate it with the mentioned component but the problem is that it gives the percentage of time each node which is above 1000 lux but this is not ASE. I have to export the data into an excel sheet and calculate it manually. Mostapha had a post in previous discussions stating that**\" ****aSE calculation is a little bit tricky. I did partially implemented the calculation in the code but never exposed it as an output. I will try to post a discussion about the reasons behind this.\"** I was wondering if he can explain more about this issue.\n\nMahsa\n", "attachments": [], "created_by_name": "Mahsa Zomorodian", "created_at": "November 13, 2015 at 5:16pm", "created_by": "MahsaZomorodian", "replies": []}, {"body": "\nYou have it all covered. One more limitation of Daysim is to model dynamic shadings for multiple windows. This is a very important limitation when it comes to calculating ASE accurately. The only accurate solution that I'm aware of for calculating ASE is Radiance's 3-Phase method. Also be careful about using annual DGP calculation with Daysim ([https://github.com/mostaphaRoudsari/Honeybee/issues/243](https://github.com/mostaphaRoudsari/Honeybee/issues/243)). In case you're using annual glare analysis make sure to double check the results by point in time glare analysis.\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "November 15, 2015 at 8:08am", "created_by": "MostaphaSadeghipour", "replies": []}]}, {"body": "\nASE, as described in IES  LM 83-12, is supposed to be calculated considering direct sun contribution only. Which roughly translates to an -ab 0 (ie 0 bounce) calculation in Radiance/Daysim. It is assumed that a 1000 lux measurement for a particular hour on a workplane grid point will indicate a illuminance from direct sun at that point. If I remember correctly, these simulations are to be run without the presence of any shading devices.\n\n\n\nFrom an ASE calculation perspective, there are several shortcomings within Daysim (as it exists right now). The daylight coefficient method, which Daysim employs, calculates illuminance by dividing the sky into discrete patches. ([http://naturalfrequency.com/wiki/sky-subdivision](http://naturalfrequency.com/wiki/sky-subdivision)) For a clear sky with sun, the luminance from sun is accounted for by approximating the position of sun into 3 (as far as I know) patches. That in turn leads to an incorrect estimation of both position and luminance contribution of the sun.\n\n\n\nAnyways, as I wrote in the begining, in my opinion the closest you'd get to calculating ASE from daysim right now would be running an annual daylighting calculation with Honeybee by setting ambient bounces as zero. A better approach, in case you are not trying to comply with something like leed v4, would be to do a DGP analysis as Chris mentioned in his post.\n\n\n\n\n\n\n\n\n\n\n", "attachments": [], "created_by_name": "Sarith Subramaniam", "created_at": "November 14, 2015 at 1:27am", "created_by": "sarith", "replies": [{"body": "\nThank you  very much Sarith for your useful comment. I think the best would be to change the metric to DGP. \n", "attachments": [], "created_by_name": "Mahsa Zomorodian", "created_at": "November 14, 2015 at 7:51pm", "created_by": "MahsaZomorodian", "replies": []}, {"body": "\nThanks for the clarification on the metric, Sarith, and for the link to Alstan's presentation, Mahsa.  The inclusion of 1000 lux in the definition of this metric seems incredibly confusing and distracting if its purpose is only meant to be a measure of direct beam sun.  Still, given the history that LEED seems to have with selecting problematic daylight metrics that it later needs to revise (slide 2 of Alstan's presentation), I guess I should not be so surprised at these issues are arising.\n\n\n\nI see that, in Alstan's presentation, he seems to be using Daysim to calculate ASE and, Sarith, you are right to bring up this issue that Daysim distributes the direct beam sun between 3-4 sky patches like so:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/j52o*TELl6H*R3Oh87E6UnZjgHUORCVQ3-MQKsku0hOXQWG9i*02FbKpw2SN0PZnbrvIc0jo1UbKV5ZekO9FdZILAr9Oesoc/DasimSky.JPG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/j52o*TELl6H*R3Oh87E6UnZjgHUORCVQ3-MQKsku0hOXQWG9i*02FbKpw2SN0PZnbrvIc0jo1UbKV5ZekO9FdZILAr9Oesoc/DasimSky.JPG)\n\nMostapha should contribute when he gets the chance but I might imagine Daysim's poor accounting for the position of the sun in the sky might be his grounds for not exposing it on his component.  This said, I know that Alstan is a smart man and a daylight expert who I highly respect so I would have liked to have heard his thoughts on this process in his presentation.\n\n\n\nIn any case, for a more accurate means of observing where the sun is in the sky than Daysim's method, you can use the Ladybug sunpath component and the corresponding sun vectors.  So, if you want a means of calculating the percentage of the floor in direct beam sun over the year, you should use the sunlight hours component with the sun path and, if you want to exclude sun when it is very cloudy or low in the sky, you can use a conditional statement on the sun path to remove sun vectors when the outdoor global horizontal illuminance is below a certain threshold.  For LEED, I guess that this threshold is 1000 lux multiplied by whatever the transmittance of your windows is but I would rather set it at 4000 lux since, as I said at the top of this post, I don't know how IES or LEED arrived at this number and I at least know that 4000 lux is what the experts have agreed the upper limit of Useful Daylight Illuminance (UDI) should be.  This workflow with the sunPath is similar to what I do in my office to account for glare, although I also add in an extra step to account for the fact that the hourly EPW data can add in an East-West bias (since illuminance values are recorded at the end of each hour as opposed to the start). I also put the results in terms of \"hours of a typical 24-hour day\" since it seems many people have a hard time understanding \"hours of the year\" intuitively.  Finally, I use these sunlight hours to make a temporal map showing when the glare is likely to occur.  I have found a good correlation between the presence of direct beam sun shining on the floor in these studies (even in small amounts) and Daylight Glare Probability (DGP) values above 0.4 (perceptible glare) for views looking towards the window or towards the floor by the window.\n\n\n\nHere is an example file showing you how to do this calculation with the sunpath for yourself:\n\n[http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;for...](http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;fork=hydra_2&amp;id=Estimate_Glare_Potential_Over_a_Year)\n\nAlso, Mahsa, there is usually no need to use excel when you have the data in GH.  GH provides you with native math components that essentially have all of the capabilities of Excel (see the example file above).\n\n\n\nHope this helps,\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "November 14, 2015 at 9:24pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nTo add to Chris's comment about inclusion of ASE in LEED v4 being confusing, that opinion is actually shared by a fair number of daylighting experts.\n\nChristoph Reinhart, whose research contributed to the creation of Daysim and DIVA, wrote an editorial about the daylighting metrics in LEED v4 where he raises similar concerns : [http://lrt.sagepub.com/content/47/4/388.full.pdf+html](http://lrt.sagepub.com/content/47/4/388.full.pdf+html)\n\nDr. Reinhart, incidentally, is Alstan's dissertation advisor.\n\n\n", "attachments": [], "created_by_name": "Sarith Subramaniam", "created_at": "November 14, 2015 at 10:05pm", "created_by": "sarith", "replies": []}, {"body": "\nthank you Sarith for letting me know about Dr. Reinhart's technical note, it answers a lot of my questions regarding the validity of this metric.\n", "attachments": [], "created_by_name": "Mahsa Zomorodian", "created_at": "November 15, 2015 at 7:21pm", "created_by": "MahsaZomorodian", "replies": []}, {"body": "\nthank you Chris and Mostapha for your  detailed  explanations and clarifications for the metric and how to calculate it. Thank you for your time and consideration it means a lot and   was is a big help in my research. \n\nI couldn't find a component to count values in GH but know this issue is solved. once again thank you for your great program and support \n\nBests\n\nMahsa\n", "attachments": [], "created_by_name": "Mahsa Zomorodian", "created_at": "November 15, 2015 at 7:37pm", "created_by": "MahsaZomorodian", "replies": []}, {"body": "\nAlso I found some useful information (Question and Answers) regarding this metric and it calculation on [http://daylightmetrics.blogspot.com/](http://daylightmetrics.blogspot.com/)\n\n\n", "attachments": [], "created_by_name": "Mahsa Zomorodian", "created_at": "November 15, 2015 at 9:10pm", "created_by": "MahsaZomorodian", "replies": []}, {"body": "\nHi Mahsa, \n\n\n\nBy using the current GH workflow, do you come across any successful case in which both sDA300lx,50% and ASE1000lx,250h below 10% can be fulfilled and LEED v4 credit could be achieved? Out of my curiosity, I desperately like to see a building which can fulfill LEED v4 requirement by balancing sDA and ASE successfully.\n\nRegards, \n\nCheney \n\n   \n", "attachments": [], "created_by_name": "Cheney", "created_at": "April 29, 2016 at 1:04pm", "created_by": "Cheney", "replies": []}]}], "id": "1400028"}