{"body": "\nHi Guys,\n\n\n\nI am exploring the possibilities of natural ventilation in honeybee and since i am new with the program i am not familiar with. I have watch some dicussions and video tutotial but i would like to know more about the possibilities when integrating natural ventilation in a daylight and energy analysis.\n", "attachments": [], "created_by_name": "Eduardo Artigas", "created_at": "November 23, 2015 at 8:20am", "created_by": "EduardoArtigas", "topic": "Integrating natural ventilation in daylight and energy analysis", "replies": [{"body": "\nEduardo,\n\nNatural ventilation should not have a significant effect on your daylight simulations but you can find an example for how to integrate it into your Energy simulations here:\n\n[http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;for...](http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;fork=hydra_2&amp;id=Natural_Ventilation)\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "November 23, 2015 at 8:27am", "created_by": "ChrisMackey", "replies": [{"body": "\nHi Chris,\n\n\n\nThanks for the information. I know that daylight and natural ventilation dont have a significant influence between them but i am trying to create a flowwork where all the important parameters for an energy analysis are integrated.Do you know where i could find an explanation about the physics behind the natural ventilation parameters?\n", "attachments": [], "created_by_name": "Eduardo Artigas", "created_at": "November 24, 2015 at 1:37am", "created_by": "EduardoArtigas", "replies": []}, {"body": "\nEduardo,\n\nGood question.  The EnergyPlus Reference section on the natural ventilation objects that the component is using is a good place to start and will go through the formulas that are calculating the air flow:\n\n[http://bigladdersoftware.com/epx/docs/8-0/input-output-reference/pa...](http://bigladdersoftware.com/epx/docs/8-0/input-output-reference/page-018.html#zoneventilationwindandstackopenarea)\n\nThis said, while the reference explains the formulas, you might want something a little more in-depth to understand all of the physics.  I know that this book covers both the formulas and the physics:\n\n[https://books.google.com/books/about/Ventilation_of_Buildings.html?...](https://books.google.com/books/about/Ventilation_of_Buildings.html?id=Nq5XYFQRFD4C&amp;hl=en)\n\nFeel free to post any specific questions about the formulas here if things are unclear form these two resources.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "November 24, 2015 at 9:03am", "created_by": "ChrisMackey", "replies": []}]}]}