{"body": "\nHi! I'm having problems running the daylight analysis after the recent update. The recipe is for daylight factor.\n\n\n\nThe error I'm getting is \"Solution exception:index out of range: 0\" in the runDaylightAnalysis component. I've appended an image of the error message.\n\n\n\nI've reinstalled everything and also ran the update component. The honeybee component seems to be updating to a new date (nov_24_2015) but the other components stay at (nov_07_2015). They are all the same version 0.0.58.\n\n\n\nAnyone have any idea what might be the problem?\n\n\n\nThank you in advance.\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1409790", "name": "error 1.png"}], "created_by_name": "Carl Molander", "created_at": "November 26, 2015 at 1:24am", "created_by": "CarlMolander", "topic": "Problem running daylight analysis", "replies": [{"body": "\nHi Carl, This issue can have different reason. I wonder if this is similar to the other post yesterday that the component doesn't wait for the analysis to be over so when it checks for the results there is nothing to collect and it gives an error. Can you confirm that it will give you similar error on a different type of analysis (e.g. gridBased)? Also which version of Windows are you using?\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "November 26, 2015 at 5:52am", "created_by": "MostaphaSadeghipour", "replies": [{"body": "\nHi again!\n\n\n\nIt's a bit embarrassing but I think I found my problem. I think at first I had different versions of components in the same model when the update function only updated some components. Then in my search for the error i reinstalled all programs and accidently missed to install radiance under C:\\. I noticed it now when I tried to do the gridbased analysis when it complained about not finding anything in the C:\\Radiance\\ folder.\n\n\n\nMy bad :( Thanks alot though for taking the time to answer my question and also a big thank you for your work!\n", "attachments": [], "created_by_name": "Carl Molander", "created_at": "November 26, 2015 at 6:38am", "created_by": "CarlMolander", "replies": []}]}]}