{"body": "\nHi every one;<br/>I want to know about the differences between ladybug&amp;honeybee and archsim but I didn’t any thing In my search…does anyone know about it?\n", "attachments": [], "created_by_name": "Davood", "created_at": "November 25, 2015 at 2:12pm", "created_by": "Davood", "topic": "“ladybug and honeybee” and “archsim” difference", "replies": [{"body": "\nDavood,\n\n\n\nA point of clarification: Archsim and Honeybee are both interfaces for EnergyPlus and so it is possible to make a comparison but Ladybug is a set of components for analyzing and visualizing weather data so it cannot be easily compared to Archsim. My account of the differences between Honeybee and Archsim will be far from complete but here are the key ones that I am aware of:\n\n\n\n1) This difference is a bit of a superficial one but points to a deeper thinking about how the software should be used.  Honeybee has many more components than Archsim, which means that Honeybee has a steeper learning curve than Archsim and will take longer to master.  Along with this, you may also encounter a general mentality in the Honeybee community that \"you should not be running a certain type of simulation unless you know how it works\" whereas I know that Archsim is a bit more amenable to making things fast and easy to set up even when you are not sure what is going on under the hood.  However, as a result of the large number of components in Honeybee, it is more open-ended, customizable, and includes more freedom in terms of cases that you can run and the parameters of the energy simulation that you can change than Archsim. You will also notice that, while there is a general ethos in the Honeybee community that you should not be running certain simulations unless you know what you are doing, we try to provide you with many resources to educate yourself if you are motivated. For example, we have long component descriptions that we assemble into documentation books like this ([https://www.gitbook.com/book/mostapharoudsari/honeybee-primer/details](https://www.gitbook.com/book/mostapharoudsari/honeybee-primer/details)), hours of video tutorial playlist like this one ([https://www.youtube.com/playlist?list=PLruLh1AdY-SgW4uDtNSMLeiUmA8Y...](https://www.youtube.com/playlist?list=PLruLh1AdY-SgW4uDtNSMLeiUmA8YXEHT_)), and many GH example files on a github-based file sharing system ([https://hydrashare.github.io/hydra/index.html](https://hydrashare.github.io/hydra/index.html)).  Not to mention a community of people who would respond to discussions like this one.\n\n\n\n2) Archsim as a standalone application will soon be no more and will be instead distributed with the DIVA daylight analysis tool ([http://diva4rhino.com/](http://diva4rhino.com/)).  While I am unclear on the exact trajectory of DIVA, it currently has a price tag attached to it and so I would assume that the future of Archsim will also carry this price tag.  On the other hand, Honeybee and any derivative software will forever be free and open source under the GPL licence ([https://github.com/mostaphaRoudsari/Honeybee/blob/master/License_Ho...](https://github.com/mostaphaRoudsari/Honeybee/blob/master/License_Honeybee_GPL.txt)).\n\n\n\n3) This third point is a bit of a reiteration of the last one but Honeybee is open source, meaning that, if you need a feature of EnergyPlus that is not yet implemented on either interface, you can usually add it in yourself with a few lines of python code in Honeybee.  This type of workflow is not possible with Archsim since it is closed source and requires you to use EnergyPlus's text editor interface after Archsim has exported an IDF in order to implement any additional EnerygPlus features.\n\n\n\n4) The libraries and templates for Honeybee come from OpenStudio - the open source interface for EnergyPlus ([https://www.openstudio.net/](https://www.openstudio.net/)), which is supported by the US Department of Energy (just like EnergyPlus).  Since Honeybee is open source, it is able to make use of the large database of building type schedules/loads and constructions that have been assembled by the OpenStudio team over the last several years as well as OpenStudio's SDK.  I can also say that almost all of the development efforts of the Honeybee team are now focused now on integrating efforts with OpenStudio, including an exporter from Honeybee to OpenStudio that should be fully functional for the next stable release.  I am not certain of the current extent of Archsim's libraries but, last I had checked, the creator was pulling them from his own experience and, as such, only had a few libraries to choose from.  For all of my knowledge, through, this may be changing with the integration of Archsim with DIVA.\n\n\n\nLet me know if this is helpful and, if anyone has more up-to-date knowledge on Archsim than I, please post there.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "November 28, 2015 at 12:26pm", "created_by": "ChrisMackey", "replies": [{"body": "\nthanks for your complete comparision, that's very helpful...   :)\n", "attachments": [], "created_by_name": "Davood", "created_at": "December 5, 2015 at 11:36am", "created_by": "Davood", "replies": []}]}]}