{"body": "\nHello everyone,\n\n\n\nI'm pretty new to Grasshopper and Honeybee and I'm trying to run a daylight/energy analysis for custom shading. I want to calculate heat gain with the E+ analysis putting my shading in as context shading.\n\n\n\nThe analysis runs fine without the shading, but as soon as I connect the context shading component it fails. I've tried using some other breps as shading just to check if the problem is my shading geometry (is it possible that it's just too complicated?), however, so far, the only thing that worked was a plain cube.\n\nIf I aditionally connect a transparency schedule, even that fails. Depending on what I tried, I got all different kinds of warnings, so I don't really know what to do anymore.\n\n\n\nI've attached the file with the analysis. Hopefully somebody here can help me out.\n\n\n\nThanks in advance\n\n\n\n\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1410046", "name": "Analyse Alu ohne Versatz eplus.gh"}], "created_by_name": "S221B", "created_at": "November 26, 2015 at 4:06am", "created_by": "S221B", "topic": "Problems with Honeybee E+ context shading component", "replies": [{"body": "\nP.S.\n\nthe shading will only be created correctly with the right Rhino-template, that is \"Meters for small objects\"\n", "attachments": [], "created_by_name": "S221B", "created_at": "November 26, 2015 at 4:08am", "created_by": "S221B", "replies": []}, {"body": "\nNo ideas?\n", "attachments": [], "created_by_name": "S221B", "created_at": "November 30, 2015 at 1:17am", "created_by": "S221B", "replies": []}, {"body": "\nHi there,\n\n\n\nSorry about no one getting back to you about this. I'm having a look now and I'll see what I can find.\n", "attachments": [], "created_by_name": "Anton Szilasi", "created_at": "November 30, 2015 at 9:46am", "created_by": "AntonSzilasi", "replies": [{"body": "\nIt works fine for me on my system except for the fact that when I connect the HBcontext surfaces to the simulation it runs extremely slowly but that is to be expected when you have 5100 surfaces. What warnings are you getting exactly? Can you post pictures of the warnings that you are getting and the components that you are getting them from.\n", "attachments": [], "created_by_name": "Anton Szilasi", "created_at": "November 30, 2015 at 10:18am", "created_by": "AntonSzilasi", "replies": []}, {"body": "\nHi there,\n\nthanks for taking a look.\n\nI used to get different error messages, one of them about the transparency schedule not being found, even though it was saved in the right folder. I don't remeber what the other messages were about. At the moment, if  I connect HB_context the simulation runs without producing an error message, however the Read_results components tell me \"1. The result file does not exist.\". I checked the folder they shoul be in and they really don't exist, which is no surprise, because the simulation runs suspiciously fast (2 minutes or so).\n\nI've also made up a new file with a somewhat simplified geometry and been playing around with the meshingSettings from the HBContext component as well es with the maximumFigure from the ShadowPar (at this point in my simulations I'm satisfied  with relatively low-quality results). That one works fine, still takes a lot of time, sadly, but I guess there's just no way to get a really fast calculation for this kind of shading?\n", "attachments": [], "created_by_name": "S221B", "created_at": "December 1, 2015 at 6:04am", "created_by": "S221B", "replies": []}, {"body": "\nWith this kind of shading no there really isnt a way to do it quicker.\n", "attachments": [], "created_by_name": "Anton Szilasi", "created_at": "December 1, 2015 at 7:05am", "created_by": "AntonSzilasi", "replies": []}, {"body": "\nall right, thanks for taking the time to answer my questions!\n", "attachments": [], "created_by_name": "S221B", "created_at": "December 2, 2015 at 1:35am", "created_by": "S221B", "replies": []}]}], "id": "1410047"}