{"body": "\nHi,\n\n\n\nI have encountered an error using Hoenybee Export to OpenStudio component as:\n\n\n\n\"Runtime error (MissingMemberException): 'EPZone' object has no attribute 'recirculatedAirPerArea'<br/>Traceback:<br/>  line 2901, in main, \"&lt;string&gt;\"<br/>  line 2989, in script\"\n\n\n\nThe error rises when I run the component to write an OS file. I would appreciate if you could help me about the cause of the error and how I could find a solution for it.\n\nPlease find attached a snapshot of the component with the error warning.\n\n\n\n[<img class=\"align-left\" src=\"http://api.ning.com:80/files/FAP00mbKucgWMDRBHpTxA6VzT8iwiD5MODxtkh-7RBhXTe2DxbgVCsL0-fuQpfzYwvX6CRqZZhf2TEgH*DQk2dvnAw1MSCl5/OSError.PNG?width=750\" width=\"750\"/>](http://api.ning.com:80/files/FAP00mbKucgWMDRBHpTxA6VzT8iwiD5MODxtkh-7RBhXTe2DxbgVCsL0-fuQpfzYwvX6CRqZZhf2TEgH*DQk2dvnAw1MSCl5/OSError.PNG)\n\n\n\nThank you,\n\nAlireza\n", "attachments": [], "created_by_name": "Alireza", "created_at": "November 28, 2015 at 8:57pm", "created_by": "Alireza", "topic": "Honeybee Export to OpenStudio", "replies": [{"body": "\nHi Alireza, What is the version of Honeybee_honeybee that you're using in your file. If you use an older version of Honeybee EPZones didn't have recirculatedAirPerArea property. Updating should solve this issue.\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "November 29, 2015 at 6:55am", "created_by": "MostaphaSadeghipour", "replies": [{"body": "\nHi Mostapha,\n\n\n\nThank you for your response.\n\nI have in fact used a previous version of Honeybee (VER 0.0.57 Jul_15_2015) to setup all the scene and simulation settings in my project. Therefore, as you have pointed out, if the older version of Honeybee EPZone does not have the recirculatedAirPerArea proprety, then it must be the cause of the error as I am using the Honeybee_Export to OpenStudio component (VER 0.0.58 Nov_07_2015). Given the discrepancy between the version of the Honeybee components used to setup everything in the file all the way prior to the point feeding the zones' data into the Export to Open Studio component, I can see different options/questions to tackle this issue:\n\n\n\n1- I have the OpenStudio 1.9.0 that works with EnergyPlusV8-3-0 installed on my computer and the reason that I had to use the newer version of the Honeybee_Export to OpenStudio component (VER 0.0.58 Nov_07_2015) is that I had initially received an error message using the component of the same version as consistent with the rest of the project (VER 0.0.57 Jul_15_2015) with the following content:\n\n\"Cannot find OpenStudio libraries. You can download the libraries from the link below. Unzip the file and copy it to C:\\Users\\Alireza\\AppData\\Roaming\\Ladybug\\OpenStudio and try again. Click on the link to copy the address.<br/><br/>[https://app.box.com/s/y2sx16k98g1lfd3r47zi](https://app.box.com/s/y2sx16k98g1lfd3r47zi)\"\n\n\n\nThe download link provided in the error message appears to be not active and thereby, I could not follow the instructions on the error message and make the Hoenybee_Export to OpenStudio component (VER 0.0.57 Jul_15_2015) work.\n\n\n\n**Therefore, if there is a way to make this version (VER 0.0.57 Jul_15_2015) of the Hoenybee_Export to OpenStudio component work by downloading the OpenStudio libraries or switching to a legacy version of the OpenStudio application prior to 1-9-0, then probably this would be one option to solve this issue.**\n\n\n\n2- When I realized I could not download the OpenStudio libraries as described in section 1 (see above) and make the Honeybee_Export to OpenStudio Component (VER 0.0.57 Jul_15_2015) work with the installed OpenStudio application (V1-9-0), I updated the entire installation of Ladybug + Honeybee User Object files to the new version (Ladybug_0_0_61 and Honeybee_0_0_58). This time the Honeybee_Export to OpenStudio component (VER 0.0.58 Nov_07_2015) seemed to be working with the installed OpenStudio application (V1-9-0) as I did not receive any error messages about missing OS libraries. However, I could not make things work since all other components in my project (eg. Creat HB Zones,Creat HB Surface) have been setup with the 0.0.57 version and obviously, the updated version of the Honeybee User Objects (V0.0.58) could not recognize my HB component of the previous version in the file.\n\n\n\n**If there is a way to make 'in-place' updates of HB components, for example updating the Honeybee_Create HB Zones in the file without having to re-wire everything from scratch, then it probably would work as the updated version will  include the 'recirculatedAirPerArea' property. Otherwise, given the complexity of the scene, it appears to be impossible for me to start everything from scratch and setup the entire scene with the new version of HB components.**\n\n\n\n3- If none of the options in the last two sections (see above) would be possible, **I was wondering if there is a way to open the zones' data as the outcome of the Honeybee_Solve Adjacency component (prior to feeding this data to the Honeybee_Open Studio Systems component and subsequently, to the the Hoenybee_Export to Open Studio) in a text-editor and manually add the missing recirculatedAirPerArea property to the zones' data; then probably I could do that and then eventually feed it to the Hoenybee_Export to Open Studio component.**\n\nThese are the three options that I could think of in order to tackle this issue of mine. I apologize for the extended reply but I figured it would be better to give a more comprehensive description of my problem and previous attempts to solve it.\n\nAny helps is most appreciated.\n\nPlease let me know if you need further information about the described issues in each section or the simulation scene setup in general.\n\n\n\nThank you,\n\nAlireza\n\n\n\n\n\n\n", "attachments": [], "created_by_name": "Alireza", "created_at": "November 29, 2015 at 4:14pm", "created_by": "Alireza", "replies": []}, {"body": "\nHi Alireza,\n\nThere is a component that updates the components in place. Check this [Hydra](http://hydrashare.github.io/hydra/viewer?owner=mostaphaRoudsari&amp;fork=hydra_1&amp;id=Update_Ladybug_and_Honeybee). You need to copy update components into your file and set updateThisFile to True. You still need to replace some of the components manually since there have been changes in number of inputs or input names. Do you know about ctrl+shift and click that let's you re-connect multiple wires from a component to another? It shouldn't be hard to re-wire a couple of components if you use ctrl+shift+click: [http://screencast.com/t/niXpaKJQ](http://screencast.com/t/niXpaKJQ)\n\n\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "November 30, 2015 at 8:10pm", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nAlireza,\n\nUpdating the components as Mostapha suggested should fix all of the issues.  I updated the \"compatibleHBVersion\" when I introduced the recirculatedAirPerArea property so you should have gotten a warning when you dropped the OpenStudio component on the canvass that you need a newer version of Honeybee to run the component.\n\nAlso, everything should be compatible with OS1.9 in this new version.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "December 7, 2015 at 9:57pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nHi Chris,\n\n\n\nThank you for your help with regards to the updated component.\n\nAlireza\n", "attachments": [], "created_by_name": "Alireza", "created_at": "December 28, 2015 at 8:21pm", "created_by": "Alireza", "replies": []}, {"body": "\nHi Mostapha,\n\nI apologize for the delayed response. I have managed to update the components in place and solve the issue. The \"re-wiring\" problem was raised from the extensive number of Honeybee surfaces that I had individually defined in my project resulting a significant allocation of the RAM on my computer slowing things down.\n\nThank you very much for your help.\n\nAlireza\n", "attachments": [], "created_by_name": "Alireza", "created_at": "December 28, 2015 at 8:19pm", "created_by": "Alireza", "replies": []}]}], "id": "1411470"}