{"body": "\nHi\n\nI have 3 analyses that are so different. the first and second is by CIE sky, sunny with sun but the time for 1th is 21th of Dec at 9 and the time for 2th is 21th of June at 9. the analysis for the 1th of summer is ok but the other is unnatural.\n\nmy window contains louver\n\nthe 3th is analysed with a sky with 10000 lux iluminance. this is natural too\n\n\n\ncould anybody guide me please... which one is correct\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1411847", "name": "1.jpg"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1411848", "name": "2.jpg"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1411849", "name": "3 10000.jpg"}], "created_by_name": "Tim", "created_at": "November 29, 2015 at 7:20am", "created_by": "Tim509", "topic": "Different skies and results", "replies": [{"body": "\nTim, CIE skies are not climate-based. The results are as expected since you're not changing the sky type for December and June. If you want the sky to be generated based on climate data use \"Honeybee generate Climate-based Sky\" component.\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "November 30, 2015 at 8:15pm", "created_by": "MostaphaSadeghipour", "replies": [{"body": "\nI want to **make comparisons between the amount of illuminance in summer and winter, I don't need ** climate-based sky.\n\nWhy do I should change the sky type for December and June??\n\nI surprised when I saw the illuminane in 21th of Dec is much more than summer..Is it possible?why?\n\nThanks\n", "attachments": [], "created_by_name": "Tim", "created_at": "November 30, 2015 at 11:21pm", "created_by": "Tim509", "replies": []}, {"body": "\nClimate-based sky is an sky that is generated based on the values from the weather file so you can see the effect of seasonal changes in radiation values in your study. If you don't use the climate-based sky the value in CIE sky will be generated based on a the sky type and not the radiation values from the weather file. Hope it helps.\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "December 1, 2015 at 6:53am", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nTim,\n\nTo more specifically address your concern, the December sky that you are getting is not unnatural.  It is just that you have direct sun coming through your louvers when the sun is low on the horizon in the winter but, when the sun is higher in the sky in the summer, all of the direct sun is being diffused by your louver system, giving much mower illuminance values. Illuminance values above 20,000 lux are very common in the outdoors or when you are in direct sun.  If you check the \"Global Horizontal Illuminance\" of an EPW file, you will see that the outside light levels can get as high as 100,000 lux in the summer at noon in most climates.\n\nI hope this explanation helps,\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "December 7, 2015 at 10:09pm", "created_by": "ChrisMackey", "replies": []}]}], "id": "1411850"}