{"body": "\nHi guys,\n\n\n\nI want to open a discussion about multiple parameters that have influence in natural ventilation and how i could make a sensitive study of how these parameters work in honeybee/energyplus.I gonnna explore the option 1 (window natural ventilation) of the natural ventilation component. The following questions are:\n\n\n\n- Sensitivity of terrain category. The terrain category affects the wind caracteristics and by that the performance of the natural ventilation. The way to implement the terrain type is by using the component HONEYBEE ENERGY SIMULATION PAR. In my investigation, my goal is to prove that the annual performance will decrease with the roughness of the terrain. \n\n\n\n- Location of opening. How does the location of the opening affect the annual performance?  I want to investigate how differs the energy consumption of a room at different building height. How can i do it? I have try just placing a room at 30 m but i guess i have to add a ground level as a reference.\n\n\n\n- Neighbour buildings. How does neighbor buildings affects the annual performance?\n\n\n\n- Shape of the building. How does shape affect the annual performance?\n\n\n\nI hope that these questions can open a discussion. \n\n\n\nBest Regards,\n\nEduardo\n\n\n\n\n\n\n\n\n", "attachments": [], "created_by_name": "Eduardo Artigas", "created_at": "December 1, 2015 at 10:03am", "created_by": "EduardoArtigas", "topic": "Natural ventilation basics", "replies": [{"body": "\nEduardo,\n\nI apologize for responding to you so late.  This past week was very busy as I had the wonderful opportunity of being at the Paris climate conference.  I should be more available here on out.\n\nFrom your questions, I get the sense that you are largely concerned with evaluating cross-ventilation that is driven by wind (as opposed to stack or buoyancy-driven ventilation).  The first two factors and the last factor that you cite are accounted for in EnergyPlus through the following methods:\n\nEnergyPlus assumes a power-law increase in wind speed with height above the ground.  You can get a visual of this power-law wind speed by using the \"Ladybug Wind Profile\" component that you see in this example file:\n\n[http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;for...](http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;fork=hydra_2&amp;id=Wind_Vertical_Profile)\n\nHoneybee will determine the height of your window above the ground by its reference to the Rhino model origin.  Essentially, the Rhino origin is considered to be the ground plane and the wind speed in the model increases according to the power law from that point.  As you see on the Wind Profile component, a different power law will be used depending upon the terrain that you select (with wind speeds being lower in urban areas and higher in unobstructed areas).\n\nTo account for the shape of your building, EnergyPlus checks the normal direction of your window surface in relation to the direction of the wind to determine a custom wind pressure coefficient for a given window and wind direction.  This is a relatively simple means of accounting for the geometry of the building and does not include any effects like the funneling of wind through narrow parts of the building geometry or the effect of a very tall building increasing wind speeds on the ground.\n\nThe third factor that you cite is not taken into account by EnergyPlus by default.  To account for this, you would have to run a CFD simulation (or perhaps a simple Lattice-Boltzmann particle collision simulation) to derive custom wind pressure coefficients for the windows to be fed into EnergyPlus.  We currently do not have a Grasshopper workflow for this yet but I know that this is one of the imagined workflows of Butterfly once it gets off the ground:\n\n[https://github.com/mostaphaRoudsari/Butterfly](https://github.com/mostaphaRoudsari/Butterfly)\n\nIn the meantime, the best that you can do to address this is to set a custom \"windDischargecoefficient\" on the Honeybee natural ventilation component if there is an object that is particularly close enough to block the wind.  It's a very rough and judgement-based way of accounting for it, though.\n\nIf you want more information on the equations used by EnergyPlus, you can find documentation here:\n\n[http://bigladdersoftware.com/epx/docs/8-0/input-output-reference/pa...](http://bigladdersoftware.com/epx/docs/8-0/input-output-reference/page-018.html#zoneventilationwindandstackopenarea)\n\nHope this helps,\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "December 7, 2015 at 11:15pm", "created_by": "ChrisMackey", "replies": []}], "id": "1412975"}