{"body": "\nHi,\n\n\n\nI have been trying to model ETFE cushions for EP and Radiance. For Radiance I am introducing manually results as produced by LBNL but for EP I have my doubts if a representation of a single layer using \"windowMaterial\" component is enough as ETFE cushions have a different behavior than that of a glass window. Especially when it comes to model more complex ETFEs with extra (shading/printed) layers and varying behavior during time I think that any simulation that is currently available is not representative enough. Any ideas/thoughts?  \n\n\n\nI am attaching a paper \"ENERGY MODELLING OF ETFE MEMBRANES IN BUILDING APPLICATIONS\" from H. Poirazis et al explaining the  behavior of ETFEs (p. 701) with with a frit intermediate layer as a reference.   \n\n\n\nThank you in advance\n\nTasos\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1412404", "name": "ETFE_Paper from IBPSA.pdf"}], "created_by_name": "Anastasios Kokkos", "created_at": "November 30, 2015 at 5:36am", "created_by": "AnastasiosKokkos", "topic": "ETFE simulation_ EP and Radiance", "replies": [{"body": "\nHi,<br/>I'm actually struggling with the same problem and I would be interested in hearing what other people think about this topic.<br/><br/>I'm thinking about modeling just one planar surface and then assigning it the properties of an entire ETFE cushion too.<br/><br/>Regards,<br/>Claudio\n", "attachments": [], "created_by_name": "Claudio Marini", "created_at": "November 30, 2015 at 10:19am", "created_by": "ClaudioMarini", "replies": [{"body": "\nHi Caludio and Tatos,\n\n\n\nFor Daylight modeling you can use Radiance's image-mapping. I published a paper recently that discusses the process ([http://www.simaud.org/2015/program.php#a-new-approach-to-modeling-f...](http://www.simaud.org/2015/program.php#a-new-approach-to-modeling-frit-patterns-for-daylight-simulation)). They haven't send it online but I can email you the paper if you're interested to read it in details.\n\n\n\nFor EnergyPlus, I would say the best solution is to generate a BSDF material using the pillows and image mapping process that I mentioned above and apply that to the surface. I'm not an expert in either creating or using BSDF materials though. Andy Mcneil has recently published a tutorial on BSDF which might be useful for this case.\n\n\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "November 30, 2015 at 6:35pm", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nThanks for the info guys!\n\n\n\nMostapha I'd love to take a look at that paper!\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "November 30, 2015 at 7:24pm", "created_by": "TheodorosGalanos", "replies": []}, {"body": "\nHere is the link to the paper: [https://copy.com/okY7JzPoVjbF6LrL](https://copy.com/okY7JzPoVjbF6LrL)\n\n\n\nand while we're talking about BSDF materials I recommend everyone to check this presentation: [http://www.radiance-online.org/community/workshops/2014-london/pres...](http://www.radiance-online.org/community/workshops/2014-london/presentations/day1/McNeil_BSDFsandPhases.pdf)\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "November 30, 2015 at 7:44pm", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nHi all, thank you for replying. Mostapha thank you very much for both links they are very useful. I am not familiar with BDSF materials either but I will try to set it up for E+. Can I use the \"radBSDF\" material component to export it also as an EP material or I should export it in another way? Finally is there any chance you publish the custom component you created for this study in HB? \n\n\n\nLooking forward! \n\n\n\nTasos\n", "attachments": [], "created_by_name": "Anastasios Kokkos", "created_at": "December 1, 2015 at 3:30am", "created_by": "AnastasiosKokkos", "replies": []}, {"body": "\nHi Tasos (Sorry I misspelled your name up there!),\n\nI have never used BSDF in EnergyPlus but I think the structure should be different. Looks like you can use Window to generate BSDF definitions for EnergyPlus ([https://windows.lbl.gov/software/window/7/7.3.4/w7_releasenotes.htm](https://windows.lbl.gov/software/window/7/7.3.4/w7_releasenotes.htm)). Then you should be able to copy the string and apply it as a construction to Honeybee surfaces. Please keep me posted. We can see if there is a better way to implement it to Honeybee.\n\nI developed the component while I was working for the company and technically they own the code. I may re-write a similar component in the near future but for now I don't have the ownership to make the decision. :|\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "December 1, 2015 at 7:12am", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nHi Mostapha, \n\nThank you for your reply, indeed you can create. I exported some material already and will apply them. I will update the post soon. Is a pity but understand the copyrights issues! :)  One thing that bugs me is that the evaluation of the results is more based on common sense rather than accuracy since I am not really sure if E+ will actually reads the created BDSF correctly. Do you have any sort of checkpoints for this? for example when you create material (in HB) and write them in the material library how do you check if E+ runs a correct simulation with the new material? (except from a qualitative evaluation)\n\n\n\nTasos  \n", "attachments": [], "created_by_name": "Anastasios Kokkos", "created_at": "December 4, 2015 at 7:41am", "created_by": "AnastasiosKokkos", "replies": []}, {"body": "\nHi Tasos, For examples like this I would check the solarGains from the window and make sure the results are changed as expected.\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "December 6, 2015 at 8:59pm", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nHi Taso,\n\n\n\nI was wondering if you had any success with linking BSDF materials to EnergyPlus. I would love to be able to use the vast database and ease of Window 7.3 in my simulations.\n\n\n\nAs for the non BSDF idf files that window can create, is there an easier way of importing them in HB than simply copying all the values manually to a new material construction?\n\n\n\nThanks in advance.\n\n\n\nKind regards,\n\nTheodore.\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1430662", "name": "GlzSys_LowE_Avg.idf"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1430663", "name": "GlzSys_LowE_Bsdf.idf"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1430664", "name": "GlzSys_LowE_Spec.idf"}], "created_by_name": "Theodoros Galanos", "created_at": "January 4, 2016 at 8:27pm", "created_by": "TheodorosGalanos", "replies": []}, {"body": "\nHi Theodore,\n\n\n\nI still haven't tried as I got stuck in some other projects but is first on my list for the upcoming week. I am not sure though what to do with new materials .idf's that I have generated. Only thing that I have tried is to copy the generated Text file inputs (from the idf Text editor) into GH like Chris is doing in this [example](http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;fork=hydra_2&amp;id=Green_Roof_In_Energy_Model) but still need to test if it works properly. As for the nonBSDF material I would try to create a common directory and save the properties in a .csv and read them in GH from there to assign them \"automatically\" to new constructions? Still though a workaround and probably not less of a work than inputting values manually. \n\nAny better ideas?\n\n\n\nRegards,\n\nTasos\n", "attachments": [], "created_by_name": "Anastasios Kokkos", "created_at": "January 5, 2016 at 5:57am", "created_by": "AnastasiosKokkos", "replies": []}, {"body": "\nHi Mostapha,\n\n\n\nI was reading your paper 2 days ago by the time I had to simulate an extremely heavy model (because of some panels). I tried to follow the method but I cannot seem to get to the end of it. \n\nI don't really understand how you are creating the HDR image (in the end I did a radiance ImageBasedSimulation of the pattern to create an HDR). Also after getting the HDR and creating a .msh of the geometry I want to apply the pattern on, I dont get the effect that I wish.\n\n\n\nI tried adding the material directly into the .rad file, which didnt work, and then by using the additionalRadFiles from the Honeybee component.\n\n\n\nIs there any other place where you have documented this procedure or can you suggest some reference? I search a bit on Radiance man pages about mesh painting but it was not very informative. \n\n\n\nthank you very much.\n\n\n\nkind regards,\n\nByron\n", "attachments": [], "created_by_name": "byron mardas", "created_at": "December 4, 2015 at 4:49am", "created_by": "byronmardas", "replies": []}, {"body": "\nHi Byron,\n\nThere is TIF&gt;HDR component in Honeybee that can be used to create and HDR file from the image. There can be different reasons why you don't see the effect correctly. You should make sure that the u, v parameters are adjusted based on your image size and rotation.\n\nThis post was very helpful when I was trying to figure it out: [http://radiance-online.org/pipermail/radiance-general/2007-June/004...](http://radiance-online.org/pipermail/radiance-general/2007-June/004366.html)\n\nI'm currently very busy but once I get a chance I will re-write the code in a clean component so you can concentrate on your work instead of workarounds! :|\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "December 6, 2015 at 9:09pm", "created_by": "MostaphaSadeghipour", "replies": []}]}], "id": "1412405"}