{"body": "\nHello everyone,\n\n\n\ni've been using an old version of Honeybee for a while but now that i updated i get this error.\n\n\n\nDoes anyone have the same message? Do you know on what does it depend? \n\nOn my colleagues computers simulations are running regularly!\n\nThank you really much,\n\n\n\nSimone\n\n\n\nP.S.\n\nI tried to wait up to 10min and nothing happens... on both their computers it takes less than 15 seconds!\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1412495", "name": "ERROR.JPG"}], "created_by_name": "Simone Bevilacqua", "created_at": "November 30, 2015 at 9:33am", "created_by": "SimoneBevilacqua", "topic": "Honey Bee issue", "replies": [{"body": "\nHi Simone, There is no error message in the screen-shot. Are you using the new version from Food4Rhino? Is your computer out of memory for any reason. That can slow down the simulation.\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "November 30, 2015 at 6:20pm", "created_by": "MostaphaSadeghipour", "replies": [{"body": "\nHi Mostapha,\n\nActually some of my students get something similar and i didn't find the way to overcome this: The daylight simulation starts, the oconv passes fine (i think) but it get stuck during the rpict stage. I revised that everything is well installed, that the folder has write permissions, and a couple of things more but didn't find the solution.\n\nCouldn't find some previous discussion on this, but my (bad) memory kind of reminds that there were some.\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "November 30, 2015 at 9:45pm", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nHi Abraham, Honeybee's daylight simulation hasn't really changed between the two release. It might be an issue with the newest version of Radiance then. Have you tried to run the batch file manually by double clicking on the file?\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "December 1, 2015 at 6:48am", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nHi Mostapha,\n\nThe problem is not me but with some of the students.\n\nThe oct file was created and then it goes to the rpict run. Then it happens that the command window remains stucked (i.e. the rpict doesn't finish). If you double click the batch file, the same thing happens.\n\nCan't think what this can be ...\n\nThanks,\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "December 1, 2015 at 10:42am", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nHi Abraham, Let's do this then. Can they uninstall Radiance and use and older version and see if the issue resist? What is the version of Radiance that they have installed? Let's see if this is an issue because of Radiance or Honeybee.\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "December 2, 2015 at 8:24am", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nHi Mostapha,\n\nI gave them this link:\n\n[https://github.com/NREL/Radiance/releases/tag/5.0](https://github.com/NREL/Radiance/releases/tag/5.0)\n\nSaying that, there are just 2-3 cases. So it is weird, since for most students it works fine.\n\nI'll ask them when i see them, hopefully tomorrow.\n\nI asked them to post the issue here in the forum but i guess they are \"shy\" :-)\n\n\n\nThanks!!\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "December 2, 2015 at 9:19am", "created_by": "AbrahamYezioro", "replies": []}]}, {"body": "\nHi Abraham, hi Mostapha,\n\nProblem solved!\n\nFor me - I don't know if that's also the case of Abraham's students - the problem was related to the fact that i never assigned a new Working Directory to the Analysis and this slowed significantly down the process that didn't process the simulation: try to create a new study folder where to save the RAD files and it should work out ;)\n\nLet me know!\n\n\n\nSimone\n", "attachments": [], "created_by_name": "Simone Bevilacqua", "created_at": "December 8, 2015 at 7:28am", "created_by": "SimoneBevilacqua", "replies": [{"body": "\nThanks Simone,\n\nI'll ask them next class how they are doing. Hoping everything is fine. Otherwise i'll try all the tricks i can imagine, including your suggestion.\n\nWhat is weird is that simulating Grid analysis is fine. Just doing Image analysis makes issues.\n\n-A.\n\n\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "December 8, 2015 at 7:51am", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\n\n\nWhat is weird is that simulating Grid analysis is fine. Just doing Image analysis makes issues.\n\nAre they using multiple cpus for running the analysis? It might be an issue with the way I implemented Radiance's parallel processing for Windows. For testing can you manually remove *.amb file from the folder before running a new analysis? The cached .amb data might be the reason.\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "December 11, 2015 at 10:44am", "created_by": "MostaphaSadeghipour", "replies": []}]}]}