{"body": "\nHey guys,\n\n\n\nI'm setting up a model for a DF simulation, and I was wondering where you specify the latitude of the building? As I remember, you used to specify it in the recipe component but you can't do that anymore. Is it moved somewhere else?\n\n\n\nI wrote the .rad files and there comes a 1000_lux.sky file. Is that used to make the CIE overcast sky?\n", "attachments": [], "created_by_name": "Christian Kongsgaard", "created_at": "December 6, 2015 at 8:43am", "created_by": "ChristianKongsgaard", "topic": "Daylight factor sky", "replies": [{"body": "\nHi Christian, Daylight Factor is a geometrical calulation and as you have already realized the location and orientation won't change the results for DF. Read pages 9-12 of [this document](https://dl.dropboxusercontent.com/u/16228160/Daysim3.0.Tutorial.pdf) for more information about different daylight measures.\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "December 6, 2015 at 8:37pm", "created_by": "MostaphaSadeghipour", "replies": [{"body": "\nYeah I get that, but will the light intensity of the overcast sky not change at different laditudes?  \n", "attachments": [], "created_by_name": "Christian Kongsgaard", "created_at": "December 7, 2015 at 2:05am", "created_by": "ChristianKongsgaard", "replies": []}, {"body": "\nYou can ask the same regarding orientation. But no. DF is kind of neutral regarding local climatic considerations.\n\nThat's why DF is less and less \"accepted\" nowadays.\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "December 7, 2015 at 2:41am", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nIt can be different but that as Abraham said it won't change the value of DF.\n\nDF is the ratio of the indoor illuminance to the outdoor horizontal illuminance under overcast sky. If the value of the sky changes the amount of light at the point will also change but the ratio (DF) will stay the same. (10000 to 200 or 20000 to 400 have the same ratio)\n\nIf you want to calculate lux values under overcast sky, you can use CIE sky component and generate an overcast sky and set-up a grid-based analysis.\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "December 7, 2015 at 6:38am", "created_by": "MostaphaSadeghipour", "replies": []}]}]}