{"body": "\n\n\nEsta es mi tesis en para la Maestría en Arquitectura Sustentable para la Universidad del Medio Ambiente (UMA), en ella se presenta un fraccionamiento de ciclo cerrado en el Municipio de Yucatán México. En esta tesis se busca incorporar los sistemas de la construcción vernácula Maya, con los principios de la bioclimática y permacultura, para generar un sistema de fraccionamiento que genere y produzca su propia comida, electricidad y cuide el agua.\n\n\n\nEspero le sirva a alguien y espero sus críticas y comentarios.\n\n\n\n[https://www.academia.edu/19541243/PROYECTO_PILOTO_DE_FRACCIONAMIENT...](https://www.academia.edu/19541243/PROYECTO_PILOTO_DE_FRACCIONAMIENTO_DE_CICLO_CERRADO_EN_KANAS%C3%8DN_YUCAT%C3%81N)\n\n\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/kUF6d6ObD*NPKPkthcBH7f8*CouxcHdVaq8ag*5yK3zY7IbxWcGfl6tmw2deZfL6AVpkTtFFR9lRLS9Dwj1h3CkhZeizdXaW/HorasenelPoligonodeConfort.png?width=750\" width=\"750\"/>](http://api.ning.com:80/files/kUF6d6ObD*NPKPkthcBH7f8*CouxcHdVaq8ag*5yK3zY7IbxWcGfl6tmw2deZfL6AVpkTtFFR9lRLS9Dwj1h3CkhZeizdXaW/HorasenelPoligonodeConfort.png)\n", "attachments": [], "created_by_name": "Javier M Gaxiola", "created_at": "December 7, 2015 at 1:22pm", "created_by": "JavierMGaxiola", "topic": "Tesis en Arquitectura Sustentable - PROYECTO PILOTO DE FRACCIONAMIENTO DE CICLO CERRADO EN KANASÍN, YUCATÁN", "replies": [{"body": "\nJavier,\n\nThis is wonderful!  Congratulations on producing such an awesome thesis.  The presentation of the final design is compelling and the Ladybug graphics are being deployed in some interesting and creative ways.\n\nThe only point of feedback that I would give is that I see you reference the PMV model on pages 34-36 and this model probably does not describe the conditions that your occupants will find comfortable well since the PMV model was derived by placing subjects in tightly-conditioned climate chambers.  There have been major discrepancies discovered between this model and observations of occupants in naturally ventilated buildings and so I would suggest using the Adaptive Comfort component to assess the comfort of your occupants instead.\n\nAgain, great work and congratulations!\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "December 7, 2015 at 9:44pm", "created_by": "ChrisMackey", "replies": []}], "id": "1416869"}