{"body": "\nHi everyone,<br/><br/>First of all, a question for you: is it possible to assign a blind to an horizontal window in Energy+? I never tried but until today I didn't think it would have been a problem to do it.<br/><br/>I'm actually struggling with the \"Honeybee_EnergyPlus Window Shade Generator\" component in order to assign some blinds objects to a couple of horizontal windows situated on a roof surface.\n\nIf I set to true in the \"horOrVertical_\" input I get this error message:<br/>\"1. Solution exception:step must be less than 0\".<br/>If I set it to false I get this error:<br/>\"1. Solution exception:Local variable 'normalVectorPerp' referenced before assignment.\"\n\nIf I slightly rotate the surface so that it's not horizontal anymore the blinds appears in the brep preview but they don't respect my input values for depth, distance between the glass and the shades and so on..<br/><br/>At this point I'm not sure if it's a problem in the HoneyBee environment or if it's not possible to do something like this in Energy+. I look forward to hear your suggestions.<br/><br/>Thanks in advance,\n\nClaudio<br/><br/><br/>\n", "attachments": [], "created_by_name": "Claudio Marini", "created_at": "December 7, 2015 at 10:58am", "created_by": "ClaudioMarini", "topic": "Assigning blinds to a horizontal window", "replies": [{"body": "\nClaudio,\n\nCan you upload a GH file illustrating your problem?  It may be that, depending upon your window dimensions and your inputs, no shades are being generated and are giving errors.  I can at least assure you that I have applied blinds to many horizontal windows in the past and I am confident that we can get it working quickly in your case too.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "December 7, 2015 at 9:21pm", "created_by": "ChrisMackey", "replies": [{"body": "\nHi Chris,<br/><br/>So it's not an Energy Plus issue and in some way I should be able to solve it. Great piece of news.<br/><br/>I attach 2 files. The first one shows the two horizontal windows with the previously mentioned errors. In the \" - copy\" version you can find an attempt of giving to the windows a slightly inclination by changing the z-values of few points. In this second case I get the blinds but they have a crazy geometry. For example if you give bigger values in order to see them more clearly they overlap and it looks like if changing their rotation value makes them moving in the same plane of the window.<br/><br/>The dimensions are pretty big compared to the roof they're inserted in, but I already tried to reduce the windows' dimensions and leave a bigger \"frame\" around them and nothing changed.<br/><br/>Thanks in advance for your precious help.<br/>Claudio\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1416997", "name": "BlindOnHorizontalWindow.gh"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1416998", "name": "BlindOnHorizontalWindow - Copy.gh"}], "created_by_name": "Claudio Marini", "created_at": "December 8, 2015 at 3:43am", "created_by": "ClaudioMarini", "replies": []}, {"body": "\nHee Chris,\n\n\n\nSolution for you might be simple: The distance from the Shading to the glass has to be bigger than 1/2 the size of the shading element. Elsewise the shading element goes through you window and Honeybee does'nt like that.\n\n\n\nI see you have a shading element of 0.05 (0.025 in both direction from centreline shading) and a distance of 0.02 which means the shading element would pas through the window by 0.005. This solved my problems once before.\n\n\n\nMaybe you can have a look at my question?\n\n[http://www.grasshopper3d.com/group/ladybug/forum/topics/loose-surfa...](http://www.grasshopper3d.com/group/ladybug/forum/topics/loose-surfaces-in-honeybee-zone)\n\n\n\nGreetings,\n\n\n\nDwayne\n", "attachments": [], "created_by_name": "Dwayne van Halewijn", "created_at": "December 8, 2015 at 3:55am", "created_by": "DwaynevanHalewijn", "replies": []}, {"body": "\nThanks for your feedback Dwayne,<br/><br/>And yes, you were right, I solved that mistake now.<br/>Just it didn't solve the \"blinds on horizontal window issue\". Still get the same warnings and the panel still doesn't give me any output.<br/><br/>Cheers,<br/>Claudio\n", "attachments": [], "created_by_name": "Claudio Marini", "created_at": "December 8, 2015 at 5:40am", "created_by": "ClaudioMarini", "replies": []}, {"body": "\nIs someone able to show me quickly a working Grasshopper file with some blind on an horizontal window?<br/>I would be really glad since I'm still struggling with this..\n\n<br/>Many thanks,<br/>Claudio\n", "attachments": [], "created_by_name": "Claudio Marini", "created_at": "December 10, 2015 at 2:59am", "created_by": "ClaudioMarini", "replies": []}, {"body": "\nClaudio,\n\nIn the BlindOnHorizontalWindowCopy file that you attached above change on the HB_EPWindowShades (original-AlwaysON) the _depth input to 1 (or maybe less).\n\nWhen bigger than that you get the following message on the white ballon:\n\n2. Note that E+ does not like shading depths greater than 1. HBObjWShades will not be generated.  shadeBreps will still be produced and you can account for these shades using a 'Honeybee_EP Context Surfaces' component.\n\nShades are supposed to be created but only as context, not as blinds.\n\nHope this helps.\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "December 10, 2015 at 3:40am", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nDear Abraham,<br/><br/>thanks for your feedback.<br/>Unfortunately that doesn't solve my issue since even with more \"realistic\" values  (values like 0,02 m) I get a bad shadeBrep output. I know that it's just for visualization, but I see its bad behaviour as an alarm alert.<br/>I put those huge values in the sample just to make the visualization of the problem easier to see.<br/>If I go to the IDF file my inputs looks right except for the angle that it in some way processed by HoneyBee according to the inclination of your window.<br/><br/>By the way we're talking about a very slightly inclinated roof. Still I have no ideas about the horizontal one.<br/><br/>Claudio\n", "attachments": [], "created_by_name": "Claudio Marini", "created_at": "December 10, 2015 at 6:08am", "created_by": "ClaudioMarini", "replies": []}, {"body": "\nI didn't went on into simulation, but i do succeed in creating the blinds and make the zone closed. Also defined the surface/window as completely horizontal.\n\nI also don't get any warning.\n\nAttached the file ...\n\nWorks for you?\n\n-A.\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1418798", "name": "BlindOnHorizontalWindowCopy_AY.gh"}], "created_by_name": "Abraham Yezioro", "created_at": "December 10, 2015 at 6:39am", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nUnfortunately no. In the file you attached the windows are still slightly inclinated (I put some 4 arrows pointing to the 4 point I modified the Z. Originally they all were 4.5m and 3.5m, I switched them to 3.4m and 4.4m) and I still see a bad Brep geometry for the shadings.<br/><br/>If I make it horizontal it doesn't work and the zone doesn't close.<br/><br/>I just tried with a new file and a new symple box and I get the same error when putting a blind on the window in the roof...<br/><br/>Thanks for your time, by the way.<br/>Claudio\n", "attachments": [], "created_by_name": "Claudio Marini", "created_at": "December 10, 2015 at 7:51am", "created_by": "ClaudioMarini", "replies": []}, {"body": "\nThis is weird because i set the angle to 0 and the zone is closed. Isn't it when you open the file? If it isn't try this:\n\nSet the tolerance in rhino to 0.001 and then re-open the file. Maybe there is some relation.\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "December 10, 2015 at 9:23am", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nClaudio,\n\nYou are absolutely right that perfectly horizontal surfaces not being accommodated by the script is a bug.  I also realized that I was probably mis-interpreting the \"distanceFromWindow\" input in EnergyPlus.  After I get through my email today, I will send the rest of the day fixing and improving this component.\n\nI will post back here when it is complete.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "December 13, 2015 at 12:33pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nClaudio,\n\nI have put a component that has this horizontal surface bug fixed onto the github and I am currently in the process of adding a lot of other features to this component (specifically for different types of setpoints and for roller shades/thermochromic glazing).  I should hopefully finish implementing all of this tomorrow and I will post back here once I do so.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "December 13, 2015 at 10:18pm", "created_by": "ChrisMackey", "replies": []}]}]}