{"body": "\nHi all.\n\nI just want to know if it is possible to run parametric energy simulation as parametric daylight analysis in tutorials? since i work on multi-objective optimization, i think it's better first run all possible solutions and then use them for optimization. any idea in this case can be so helpful.\n\n\n\nThanks in advance.\n", "attachments": [], "created_by_name": "mahr", "created_at": "December 8, 2015 at 1:47pm", "created_by": "mahr", "topic": "possibility of parametric energy simulation!", "replies": [{"body": "\nThere is nothing to stop you from that. The set-up is very similar and you only need to run an energy simulation for each option instead of daylighting. I used Honeybee to run all the examples you see here in [DesignExplorer](http://tt-acm.github.io/DesignExplorer/) both for daylighting and energy simulations.\n\n\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/VwTb9tHVOFvoiW7SwCo-vfg9U8gApfbOdUPL3P65iSvqb5N-7yxwMcVKFjRgyojJgnZyPFMEWiR0QNWhOUr6d3HQtBugj2hC/parametricEnergyModeling.JPG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/VwTb9tHVOFvoiW7SwCo-vfg9U8gApfbOdUPL3P65iSvqb5N-7yxwMcVKFjRgyojJgnZyPFMEWiR0QNWhOUr6d3HQtBugj2hC/parametricEnergyModeling.JPG)\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "December 9, 2015 at 8:00am", "created_by": "MostaphaSadeghipour", "replies": [{"body": "\nHi Mostapha,\n\n\n\nSomehow I completely skipped this! What a shame it's simply amazing. Will play around with it asap.\n\n\n\nI'm using pollination with a lot of success lately to test a series of parametric study definitions. While I do realize that the instructions on the wiki seem straightforward, would there be a chance for a sample file for DE?\n\n\n\nAs a side note, not sure if it's worthy of a separate discussion, but I did run into some trouble with parametric daylighting (DF in particular). It seems to be very slow restarting the simulation and taking up a lot of memory. I'm fairly certain it has to do with my definition, as most of the HB objects are \"re-made\" in the pipeline at each iteration. Has anyone ever had memory trouble with parametric daylighting?\n\n\n\nAlso, I'm curious. Would rotating a simple brep before making zones out of it be better, computationally-wise, than rotating HB objects?\n\n\n\nThanks in advance and thanks for the amazing job!\n\n\n\nKind regards,\n\nTheodore.\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "January 27, 2016 at 6:13am", "created_by": "TheodorosGalanos", "replies": []}, {"body": "\nHi Theodore, \n\n\n\nFor a sample .csv you can  click on the \"save selection to file\" button as seen on the screenshot of Mostapha above and in the DE page. For the rest you need to follow the structure you follow with Pollination. If you manage DE to work properly  with images and .json files that you have connected please let me know since the links do not work for me.\n\n\n\nBest\n\n-Tasos\n", "attachments": [], "created_by_name": "Anastasios Kokkos", "created_at": "January 27, 2016 at 8:31am", "created_by": "AnastasiosKokkos", "replies": []}, {"body": "\nHi Taso,\n\n\n\nI am going to try it now. I am still a bit confused with the instructions on github, mentioning in: and out: for inputs and outputs. However, the file structure doesn't involve them so I'll go forward. Guessing those are for coding reason.s\n\n\n\nWill let you know of any success.\n\n\n\nKind regards,\n\nTheodore.\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "January 28, 2016 at 1:35am", "created_by": "TheodorosGalanos", "replies": []}]}, {"body": "", "attachments": [], "created_by_name": "Anastasios Kokkos", "created_at": "December 11, 2015 at 1:04am", "created_by": "AnastasiosKokkos", "replies": [{"body": "\nHi Tasos, Can you share with me one line of your csv file with the header?\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "December 11, 2015 at 9:48am", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nTasos,\n\nA friend of mine encountered the same issue a few days ago.  Hopefully, we can get to the bottom of this soon but I paste a part of his email here for reference:\n\n\n\nI have been testing out Design Explorer, and I’ve run into a pretty significant problem.  When I prepare my .csv file (even if I start from one of their sample ones) and then upload it to Design Explorer, the 2D images do not display—the image just shows the text of the filepath (or sometimes the design properties).  I have tried linking to dropbox, or the local file path of my computer, and the issue keeps happening.  Have you ever had this problem, and/or is there a workaround?  Any advice you have is helpful.\n\n\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "December 13, 2015 at 2:08pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nHi Mostapha, Chris,\n\n\n\nI totally skipped this discussion after trying for a couple of days to make DE work and then had to skip projects. I am really sorry and thank you for your replies in any case. I encounter the same problem again. I am attaching a line of my CSV here: \n\n\n\nname:Distribution,in:Orientation,in:NumberOfStripes,in:NumberOPlanes,out:Planarity,out:Deviation,img:img<br/>Normalised,0,10,15,0.484915,1.220677,[https://www.dropbox.com/s/pb35wnns1o38jx4/Hallo_Perspective.png?dl=0](https://www.dropbox.com/s/pb35wnns1o38jx4/Hallo_Perspective.png?dl=0)\n\n\n\nEven if I try the input and output data without the prefixes (name:. in:, out: img: etc) I still see no result. Only in case I replace my link with one of the links you have in your example files the DE seems to respond! Any input would be great! \n\n\n\n-Tasos\n", "attachments": [], "created_by_name": "Anastasios Kokkos", "created_at": "January 27, 2016 at 2:56am", "created_by": "AnastasiosKokkos", "replies": []}, {"body": "\nI had the same issue with json files and dropbox but managed to get around it by using someone else's.I'd be interested to know what the fix is?\n", "attachments": [], "created_by_name": "Duncan Cox", "created_at": "January 27, 2016 at 10:08am", "created_by": "DuncanCox", "replies": []}, {"body": "\nActually just saw this, will try and use the format.\n\n\n\nKind regards,\n\nTheodore.\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "January 28, 2016 at 1:52am", "created_by": "TheodorosGalanos", "replies": []}, {"body": "\nDropbox is very strange.\n\n\n\nEvery time I request a link it gives me a different address. The link from my HD is completely different from the ones in the web portal. And sometimes the links of a folder are different than the links of the files inside.\n\n\n\nI would also love a standard way of generating this, or perhaps something else than dropbox. Maybe googledrive?\n\n\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "January 28, 2016 at 2:43am", "created_by": "TheodorosGalanos", "replies": []}, {"body": "", "attachments": [], "created_by_name": "Anastasios Kokkos", "created_at": "January 27, 2016 at 11:16am", "created_by": "AnastasiosKokkos", "replies": []}]}], "id": "1417543"}