{"body": "\nHi Guys,\n\nIs there any one of you know how to do evaporate cooling simulation in Honeybee and Laybug?**<br/>**\n\nI was trying to use Roof Pond Strategy to cool down my Design in Kuala Lumpur during daytime. And so far, my method is modeling an adjacent zone with natual ventilation and fan ventilation on top of my roof, and pretend this zone is acting like a roof pond. This method is pretty questionable.\n\nThus, I was wondering if any of you guys would have solid idea than mine.\n\n\n\nFYI, I found this [1ZoneEvapCooler.idf](https://github.com/joshwentz/virtualpulse/blob/master/EnergyPlus-7-1-0/Examples/1ZoneEvapCooler.idf) in GitHub, but also found it is hard to do it with honeybee and grasshopper.\n\n\n\nThanks,\n\nDaniel\n", "attachments": [], "created_by_name": "Danielron", "created_at": "December 7, 2015 at 10:10pm", "created_by": "Danielron", "topic": "How to use Honeybee and Ladybug to model Evaporate Cooling", "replies": [{"body": "\nHi Daniel, I don't know the answer to modeling a Roof Pond. I think a good place to ask the question like this is (unmethours.com). The example file that you attached is from EnergyPlus example files and [is different](https://www.google.com/search?q=direct+evaporative+cooler+system&amp;espv=2&amp;biw=1280&amp;bih=713&amp;tbm=isch&amp;tbo=u&amp;source=univ&amp;sa=X&amp;ved=0ahUKEwjVyb23ic_JAhXKkx4KHTo9CCYQsAQIIQ) from what you're trying to achieve. Let us know if you find a solution in EnergyPlus and we should be able to implement it in Honeybee.\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "December 9, 2015 at 8:21am", "created_by": "MostaphaSadeghipour", "replies": [{"body": "\nDaniel,\n\nSorry for the late reply.  As Mostapha said, make sure that you are aware of all of the assumptions of the evaporative cooling model that you are using and that it is a close approximation of what you are proposing as a design.  Before posting the question to unmethours, it might be worthwhile to read through the EnergyPlus Input/Output reference on evaporative cooling objects so that you are able to ask the right types of questions:\n\n[http://bigladdersoftware.com/epx/docs/8-0/input-output-reference/pa...](http://bigladdersoftware.com/epx/docs/8-0/input-output-reference/page-052.html#group-evaporative-coolers)\n\nOnce you have nailed down the evaporative cooling model that you want to use, you should be able to implement it with the additionalStrings input of the run simulation component.  Here is an example for how to do this for an evaporative cooling downdraft tower like those in the ancient Iranian city of Yazd, where wet sheets were sometimes hung at the top of the towers to get cool air to sink into the houses:\n\n[http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;for...](http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;fork=hydra_2&amp;id=Evaporative_Cooling_Tower)\n\nHere is the EnergyPlus object that I was using to model the downdraft tower:\n\n[http://bigladdersoftware.com/epx/docs/8-0/input-output-reference/pa...](http://bigladdersoftware.com/epx/docs/8-0/input-output-reference/page-018.html#zonecooltowershower)\n\nIt's truly brilliant stuff that the ancient Iranians developed thousands of years ago.  That tower object blows most of the other passive strategies that I know out of the water vapor!\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "December 11, 2015 at 3:10pm", "created_by": "ChrisMackey", "replies": []}]}]}