{"body": "\n\n\nI am trying to add internal windows to the core zone of a building with core and perimeter zones. I am passing this core zone through addHBGlz and supplying the names of all it's walls into the input childSurfacesName_.\n\n\n\nThe outcome that I would expect is that glazing should be added to each wall whose name I have specified in the input childSurfacesName_. Instead however I receive a null output.\n\n\n\nIs this a bug? What should I be expecting? Chris or Mostapha if this is a bug then let me fix it myself ; ).\n\n\n\n\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1418154", "name": "addHBGlzing.JPG"}], "created_by_name": "Anton Szilasi", "created_at": "December 9, 2015 at 8:59am", "created_by": "AntonSzilasi", "topic": "addHBGlz not working as expected", "replies": [{"body": "\nHi Anton,\n\nMaybe i'm missing something from your image, but there is nothing connected to the _childSurfaces. Just giving the name is not enough to produce the (internal) windows.\n\nJust wonder ...\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "December 9, 2015 at 11:34pm", "created_by": "AbrahamYezioro", "replies": [{"body": "\nHi Abraham\n\n\n\nShouldn't you be able to give either the names or the surfaces? That would make more sense to me. I'm going to modify the component so that you can give either.\n", "attachments": [], "created_by_name": "Anton Szilasi", "created_at": "December 10, 2015 at 2:16am", "created_by": "AntonSzilasi", "replies": []}, {"body": "\nHi Anton,\n\nI didn't tried much the internal windows, but if they work as the external (and i don't see why they not), you need to give the host surface and the child surface. In this case the host should be the same walls taht you want to be windows and that can't be. Also the size of the child window should not be the same as the host (E+ constrain).\n\nThat's why i think that giving just the name is not good enough.\n\nThough, now that you mention this, a nice trick can be to give the name, the duplicate is and scale it by some amount (less than 0.95) making the whole process transparent for the user. But as long as i write this, sounds a bit complicated (and confusing).\n\nMakes sense for you?\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "December 10, 2015 at 2:22am", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nAs i was thinking the name should say it itself, childSurfacesName is an optional input for naming the new child surfaces. It has nothing to do with the parent surfaces or creating a window.\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "December 10, 2015 at 11:11am", "created_by": "MostaphaSadeghipour", "replies": []}]}]}