{"body": "\nHi Mostapha,[<br/>](https://github.com/mostaphaRoudsari)\n\n\n\nRecently, I'm trying to connect Gambit and Fluent with grasshopper to run CFD simulation. I learned much from Ladybug&amp;Honeybee codes. Now I wanted to write a batch file to call the simulation software as you do in the \"runDaylightAnalysis\" or \"runEnergySimulation\" component. But I can not fully understand your codes.\n\n\n\nbatchStr = workingDrive + '\\ncd\\\\' + folderName + '\\n' + EPDirectory + \\<br/>               '\\\\Epl-run ' + fullPath + ' ' + fullPath + ' idf ' + epwFileAddress +\n\n               ' EP N nolimit N N 0 Y'\n\n\n\nBelow is my code, which I imitate what you write. I think it still needs to be modified. Gambit is an execute programming, and I want to use it to run .jou file. I don't know why two \"fullPath\" are needed.\n\n\n\nbatchStr = workingDrive + '\\ncd\\\\' + folderName + '\\n' + GambitDirectory + \\<br/>              '\\\\gambit ' + fullPath + ' ' + fullPath + ' jou '\n\n\n\nCould you give me any suggestions? Thanks a lot. Looking forward for your reply.\n\n\n\nBest regards,\n\n\n\nDan\n", "attachments": [], "created_by_name": "Dan Hou", "created_at": "December 14, 2015 at 8:37am", "created_by": "DanHou", "topic": "How to write batch file to call the simulation software?", "replies": [{"body": "\nDan,\n\nIt sounds like you are working on some cool stuff.  The content that goes in the batchStr is a set of input parameters that are needed to run the specific program that you are calling from the command line.  I would first try running the Gambit exe from a command window like so:\n\n[http://superuser.com/questions/617174/pass-parameters-via-command-l...](http://superuser.com/questions/617174/pass-parameters-via-command-line-argument-to-exe)\n\nOnce you figure out the specific parameters that need to be passed to Gambit to get it to run, you should be able to write a batch string that is simply a list of these parameters.  Here's another example of a component writing a batchStr for the new insect that I am working on (also derived from Mostapha's examples):\n\n[https://github.com/chriswmackey/Dragonfly/blob/master/src/Dragonfly...](https://github.com/chriswmackey/Dragonfly/blob/master/src/Dragonfly_Run%20Urban%20Weather%20Generator.py#L375-L379)\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "December 14, 2015 at 7:21pm", "created_by": "ChrisMackey", "replies": [{"body": "\nHi Chris,\n\n\n\nThanks a lot for your information. They are very useful for me. I will look into them carefully and try to modify my codes. Maybe we will have further discussion. I hope I can success and then share my work with you. Your work give me many inspiration. Thanks again.\n\n\n\nBest regards,\n\n\n\nDan\n", "attachments": [], "created_by_name": "Dan Hou", "created_at": "December 15, 2015 at 8:27am", "created_by": "DanHou", "replies": []}]}]}