{"body": "\nHi\n\n\n\nSo i am looking at different facade framing patterns with varying u-values. One of the options has a thermal break and the other does not. The one without the thermal break has a higher u-value than the one with as you'd expect.\n\n\n\nWhen I run this through honeybee I find that the solution without a thermal break has a lower peak cooling load than the one with - which makes no sense. I don't know if I have messed up the material construction somehow. I do find that the peak heating load follows behavior that i would expect to see.\n\n\n\nWould someone mind having a look at my attached file and letting me know what I am doing wrong please?\n\n\n\nThanks\n\n\n\nDuncan\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1422473", "name": "151214_AOAA.3dm"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1422474", "name": "151216_Panel_Study.gh"}], "created_by_name": "Duncan Cox", "created_at": "December 16, 2015 at 9:29am", "created_by": "DuncanCox", "topic": "Odd cooling loads", "replies": [{"body": "\nWhat is the outdoor temperature during the peak cooling condition?\n\n\n\nIf it is lower than the internal zone temperature, then the zone is shedding heat to the outdoors. In this case, lower wall thermal conductivity leads to lower peak cooling load.\n", "attachments": [], "created_by_name": "Octagon26", "created_at": "December 16, 2015 at 10:43am", "created_by": "Octagon26", "replies": []}, {"body": "\nHi Ducan,\n\n\n\nThe second major energy-performance feature of windows is the ability to control solar heat gain through the glazing. I have seen in your file two type of glazings:\n\na) ProposedGlazing\n\nb) ExistingGlazing\n\nI don't know the characteristics of your materials. Have you also changed the SHGC?<br/>\n\nI think you have not considered the influence of the SHGC.\n\n\n\nBests\n\nAntonello\n\n\n", "attachments": [], "created_by_name": "Antonello Di Nunzio", "created_at": "December 16, 2015 at 11:57am", "created_by": "AntonelloDiNunzio", "replies": [{"body": "\nBut I think that the main problem for your simulation is this:<br/>the WindowMaterial:SimpleGlazingSystem.<br/>Is the method that you used for U-value (with frames) suitable for this type of model?<br/>Look at the link below.<br/>[](But%20I%20think%20that%20the%20main%20problem%20for%20your%20simulation%20is%20this:%20the%20WindowMaterial:SimpleGlazingSystem.%20Is%20the%20method%20that%20you%20used%20for%20U-value%20(with%20frames)%20suitable%20for%20this%20type%20of%20model?%20Look%20at%20the%20link%20below.%20http://bigladdersoftware.com/epx/docs/8-0/engineering-reference/page-043.html)[http://bigladdersoftware.com/epx/docs/8-0/engineering-reference/pag...](http://bigladdersoftware.com/epx/docs/8-0/engineering-reference/page-043.html)\n\nAnd \"WindowProperty:FrameAndDivider\" is not defined.\n\n[<img class=\"align-center\" src=\"http://api.ning.com:80/files/S-*Q0dYAAj0pexLOa9plTfsX2VZKDM4wZZma8YpLBu8T1fTtCKOu4K77LVqUniLG9jkf4mvco0jtqBDgd31CT721IpI7gu6r/frame.png?width=721\" width=\"721\"/>](http://api.ning.com:80/files/S-*Q0dYAAj0pexLOa9plTfsX2VZKDM4wZZma8YpLBu8T1fTtCKOu4K77LVqUniLG9jkf4mvco0jtqBDgd31CT721IpI7gu6r/frame.png)\n", "attachments": [], "created_by_name": "Antonello Di Nunzio", "created_at": "December 16, 2015 at 1:11pm", "created_by": "AntonelloDiNunzio", "replies": []}, {"body": "\nDuncan,\n\nI see that the peak cooling in two cases of U-values are differing by only a very small amount (&lt;1W out of over 300W) and this is more like a rounding error than an actual decrease in peak cooling.  This result makes a lot of sense to me when you consider all of the factors that contribute to your EnergyPlus peak cooling and is something that I have witnessed in some simulations of my own over the past couple of years.\n\nThe reason why the peak cooling is not deeply affected by the changing U-Value is that having a high U-Value can actually be a benefit in hot times of the year as it can assist in the shedding of heat in the night before a hot day and the cooling down of the buildings surfaces.  This is particularly important in your model where the nighttime setback is 30C, which is much warmer than the nighttime outdoor temperature and means that you certainly are getting more heat loss at night with a higher window U-value.  Contrarily, the day (especially in a south glazed building like the one you are testing) is driven mostly by solar load and (especially for retail) internal gain.  Whatever heat gain you may be getting through window conduction with a higher U-value is very small in comparison to these other heat sources and is understandably counter-acted by the coolness of building's thermal mass from the previous night (and it's ability to absorb the heat of these other intense sources).\n\nI third the statement that, if you really want to see a major reduction in peak cooling, the SHGC is the term that you should be adjusting.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "December 16, 2015 at 10:01pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nThanks for everyone's time and insight. And yes we do recognise that the SHGC is the critical factor here but I just wanted to have some confidence that the materials were behaving properly in my script. \n\n\n\nThanks for all your help as always.\n", "attachments": [], "created_by_name": "Duncan Cox", "created_at": "December 17, 2015 at 2:44am", "created_by": "DuncanCox", "replies": []}, {"body": "\nYou're very welcome, Duncan.\n\nFor some extra confidence in your case, it may also be useful to look at the glazing conduction term of the energy balance in relation to the other terms for the peak cooling day using the following workflow:\n\n[http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;for...](http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;fork=hydra_2&amp;id=Energy_Balance)\n\nVisualizing the \"Surface Energy Flow\" with the \"Color Zone Surfaces\" may also be informative to understand the participation of the conduction in the overall energy flow across the window.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "December 17, 2015 at 5:46am", "created_by": "ChrisMackey", "replies": []}, {"body": "\nThis energy balance output is great!\n", "attachments": [], "created_by_name": "Duncan Cox", "created_at": "December 17, 2015 at 9:04am", "created_by": "DuncanCox", "replies": []}]}]}