{"body": "\nHi Mostapha, Chris and all,\n\nI encountered a problem by using \"occupancyGenerator\" in daylight simulation, which might cause the error in \"readAnnualResultsI\". The files are attached here.\n\nError was reported by the \"readAnnualResultsI\" when I used the \"occupancyGenerator\" to generate schedule for the daylight simulation, as follows:\n\n1. Solution exception:Can't find C:\\Users\\LocalAdmin\\AppData\\Roaming\\Ladybug\\DaysimCSVOCC\\8-22 in EnergyPlus schedules.\n\nBut, actually the schedule file did exist in the above path in my laptop. I have no idea why this error occurred. Further, if I used the \"csvSchedule\" component to generate the schedule for the daylight simulation, wrong results were generated by the \"readAnnualResultsI\". For instance, all the DLA results are -1, which is incorrect.<br/>\n\nCould you please figure out if there is anything wrong in my file? Thank you in advance!\n\nBest,\n\nDing\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1422463", "name": "unnamed_update____.gh"}], "created_by_name": "Ding", "created_at": "December 16, 2015 at 8:44am", "created_by": "doudou", "topic": "Errors from readAnnualResultsI and occupancyGenerator", "replies": [{"body": "\nDing,\n\nUpdating the file will do the trick. See attache. The HB_occupancyGenerator you were using was creating schedules without the csv extension. The new one is. I remember reporting this in the past.\n\nWhat i've found is that after that the simulation runs but i get the nasty \"ds_el_lighting has stopped working\" window error. This is the processor of the Daysim results. Searching for this error i've found that the problem is caused when previous ill files exist in the simulation folder. I removed them and then it runs fine. But i wonder if there is a solution for that. I didn't find one.\n\n-A.\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1422623", "name": "unnamed_update_____AY.gh"}], "created_by_name": "Abraham Yezioro", "created_at": "December 16, 2015 at 12:21pm", "created_by": "AbrahamYezioro", "replies": []}], "id": "1422464"}