{"body": "\n**Hello everyone!**\n\n\n\nFirst of all many compliments for this two great tools you created (LB &amp; HB), they've changed my way of running my simulations and are therefore very very useful.\n\n\n\nI'm experiencing a problem though when trying to set a daylight simulation with some determined radiance parameters. Here's the problem: After many tries I think I found out that setting -ab = 6 and at the same time -aa = .05 creates some sort of problem, because when I try to do so My PC blocks for several minutes, without letting me manually end processes from taskmanager, and when I'm able again to enter grasshopper, i get the following error:\n\n\"Solution exception:index out of range: 0\"\n\nDoes this really depends on the parameters and values I found out or is it related to something else? Is the problem relative to the structure of HoneyBee or is it just relative to my specific case (and maybe PC)? Is it possible to solve it, and if yes, how?\n\n\n\nAtteched you find my rhino model and my grasshopper file.\n\n\n\nThanks in advance for your help and again many compliments!\n\nLuigi\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1423949", "name": "Office_Model_1.3dm"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1423950", "name": "Model For honeybee_2.gh"}], "created_by_name": "Luigi Giovannini", "created_at": "December 19, 2015 at 11:35am", "created_by": "LuigiGiovannini", "topic": "HoneyBee reports error with some Radiance parameters", "replies": [{"body": "\nHi Ligui,\n\nYour model is ok and I could run it properly. I think the error can be about cancelling the simulation when it was running. Try it once more.\n\nMy result is attached here.[<img class=\"align-center\" src=\"http://api.ning.com:80/files/T-9GsR3UPPEC72acv*bgG-eASZKGaj6e3mH2zNC0kB*SR8LwuERmpd2m1atfSKw-fhumUuDHWAVpWiRz3LJ7FFcRsQmIzuKd/scho.png?width=721\" width=\"721\"/>](http://api.ning.com:80/files/T-9GsR3UPPEC72acv*bgG-eASZKGaj6e3mH2zNC0kB*SR8LwuERmpd2m1atfSKw-fhumUuDHWAVpWiRz3LJ7FFcRsQmIzuKd/scho.png)\n", "attachments": [], "created_by_name": "masoome", "created_at": "December 20, 2015 at 5:18am", "created_by": "masoome", "replies": [{"body": "\nHi masoome,\n\nthanks fir yiur reply!\n\nI tried to run again the simulation with the same parameters as the file I attached before and without stoppong it, but I keep getting the same problems and errors. The  PC actually stops working because after a few seconds the simulation starts the fan inside the PC all of a sudden stops and for the next 5-10 mins I cannot do anything, even alt+ctrl+canc. After I wait for that time i get the followig error:\n\n\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/T-9GsR3UPPEuU0CXwqEUwCb9JMWWx7CWVLU2i1HBE6TzXCn16TDgHVvIu0KABfqu9faGFPV4A4cOKwYay6yuFRpog2ryZmtj/Cattura.JPG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/T-9GsR3UPPEuU0CXwqEUwCb9JMWWx7CWVLU2i1HBE6TzXCn16TDgHVvIu0KABfqu9faGFPV4A4cOKwYay6yuFRpog2ryZmtj/Cattura.JPG)\n\n\n\nthe ReadMe says:\n\n\n\n{0;0;0}<br/>0. Grid-based Radiance simulation<br/>1. The component is checking ad, as, ar and aa values. This is just to make sure that the results are accurate enough.<br/>2. -ar is set to 300.<br/>3. Good to go!<br/>4. Current working directory is set to: C:\\Users\\Luigi\\Desktop\\Prova__\\Prova_1\\gridBasedSimulation\\<br/>5. Found a trans material... Resetting st parameter from 0.85 to 0.01127600496<br/>6. WMIC PROCESS get Commandline<br/>7. WMIC PROCESS get Commandline<br/>8. WMIC PROCESS get Commandline<br/>9. WMIC PROCESS get Commandline<br/>10. WMIC PROCESS get Commandline<br/>11. WMIC PROCESS get Commandline<br/>12. WMIC PROCESS get Commandline<br/>13. WMIC PROCESS get Commandline<br/>14. WMIC PROCESS get Commandline<br/>15. WMIC PROCESS get Commandline<br/>16. WMIC PROCESS get Commandline<br/>17. WMIC PROCESS get Commandline<br/>18. WMIC PROCESS get Commandline<br/>19. WMIC PROCESS get Commandline<br/>20. WMIC PROCESS get Commandline<br/>21. WMIC PROCESS get Commandline<br/>22. WMIC PROCESS get Commandline<br/>23. WMIC PROCESS get Commandline<br/>24. WMIC PROCESS get Commandline<br/>25. WMIC PROCESS get Commandline<br/>26. WMIC PROCESS get Commandline<br/>27. WMIC PROCESS get Commandline<br/>28. WMIC PROCESS get Commandline<br/>29. WMIC PROCESS get Commandline<br/>30. WMIC PROCESS get Commandline<br/>31. WMIC PROCESS get Commandline<br/>32. WMIC PROCESS get Commandline<br/>33. WMIC PROCESS get Commandline<br/>34. WMIC PROCESS get Commandline<br/>35. WMIC PROCESS get Commandline<br/>36. WMIC PROCESS get Commandline<br/>37. WMIC PROCESS get Commandline<br/>38. WMIC PROCESS get Commandline<br/>39. WMIC PROCESS get Commandline<br/>40. WMIC PROCESS get Commandline<br/>41. WMIC PROCESS get Commandline<br/>42. WMIC PROCESS get Commandline<br/>43. WMIC PROCESS get Commandline<br/>44. WMIC PROCESS get Commandline<br/>45. WMIC PROCESS get Commandline<br/>46. WMIC PROCESS get Commandline<br/>47. WMIC PROCESS get Commandline<br/>48. WMIC PROCESS get Commandline<br/>49. WMIC PROCESS get Commandline<br/>50. WMIC PROCESS get Commandline<br/>51. WMIC PROCESS get Commandline<br/>52. WMIC PROCESS get Commandline<br/>53. WMIC PROCESS get Commandline<br/>54. WMIC PROCESS get Commandline<br/>55. WMIC PROCESS get Commandline<br/>56. WMIC PROCESS get Commandline<br/>57. WMIC PROCESS get Commandline<br/>58. WMIC PROCESS get Commandline<br/>59. WMIC PROCESS get Commandline<br/>60. WMIC PROCESS get Commandline<br/>61. WMIC PROCESS get Commandline<br/>62. WMIC PROCESS get Commandline<br/>63. WMIC PROCESS get Commandline<br/>64. WMIC PROCESS get Commandline<br/>65. WMIC PROCESS get Commandline<br/>66. WMIC PROCESS get Commandline<br/>67. WMIC PROCESS get Commandline<br/>68. WMIC PROCESS get Commandline<br/>69. WMIC PROCESS get Commandline<br/>70. WMIC PROCESS get Commandline<br/>71. WMIC PROCESS get Commandline<br/>72. WMIC PROCESS get Commandline<br/>73. WMIC PROCESS get Commandline<br/>74. WMIC PROCESS get Commandline<br/>75. WMIC PROCESS get Commandline<br/>76. WMIC PROCESS get Commandline<br/>77. WMIC PROCESS get Commandline<br/>78. WMIC PROCESS get Commandline<br/>79. WMIC PROCESS get Commandline<br/>80. WMIC PROCESS get Commandline<br/>81. WMIC PROCESS get Commandline<br/>82. WMIC PROCESS get Commandline<br/>83. WMIC PROCESS get Commandline<br/>84. WMIC PROCESS get Commandline<br/>85. WMIC PROCESS get Commandline<br/>86. WMIC PROCESS get Commandline<br/>87. WMIC PROCESS get Commandline<br/>88. WMIC PROCESS get Commandline<br/>89. WMIC PROCESS get Commandline<br/>90. WMIC PROCESS get Commandline<br/>91. WMIC PROCESS get Commandline<br/>92. WMIC PROCESS get Commandline<br/>93. WMIC PROCESS get Commandline<br/>94. WMIC PROCESS get Commandline<br/>95. WMIC PROCESS get Commandline<br/>96. WMIC PROCESS get Commandline<br/>97. WMIC PROCESS get Commandline<br/>98. WMIC PROCESS get Commandline<br/>99. WMIC PROCESS get Commandline<br/>100. WMIC PROCESS get Commandline<br/>101. WMIC PROCESS get Commandline<br/>102. WMIC PROCESS get Commandline<br/>103. WMIC PROCESS get Commandline<br/>104. WMIC PROCESS get Commandline<br/>105. WMIC PROCESS get Commandline<br/>106. WMIC PROCESS get Commandline<br/>107. WMIC PROCESS get Commandline<br/>108. WMIC PROCESS get Commandline<br/>109. WMIC PROCESS get Commandline<br/>110. WMIC PROCESS get Commandline<br/>111. WMIC PROCESS get Commandline<br/>112. WMIC PROCESS get Commandline<br/>113. WMIC PROCESS get Commandline<br/>114. WMIC PROCESS get Commandline<br/>115. WMIC PROCESS get Commandline<br/>116. WMIC PROCESS get Commandline<br/>117. WMIC PROCESS get Commandline<br/>118. WMIC PROCESS get Commandline<br/>119. WMIC PROCESS get Commandline<br/>120. WMIC PROCESS get Commandline<br/>121. WMIC PROCESS get Commandline<br/>122. WMIC PROCESS get Commandline<br/>123. WMIC PROCESS get Commandline<br/>124. WMIC PROCESS get Commandline<br/>125. WMIC PROCESS get Commandline<br/>126. WMIC PROCESS get Commandline<br/>127. WMIC PROCESS get Commandline<br/>128. WMIC PROCESS get Commandline<br/>129. WMIC PROCESS get Commandline<br/>130. WMIC PROCESS get Commandline<br/>131. WMIC PROCESS get Commandline<br/>132. WMIC PROCESS get Commandline<br/>133. WMIC PROCESS get Commandline<br/>134. WMIC PROCESS get Commandline<br/>135. WMIC PROCESS get Commandline<br/>136. WMIC PROCESS get Commandline<br/>137. WMIC PROCESS get Commandline<br/>138. WMIC PROCESS get Commandline<br/>139. WMIC PROCESS get Commandline<br/>140. WMIC PROCESS get Commandline<br/>141. WMIC PROCESS get Commandline<br/>142. WMIC PROCESS get Commandline<br/>143. WMIC PROCESS get Commandline<br/>144. WMIC PROCESS get Commandline<br/>145. WMIC PROCESS get Commandline<br/>146. WMIC PROCESS get Commandline<br/>147. WMIC PROCESS get Commandline<br/>148. WMIC PROCESS get Commandline<br/>149. WMIC PROCESS get Commandline<br/>150. WMIC PROCESS get Commandline<br/>151. WMIC PROCESS get Commandline<br/>152. WMIC PROCESS get Commandline<br/>153. WMIC PROCESS get Commandline<br/>154. WMIC PROCESS get Commandline<br/>155. WMIC PROCESS get Commandline<br/>156. WMIC PROCESS get Commandline<br/>157. WMIC PROCESS get Commandline<br/>158. WMIC PROCESS get Commandline<br/>159. WMIC PROCESS get Commandline<br/>160. WMIC PROCESS get Commandline<br/>161. WMIC PROCESS get Commandline<br/>162. WMIC PROCESS get Commandline<br/>163. WMIC PROCESS get Commandline<br/>164. WMIC PROCESS get Commandline<br/>165. WMIC PROCESS get Commandline<br/>166. WMIC PROCESS get Commandline<br/>167. WMIC PROCESS get Commandline<br/>168. WMIC PROCESS get Commandline<br/>169. WMIC PROCESS get Commandline<br/>170. WMIC PROCESS get Commandline<br/>171. WMIC PROCESS get Commandline<br/>172. WMIC PROCESS get Commandline<br/>173. WMIC PROCESS get Commandline<br/>174. WMIC PROCESS get Commandline<br/>175. WMIC PROCESS get Commandline<br/>176. WMIC PROCESS get Commandline<br/>177. WMIC PROCESS get Commandline<br/>178. WMIC PROCESS get Commandline<br/>179. WMIC PROCESS get Commandline<br/>180. WMIC PROCESS get Commandline<br/>181. WMIC PROCESS get Commandline<br/>182. WMIC PROCESS get Commandline<br/>183. WMIC PROCESS get Commandline<br/>184. WMIC PROCESS get Commandline<br/>185. WMIC PROCESS get Commandline<br/>186. WMIC PROCESS get Commandline<br/>187. WMIC PROCESS get Commandline<br/>188. WMIC PROCESS get Commandline<br/>189. WMIC PROCESS get Commandline<br/>190. WMIC PROCESS get Commandline<br/>191. WMIC PROCESS get Commandline<br/>192. WMIC PROCESS get Commandline<br/>193. WMIC PROCESS get Commandline<br/>194. WMIC PROCESS get Commandline<br/>195. WMIC PROCESS get Commandline<br/>196. WMIC PROCESS get Commandline<br/>197. WMIC PROCESS get Commandline<br/>198. Runtime error (IndexOutOfRangeException): index out of range: 0<br/>199. Traceback:<br/> line 320, in script\n\n\n\nThe thing is that if I raise the -aa parameter from 0.05 to 0.1 all works fine..\n\nIs this only related to my PC then?? What should I do to solve this issue?\n\n\n\nThanks again for your help\n\nLuigi\n", "attachments": [], "created_by_name": "Luigi Giovannini", "created_at": "December 20, 2015 at 8:55am", "created_by": "LuigiGiovannini", "replies": []}, {"body": "\nHi Luigi,\n\n\n\nBased on the report the analysis is running fine on your system. You may run out of memory with this setting. Setting aa to low values can be very computationally expensive. Do you really need to set aa that low? Here is a good reference for Radiance Parameters: ([http://radsite.lbl.gov/radiance/refer/Notes/rpict_options.html](http://radsite.lbl.gov/radiance/refer/Notes/rpict_options.html))\n\n\n\nAlso check this discussion: [http://radiance-online.org/pipermail/radiance-general/2015-August/0...](http://radiance-online.org/pipermail/radiance-general/2015-August/011160.html)\n\n\n\nI added an error.log file to Honeybee daylight analysis with Radiance and it will hopefully give you a more meaningful error report if you try the attached file.\n\n\n\nMostapha\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1424812", "name": "ModelForhoneybee_2_msr.gh"}], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "December 21, 2015 at 8:29am", "created_by": "MostaphaSadeghipour", "replies": []}]}], "id": "1423951"}