{"body": "\nHi Chris,\n\nTrying to check the recently uploaded example on Therm in Hydra i noticed that the geometry is not internalized.\n\nCan you update this example?\n\n\n\nThanks,\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "January 2, 2016 at 1:16pm", "created_by": "AbrahamYezioro", "topic": "Therm example", "replies": [{"body": "\nAbraham,\n\nI updated the example file so that the geometry is internalized:\n\n[https://github.com/chriswmackey/hydra_2/commit/e856a0bf1b34b66e461f...](https://github.com/chriswmackey/hydra_2/commit/e856a0bf1b34b66e461f92cdef0138767b171afd)\n\nAlso, the THERM example files each should come with a Rhino file in the .zip folder.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "January 2, 2016 at 3:51pm", "created_by": "ChrisMackey", "replies": [{"body": "\nThanks Chris,\n\nThe Rhino files are not included in the zip.\n\nQuestion: EP materials can be the input for the HB_createThermPolygons? This is what i read, but when running the Therm_Export_Workflow example the HB_writeTHERM is not recognizing thhose EP materials.\n\nI'm using your files as they are and i am updated as for today.\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "January 2, 2016 at 10:46pm", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nAbraham,\n\nThank you for letting me know.  It seems that the Rhino files were not exported because I was using a very old version of the Hydra component.  I will try to fix this when I get the chance but, in the meantime, both example files should have the geometry internalized.\n\nThe \"Create Therm Polygons\" component is meant to accept either EP or THERM materials and this is what is demonstrated in the example file.  Are you saying that you do not see the THERM polygon components like so when you open the file?\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/DYswKX9FwiSYNIS8Eex2EbDvfAqPyMvEE0uAWVwUWzIWKFR64lHiltIxf8EqzpzoxFsy7WIMCC7nbeGn33GnVXfUNzBinOFi/EPMAterialsWithTherm.JPG\" width=\"688\"/>](http://api.ning.com:80/files/DYswKX9FwiSYNIS8Eex2EbDvfAqPyMvEE0uAWVwUWzIWKFR64lHiltIxf8EqzpzoxFsy7WIMCC7nbeGn33GnVXfUNzBinOFi/EPMAterialsWithTherm.JPG)\n\nAs you see, the \"M01 100MM BRICK\", \"8IN CONCRETE HW\" and \"1/2IN GYPSUM\" are EP materials.  If you do not see the Therm Polygon components like to, it's a problem that is specific to your system and you will have to send me the error message.\n\nAnother guess, which may be far off from the issue, is that you might be connecting EP Constructions and not EP Materials?\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "January 2, 2016 at 11:24pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nHi Chris,\n\nThis is weird.\n\nFirst of all, i'm not using constructions.\n\nI was just trying the example file as is. The thing is that i see the EP materials out of the HB_callFromEPConstrLibrary, but they are not recognized by the HB_writeTHERM. I changed the materials using my own EP's and it is now working.\n\nAfter your above response i disconnected your materials and connected again and it is working now.\n\nI suppose some times it need some kind of \"electric shock\" to work :-)\n\nIt is fine now.\n\nThanks,\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "January 2, 2016 at 11:35pm", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nAbraham,\n\nI think I know what is happening.  When you connect up an EP Material to the thermPolygon component, a process happens that is similar to connecting a new custom EPmaterial/EPConstruction to the HBSrf component. Specifically, the component writes a THERM version of the EP Material into the THERM library that is stored in memory just like the HBSrf component writes the new custom material/construction into the EP Library in memory.\n\nWhen you have another HB_HB flying on another GH canvass or you drag/drop a newr HB_HB onto the canvass, it overwrites all of the materials that you have written to this library in the memory of the Rhino document.  Accordingly, to ensure that you do not encounter this error, I would either not have multiple GH files open for a given Rhino document or, if you do, hit recompute whenever you get this type of warning to ensure that the GH document re-writes all of the materials/constructions into the library.\n\nMostapha, if you read this, I think that we really need to find some way around this overwriting of libraries in Honeybee.  If this issue has confused Abraham a couple of times, that I am positive that it has confused the great majority of the HB user base.  I have started a github issue for it here and please let me know your thoughts:\n\n[https://github.com/mostaphaRoudsari/Honeybee/issues/446](https://github.com/mostaphaRoudsari/Honeybee/issues/446)\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "January 4, 2016 at 7:52am", "created_by": "ChrisMackey", "replies": []}, {"body": "\nHi Chris,\n\nThis was EXACTLY like you described. I had many GH open. The timing of your response was impeccable, as something similar happened to me in class time, so i knew how to deal with this.\n\nNext time i know what to do.\n\nThanks a lot,\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "January 4, 2016 at 1:29pm", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nAbraham,\n\nThe issue has been fixed by Mostapha:\n\n[https://github.com/mostaphaRoudsari/Honeybee/issues/446](https://github.com/mostaphaRoudsari/Honeybee/issues/446)\n\nHopefully this should never happen again!\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "January 5, 2016 at 7:44am", "created_by": "ChrisMackey", "replies": []}, {"body": "\nExcelent!!\n\nThank you!!\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "January 5, 2016 at 9:17am", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nHi Chris,\n\n\n\nThis is the rookie question and I apologize. I downloaded the example Mostapha shared in the new version announcement. Somehow the air gap material doesn't exist in the library. I tried going over the available materials and it wasn't there.\n\n\n\nNow this is not bug ofc, as the whole thing works when I change it to anything in the library. But the air gap would be an important material to have in these. I wonder if it is my fault missing this or I need to create one with the components?\n\n<br/>Sorry for taking your time about this small matter.\n\n\n\nKind regards,\n\nTheodore.\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "January 28, 2016 at 10:18pm", "created_by": "TheodorosGalanos", "replies": []}, {"body": "\nHi Theodore,\n\nThe air material is very important as almost every construction has some sort of air gap in it and it is often important to use the THERM air material to model the radiant heat transfer of this gap correctly.  Thank you for posting about this.\n\nAll of the THERM materials are stored in a file called thermMaterial.csv that is in your Ladybug Default folder.  The file is supposed to update when I post a new version but this feature was not working if you had a very old version of the library.\n\nCan you verify that the air material shows up in the most recent version of this example file?\n\n[http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;for...](http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;fork=hydra_2&amp;id=THERM_Window_Frame_Construction&amp;slide=0&amp;scale=1&amp;offset=0,0)\n\nIf so, all of your future GH files should include the air material in the library.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "January 30, 2016 at 8:19pm", "created_by": "ChrisMackey", "replies": []}]}]}