{"body": "\nI've noticed that E+ is able to accept precipitation schedules based on the EPW precipitation data. It then uses this to account for when the building walls are wet, which changes the film coefficient.\n\n\n\nI'm located in the tropics and precipitation is quite high, with rain coming every day. I wonder if anyone has ever used this method before.\n\n\n\nI know E+ has a precitipation schedule for the US ([https://raw.githubusercontent.com/NREL/EnergyPlus/develop/datasets/...](https://raw.githubusercontent.com/NREL/EnergyPlus/develop/datasets/PrecipitationSchedulesUSA.idf)) and the official site briefly describes how to develop one. But still the file is thousands of lines long.\n\n\n\nI wonder if there is a way we can write precipitation schedules from the open epw component in HB/LB? And if then we can use them as inputs to the precipitation object of E+. I would love to investigate the impact of this in results.\n\n\n\nI apologize beforehand if such an option already exists in HB/LB, or if this whole process isalready taken intoaccount in normal simulations.\n\n\n\nEDIT: I now wonder if this is already taken care of when we link the weather file to the run energy simulation component.\n\n\n\nKind regards,\n\nTheodore.\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "January 4, 2016 at 12:16am", "created_by": "TheodorosGalanos", "topic": "Developing and using precipitation schedules with HB/LB", "replies": [{"body": "\nYou might be interested in this issue on EnergyPlus website: [https://github.com/NREL/EnergyPlus/issues/4714](https://github.com/NREL/EnergyPlus/issues/4714)\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "January 9, 2016 at 10:20am", "created_by": "MostaphaSadeghipour", "replies": [{"body": "\nTheodore,\n\nI have not used this method but I know from looking at the 'liquidPrecipitationDept' output of the Import EPW component that the vast majority of EPW files do not contain precipitation data and, when they do it is usually inaccurate.  We have been planning to connect out to a NASA database with better precipitation data for a while now:\n\n[https://github.com/mostaphaRoudsari/ladybug/issues/86](https://github.com/mostaphaRoudsari/ladybug/issues/86)\n\nSince this database is related to a lot of other NASA databases that I am connecting to with Dragonfly, I was thinking of building out a connection to it there.  I will let you know how this progresses.  I think that having accurate precipitation values is a necessary pre-step before trying to use this object and, by the time we have that, hopefully that E+ issue that Mostapha posted is addressed.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "January 9, 2016 at 1:21pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nHi Mostapha and Chris,\n\n\n\nThanks for your responses.\n\n\n\nDoes this mean that at the moment, and in the absence of precipitation data in the weather file, the outside convection coefficient is always set at \"dry\"? Or I guess they could contain a boolean for rainfall that sets israining on?\n\n\n\nThat connection sounds amazing Chris. I really should take a look at the work done in Dragonfly, I've neglected that.\n\n\n\nKind regards,\n\nTheodore. \n\n\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "January 10, 2016 at 4:34am", "created_by": "TheodorosGalanos", "replies": []}, {"body": "\nThe field for rain vs dry is \"Present Weather Observation\" (page 46) which is used by EnergyPlus (page 20).\n\n\n\n[https://www.energyplus.net/sites/all/modules/custom/nrel_custom/pdf...](https://www.energyplus.net/sites/all/modules/custom/nrel_custom/pdfs/pdfs_v8.4.0/AuxiliaryPrograms.pdf)\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "January 10, 2016 at 8:42am", "created_by": "MostaphaSadeghipour", "replies": []}]}]}