{"body": "\nHello everyone,\n\n\n\nFirst of all sorry if there was a thread I could add this, couldn't find one.\n\n\n\nI was wondering about something that I unfortunately don't have the time to test.\n\n\n\nIf I undertand correctly the simpler methods that E+ employs for solar distrubtion assign radiation equally to all indoor surfaces, something that I guess would impact some of the metrics calculated by E+.\n\n\n\nMy questions is should I make it a habit to create convex zones and use the fullInteriorAndExterior mode for accurate results or is it that the impact on results isn't all that great to justify that?\n\n\n\nThanks in advance,\n\nTheodore.\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "January 3, 2016 at 9:20pm", "created_by": "TheodorosGalanos", "topic": "Thermal Comfort and Solar Distribution", "replies": [{"body": "\nTheodore,\n\nFirst just a small correction to what you said:\n\nFor simpler solar distribution calculations (fullInteriorAndExterior), EnergyPlus uses VIEW FACTOR from the window to the zone surfaces to divide up the incoming solar energy (it is not divided equally).  This is a fine assumption as long as you are only interested in results on the zone level (like zone cooling, or average zone air temperature/MRT).\n\nHowever, if you are going to generate a micro-climate map off of the energy simulation results, this method is not satisfactory and you really need to be breaking up individual surfaces into multiple ones to capture the variation in surface temperature and running the simulation with fullInteriorAndExteriorWithReflections.\n\nIf you are trying to generate a micro-climate map for a convex zone, you have a tough judgement call that varies depending on the type of geometry that you are simulating.  If you have an L-shaped zone where all windows are far away from the \"joint\" of the L, I would suggest breaking up the zone in two zones and putting an air wall between them (the HB view factor component will know to discount the air wall from the MRT calculation).  However, there are many cases where I would say that this breaking up is not worth it since incoming solar energy cannot pass through an air wall (E+ does not treat it as transparent) and so this can badly mess up your radiative heat transfer calculations if you put an air wall close enough to a window that sunlight is hitting it.  In this case, if you can find a way to make the zone not convex (ie. shave off the small convex portion of the zone) this might actually be best in some cases.  Otherwise, you might have to accept the limitation of solar energy distributed by view factor with the simpler model.\n\nMan, I really wish E+ team would fix this convex issue.  It's a really big limitation that I know could be addressed with a bit more time.  Mark my words, if it isn't fixed in 3 years, I am going to edit the E+ code myself.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "January 4, 2016 at 9:50am", "created_by": "ChrisMackey", "replies": [{"body": "\nThanks for the answer Chris. I think I meant simple and not simpler then, I was pretty sure the first option was averaging across all surfaces.\n\n\n\nIt sounds as if it is not even straightforward to break up zones into convex shapes, I never knew the positioning of the virtual partition would be a problem. View factor distribution doesn't sound all that bad I guess. When I get the time I'll set up a simple room and test the whole thing out.\n\n\n\nWho knows, maybe in 3 years I'll know how to read E+ code and I'll help :)\n\n\n\nKind regards,\n\nTheodore.\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "January 4, 2016 at 6:37pm", "created_by": "TheodorosGalanos", "replies": []}, {"body": "\nTheodore,\n\nI just realized that the E+ Input/Output reference is unclear about how the diffuse radiation is distributed.  It only says that it is \"evenly distributed\":\n\n[http://bigladdersoftware.com/epx/docs/8-0/input-output-reference/pa...](http://bigladdersoftware.com/epx/docs/8-0/input-output-reference/page-006.html#building)\n\nThis is vague to me as it could mean either an even distribution of light from the window surface (view factor) or an even distribution across the surface area of the zone.  I always wanted to believe the former but now I am not sure.  I will let you know when I find out.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "January 9, 2016 at 1:42pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nThanks Chris.\n\n\n\nI'll try and search around myself, although I'm sure I'm at a disadvantage here.\n\n\n\nI wonder if we can set up a small experiment and test this out? Perhaps a simple geometry that would leave all methods on an equal footing (i.e. no convex funny stuff).\n\n\n\nI don't have the time today but I'll set it up within the week.\n\n\n\nKind regards,\n\nTheodore.\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "January 11, 2016 at 3:48am", "created_by": "TheodorosGalanos", "replies": []}]}]}