{"body": "\nHas anyone ever used this E+ object?\n\n(found at [http://bigladdersoftware.com/epx/docs/8-0/input-output-reference/pa...](http://bigladdersoftware.com/epx/docs/8-0/input-output-reference/page-014.html#group-room-air-models))\n\n\n\nIt seems to be stated in the guide that this option is kind of a post-processing of other results the user might have (and one possible source stated is CFD). But the description provided isn't really illuminating. It seems that the CFD results could possibly be inputed in the form of a temperature stratification using a lookup table (like it is done in the nonDimensionalHeight object). But I really can't be sure. I wonder if anyone has used it before.\n\n\n\nThanks in advance.\n\n\n\nKind regards,\n\nTheodore.\n\n\n\nEDIT: I just realized I have been asking a lot of E+ focused questions and might be out of context of the forum. I apologize for that, I will tone it down. I do believe though that this post might be strongly connected with this forum due to the development of Butterfly.\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "January 4, 2016 at 8:49pm", "created_by": "TheodorosGalanos", "topic": "RoomAir:TemperaturePattern:UserDefined - Using CFD results in E+", "replies": [{"body": "\nHi Theodore! I haven't used it myself but I think if you ask the question on unmethours.com someone there should be able to help. I agree that we should have a link to the answer in Butterfly repository as it will be very useful down the road.\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "January 5, 2016 at 8:42pm", "created_by": "MostaphaSadeghipour", "replies": [{"body": "\nHi Mostapha,\n\n\n\nYes I started searching the terms in unmethours after I posted this (and realized I was a bit out of context). I'll ask the question there, see what they say and will link the answer (if any).\n\n\n\nKind regards,\n\nTheodore.\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "January 5, 2016 at 8:45pm", "created_by": "TheodorosGalanos", "replies": []}]}], "id": "1430815"}