{"body": "\nHello everybody!\n\n\n\nI've been trying to run an E+ Simulation for a single room. I've generated a custom shading and used it as \"shdSurface\" for the \"HB_EPContextSrf\" component. The Simulation does run, but once it finished I get this error message:\n\n1. The simulation has not run correctly because of this severe error: <br/>   ** Severe  ** GetSurfaceData: There are 50 degenerate surfaces; Degenerate surfaces are those with number of sides &lt; 3.\n\n\n\nCan sombody tell me how to find the degenerate surfaces and get rid of them?\n\n\n\nI attached the gh.-file and I'm using the \"Small objects - meters\" template for Rhino, in case that's important.\n\n\n\nThanks in anvance\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1434586", "name": "E+ Simulation.gh"}], "created_by_name": "S221B", "created_at": "January 8, 2016 at 12:39pm", "created_by": "S221B", "topic": "E+ context surface error", "replies": [{"body": "\nS221B,\n\nIn my opinion you are approaching this wrongly. There are a couple of options:\n\n1. As you did, but you are modeling the blind with thickness. If you keep with this approach just stick with a plain surface (re-model the profile just as one curve and not as a profile. The profile is what is \"killing\" the simulation, even though you get results.\n\n2. Using the native HB_EPWindowShades which will give you all you need, i think.\n\n\n\nHope this helps.\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "January 9, 2016 at 1:04am", "created_by": "AbrahamYezioro", "replies": [{"body": "\nHello Abraham,\n\nsadly, I won't be able to use the native HB_EPWindowShades, since I'm trying to compare different kinds of custom shadings.\n\nSo, I'll try your first idea.\n\n\n\nThank you\n\n\n", "attachments": [], "created_by_name": "S221B", "created_at": "January 11, 2016 at 1:47am", "created_by": "S221B", "replies": []}, {"body": "\nInteresting ...\n\nI wonder what kind of shading devices do you want to check that EPWindowShades can't take. Just assuming that they will be similar to the blinds you did before.\n\nIf you just check energy consumption i don't believe that the curvature of those shades will do any difference as opposed to be straight lines.\n\nGood luck,\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "January 11, 2016 at 2:15am", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nthe other kind uses cylinders, instead of lamellae, so quite a bit of difference ^^\n\nthanks again\n", "attachments": [], "created_by_name": "S221B", "created_at": "January 11, 2016 at 2:48am", "created_by": "S221B", "replies": []}]}], "id": "1434587"}