{"body": "\nHi Everyone,\n\n\n\nThe new electric lighting components for Honeybee are now available for download. You can either get them with the next release of Honeybee or update them in your existing installation by using the Honeybee_Update Honeybee component.\n\n\n\nThe video below (best viewed in full-screen mode) provides an idea of what these components are capable of being used for:\n\n<iframe _origwidth=\"596\" frameborder=\"0\" height=\"447\" src=\"https://www.youtube.com/embed/PCngnTVtNo8?wmode=opaque\" width=\"596\"></iframe>\n\n\n\n\nThe video below shows how these components can be used in an existing Honeybee project (for additional links please open this video in youtube):\n\n<iframe _origwidth=\"603\" frameborder=\"0\" height=\"340\" src=\"https://www.youtube.com/embed/ujR7iNVRuhs?wmode=opaque\" width=\"603\"></iframe>\n\n\n\n\nI have uploaded two examples as Hydra files that show how these components can be used for grid-point and image-based simulations:\n\n[Example1 : Grid Point Calculations](http://hydrashare.github.io/hydra/viewer?owner=sariths&amp;fork=hydra&amp;id=IES_Electric_Lighting_Grid-based_calculations&amp;slide=0&amp;scale=1&amp;offset=0,0)\n\n[Example2: Image based simulation](http://hydrashare.github.io/hydra/viewer?owner=sariths&amp;fork=hydra&amp;id=IES_Electric_Lighting_Basic_Example&amp;slide=0&amp;scale=1&amp;offset=0,0)\n\n\n\n\n\nFinally, a more esoteric application is demonstrated in this video:\n\n\n\n<iframe _origwidth=\"631\" frameborder=\"0\" height=\"355\" src=\"https://www.youtube.com/embed/JtoH-Sgu0BE?wmode=opaque\" width=\"631\"></iframe>\n\n\nThese components are still in the beta-testing stage. Some of the limitations of the components are:\n\n1. Only Type C photometry IES files are supported at present.\n\n2. Rhino is likely to get sluggish if there are too many luminaires (i.e. light fixtures) present in a scene.\n\n3. Due to the spectral limitations of the ray-tracing software (RADIANCE), simulations involving color mixing might not be physically realizable.\n\n\n\nAdditional details about photometric and spectral calculations are probably an overkill for this forum. However, I'd be glad to answer any related questions. Please report any bugs or request new features either on this forum or on [Github](https://github.com/mostaphaRoudsari/Honeybee).\n\n\n\n[Mostapha](http://www.grasshopper3d.com/profile/MostaphaSadeghipour?xg_source=activity), [Leland Curtis](http://www.grasshopper3d.com/profile/LelandCurtis), [Reinhardt Swart](http://www.grasshopper3d.com/profile/ReinhardtSwart) and [Dr. Richard Mistrick](http://www.engr.psu.edu/ae/faculty/mistrick/) provided valuable inputs during the development of these components.\n\n\n\n\n\n\n\nThanks,\n\nSarith\n\n\n\n\n\n\n\n\n\n\n\n**Update 16th January 2017**:\n\nAn example with some new components and bug fixes since the initial release announcement can be found [here](http://hydrashare.github.io/hydra/viewer?owner=sariths&amp;fork=hydra&amp;id=IES_ElectricLighting_WithNewComponent&amp;slide=0&amp;scale=1&amp;offset=0,0)\n\n[<img class=\"align-left\" src=\"http://api.ning.com:80/files/Fxq0VavCSuARKxBAcZ7sH0FhZidOkNI892oovSUxbMkm7qEgJj0SwVZcQbg8Xxb3sk40*1Fa32dgV5MY44QR-PtSEP6cDugP/RhinoViewPort.png?width=500\" width=\"500\"/>](http://api.ning.com:80/files/Fxq0VavCSuARKxBAcZ7sH0FhZidOkNI892oovSUxbMkm7qEgJj0SwVZcQbg8Xxb3sk40*1Fa32dgV5MY44QR-PtSEP6cDugP/RhinoViewPort.png)\n\n\n\n[<img class=\"align-left\" src=\"http://api.ning.com:80/files/Fxq0VavCSuDDl-108BvtSELdsF99tH2YJ8UVysfGatd6MWth-1XMUkFE6aTG8KZbH44FPiY*OetP8ZfM3RAKt00H4cSDO7R6/HigherRes.png?width=500\" width=\"500\"/>](http://api.ning.com:80/files/Fxq0VavCSuDDl-108BvtSELdsF99tH2YJ8UVysfGatd6MWth-1XMUkFE6aTG8KZbH44FPiY*OetP8ZfM3RAKt00H4cSDO7R6/HigherRes.png)[<img class=\"align-left\" src=\"http://api.ning.com:80/files/Fxq0VavCSuBUpaAk-YOA4X07YLCTHb5bXb5-f*iDQdoh*JgjIIspRQbax4V4hgtY2I6*ViC1OuG93jOQyxtj72CAySJZutkR/IES_ElectricLighting_WithNewComponent_GH.png?width=500\" width=\"500\"/>](http://api.ning.com:80/files/Fxq0VavCSuBUpaAk-YOA4X07YLCTHb5bXb5-f*iDQdoh*JgjIIspRQbax4V4hgtY2I6*ViC1OuG93jOQyxtj72CAySJZutkR/IES_ElectricLighting_WithNewComponent_GH.png)\n", "attachments": [], "created_by_name": "Sarith Subramaniam", "created_at": "January 13, 2016 at 10:25pm", "created_by": "sarith", "topic": "Electric lighting components for Honeybee", "replies": [{"body": "\nSuperb, congrats and thanks for a superb components :)\n", "attachments": [], "created_by_name": "Peter Zaťko", "created_at": "January 14, 2016 at 4:34am", "created_by": "PeterZatko", "replies": []}, {"body": "\nGreat work, very excited to experiment with this!\n", "attachments": [], "created_by_name": "Reinier Zeldenrust", "created_at": "January 14, 2016 at 5:44am", "created_by": "ReinierZeldenrust", "replies": []}, {"body": "", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "January 14, 2016 at 5:37pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nWell done, this is one of the much wanted aspects in HB/LB!\n\n\n\nThanks for the amazing work!\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "January 14, 2016 at 7:47pm", "created_by": "TheodorosGalanos", "replies": []}, {"body": "\nhey this is quite interesting, great work! as a lighting designer and heavy grasshopper user, this has been a long time coming.  first, we got a few issues when testing the example files:\n\n1) missing the embryoA image viewer - using firefly's image viewer in the mean time but can you share that?\n\n2) we ran into a snag when loading ies file from a network location - it only worked on local disk. you should include that in your documentation? is it possible to make the links work over network? \n\n3) support for all ies file types?\n\n \n\nsecond, some initial thoughts:\n\n1) change some of the nomenclature in the various components to not refer to 'Run daylight simulation' but just 'radiance lighting simulation.'\n\n2) would be very helpful to have an output stating lumens (yes it's in luminaire details) but have the read-out show resulting lumens after LLF + calndelaMultiplier would be great.\n\n3) possible incorporation of accelerad for GPU calc?\n\n4) for the ies photometric web view, it would be nice to show the point grid of all the candela readings - this would show me if the ies file was created with a few real readings in an integrating sphere, or output from a digital software like photopia (generally useful when doing fixture research). it'd also be cool to be able to turn on the vector or point of peak candela.\n\n5)in the 'Run Daylight Simulation' component - it'd be cleaner to separate out the inputs for geometry from the inputs for lights.\n\n\n\nwill submit more comments as i try it out on a few real projects...\n\ncheers\n\ndan\n", "attachments": [], "created_by_name": "Dan Weissman", "created_at": "February 29, 2016 at 3:31pm", "created_by": "DanWeissman", "replies": [{"body": "\nHi Dan,\n\n\n\nFirst up, you can download Embryo Viz from here: [http://www.grasshopper3d.com/xn/detail/2985220:Comment:1101387](http://www.grasshopper3d.com/xn/detail/2985220:Comment:1101387) ( I am not sure if there is a proper link for it. Perhaps Mostapha can clarify).\n\n\n\nI had updated the components a few weeks ago but then got too lazy/busy to properly document that anywhere. Some of the additional features are:\n\n1. It is now possible to substitute an IES file with a text string. For example one can paste the contents of an IES file into a text panel and connect that to the input for _iesFilePath. Alternatively, you can read a text file using the native Grasshopper \"Read File\" component, then embed (and internalize) that information inside the \"Text\" component.\n\nSo, either of the below two options will(should) qualify as an input for the _iesFilePath:\n\n[<img class=\"align-left\" src=\"http://api.ning.com:80/files/GTkgWcNU8QmU*AW5-LAJY7YPsfoawm1Fpv0dUk0AGjZZl3mm7OW6qtBa4Zi-5ZrgUKeURmCJhYD9GG06T-JyJad8gX-ACO-i/229201660740PM.bmp?width=500\" width=\"500\"/>](http://api.ning.com:80/files/GTkgWcNU8QmU*AW5-LAJY7YPsfoawm1Fpv0dUk0AGjZZl3mm7OW6qtBa4Zi-5ZrgUKeURmCJhYD9GG06T-JyJad8gX-ACO-i/229201660740PM.bmp)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[<img class=\"align-left\" src=\"http://api.ning.com:80/files/GTkgWcNU8QlNTwof2Woyw-DhKG2OL2gpvbWlOyDylLp3RzjdBDQ1aeKU0l30B9I5dpnZvmy6erQXHKFXLzc*zz4*px*s9x9b/229201660714PM.bmp?width=721\" width=\"721\"/>](http://api.ning.com:80/files/GTkgWcNU8QlNTwof2Woyw-DhKG2OL2gpvbWlOyDylLp3RzjdBDQ1aeKU0l30B9I5dpnZvmy6erQXHKFXLzc*zz4*px*s9x9b/229201660714PM.bmp)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThis makes it possible to embed IES data inside a GrassHopper file, thus doing away with the need for connecting to a file on a local drive.\n\n\n\n2. I created a new component called Honeybee_IES Project which does the following:\n\n\n\n[<img class=\"align-left\" src=\"http://api.ning.com:80/files/GTkgWcNU8QnUS2U9Sn*1Ht-tVT0QDwZZ3gxDl7N6Llx9RUEA9MjSEgRG6fqbljHGC0pt-Aa3A-2V3PFgO3OzCLYEPTrq7ULo/229201661346PM.bmp?width=500\" width=\"500\"/>](http://api.ning.com:80/files/GTkgWcNU8QnUS2U9Sn*1Ht-tVT0QDwZZ3gxDl7N6Llx9RUEA9MjSEgRG6fqbljHGC0pt-Aa3A-2V3PFgO3OzCLYEPTrq7ULo/229201661346PM.bmp)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n1. It consolidates all the electric lighting RAD files for a simulation in one place. The single radFilePaths output from the component can be connected to the daylight simulation instead of connecting individual radFilePath outputs from every luminaire.\n\n2. It creates a BOQ and luminaire schedule for all the luminaires used in the simulation. The schedule can either be viewed in a Grasshopper text panel or exported as excel.\n\nThe values for LLF, Candela Multiplier and Lamp Depreciation factor are printed out for each luminaire.\n\n[<img class=\"align-left\" src=\"http://api.ning.com:80/files/GTkgWcNU8QlLX3*OAELWxnTU9ECfBt25Uq8-CJUsrbZTA0dvRpwvfzL-JjtlfbJul*0ibq7PAyOgM-6uy-tYCS3vhB-ruGlt/229201662011PM.bmp?width=721\" width=\"721\"/>](http://api.ning.com:80/files/GTkgWcNU8QlLX3*OAELWxnTU9ECfBt25Uq8-CJUsrbZTA0dvRpwvfzL-JjtlfbJul*0ibq7PAyOgM-6uy-tYCS3vhB-ruGlt/229201662011PM.bmp)\n\n\n\n\n\n\n\n\n\nThe effect of the multipliers on power consumption can be seen in the BOQ in the Total Power column:\n\n[<img class=\"align-left\" src=\"http://api.ning.com:80/files/GTkgWcNU8Qkv4ukPAZGNoI*Rqs7O8PlQ1oTn29YrL1IUv6eBLxhoYoxjq7bNL3NstVsz2Alh6RSm6DPrkWpzKxfLuZiExmbh/229201662424PM.bmp?width=600\" width=\"600\"/>](http://api.ning.com:80/files/GTkgWcNU8Qkv4ukPAZGNoI*Rqs7O8PlQ1oTn29YrL1IUv6eBLxhoYoxjq7bNL3NstVsz2Alh6RSm6DPrkWpzKxfLuZiExmbh/229201662424PM.bmp)\n\n\n\n\n\n\n\n\n\nAdding lumens to the output will be minor fix. I will update that within a few days.\n\n\n\nI think the point-grid for the photometric and peak candela display are a great idea. I will add that functionality within a couple of weeks.\n\n\n\nAre you implying the inclusion Type B photometry by \"support for all ies file types\" ? If so, that has been on my to-do list for a while. It might, however, be a while before I can get to it as it would require writing a convertor from Type C to Type B so that it can be visualized as a photometric mesh inside the Rhino viewport. I think the hackish way to get Type B photometry to work in Honeybee is to first convert the Type B photometry to Type C using something like the Photometric Toolbox.\n\n\n\nFinally, the electric lighting components were initially written as a hack and they are still pretty much work-in-progress. I agree that calling the simulation a lighting simulation and adding separate inputs for electric lights would be a cleaner way of approaching these simulations. Mostapaha and I weren't sure of the traction that these new features might get. Based on the feedback received we will be simplifying and enhancing these components and the workflow to do electric lighting simulations.\n\n\n\n(PS: Although I have heard a lot about Accelerad, due to the lack of compatible resources, I have never run a gpu-based simulation myself. I am not sure if Nathaniel requires additional flags or information to run Radiance simulations through Accelerad. If not, it should be possible to use files written through Honeybee to run Accelerad simulations. I will defer to Mostapha on the possibility of incorporating Accelerad in the Honeybee project).\n\n\n\n\n\n\n\n\n\n\n", "attachments": [], "created_by_name": "Sarith Subramaniam", "created_at": "February 29, 2016 at 4:53pm", "created_by": "sarith", "replies": []}, {"body": "\nGuys- \n\ngreat work! will check out the new IES_project component - i'm running some first real-project tests right now. so far i also found that if i path to an ies file, the file name can't have spaces (duh). but being able to link in how you suggest would obviously solve this issue.\n\n\n\nyou are correct about the Type 2 ies - we've run into this problem a few times, and yes, we typically transform in photometric toolbox. it's just a pain. if it's on your to-do list, then awesome. \n\nA few new comments:\n\n\n\nMore generally, i'm not totally sure how we'll use this yet - in the office we've been transitioning from AGI to using iray in 3ds max (for some people quicker than others), which obviously puts out much higher quality renderings than radiance. but i think for more analytical studies this will, for me at least, be a total game-changer, and totally replace AGI. I also think it'll be a great replacement for photometric toolbox for photometric analysis. But if you're looking for further capabilities to add, AGI is a good place to start.\n\n\n\ni'll keep a running log of issues/ideas as i find them and keep you posted. \n\n\n\nthanks a ton\n\ndan\n\n\n", "attachments": [], "created_by_name": "Dan Weissman", "created_at": "March 3, 2016 at 9:08am", "created_by": "DanWeissman", "replies": []}, {"body": "\nYou can find a related discussion and a relevant Grasshopper file here: [https://github.com/mostaphaRoudsari/Honeybee/pull/485](https://github.com/mostaphaRoudsari/Honeybee/pull/485)\n", "attachments": [], "created_by_name": "Sarith Subramaniam", "created_at": "February 29, 2016 at 4:56pm", "created_by": "sarith", "replies": []}, {"body": "\nHi Dan and Sarith,\n\nIf we can solve the licensing issues for distributing Accelerad libraries then it's pretty easy to do so. Currently the license is just for a single user. I briefly talked to Nathaniel about this at the Radiance workshop last year. If they change the licensing then we can think about adding it as an option. You may want to get in touch with Nathaniel and ask if there has been any changes about the licensing.\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "February 29, 2016 at 5:00pm", "created_by": "MostaphaSadeghipour", "replies": []}]}, {"body": "\nHello everyone, I am having a look at the new IES luminaire components. I was wondering whether it would be possible to input a different multiplier for each value in the candela table. In this way one can control the luminaire web shape through other grasshopper parameters (I.E: on a given spatial coordinate lighting will be omnidirectional, on another it will be a directional spotlight).\n", "attachments": [], "created_by_name": "Pietro Florio", "created_at": "April 26, 2016 at 8:42am", "created_by": "PietroFlorio", "replies": [{"body": "\n[see reply here](http://www.grasshopper3d.com/group/ladybug/forum/topics/ies-candela-tables?commentId=2985220%3AComment%3A1517420&amp;xg_source=msg_com_gr_forum)\n", "attachments": [], "created_by_name": "Pietro Florio", "created_at": "April 27, 2016 at 2:58am", "created_by": "PietroFlorio", "replies": []}]}, {"body": "\nHi Sarith , \n\nI'm trying to learn how to use electrical lighting component of HB , all the steps are like your file but the illuminance is zero . So , If you don't mind,  tell me what my file is missing !!! and I'd like to know a good website to download IES files from .\n\nThank you ,\n\nMona Rezk  \n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1579938", "name": "mona trail.gh"}], "created_by_name": "mona rezk", "created_at": "August 10, 2016 at 5:33pm", "created_by": "monarezk", "replies": []}], "id": "1438108"}