{"body": "\nHello!\n\nI have a quick question concerning the view analysis component.\n\nWhen I input a list of BREPS in the _geometry plug, are they also taken into account as obstacles to the view? or should I add them to the context_ plug?\n\nIn practice: if I input some building façades in _geometry, _viewpoints can see through façades as if they were transparent when the same façades are not in the context_ plug?\n\n\n\nIn other words: _geometry can block view rays to other sensors on the same _geometry?\n\n\n\nThank you for your answer. Hope it was clear enough\n\nPietro\n", "attachments": [], "created_by_name": "Pietro Florio", "created_at": "January 21, 2016 at 9:00am", "created_by": "PietroFlorio", "topic": "view analysis component on Ladybug", "replies": [{"body": "\nHi Pietro,\n\nThe short answer is yes. In all Ladybug analysis components geometry will block view rays. You need to remove the transparent parts of the geometry before connecting them to the component.\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "January 21, 2016 at 9:03am", "created_by": "MostaphaSadeghipour", "replies": [{"body": "\nThank you very much Mostapha :)\n", "attachments": [], "created_by_name": "Pietro Florio", "created_at": "January 21, 2016 at 9:27am", "created_by": "PietroFlorio", "replies": []}, {"body": "\nPietro,\n\nI just wanted to add that, for the view component of the last stable release and all typical uses of the view component into the future, the _geometry will block the view as Mostapha states.  However, there were two new capabilities that I recently added into the component where I realized you usually do not want the geometry to block the view and so I do not have this _geometry block the view.\n\nThese cases are 'spherical view' and 'horizontal 60 degree cone of vision' which are used primarily for indoor studies when you are trying to maximize overall view to the outdoors (as opposed to view towards a given destination object for which you would use a series of points).  In these two cases of spherical and cone of vision, your _geometry is usually the plane of vision and so you do not want this plane to block the view.\n\nMy comment here will be more relevant after the next stable release.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "January 21, 2016 at 12:28pm", "created_by": "ChrisMackey", "replies": []}]}]}