{"body": "\nHi, everyone.\n\n\n\nIm trying to verify solar radiation of ground surface which is reflected from the other buildings with \"Run Daylight Simulation\" component and \"annualSimulation\" component.\n\n\n\nTo analyze reflected solar radiation, I wanna isolate direct radiation from total radiation.\n\n\n\nI tried to modify the epw file.\n\nI changed numerical values of Global Horizontal Radiation when there is no Diffuse Horizontal Radiation, and inputed zero into Diffuse Horizontal Radiation value.\n\nBut the result was all zero.\n\n\n\nI used following formula.\n\nGlobal Horizontal Radiation(Direct Horizontal Radiation) = Direct Normal Radiation*sin(solar altitude)\n\n\n\nPlease let me know how to evaluate only direct radiation.\n\n\n\nthanks.\n", "attachments": [], "created_by_name": "natchan", "created_at": "January 22, 2016 at 8:32am", "created_by": "natchan", "topic": "How to evaluate direct radiation", "replies": [{"body": "\nI'm not sure if you're trying to find the direct radiation as the title of your question says or the amount which is reflected from other buildings which is what I understand from the first paragraph.\n\nIn any case, if you apply a fully black material to buildings and set ab to 0 then you will get only direct radiation as radiance won't calculate any of the ambient bounces.\n\nNow you can subtract the values of the analysis with normal setting from this one to find the reflected values.\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "January 23, 2016 at 6:12pm", "created_by": "MostaphaSadeghipour", "replies": [{"body": "\nHi, Mostapha Sadeghipour Roudsari.\n\n\n\nThank you for your reply.\n\nAnd I'm sorry for my poor English.\n\n\n\nI meaned \" direct radiation \" for \" direct solar radiation\".\n\nI would like to exclude Diffuse Horizontal Radiation(from sky) from Global Horizontal Radiation.\n", "attachments": [], "created_by_name": "natchan", "created_at": "January 24, 2016 at 11:13pm", "created_by": "natchan", "replies": []}, {"body": "\nHi natchan,\n\nI'm not sure how to do this with Daysim. It created the sky separately for direct sun locations.\n\nYou can do this with Radiance's 3-Phase method and gendaymtx which is not implemented in Honeybee.\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "February 5, 2016 at 10:49pm", "created_by": "MostaphaSadeghipour", "replies": []}]}]}