{"body": "\nHey everyone,\n\n\n\nI've run into a problem with a few components where I get an error saying: \"You need a newer version of Honeybee to use this component, and if you already have updated Honeybee then delete the component and try to drag it back into the canvas.\" \n\n\n\nI've already tried to update through the \"update Honeybee\" component, checking the Food4Rhino website if the versions is up to date, replace the faulty components as well as restarting the program. But nothing has worked so far. \n\n\n\nI've noticed problems with following components:\n\nHoneybee_Decompose EP Material\n\nHoneybee_Immport IDF\n\n\n\nAny ideas to what might cause this error?\n\n\n\nThank you for your help :)\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1445661", "name": "M0018131-32.gh"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1445662", "name": "Decompose EP Material.jpg"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1445663", "name": "Import IDF.jpg"}], "created_by_name": "Nickolaj Feldt Jensen", "created_at": "January 23, 2016 at 9:37am", "created_by": "NickolajFeldtJensen", "topic": "Error: You need a newer version of Honeybee to use this component", "replies": [{"body": "\nHi Nickolaj,\n\nI understand that it can be confusing and we have discussed this a couple of times to find a better solution but so far we couldn't find any.\n\nHoneybee+Ladybug has two releases. One is the last stable release that you can download form food4Rhino and the other one is the development version which is the one that you can download from github.\n\nWhen you're using Update components from Grasshopper and set updateAllUserObjects to True it updates user-objects on your system to be the same as the ones in github but it doesn't do that for your files which means if you have a file which you created before it will have the older components.\n\nEvery version of Ladybug+Honeybee will work with the components from the same version but when we are adding or modifying the new components some of them would only work with the newer version of the development [and that's the warning that you get].\n\nYou're probably thinking how does it happen while you have updated all your userobjects? It's because the old Honeybee_honeybee components are still in your files. When you open one of the old files the honeybee_honeybee component from the old file overwrites the newer version. Hence when you drop an updated component from the tab into the canvas it gives you the warning that you need a newer version of Honeybee to fly. To solve the issue delete the old honeybee_honeybee from the file, and drop a new one from the Honeybee tab. Now reconnect the input to the component with the warning and you will see that it will work fine.\n\nOne of the possible issues with this approach is that the next time that you open the file you'll see all the components are orange and asking you to let the Honeybee fly. That's happening because you have inserted the Honeybee component later into the document and Grasshopper execute it after it executes the other component. To avoid this issue select Honeybee_honeybee component and press ctrl + B after you insert it into the canvas so it will be sent to the Back and will be executed first when you open the file.\n\n\n\nI hope it helps,\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "January 23, 2016 at 9:29pm", "created_by": "MostaphaSadeghipour", "replies": []}]}