{"body": "\nHello everyone,\n\n\n\nI am about to run a parametric study with around 1800 states. For each of those states several building performance parameters will be calculated (mainly daylight metrics within the buildings and outdoor comofort and shade in the outdoors).\n\n\n\nI mean to use pollination in order to quickly sort through the results afterward. However, I have never used it before and I was wondering if there is an example definition laying around. It would be very helpful into getting me started.\n\n\n\nAnother thing I was wondering about is structuring the results. My main parameters in the study are angles of orientation for either the total massing or the individual rotation angles for the buildings. Would it be possible to structure the results in a way that you can browse through all results of individual rotation angles for one of the available massing orientation angles (see below)? Is that a matter of proper structuring my parameters before I link them to Pollination? Or is that already handled by simply linking my parameters in?\n\n\n\ne.g.\n\n\n\n                                         \n\n                                               Building 1 angle: 5    Building 2 angle: 0\n\n                                               Building 1 angle: 10  Building 2 angle: 0\n\n Orientation angle: 45                  Building 1 angle: 15  Building 2 angle: 0\n\n                                               Building 1 angle: 20  Building 2 angle: 0\n\n                                               etc.\n\n\n\nThanks a lot in advance!\n\n\n\nKind regards,\n\nTheodore.\n\n\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "January 25, 2016 at 7:48pm", "created_by": "TheodorosGalanos", "topic": "Pollination for HB/LB", "replies": [{"body": "\nPlease disregard the above. I finished one round of the expirement and the data are structured and displayed nicely. In any case, I would think it would be a simple matter of running the experiments segregated.\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "January 26, 2016 at 6:54pm", "created_by": "TheodorosGalanos", "replies": [{"body": "\nHi Theodoros,\n\n\n\nI myself am interested in using pollination to have a look at my results but cannot for the life of me understand how the component works to set out all the data. I am using the parametric slider \"Ladybug_fly!\" to generate some idf files, and the batch writer to create batches to run in parallel. However, bringing the data back in and then using pollination to summarise it all is slipping past me for whatever reason.\n\n\n\nAre you able to provide your file for me to see how you have done it, or go over my own and show me how it should be done?\n\n\n\nKind Regards\n\nElly\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1447702", "name": "Workflow_Forum.gh"}], "created_by_name": "Elzine Braasch", "created_at": "January 26, 2016 at 7:24pm", "created_by": "ElzineBraasch", "replies": []}, {"body": "\nHi Elly,\n\n\n\nYes it was hard for me to get it running as well. The trick was to bring all the values (even the name of the variables in data recorders) and to use text split to update the values used at each iteration.\n\n\n\nI'm currently running a simulation so I cannot clean up my file but you should be able to discern how it works. Special attention to the pollination part (bottom right) and also the text split component (which is crucial in making slider values into iterative parameters) right by the slider section on the left.\n\n\n\nFor anyone interested, what it does is calculate the vertical sky cover of an urban canyon by rotating it around the y axis (what I call massing orientation) and also rotating each of the buildings individually (left or right building rotation). The massing rotation interval is 15 degrees and the building interval is 5 degrees, with a maximum of 40. This gives 1944 possible configurations which are further reduced by assigning a minimum distance between the two buildings of 6m. The check of that distance is a boolean (true or false) and acts as the toggle that starts the simulation. Finally, the simulation is of vertical sky cover which is the fastest one for testing and fits my needs.\n\n\n\nP.S.: I realize calculating VSC of this configuration for all 360 degrees doesn't make much sense but it's the ability of the definition to test this atm that matters and not the results.\n\n\n\nHope this helps!\n\n\n\nKind regards,\n\nTheodore.\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1447781", "name": "TG_UrbanCanyon.gh"}], "created_by_name": "Theodoros Galanos", "created_at": "January 26, 2016 at 7:46pm", "created_by": "TheodorosGalanos", "replies": []}, {"body": "\nHi Theodoros,\n\n\n\nThank you, I'll have a look through and see if I have any further questions.\n\n\n\nYour project sounds very interesting though, reminds me of a Master's thesis finished last year which worked with orientations, daylight penetration and the minimum amount of distance required between buildings for effect daylight penetration (Tavis Creswell-Wells' \"Urban Form and Passive Design for High Performance Buildings in the Christchurch Rebuild\" if you're curious)\n\nKind Regards\n\nElly\n", "attachments": [], "created_by_name": "Elzine Braasch", "created_at": "January 26, 2016 at 7:53pm", "created_by": "ElzineBraasch", "replies": []}, {"body": "\nHi Elly,\n\n\n\nThanks for the reference, I'll check it out! Actually, that is my next step, doing Daylight assessment of interior in the buildings and outdoor comfort maps using Chris's excellent work. I'm thinking to use DF (and also use it for light penetrration), DA/UDI, and maybe solar envelope analysis. However, I am intending to reduce the alternatives by a lot given the time required for daylight simulations. Also, I will calculate VSC on window surfaces as a criterion. Final step would be CFD of site configuarations (having multiple batches of buildings).\n\n\n\nKind regards,\n\nTheodore.\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "January 26, 2016 at 8:58pm", "created_by": "TheodorosGalanos", "replies": []}, {"body": "\nYes daylight simulations are a real consumer of time, it takes a shocking hour for a full annual simulation run for my small like shoebox model, though mind you it is on the highest quality setting for the recipe.\n\n\n\nI would be interested to see how you do the CFD analysis.\n\n\n\nElly\n", "attachments": [], "created_by_name": "Elzine Braasch", "created_at": "January 26, 2016 at 9:00pm", "created_by": "ElzineBraasch", "replies": []}, {"body": "\nYes,\n\n\n\nWell I am going to be very cheap on the quality side :) Probably medium to high grids as well. Quality will increase when alternatives are narrowed down.\n\n\n\nI will use OpenFoam to do the CFD studies, this is a quite typical wind tunnel model, quite straightforward to formulate. I can share my case folder if you're interested.\n\n\n\nHopefully, in the near future we will have Butterfly ([https://github.com/mostaphaRoudsari/Butterfly](https://github.com/mostaphaRoudsari/Butterfly)) up and running in order to integrate CFD in the parametric design process, which would really transform CFD assessments!\n\n\n\nTheodore.\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "January 26, 2016 at 9:06pm", "created_by": "TheodorosGalanos", "replies": []}, {"body": "\nIndeed, butterfly has been on our radar for a while now. We have several students here interested in exploring more options for making CFD quicker and easier to use.\n\n\n\nQuestion about pollination, is there a format I am missing to name the iterations? I am finding your data recorder to work well in recording the objectives (though its annoying not being able to run things in parallel due to it), but I notice that Mostapha's example in pollination has the iteration names on the side. Do you use a \"name:\" convention or something? (simulations are running at the moment so I can't check)..\n\n\n\nNevermind I'm drawing a mere, think by looking at it it just seems to be needed as the first row.\n", "attachments": [], "created_by_name": "Elzine Braasch", "created_at": "January 26, 2016 at 9:28pm", "created_by": "ElzineBraasch", "replies": []}, {"body": "\nSorry it is still running here as well and can't open the file.\n\n\n\nI believe I'm concatenating to create their names, typical MassingOrientation_XX_LeftBuildingAngle_XX_RightBuildingAngle_XX if i'm not mistaken.\n\n\n\nThe component is close to the simulation component because it also assings the same name on the layer on which the result are baked.\n\n\n\nBtw, if you are running my definition I should warn you it will take around 4 hours. Haven't found a way to cancel fly component but the task manager will do (and actually you can still open the .csv in pollination after).\n\n\n\nI am guessing that by parallel you mean two different simulations. I haven't tried that yet. Wouldn't just adding another set of recorders connected to the second simulation output work? Not sure though can't check yet.\n\n\n\nTheodore.\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "January 26, 2016 at 9:40pm", "created_by": "TheodorosGalanos", "replies": []}, {"body": "\nIn parallel, you run the fly slider to only make a series of idfs, rather than running them (similar to the rad files). You would then use the Re-run idf component to take the idf files and generate batch files, which then you can use a python script component to run the batch files in parallel.\n\nI've included the bit in my workflow if you are curious. Essentially it means that E+ is running several simulations rather than one, and because grasshopper works in real time, it wouldn't be possible to record the data as the simulations are running in parallel to each other.\n\n\n\nI am wondering if you have a solution to this though, I just connected two sliders to the fly component to see how the pollinator recorders might work, and one of the sliders doesn't cycle through the same amount of times as the other, causing a mismatch of the recorded data. Not sure if I am doing them wrong, or if there is a simple fix?\n\n\n\nPS. No i havn't attempted to run yours, I think I can peice everything together within it\n\n\n\n- Elly\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1447981", "name": "Workflow_Forum.gh"}], "created_by_name": "Elzine Braasch", "created_at": "January 26, 2016 at 9:49pm", "created_by": "ElzineBraasch", "replies": []}, {"body": "\nHmm can't check yet, my simulation is almost over though. I downloaded and will open soon. Your process sounds quite impressive, thanks for sharing!\n\n\n\nConcerning the fly component, it should run all the possible iterations, barring any conditions you might have set (like my condition of minimum distance). Is the number the fly component reporting once you click it what you would normally expect? Perhaps there's something else going on.\n\nTheodore.\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "January 26, 2016 at 10:39pm", "created_by": "TheodorosGalanos", "replies": []}, {"body": "\nOne other thing that could work is to use pollination as a post process tool.\n\n\n\nWhat if you could create another automation process of not running energy simulations but instead opening them after they are finished, ony-by-one, from their respective folders, loading their results with the zone/surface components and then recording those results with pollination.\n\n\n\nJust thinking out loud, haven't tried to design it. Seems like a waste to use it after the fact and I'm sure someone can think of a more elegant solution but it could still save you a lot of post processing time.\n\n\n\nTheodore\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "January 26, 2016 at 10:44pm", "created_by": "TheodorosGalanos", "replies": []}]}]}