{"body": "\nIt seems that the indoor view factor calculator will take a long time to \"settle down\" every time a new input is connected to it even if the component is not set to \"runit\".\n\n\n\nMay I ask why this is the case? and how to speed up the set up of inputs for this component?\n\n\n\nThank you!\n", "attachments": [], "created_by_name": "Grasshope", "created_at": "January 27, 2016 at 9:23am", "created_by": "Grasshope", "topic": "\"indoor view factor calculator\" takes a long time to \"settle down\" with new input conneccted", "replies": [{"body": "\nAdded to github so Chris can review: [https://github.com/mostaphaRoudsari/Honeybee/issues/475](https://github.com/mostaphaRoudsari/Honeybee/issues/475)\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "February 5, 2016 at 11:15pm", "created_by": "MostaphaSadeghipour", "replies": [{"body": "\nGrasshope,\n\nSorry for the incredibly late reply.  The indoor view factor component performs two main operations, each of which is computationally intensive enough to take at least a second or two.\n\nThe first is the building of the mesh and the extraction of test points from this (including checks to see which zone the points lie inside or if they are outdoors).\n\nThe second is the actual calculation of view factors by projecting out many rays from the points to see how many hit the respective surfaces.\n\nEach of these operations has a separate boolean input on the component and I did this in case you want to see what your mesh looks like but do not want to run the more intensive view factor calculation)  I usually recommend setting the same boolean to both of these inputs as you see below:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/Xi0CdRBbqOWOFC34l7dhoFj7aZJ1UtCK91TPIEmC3iSu1EOU966W0KafTWzY4MddN*NJjlrMMIjidET0inEggYYV3zbTUK2J/ViewFactorComponent.JPG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/Xi0CdRBbqOWOFC34l7dhoFj7aZJ1UtCK91TPIEmC3iSu1EOU966W0KafTWzY4MddN*NJjlrMMIjidET0inEggYYV3zbTUK2J/ViewFactorComponent.JPG)\n\nThis way, you will not get the component 'settling down' after you make a change if you set this single boolean to 'False'.  You will also notice in this image that the readMe gives a short report about the amount of time that each operation took so that you can get a sense of what is happening in the component.\n\n\n\nI had considered having both the build mesh and view factor operations being controlled by the same '_runIt' boolean but the separation of these two has been helpful in a number of cases to me.  I feel that others will appreciate it too if they understand how to use it.\n\n\n\nLet me know if this makes sense or if you would suggest any changes to make it more intuitve.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "February 16, 2016 at 7:51am", "created_by": "ChrisMackey", "replies": []}]}], "id": "1448265"}