{"body": "\nIt seems the result of PMV calculator is different from that got from the CBE thermal comfort tool.\n\n\n\nI recall that the PMV calculator component is using the same code as the CBE tool for calculation. Then, why is this discrepancy?\n\n\n\nAppreciate your advice!\n\n\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/UjLFZWxAkgpURprBxZvrpKZvAcSfq2QCxsPDO1xHVkypluX5cbKkXZYd2E5y8m33kO9Sdh1VyPV2iRasmhjlSuNL-2GhW9YI/4.JPG?width=750\" width=\"750\"/>](http://api.ning.com:80/files/UjLFZWxAkgpURprBxZvrpKZvAcSfq2QCxsPDO1xHVkypluX5cbKkXZYd2E5y8m33kO9Sdh1VyPV2iRasmhjlSuNL-2GhW9YI/4.JPG)\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/UjLFZWxAkgoxjzIWolEeTV9xqQkXUJvnX6dwi9v7Mc9C-BL4aPZzFJ2ZVe2nLHH6vnchXi1e4V1y5FEn-JjkyrMmqDN1f5Ch/5.JPG?width=750\" width=\"750\"/>](http://api.ning.com:80/files/UjLFZWxAkgoxjzIWolEeTV9xqQkXUJvnX6dwi9v7Mc9C-BL4aPZzFJ2ZVe2nLHH6vnchXi1e4V1y5FEn-JjkyrMmqDN1f5Ch/5.JPG)\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1448574", "name": "PMV.gh"}], "created_by_name": "Grasshope", "created_at": "January 28, 2016 at 12:41am", "created_by": "Grasshope", "topic": "[clarified] result of PMV calculator is different from that of CBE Thermal Comfort Tool", "replies": [{"body": "\nAccording to the **comfort_models.py** source code on:\n\n[https://github.com/CenterForTheBuiltEnvironment/comfort_tool/blob/m...](https://github.com/CenterForTheBuiltEnvironment/comfort_tool/blob/master/contrib/comfort_models.py)\n\n\n\n... the output for:\n\nprint comfPMV(27.5, 27.37, 0.18, 61.14, 1, 0.3, 0)\n\n... is:\n\n[-0.059644171197520995, 5.073652266813937]<br/><br/>\n\n... and the output of\n\nprint comfPMVElevatedAirspeed(27.5, 27.37, 0.18, 61.14, 1, 0.3, 0)\n\n... is:\n\n[-0.14102300772003976, 5.412044629473883, 24.866353217014876, 26.82930735799878, 0.6706926420012209]<br/><br/>\n\nSo, now we have a group of different PMV values calculated from different methods for the same input variables:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/UjLFZWxAkgoBo*7dqPFkUV-BHgVq7fya9lg7nBTkVWsH3SrFJE-*AkSL2S4PSX9isVnfsH2RIjC6XCtSoOXulOl29JBMPqxb/6.JPG\" width=\"581\"/>](http://api.ning.com:80/files/UjLFZWxAkgoBo*7dqPFkUV-BHgVq7fya9lg7nBTkVWsH3SrFJE-*AkSL2S4PSX9isVnfsH2RIjC6XCtSoOXulOl29JBMPqxb/6.JPG)\n\nI'm quite confused here, and not sure what's causing the difference and which one is the correct one...\n\n\n\nAppreciate your advice!\n\n\n\nThanks!\n", "attachments": [], "created_by_name": "Grasshope", "created_at": "January 28, 2016 at 1:18am", "created_by": "Grasshope", "replies": [{"body": "\nMaybe i'm missing something here from your explanation, but the results table looks completely similar for me.\n\nAre you worried because -0.0988 is different from 0.03? They are the same (not even 1%). Also SET values are the same. The differences can be caused because the round function or any other similar reason.\n\nFrom what you sent i find a very good correlation between the tools!!\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "January 28, 2016 at 1:38am", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nThanks, Abraham!\n\n\n\nThe main difference I see is the difference in sign of the values, i.e. negative value indicate a cool feeling and positive value indicates a warm feeling, which is quite different conceptually in thermal comfort study...\n\n\n\nThe value \"-0.141\" is about 42% \"smaller\" than \"-0.0988\", so the value difference between them is not small...\n\n\n\nIf we have different results, such as -0.55 and 0.49, for the same inputs, how do we determine if it is within the neutral zone? and if such instance accumulate in large scale survey, the conclusions will be problematic.\n\n\n\nBottom line: if the same algorithm is applied for the code of the methods mentioned above, why the results are not that \"similar\" in terms of absolute value and the sign of the value?\n", "attachments": [], "created_by_name": "Grasshope", "created_at": "January 28, 2016 at 2:05am", "created_by": "Grasshope", "replies": []}, {"body": "\nI think you are wrong saying that the % difference between values is what is making the result more or les reliable. Take the result as is. -0.141 and -0.0988 is not even a 1% of the significance of the result. You are looking for PMV (or any other for that matter), you have to compare in relation to the possible values on this measuring scale and not in relation to the values obtained. At least not in the range of values you get. A difference of 1-2% can be acceptable, because of the reasons i mentioned before.\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "January 28, 2016 at 2:23am", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nGrasshope,\n\n<br/>While I am glad that you have posted this discussion, it is not a critical error and thank you, Abraham, for making this clear. The ever-so-slight difference in PMV was resulting from Ladybug's use of the CBE code from a year ago, which used a 'still air threshold' of 0.15 m/s. The CBE group seems to have recently changed this variable to be 0.1 m/s ([https://github.com/CenterForTheBuiltEnvironment/comfort_tool/blob/m...](https://github.com/CenterForTheBuiltEnvironment/comfort_tool/blob/master/static/js/comfortmodels.js#L100)).<br/>The 'still air threshold' is the air speed that is used to determine whether to use the original Fanger PMV model (which was developed with climate chamber surveys at low air speeds) or attempt to compute a 'cooling effect' from increased wind speed by running iterations of this PMV model until the results align with the SET calculation. As I understand it, the still air threshold is not a part of any building code and (like many of the coefficients and terms in the PMV model) it's a fairly subjective value that is there to make the comfort models align with each other or align with climate chamber survey data. I don't know what prompted the CBE group to change this value but this example points to a larger issue with PMV, which is something that I WOULD deem 'critical' in a broader scientific research sense.<br/>Namely, we should be much more concerned about whether PMV is a good predictor of real-world occupant comfort votes than we should be concerned about getting all of our coefficients of our theoretical comfort models to be the same. For example, the real-world occupant surveys that were used to build the Adaptive comfort model found PMV to be more poorly correlated to occupant comfort votes than the simple operative temperature (or globe temperature). You can see the R2 values of these metrics to comfort votes on page 106 of this [very comprehensive book](https://books.google.com/books?id=lOZzCgAAQBAJ&amp;printsec=frontcover&amp;dq=Adaptive+thermal+comfort&amp;hl=en&amp;sa=X&amp;ved=0ahUKEwjr08y7hdDKAhWHGh4KHWNGAx8Q6AEIIzAB#v=onepage&amp;q=Adaptive%20thermal%20comfort&amp;f=false).\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/zOUTc6Nq2HNF-me67sEpt7wP68hsh9n-SG4GT6wCLirfpfazbedH6hYDvCIvGNrx8yilcvf4wLtzpUZJeTLXXtcLj3sj05CX/CorrelationsofThermalMetrics.jpg?width=721\" width=\"721\"/>](http://api.ning.com:80/files/zOUTc6Nq2HNF-me67sEpt7wP68hsh9n-SG4GT6wCLirfpfazbedH6hYDvCIvGNrx8yilcvf4wLtzpUZJeTLXXtcLj3sj05CX/CorrelationsofThermalMetrics.jpg)\n\nSo, if we are going to debate the accuracy of PMV calculations, I would much rather have us discuss this deeper, systemic issue of the PMV methodology as it relates to real people in real buildings.  Or, if we are going to talk about differences of decimal places and subjective coefficients, let us couch the issue within the broader question of PMV's accuracy.\n\n\n\nAll of this said, I have [amended the ladybug code](https://github.com/mostaphaRoudsari/ladybug/commit/588524d5cdb45ce27dae45e3e6d735d0b14dc52d) to align with the most recent CBE code so that you now get matching values between the two. I hope this helps and thank you both for starting the discussion.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "January 29, 2016 at 3:52pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nThanks Chris for your thorough response.\n\nAnother question can be the fitness of ANY comfort system/approach/scale to different local conditions (climatic, cultural, ...). Many of those systems were developed for locations where research was/is done (US for this matter). So what happens when those results are adopted to places where different cultures/behaviour/etc are much different from the original.\n\nThis is a different range of question, but just wanted to make notice of it.\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "January 29, 2016 at 9:48pm", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nThank you very much, Chris and Abraham, for the detailed clarification!\n\n\n\nI understand the that there are discussions among researchers about the utility of PMV model as compared to the adaptive model, especially for non air conditioned, naturally ventilated space.\n\n\n\nOur own thermal comfort survey in tropical context also indicate that:\n\n1) people felling thermally neutral (thermal sensation vote = 0) tend to be predicted as feeling slightly warm as indicated by PMV value calculated, and\n\n2) the adaptive model (ASHRAE 2013 ) seems to provide a close predication on percentage of people feeling thermally neutral than that indicated according to the PMV values calculated, comparing to the percentage based on people's actual thermal sensation vote in the context of non-AC, hybrid or naturally ventilated spaces.\n\n\n\nNevertheless, I think only through continuous empirical study can we further validate which model is more appropriate under certain climatic context.\n\n\n\nThank you, too, for revising the PMV component!\n\n\n\nCheers!\n", "attachments": [], "created_by_name": "Grasshope", "created_at": "January 29, 2016 at 10:20pm", "created_by": "Grasshope", "replies": []}]}, {"body": "\nHello everyone,\n\n\n\nThis is a very interesting discussion, even though it started with a mathematical discrepancy.\n\n\n\nTo add to what you were saying I can convey my experiences from Malaysia, the tropics.\n\n\n\nMost indoor spaces in Malaysia are indeed pretty close to what we call a chamber. By that I don't obviously mean they are actually air-conditioned chambers but mechanically conditioned buildings with no operable openings (this is the norm in the tropics unfortunately).\n\n\n\nThere are of course limited areas where a mix of spaces exists, consisting of NV corridors and atria intermingled with air conditioned shop lots (as in the case of big malls for example). To add to this complexity, as Abraham mentioned, there are distinct cultural differences in people's norms, routines, and behaviors which have concrete, material results that impact thermal comfort (e.g. clothing where one part of the population is heavily clothed while the other is in opposite lightly clothed). To make things even worse, I have personally witnessed on a daily basis a very interesting result of the thermal comfort study Chris linked, that people in the tropics prefer their environments to be below neutral (i.e. slightly uncomfortable, that is cold). A way for integrated thermal comfort strategies then is indeed very difficult, if not impossible under these conditions.\n\n\n\nI work a lot with building certification and in that area most of the discussion here is irrelevant. Simulations and studies that we so easily are able to perform with HB/LB (and we thank you for this) are indeed very rarely used. The typical way thermal comfort is assessed in various green building tools is a simple range of temperature and humidity that is deemed comfortable (probably extracted from the same experiments that gave us PMV).\n\n\n\nInterestingly enough it seems, at least from the table Chris posted, that the approach of using temperature (and/or humidity) might be more correct than using ranges of PMV. But what are exactly the ranges of comfort? And more importantly how can we influence these ranges? How can we finally avoid the standard approach of all practical desing methodologies that \"design for the worst case\", which results in suboptimal solutions?\n\n\n\nI have been thinking of these things for a while. I think it is a critical aspect of what I am doing even though the industry really doesn't give a damn. I have a kind of intuition that thermal comfort could be assessed and improved, at least here in the tropics, with design interventions that are neither inside (indoor climate) nor outside (outdoor conditions), but in the interface between them. I feel the impact of high gradient temperature changes to people's comfortable ranges should be properly assessed. One strategy (i.e. PMV) will probably always be suboptimal.\n\n\n\nAs a final note, perhaps another way to deal with the complexity inherent in these studies is to introduce more complexity! By that, I mean introduce adaptive comfort strategies in the buildings. In this way you have a local adaptation instead of a single (suboptimal) adaptation. But then, again in the real world, it is a challenge to convince Clients and Designers that the spaces will be indeed comfortable. That is why I think workflows like the one Chris has provided us with his research are extremely important in the 'effort to convince'. \n\n\n\nWhen I get the time I will try to contribute what little I can by making a few CFD studies analysing the impact of these 'thermal transition spaces' in buildings. But short of real-life experiments which could calibrate various assessment models (ABM anyone?) I can't think of any other way we could practically assess this. Perhaps someone already has done so? Hell, maybe it's already in the Adaptive Comfort book which I've only skimmed through?\n\n\n\nAnyways, long winded. Very nice discussion indeed. I appreciate all your experiences and expertise, they really help stimulate discussion and ideas.\n\n\n\nKind regards,\n\nTheodore.\n\n\n\n \n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "January 31, 2016 at 10:44pm", "created_by": "TheodorosGalanos", "replies": []}], "id": "1448575"}