{"body": "\n\n\nWe are all pleased to announce the public release of Ladybug 0.0.62 and Honeybee 0.0.59!  Though this release is only 4 months from our last one, there has been a flurry of activity and several new software connections built from the initial seed of the project. As always you can download the new release from [Food4Rhino](http://www.food4rhino.com/project/ladybug-honeybee?ufh). Make sure to remove the older version of Ladybug and Honeybee and update your scripts.\n\n\n\nThis release is also special since today it is just about 3 years (3 years and 2 weeks) from the first release of Ladybug. As with any release, there have been a number of bug fixes and improvements but we also have some major news this time. In no specific order and to ensure that the biggest developments do not get lost in the extensive list of updates, here are the major ones:\n\n \n\n**Mostapha is re-writing Ladybug!**\n\n**Ladybug for DynamoBIM is finally available.**\n\n**Chris made bakeIt really useful by incorporating an export pathway to PDFs and vector-based programs.**\n\n**Honeybee is now connected to THERM and the LBNL suite thanks to Chris Mackey.**\n\n**Sarith has addressed a much-desired wish for Honeybee (Hi Theodore!) by adding components to model electric lighting with Radiance.**\n\n**Djordje is on his way to making renewable energy deeply integrated with Ladybug by releasing components for modeling solar hot water.**\n\n**Last but definitely not least (in case you’re not still convinced that this release is a major one) Miguel has started a new project that brings some of Ladybug’s features directly to Rhino. We mean Rhino Rhino - A Rhino plugin! Say hi to Icarus! #surprise**\n\n \n\nBefore we forget! **Ladybug and Honeybee now have** **[official stickers](https://www.stickermule.com/user/1070709587/stickers)**. Yes! We know about T-Shirts and mugs and they will be next.  For now, you can deck-out your laptops and powerhouse simulation machines with the symbology of our collaborative software ecosystem.\n\n[<img class=\"align-center\" src=\"https://lh4.googleusercontent.com/ek9M70eDkU2Xl_ke_bkP06MhVAS9Tov0TabahDPAGmjqktAfQRzj2eBqMy-J_Gtb6HI2Iq99yOl-C444naDW2wOsW17jPsfVX6iROCbFXuMmmL3ELZSCNnDfW9P3hnk1drXOg8W3?width=529\" width=\"529\"/>](https://www.stickermule.com/user/1070709587/stickers)\n\n \n\n\n\nNow go grab a cup of tea/coffee and read the details below:\n\n\n\n**Rewriting Ladybug!**\n\nPerhaps the most far-reaching development of the last 4 months is an effort on the part of Mostapha to initiate a well structured, well documented, flexible, and extendable version of the Ladybug libraries. While such code is something that few community members will interact with directly, a well-documented library is critical for maintaining the project, adding new features, and for porting Ladybug to other software platforms.\n\n\n\nThe new Ladybug libraries are still under development across a number of [new repositories](http://github.com/ladybug-analysis-tools/) and they separate a ladybug-core, which includes epw parsing and all non-geometric functions, from interface-specific geometry libraries. This allows us to easily extend Ladybug to other platforms with a different geometry library for each platform (ie. ladybug-grasshopper, ladybug-dynamo, ladybug-web, etc) all of which are developed on top of the ladybug-core.\n\n\n\nWithout getting too technical, here is an example of a useful outcome of this development. If you want to know the number of hours that relative humidity is more than 90% for a given epw, all that you have to code (in any python interface) is the following:\n\nimport ladybug as lb\n\n_epwFile = r\"C:\\EnergyPlusV7-2-0\\WeatherData\\USA_CO_Golden-NREL.724666_TMY3.epw\"\n\nepwfile = lb.epw.EPW(_epwFile)\n\nfilteredData = epwfile.relativeHumidity.filterByConditionalStatement('x&gt;90')\n\nprint \"Number of hours with Humidity more than 90 is %d \"%len(filteredData.timeStamps)\n\n\n\nCompare that to the 500 + lines that you would have had to write previously for this operation, which were usually tied to a single interface! Now let’s see what will happen if you want to use the geometry-specific libraries. Let’s draw a sunpath in Grasshopper:\n\nimport ladybuggrasshopper.epw as epw\n\nimport ladybuggrasshopper.sunpath as sunpath\n\n# get location data form epw file\n\nlocation = epw.EPW(_epwFile).location\n\n# initiate sunpath based on location\n\nsp = sunpath.Sunpath.fromLocation(location, northAngle = 0, daylightSavingPeriod = None, basePoint =cenPt, scale = scale, sunScale = sunScale)\n\n# draw sunpath geometry\n\nsp.drawAnnualSunpath()\n\n# assign geometries to outputs\n\n...\n\n\n\nFinally we ask, how would this code will look if we wanted to make a sunpath for dynamo? Well, it will be exactly the same! Just change ladybuggrasshopper in the second line to ladybugdynamo! [Here is the code](https://github.com/ladybug-analysis-tools/ladybug-dynamo/blob/master/plugin/source/sunpath_node.py) which is creating the sunpath below.\n\n\n\n<img alt=\"sunpath.gif\" height=\"340\" src=\"https://lh5.googleusercontent.com/L2rfRAPxYM-qtxVUZqe-Ip5fdZXkERiOxDnl5I6-9e24hQuqErj0SDOTrOeWSykf8RIvcwdlrH8SDCiR5173RtFaUhGvKauGBfEVvC1Q-PLHaCETphNTdky661-9vxhMMCzK9nPp\" width=\"624\"/>\n\n\n\nWith this ease of scripting, we hope to involve more of our community members in our development and make it easy for others to use ladybug in their various preferred applications.  By the next release, we will produce an API documentation (documentation of all the ladybug classes, methods and properties that you can script with) and begin making tutorials for those interested in getting deeper into Ladybug development.\n\n \n\n**LADYBUG**\n\n**1 - Initial Release of Ladybug for Dynamo:**\n\nAs is evident from the post above, we are happy to announce the first release of Ladybug for Dynamo! You can download the ladybug package from Dynamo package manager. Make sure to download version 0.0.6 which is actually 0.0.1! It took a number of trial and errors to get it up there. Once you have the file downloaded you can watch these videos to get started:\n\n\n\n<iframe _origwidth=\"560\" frameborder=\"0\" height=\"315\" src=\"https://www.youtube.com/embed/videoseries?list=PLkjfDmSc5OryQ0FD9vUVNU6dQaIM4RPDD&amp;wmode=opaque\" width=\"560\"></iframe>\n\n\n\n\nThe source code can be find under [ladybug-dynamo repository](https://github.com/ladybug-analysis-tools/ladybug-dynamo) and (as you can already guess) it is using the new code base. It includes a very small toolkit of essential Ladybug components/nodes but it has enough to get you started. You can import weather files, draw sunpaths and run sunlighthours or radiation analyses.\n\n\n\n[There are two known issues in this release](https://github.com/ladybug-analysis-tools/ladybug-dynamo/releases/tag/0.0.1) but neither of them is critical. You need to have [Dynamo 0.9.1](http://dyn-builds-data.s3-us-west-2.amazonaws.com/DynamoReleaseCandidateInstall0.9.1.exe) or higher installed which you can download from here ([http://dynamobuilds.com/](http://dynamobuilds.com/)). **It is recommended that you run the scripts with ‘Manual’ run (as opposed to ‘Automatic’) since the more intense calculations can make Dynamo crash in automatic mode.**\n\n\n\n\n\n[<img class=\"align-center\" src=\"https://lh6.googleusercontent.com/YelrSXo4XuXghmvg-F4hQ8Lhjgcw5GNzovyTTUN2aYN4BCRQsS9mbJNJmH3D-DXxmD_MjXzjXkO2AQE-17IpKHFIZ62_Zt2tHLoL216vQZPQjxekIgGty0cjpbZydfKy2yZwY-wR?width=624\" width=\"624\"/>](https://lh6.googleusercontent.com/YelrSXo4XuXghmvg-F4hQ8Lhjgcw5GNzovyTTUN2aYN4BCRQsS9mbJNJmH3D-DXxmD_MjXzjXkO2AQE-17IpKHFIZ62_Zt2tHLoL216vQZPQjxekIgGty0cjpbZydfKy2yZwY-wR)\n\n\n\n\n\nTo put things in perspective, here is how we would map Ladybug for Dynamo vs Ladybug and Honeybee for Grasshopper on the classic  ‘Hype graph’. The good news is that what we learned a lot from the last three years, making development of the Dynamo version easier and getting us to the plateau of productivity faster.\n\n\n\n\n\n[<img class=\"align-center\" src=\"https://lh4.googleusercontent.com/6XBzmyPhW4o290HnCDOEsQIFFi_zd5OGbSeSBwwbVSTAsdap9KUXyxcMnPtVJHbVcrlBTmzsh7j_YO0YLaTDPdmQWn6u85p4vqXJT_heQ_60dESWRe8i5P2Dyiz9xHyed7dpktLC?width=624\" width=\"624\"/>](https://lh4.googleusercontent.com/6XBzmyPhW4o290HnCDOEsQIFFi_zd5OGbSeSBwwbVSTAsdap9KUXyxcMnPtVJHbVcrlBTmzsh7j_YO0YLaTDPdmQWn6u85p4vqXJT_heQ_60dESWRe8i5P2Dyiz9xHyed7dpktLC)\n\n\n\nWe should also note that the current development of the Dynamo interface is behind that of the Ladybug-Core, which means there are a number of features that are developed in the code but haven’t made their way to the nodes yet. They will be added gradually over the next month or two.\n\n\n\nIf you’re interested to get involved in the development process or have ideas for the development, follow ladybug on [Facebook](https://www.facebook.com/LadybugAnalysisTools), [Twitter](https://twitter.com/ladybug_tool) and [Github](https://github.com/ladybug-analysis-tools). We will only post major release news here. Facebook, github and twitter will be the main channels for posting the development process. There will also be a release of a new ladybug for Grasshopper soon that will use the came Ladybug-Core libraries as the Dynamo interface [Trying hard not to name it as Ladybug 2].\n\n<br/> <br/>\n\n**2 - New Project “Icarus” Provides Ladybug Capabilities Directly in Rhino**\n\nSpeaking of expanded cross-platform capabilities, the talented Miguel Rus has produced a standalone Rhino Plugin off of the original Ladybug code that has been included in this release. After writing his own core C# libraries, Miguel’s plugin enables users to produce sunpath and run sunlight hours analyses in the Rhino scene without need of opening Grasshopper or engaging the (sometimes daunting) act of visual scripting.\n\n\n\nThis release includes his initial RHP plugin file. It is hoped that Miguel’s efforts will extend some of the capabilities of environmental design to individuals who are unfamiliar with visual scripting, casting the network of our community into new territory. We need your help spreading the word about Icarus since the people who will benefit the most from it have probably not read this far into the release notes. Also, as the project is in the early stages, your feedback can make a great difference. You can download the current release from [this link](http://bit.ly/1PMbjTk).\n\n\n\nOnce you download the zip file. Right click and unblock it. Then extract the files under C:\\Program Files\\Rhinoceros 5 (64-bit)\\Plug-ins\\ folder. Drag and drop the RHP file into Rhino and you should be ready to go. You can either type Icarus in the command line or open it via the panels. Here is a short video that shows how to run a sunlighhours analysis study in Rhino.\n\n\n\n<iframe _origwidth=\"560\" frameborder=\"0\" height=\"315\" src=\"https://www.youtube.com/embed/IrN064ea4Is?wmode=opaque\" width=\"560\"></iframe>\n\n\n \n\n**3 - BakeIt Input Now Supports a Pathway to PDF +Vector Programs**\n\nAs promised in the previous release, the BakeIt_ option available on Ladybug’s visual components has been enhanced to provide a full pathway to vector-based programs (like Illustrator and Inkscape) and eases the export to vector formats like PDFs.\n\n\n\nThis means that the BakeIt_ operation now places all text in the Rhino scene as actual editable text (not meshes) and any colored meshes are output as groups of colored hatches (so that they appear as color-filled polygons in vector-based programs).  There is still an option to bake the colored geometries as light meshes (which requires smaller amounts of memory and computation time) but the new hatched capability should make it easier to incorporate Ladybug graphics in architectural drawings and documents like this [vector psychrometric chart](https://www.dropbox.com/s/ww8mliatzm5c09d/PsychChart3.pdf?dl=0).\n\n \n\n**4 - Physiological Equivalent Temperature (PET) Now Available**\n\nThanks to the efforts of Djordje Spasic, it is now possible to compute the common outdoor comfort metric ‘Physiological Equivalent Temperature’  (PET) with Ladybug.  The capability has been included with this release of “Thermal Comfort Indices” component and is supported by a “Body Characteristics” component in the Extra tab.  PET is particularly helpful for evaluating outdoor comfort at a high spatial resolution and so the next Honeybee release will include an option for PET with the microclimate map workflow.\n\n \n\n**5 - Solar Hot Water Components Available in WIP**\n\nChengchu Yan and Djordje Spasic have built a set of components that perform detailed estimates of solar hot water. The components are currently undergoing final stages of testing and are available in the WIP tab of this release. [You can read the full release notes for the components here](http://www.grasshopper3d.com/group/ladybug/forum/topics/ladybug-solar-water-heating-components-released).\n\n[<img class=\"align-center\" src=\"http://api.ning.com/files/IDNSaKSVW-IhnI6BKG1eafJNDjkWIponNAPnbfKzpF7yic*xal*sPGZrNWUiySTvA11gfdakoZn8rpt5b0wB7OrvF2wgs-wv/ladybug_solar_water_heat3b_msr.jpg\"/>](http://api.ning.com/files/IDNSaKSVW-IhnI6BKG1eafJNDjkWIponNAPnbfKzpF7yic*xal*sPGZrNWUiySTvA11gfdakoZn8rpt5b0wB7OrvF2wgs-wv/ladybug_solar_water_heat3b_msr.jpg)\n\n\n\n**6 - New Ladybug Graphic Standards**\n\nWith the parallel efforts or so many developers, we have made an effort in this release to standardize the means by which you interact with the components.  This includes warnings for missing inputs and the ability to make either icons or text appear on the components as you wish (Hi Andres!).  A full list of all graphic standards can be found [here](https://github.com/mostaphaRoudsari/ladybug/blob/master/resources/Ladybug%20Grahpic%20Standards.md).  If you have any thoughts or comments on the new standards, feel free to voice them [here](https://github.com/mostaphaRoudsari/ladybug/issues/196).\n\n \n\n**7 - Wet Bulb Temperature Now Available**\n\nThanks to [Antonello Di Nunzio](http://www.grasshopper3d.com/profile/AntonelloDiNunzio) - the newest member of the Ladybug development team, it is now possible to calculate wet bulb temperature with Ladybug.  Antonello’s component can be found under the WIP tab and takes inputs of dry bulb temperature, relative humidity, and barometric pressure.  \n\n \n\n**8 - New View Analysis Types**\n\nThe view analysis component now allows for several different view studies in addition to the previous ‘view to test points.’  These include, skyview (which is helpful for studies of outdoor micro-climate), as well as spherical view and ‘cone of vision’ view, which are helpful for indoor studies evaluating the overall visual connection to the outdoors.\n\n<br/> <br/>\n\nHONEYBEE\n\n**1 - Connection to THERM and LBNL Programs**\n\nWith this release, many of you will notice that a new tab has been added to Honeybee.  The tab “11 | THERM” includes 7 new components that enable you to export ready-to-simulate Lawrence Berkeley National Lab (LBNL) THERM files from Rhino/Grasshopper.  THERM is a 2D finite element heat flow engine that is used to evaluate the performance of wall/window construction details by simulating thermal bridging behavior.  The new Honeybee tab represents the first ever CAD plugin interface for THERM, which has been in demand since the first release of LBNL THERM several years ago.  The export workflow involves the drawing of window/wall construction details in Rhino and the assigning of materials and boundary conditions in Grasshopper to produce ready-to-simulate THERM files that allow you to bypass the limited drawing interface of THERM completely.  Additional components in the “11 | THERM” tab allow you to import the results of THERM simulations back into Grasshopper and assist with incorporating THERM results into Honeybee EnergyPlus simulations.  Finally, two components assist with a connection to LBNL WINDOW for advanced modeling of Glazing constructions.  Example files illustrating many of the capabilities of the new components can be found in there links.\n\n[THERM_Export_Workflow](http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;fork=hydra_2&amp;id=THERM_Export_Workflow), [THERM_Comparison_of_Stud_Wall_Constructions](http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;fork=hydra_2&amp;id=THERM_Comparison_of_Stud_Wall_Constructions)\n\n[Analyze_THERM_Results](http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;fork=hydra_2&amp;id=Analyze_THERM_Results), [Thermal_Bridging_with_THERM_and_EnergyPlus](http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;fork=hydra_2&amp;id=Thermal_Bridging_with_THERM_and_EnergyPlus)\n\n[Import_Glazing_System_from_LBNL_WINDOW](http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;fork=hydra_2&amp;id=Import_Glazing_System_from_LBNL_WINDOW&amp;slide=0&amp;scale=1&amp;offset=0,0), [Import_LBNL_WINDOW_Glazing_Assembly_for_EnergyPlus](http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;fork=hydra_2&amp;id=Import_LBNL_WINDOW_Glazing_Assembly_for_EnergyPlus&amp;slide=0&amp;scale=1&amp;offset=0,0)\n\n[](http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;fork=hydra_2&amp;id=THERM_Window_Frame_Construction)\n\n\n\nIt is recommended that those who are using these THERM components for the first time begin by exploring [this example file](http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;fork=hydra_2&amp;id=THERM_Export_Workflow).\n\n\n\nTutorial videos on how to use the components will be posted soon.  A great deal of thanks is due to the LBNL team that was responsive to questions at the start of the development and special thanks goes to [Payette Architects](http://www.payette.com/), which allowed Chris Mackey (the author of the components) a significant amount of paid time to develop them.\n\n[<img class=\"align-center\" src=\"https://lh4.googleusercontent.com/P9xXr-mivMzYFcLCb2bkOw0z8D65jA8YYy1jAWaqFmPx0BSTHhD-7dV9ysUuNx4tKUYcoWQOo3ef3yZceTyAhmUXZfLmMOiWPFnM3p1FTJx1s7kn48jct0iRSye7yeuj23HTLbt9?width=624\" width=\"624\"/>](https://lh4.googleusercontent.com/P9xXr-mivMzYFcLCb2bkOw0z8D65jA8YYy1jAWaqFmPx0BSTHhD-7dV9ysUuNx4tKUYcoWQOo3ef3yZceTyAhmUXZfLmMOiWPFnM3p1FTJx1s7kn48jct0iRSye7yeuj23HTLbt9)\n\n\n\n\n\n**2 - Electrical Lighting Components with Enhanced Capabilities for Importing and Manipulating IES Files**\n\nThanks to the efforts of [Sarith Subramaniam](http://www.grasshopper3d.com/profile/sarith), it is now much easier and more flexible to include electric lighting in Honeybee Radiance simulations. A series of very exciting images and videos can be found in [his release post](http://www.grasshopper3d.com/group/ladybug/forum/topics/new-electric-lighting-components-for-honeybee-are-available-for).\n\n\n\nYou can find the components under WIP tab. Sarith is looking for feedback and wishes. Please give them a try and let him know your thoughts. Several example files showing how to use the components can be found here. [1](http://hydrashare.github.io/hydra/viewer?owner=sariths&amp;fork=hydra&amp;id=IES_Electric_Lighting_Demo_Setup), [2](http://hydrashare.github.io/hydra/viewer?owner=sariths&amp;fork=hydra&amp;id=IES_Electric_Lighting_Basic_Example), [3](http://hydrashare.github.io/hydra/viewer?owner=sariths&amp;fork=hydra&amp;id=IES_Electric_Lighting_Grid-based_calculations).<br class=\"kix-line-break\"/>[<br class=\"kix-line-break\"/>](http://hydrashare.github.io/hydra/viewer?owner=sariths&amp;fork=hydra&amp;id=IES_Electric_Lighting_Grid-based_calculations)\n\n[<img class=\"align-center\" src=\"https://lh3.googleusercontent.com/XZ2MLd6XYKZqjVzJVlOh_Q6iwzJOIuQnTN16RZyoRrFmIzymMyhfSfD0krTne73yFOvtsq6hTHbLxsImQloO3Kq4PrabzSHFCwDz-DQA9EAbeVDAV_IrOJAREuiFbHlvBCsgKAHf?width=624\" width=\"624\"/>](https://lh3.googleusercontent.com/XZ2MLd6XYKZqjVzJVlOh_Q6iwzJOIuQnTN16RZyoRrFmIzymMyhfSfD0krTne73yFOvtsq6hTHbLxsImQloO3Kq4PrabzSHFCwDz-DQA9EAbeVDAV_IrOJAREuiFbHlvBCsgKAHf)\n\n\n\n**3- Expanded Dynamic Shade Capabilities**\n\nAfter great demand, it is now possible to assign several different types of control strategies for interior blinds and shades for EnergyPlus simulations.  Control thresholds range from zone temperature, to zone cooling load, to radiation on windows, to many combinations of these variables.  The new component also features the ability to run EnergyPlus simulations with electrochromic glazing.  An example file showing many of the new capabilities can be found [here](http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;fork=hydra_2&amp;id=EnergyPlus_Window_Shade_Generator).\n\n\n\n**Dragonfly Beta**\n\nIn order to link the capabilities of Ladybug + Honeybee to a wider range of climatic data sets and analytical tools, a new insect has been initiated under the name of Dragonfly.  While the Dragonfly components are not included with the download of this release, the most recent version can be downloaded [here](https://github.com/chriswmackey/Dragonfly/archive/master.zip).  An example file showing how to use Dragonfly to warp EPW data to account for urban heat island effect can also be found [here](http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;fork=hydra_2&amp;id=Urban_Weather_Generator_Workflow).  By the next release, the capabilities of Dragonfly should be robust enough for it to fly on its own.  Additional features that will be implemented in the next few months include importing thermal satellite image data to Rhino/GH as well as the ability to warp EPW files to account for climate change projections.  Anyone interested in testing out the new insect should feel free to contact [Chris Mackey](mailto:chris@mackeyarchitecture.com).\n\n<br/> <br/>\n\nAnd finally, it is with great pleasure that we welcome Sarith and Antonello to the team. As mentioned in the above release notes, Sarith has added a robust implementation for electric light modeling with Honeybee and Antonello has added a component to calculate wet bulb temperature while providing stellar support to a number of people here on the GH forum.\n\n \n\nAs always let us know your comments and suggestions.\n\n \n\nEnjoy!\n\nLadybug+Honeybee development team\n\n \n\nPS: Special thanks to Chris for writing most of the release notes!\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "January 28, 2016 at 6:51pm", "created_by": "MostaphaSadeghipour", "topic": "Release Notes - Ladybug 0.0.62 and Honeybee 0.0.59", "replies": [{"body": "\nI think just saying \"All of this is amazing!!!\" would not be sufficient enough to describe the amount of new brilliant work that has been built in for this release.\n\nStunning. Absolutely stunning.\n", "attachments": [], "created_by_name": "djordje", "created_at": "January 28, 2016 at 7:14pm", "created_by": "djordje", "replies": []}, {"body": "\nGREAT TEAM - GREAT WORK . THANK ALOT\n", "attachments": [], "created_by_name": "Bao Nguyen", "created_at": "January 28, 2016 at 7:23pm", "created_by": "BaoNguyen", "replies": []}, {"body": "", "attachments": [], "created_by_name": "Claudio", "created_at": "January 28, 2016 at 8:28pm", "created_by": "Claudio", "replies": []}, {"body": "\nAs always I am humbled by the amount of work and creativity that is fueled into this project, the community it has created around it, and the actual impact it already has in real life.\n\n\n\nI thank all of you for giving us the opportunity and the means to do, think, create, challenge ideas we would never be possible otherwise.\n\n\n\nTheodore.\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "January 28, 2016 at 9:50pm", "created_by": "TheodorosGalanos", "replies": []}, {"body": "\nSo, so, so ... GREAT.\n\nThanks for all of this.\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "January 28, 2016 at 9:55pm", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nCongratulations, the Ladybug+Honeybee Team!!!\n\n\n\nThank you very much for your hard work to make this amazing software for the community!!!\n\n\n\n\n", "attachments": [], "created_by_name": "Grasshope", "created_at": "January 28, 2016 at 10:05pm", "created_by": "Grasshope", "replies": []}, {"body": "\nI'd like to see a day or maybe two from your normal everyday life and the way you guys are working on the plugins to apprehend how such amazing tools are being created.\n\nAnyway, the plugins are awesome and I wish you guys all the best.\n", "attachments": [], "created_by_name": "Tim", "created_at": "January 29, 2016 at 1:43am", "created_by": "Timur582", "replies": []}, {"body": "\nFor those users who love sustainable architecture, this is the best tool for you!<br/>Thanks! LB HB is flying fast!\n\n\n\nAntonello\n", "attachments": [], "created_by_name": "Antonello Di Nunzio", "created_at": "January 29, 2016 at 2:59am", "created_by": "AntonelloDiNunzio", "replies": []}, {"body": "\nThank you a lot for your hard work!\n", "attachments": [], "created_by_name": "Alessandro Corso", "created_at": "January 29, 2016 at 2:59am", "created_by": "AlessandroCorso", "replies": []}, {"body": "\nwoohoo awesome!\n", "attachments": [], "created_by_name": "Anton Szilasi", "created_at": "January 29, 2016 at 4:58am", "created_by": "AntonSzilasi", "replies": []}, {"body": "\nThis is definitely amazing! Thank you all for making everything better.\n", "attachments": [], "created_by_name": "Mohammad Yazdi", "created_at": "January 29, 2016 at 7:26am", "created_by": "MYazdi", "replies": []}, {"body": "\nThe new option for baking is awesome! Helps saving a lot of time ;) Thank you all! \n", "attachments": [], "created_by_name": "Simone Bevilacqua", "created_at": "January 29, 2016 at 12:24pm", "created_by": "SimoneBevilacqua", "replies": []}], "id": "1449386"}