{"body": "\nHi!<br/><br/>I cant get my head around this. After install and doing a createHBZone I get this error message:<br/><br/>\n\nRuntime error (KeyNotFoundException): Den angivna nyckeln finns inte i uppslagslistan.<br/>Traceback:<br/> line 7555, in callFromHoneybeeHive, \"&lt;string&gt;\"<br/> line 94, in main, \"&lt;string&gt;\"<br/> line 126, in script\n\n<br/>(Swedish errormessage translation: \"selected key does not exist in the lookup list\")\n\n\n\nI dont get any error messages in either LB or HB. HB says it has all libraries in its text output.<br/><br/>I'm using a vanilla install of Win 10 with standard win firewall unaltered. I have a feeling it has something to do with files not downloading all the same.<br/><br/>c:/Ladybug does not exist.\n\n\n\nPicture shows contents of roaming/ladybug folder. is something missing?\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/jO3X92pbJPsFJcPHOD2CenY64kvedZuVty*mxCwPhEECG-Me4o0XlMn-cuczxS3qM6i0bXzYUT57aVQ7PtK-1ramVc4XUtSO/files.PNG\" width=\"603\"/>](http://api.ning.com:80/files/jO3X92pbJPsFJcPHOD2CenY64kvedZuVty*mxCwPhEECG-Me4o0XlMn-cuczxS3qM6i0bXzYUT57aVQ7PtK-1ramVc4XUtSO/files.PNG)<br/><br/>This is what i've done so far:\n\nFollowed all the steps on the install instructions.<br/>Uninstalled and installed it again running in administrator mode.\n\nTried to get files from [this thread](http://www.grasshopper3d.com/group/ladybug/forum/topics/issues-with-honeybee), but links are broken to download those outdated files. I think I remember I usually have to do this when i do HB installs on new OS...<br/><br/>I have not installed open studio, only energy+\n", "attachments": [], "created_by_name": "Ludvig Haav", "created_at": "January 31, 2016 at 5:25am", "created_by": "LudvigNyman", "topic": "Installation issues (KeyNotFoundException)", "replies": [{"body": "\nHi Ludvig,\n\nThank you for explaining the issue very well. The error has nothing to do with the libraries. It can't find the id of the Honeybee surfaces from the sticky. Can you check your file and see if all the surfaces that you're connecting to the component are Honeybee surfaces and there is no None or Just Grasshopper geometry connected to it? We should have a better protection for cases like this.\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "January 31, 2016 at 5:44pm", "created_by": "MostaphaSadeghipour", "replies": [{"body": "\nYeah, you were right - I missed that there indeed was a non HB-surface hidden with the rest of them. Very sloppy of me. Thank you!\n", "attachments": [], "created_by_name": "Ludvig Haav", "created_at": "February 2, 2016 at 6:07am", "created_by": "LudvigNyman", "replies": []}]}]}