{"body": "\nHi all,\n\nI am following the example file and the Mostapha tutorial for Daylight factor calculation with Honeybee. I can't input the Location and I understand the explaination of Mostapha for this aspect, but I am doing my thesis and I am comparing this result with DIALUX result, to validate the process. In DIALUX I have to set (for Cloudy Sky) time (month hour and day) and location.\n\n\n\nWhich is the difference between this two methods? Why Honeybee doesn't have this possibility? Which input I have to use to compare it with dialux results?\n\n\n\nThanks in advance to everyone who can help me to understand better\n\nDavid\n", "attachments": [], "created_by_name": "David Maimone", "created_at": "February 1, 2016 at 5:13am", "created_by": "DavidMaimone", "topic": "DayLight Factor Difference between HONEYBEE and other daylight analysis programs", "replies": [{"body": "\nHi David,\n\n\n\nI might not be able to fully answer your question as I have no experience with Dialux (my daylighting experience comes from 3DS Max Design). However, the location input, cloudy sky setting and time are all input into the creation of the Standard CIE sky which you use for Daylight Factor calculation. If you are doing a DF calculation, you would require the DF analysis recipe and the Standard CIE sky which has all those inputs which Dialux has.\n\n\n\nHope this helps...\n\n\n\nKind Regards\n\nElly\n", "attachments": [], "created_by_name": "Elzine Braasch", "created_at": "February 1, 2016 at 3:02pm", "created_by": "ElzineBraasch", "replies": []}, {"body": "\nHello David,\n\n\n\nDF calculation is not time or day sensitive afaik. From my limited knowledge what you essentially do is calculate the daylight performance of your space under a standard luminance value (which yes can vary from place to place). I am not very convinced with Dialux (at least the version I have tried) because it does not offer any control over the radiance and sky properties, unless I missed smth.\n\n\n\nIf you provide us with your HB file and perhaps a table comparing the options used in both people in here would be of great help.\n\n\n\nKind regards,\n\nTheodore.\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "February 2, 2016 at 12:11am", "created_by": "TheodorosGalanos", "replies": []}, {"body": "\nHi All,\n\nthanks a lot for your help.\n\nI post here the difference between Honeybee and Dialux parameters. For Honeybee I can only choose cloudy or uniform CIE sky (no hours, days, months and location). In Dialux all of this information can be set before doing the daylight factor calculation.\n\nKind regards\n\nDavid\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1452630", "name": "Daylight factor honeybee.png"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1452631", "name": "daylight factor dialux.JPG"}], "created_by_name": "David Maimone", "created_at": "February 2, 2016 at 2:12am", "created_by": "DavidMaimone", "replies": [{"body": "\nHmm it is strange because I feel that DF calculation involes firing equal luminance beams from all the sky into the model and calculating the lux levels inside. At least that's the impression I have. I don't see how time and date could be relevant as the above is quite time irrelevant in itself. Perhaps I am missing something or perhaps Dialux allows for Climate based simulations (which do get time and date as inputs) without naming them as such?\n\n\n\nI'm sorry I can't help more but I'm sure people much more knowledgable than me are on their way :)\n\n\n\nKind regards,\n\nTheodore.\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "February 2, 2016 at 2:36am", "created_by": "TheodorosGalanos", "replies": []}, {"body": "\nHi,\n\nThe DF definition is:\n\nThe design day for daylight factor calculations is based on the standard CIE overcast Sky for 21 September at 12:00pm, and where the *Ground Ambient* light level is 11921 Lux.\n\nSaying that the DF component in HB set the date to Dec 6 at 12:00 (Mostapha: Is that right? and does it complies with the previous definition?)\n\n\n\nFor you case, and for comparison you can set the date in Dialux as in HB.\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "February 2, 2016 at 6:04am", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nHi Abraham,\n\nthanks for your help. Do you have the link of the source of this definition?\n\nwhy in HB is used that specific day ( Dec 6 at 12:00)? I will wait for Mostapha to clarify this aspect\n\n\n\nThanks\n\nDavid\n", "attachments": [], "created_by_name": "David Maimone", "created_at": "February 2, 2016 at 6:10am", "created_by": "DavidMaimone", "replies": []}, {"body": "\nEmbarrassed to say that this is from wikipedia. But check for CIE definitions.\n\nOther definitions i have don't mention the date, but yes the hour (12:00). Since it is a relation between light outside and inside i don't believe it will make a difference changing the date (not the hour). You can try this ...\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "February 2, 2016 at 6:18am", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nSorry for being late! As mentioned by everyone else DF is the same regardless of the time and or orientation. As you can see in this image overcast/cloudy sky is symmetrical:\n\n\n\n[<img class=\"align-full\" src=\"https://scontent-ord1-1.xx.fbcdn.net/hphotos-prn2/t31.0-8/1899568_738349506177905_814150566_o.jpg\"/>](https://scontent-ord1-1.xx.fbcdn.net/hphotos-prn2/t31.0-8/1899568_738349506177905_814150566_o.jpg)\n\n\n\nAlso DF is the result of dividing sky horizontal illuminance to the illuminance that the point receives which means if you change the value of the sky the value of light on the test point will change but the relationship and so the daylight factor stays the same. Here is the source code for the sky that Honeybee uses for DF calculation: [https://github.com/mostaphaRoudsari/Honeybee/blob/master/src/Honeyb...](https://github.com/mostaphaRoudsari/Honeybee/blob/master/src/Honeybee_Daylight%20Factor%20Simulation.py#L54-L83)\n\n\n\nI'm curios to know if changing the date and time in Dialux changes the value of DF. It should not. That would be an interesting study.\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "February 5, 2016 at 10:18pm", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nThanks Mostapha.\n\nwhen I will test it in Dialux I will let you know the responce about the possibility of having different values for daylight factor, for different time and day.\n\nkind regards\n\nDavid\n", "attachments": [], "created_by_name": "David Maimone", "created_at": "February 9, 2016 at 9:14am", "created_by": "DavidMaimone", "replies": []}]}]}