{"body": "\nHi all,\n\nI am trying to understand which is the logic behind some result we can have using Annual Analysis with Read Rad 1 component.\n\nAnnual analysis in honeybee is not done with climate data, it don't need skyfile as input but only the epw weather file (which have the informations of the location). Running the analysis and using Read Rad component I can calculate DA-UDI etc throught Daysim.\n\nBUT reading about Daysim calculation method ([http://daysim.ning.com/page/keyword-daylight-autonomy](http://daysim.ning.com/page/keyword-daylight-autonomy)) on the official site I see that DA is obtained \"considers all sky conditions throughout the year\" and also the definition of DA ([http://patternguide.advancedbuildings.net/using-this-guide/analysis...](http://patternguide.advancedbuildings.net/using-this-guide/analysis-methods/daylight-autonomy)) explains that \" a major innovation since in considers geographic location specific weather information on an annual basis\". \n\n\n\nAlso this Paper by Mostapha ([http://www.ibpsa.org/proceedings/bs2013/p_2499.pdf](http://www.ibpsa.org/proceedings/bs2013/p_2499.pdf)  page 3133) explaine that \"One component calculates typical outputs of an annual climate based daylighting analysis, such as Daylight Autonomy and Daylight Availability\".\n\n\n\nMy questions are: Does Honeybee work using CLIMATE BASED data to calculate UDI-DA? How can it use climate data if it needs only epw weather file? If it doesn't use climate data, which kind of sky it use? Looking at DIVA the annual analysis is named \"CLIMATE BASED ANALYSIS\": which are the difference between Honeybee Annual Analysis and this last DIVA analysis.\n\n\n\nHoping someone can help me to understand which kinds of results we are getting from this incredible plug-in,\n\nKind Regards\n\nDavid \n", "attachments": [], "created_by_name": "David Maimone", "created_at": "February 1, 2016 at 3:50am", "created_by": "DavidMaimone", "topic": "CLIMATE BASED ANALYSIS \\ ANNUAL ANALYSIS \\ UDI-DA", "replies": [{"body": "\nDavid,\n\n \n\nepw files include tmy3 weather data to approximate the local climate at every hour. DA is calculated by measuring how much each unique skypatch contributes to the test point. Once this matrix is computed, Daysim creates a series of unique hourly skies to match each hour in the analysis range. Each hour is based on the epw weather data, so the final result it is climate and location specific. You don't need to input the sky because Daysim creates them automatically. Honeybee and DIVA both use the DAYSIM/Radiance calc engines, so the computation should be identical.\n", "attachments": [], "created_by_name": "Leland Curtis", "created_at": "February 1, 2016 at 7:23am", "created_by": "LelandCurtis", "replies": [{"body": "\nHi Leland,\n\nthanks for your explaination. I am starting to understand which the results mean. My doubts start watching the different kinds of skys, expecially seeing the Climate based sky for grid analysis. Mostapha explained that it can be used only for a specific time in the year because using that sky for a annual analysis means to run 8700 analysis, one for each hour of the year. So, if I understand well, using \"readDSHourlyResults\" and choosing the same HOY I used for grid analysis with Climate Based Sky, I should have the same result?\n\nThanks a lot for your time\n\nDavid \n", "attachments": [], "created_by_name": "David Maimone", "created_at": "February 1, 2016 at 8:31am", "created_by": "DavidMaimone", "replies": []}, {"body": "\nDavid,\n\n\n\nDaysim DA calcs use Tregenza skies to simplify the calculation process. I think a standard Radiance render or grid point calc uses a smoother Perez sky or CIE standard sky type depending on what sky type you choose. See images below.\n\nA Tregenza sky discretizes the skydome into 145 patches to simplify the calculation process. This skydome approximates the smoother Perez sky shown below. Both the Tregenza 145-patch sky and the Perez sky use climate data to create realistic skies that react to hourly solar and weather data. So there may be some differences between the two runs. Also, every unique run will have some error based on how the calc process works and what your presets are.\n\n[](http://www.google.com/url?sa=i&amp;rct=j&amp;q=&amp;esrc=s&amp;frm=1&amp;source=images&amp;cd=&amp;cad=rja&amp;uact=8&amp;ved=0ahUKEwiSqpi79dbKAhWB6CYKHQNZB_gQjRwIBw&amp;url=http%3A%2F%2Fdiva4rhino.com%2Fforum%2Ftopics%2Fdaylight-autonomy-analysis-accuracy&amp;psig=AFQjCNF6sfR9z3sg9UKrwBT6VqpqbLu8WQ&amp;ust=1454428213998576)[<img height=\"290\" id=\"irc_mi\" src=\"http://api.ning.com/files/w-k4IC*v9QmuB73hI5ZQoTN1OXxpWciO--zR68rdGrM*v6gW1OBcluyC0NaOp3*ajommn2nBpL6VdVSM9PWVJN0dPTN0WfTX/skymodels.png\" style=\"margin-top: 156px;\" width=\"898\"/>](http://www.google.com/url?sa=i&amp;rct=j&amp;q=&amp;esrc=s&amp;frm=1&amp;source=images&amp;cd=&amp;cad=rja&amp;uact=8&amp;ved=0ahUKEwiSqpi79dbKAhWB6CYKHQNZB_gQjRwIBw&amp;url=http%3A%2F%2Fdiva4rhino.com%2Fforum%2Ftopics%2Fdaylight-autonomy-analysis-accuracy&amp;psig=AFQjCNF6sfR9z3sg9UKrwBT6VqpqbLu8WQ&amp;ust=1454428213998576) \n", "attachments": [], "created_by_name": "Leland Curtis", "created_at": "February 1, 2016 at 9:04am", "created_by": "LelandCurtis", "replies": []}, {"body": "\nThanks a lot Leland,\n\nnow, for me, it is totally clear  the difference between the two methods, and also the images help a lot.\n\nHave a nice day,\n\nDavid \n", "attachments": [], "created_by_name": "David Maimone", "created_at": "February 1, 2016 at 9:25am", "created_by": "DavidMaimone", "replies": []}]}]}