{"body": "\nHej fellow ladybug and honeybee users,\n\n\n\nI am trying to define a certain process but every time I try something else goes wrong. This time I don't know how to fix it maybe you can give me a clue to what it is I did wrong. \n\n\n\nI have the grasshopper file here- [https://www.dropbox.com/s/31tud3tyho9b7uq/apartments%20put%20toghet...](https://www.dropbox.com/s/31tud3tyho9b7uq/apartments%20put%20toghether%20test.gh?dl=0) - please let me know if you have any suggestions. \n\n\n\nSo here is the issue.\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/cKnzGdTqAJ5Xm8mL1RYad9Kz65DDS5FARG3prSGFMj310LzxEcmBzoIeIk98uWOwrtTz-QZ0wpE9CZ80YE19eD6K2Db9YpFf/etc.jpg?width=750\" width=\"750\"/>](http://api.ning.com:80/files/cKnzGdTqAJ5Xm8mL1RYad9Kz65DDS5FARG3prSGFMj310LzxEcmBzoIeIk98uWOwrtTz-QZ0wpE9CZ80YE19eD6K2Db9YpFf/etc.jpg)\n", "attachments": [], "created_by_name": "Stefania Dinea", "created_at": "February 1, 2016 at 2:17pm", "created_by": "StefaniaDinea", "topic": "severe error", "replies": [{"body": "\nHi Stefania,\n\n\n\nYour geometry seemed to not be thermal zones from the beginning. I solved it by putting all your clusters through the Mass2Zones component.\n\n\n\nElly\n", "attachments": [], "created_by_name": "Elzine Braasch", "created_at": "February 1, 2016 at 2:50pm", "created_by": "ElzineBraasch", "replies": []}, {"body": "\nHi Stefania,\n\n\n\nYour geometry seemed to not be thermal zones from the beginning. I solved it by putting all your clusters through the Mass2Zones component.\n\nI will note that your clusters made the simulation run very slowly (at least on my computer). The file seems too large to attach here, so find it:\n\n[https://www.dropbox.com/s/qtipqgtxog1pk57/apartments%20put%20toghet...](https://www.dropbox.com/s/qtipqgtxog1pk57/apartments%20put%20toghether%20test_Solved.gh?dl=0)\n\n\n\nElly\n", "attachments": [], "created_by_name": "Elzine Braasch", "created_at": "February 1, 2016 at 2:52pm", "created_by": "ElzineBraasch", "replies": [{"body": "\nHej Elzine,\n\n\n\nThank you so much for your support - it really helped - on my PC it took like 1 min so it was not so bad. How would you go about defining over 500 zones?\n\n\n\nI chose this method because I need to have control and be able to move to zones to make an analysis of energy used based on the location of the zone in the building. \n", "attachments": [], "created_by_name": "Stefania Dinea", "created_at": "February 2, 2016 at 3:37am", "created_by": "StefaniaDinea", "replies": []}, {"body": "\nHi Stefania,\n\n\n\nAre you defining 500 zones which are boxes or are they some other shape? If they are all the same I would create a base case and simply move/duplicate it using Honeybee move objects. Although if you have a 500 zones I think you are going to need a beast of a computer.\n", "attachments": [], "created_by_name": "Anton Szilasi", "created_at": "February 2, 2016 at 9:19am", "created_by": "AntonSzilasi", "replies": []}, {"body": "\nHi Stefania,\n\n\n\n500 zones seems an insane amount and I would highly suggest using simplified methods. For example, when modelling a building in EnergyPlus/SketchUp, you would normally just model the zones which would vary for the rest depending on its location and 'multiply' it, with its surfaces attached to itself... in very simplified studies, these normally meant just looking at perimeter zones and core, and then the top, bottom and middle floors. In the below example, the middle floors 'floor' and 'roof' are surface matched to each other to represent the thermal exchange to a floor so similar, that it is basically the same floor. Obviously this example will not work for daylighting, but for energy it does the trick.\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/UNLKhjTj3qvUHj1sxH11vWTeAwFYXSDyd3IHQBEXBWIC2LXFQF5mWRsiAWdld4tJi1ZN*VqB0dq3Kha4XVEHiHYHH9eD8OjW/SimplifiedExample.JPG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/UNLKhjTj3qvUHj1sxH11vWTeAwFYXSDyd3IHQBEXBWIC2LXFQF5mWRsiAWdld4tJi1ZN*VqB0dq3Kha4XVEHiHYHH9eD8OjW/SimplifiedExample.JPG)I'm not sure how this can help you, as I have not played around in HB from this aspect to try duplicate it.\n\n\n\nPerhaps if you told us what you wish to complish? You can move to different zones within HB quite easily using item selectors... perhaps I'm not understanding what you want to do?\n", "attachments": [], "created_by_name": "Elzine Braasch", "created_at": "February 2, 2016 at 1:30pm", "created_by": "ElzineBraasch", "replies": []}, {"body": "\nHej again,\n\n\n\nI am trying to prove or disprove (i leave the outcome open) the fact that the position of a room/zone can affect the energy outcome in a mixed function building - meaning that i will try to mix residential and office spaces - in steps, side by side, on top of each other.\n\nAlso this is done to see how hard would it be for architects to implement such a method in concept stage therefore having a more energy efficient design and model.  \n\nFor example is it more energy efficient to have the staircase in the middle of the building or on the outside? Is it energy efficient to place all the office functions on the north side and the apartments on the south? Of course these questions can be easily answered by common sense but I would like to also prove it and also in the same time analyse the outcome and the percentage of the influence.  The example you saw was just a test for me to get a hang of the method - I am still learning and analyzing the fastest and best way to do this. Specially when you have a big project. The photo below is just a start up example [<img class=\"align-full\" src=\"http://api.ning.com:80/files/6dxYD0J5Ccpyyvr0t*DsZEZAPrMoT7UL*FuGezUYBmAD0H-1fcenXMqCQHCuGd5hHoWSyY3epoCKx-mdwhQ-bsIpuj5EOxRv/zones.JPG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/6dxYD0J5Ccpyyvr0t*DsZEZAPrMoT7UL*FuGezUYBmAD0H-1fcenXMqCQHCuGd5hHoWSyY3epoCKx-mdwhQ-bsIpuj5EOxRv/zones.JPG)\n\n\n\n\n\n\n", "attachments": [], "created_by_name": "Stefania Dinea", "created_at": "February 3, 2016 at 1:20am", "created_by": "StefaniaDinea", "replies": []}, {"body": "\nWow! This is a huge file. I wonder how long it will take to run the energy model.\n\n\n\nJust a note about using multiplier in EnergyPlus. It's not included in Honeybee but you can easily modify it in the idf file. Before doing so I suggest to check EnergyPlus tips and tricks document. It can cause big differences depending on the climate and geometries.\n\n\n\n[http://bigladdersoftware.com/epx/docs/8-3/tips-and-tricks-using-ene...](http://bigladdersoftware.com/epx/docs/8-3/tips-and-tricks-using-energyplus/using-multipliers-zone-and-or-window.html#using-multipliers-zone-andor-window)\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "February 5, 2016 at 9:11pm", "created_by": "MostaphaSadeghipour", "replies": []}]}]}