{"body": "\nHey there,\n\n\n\nI have a small question regarding some of the severe error that are shown on the \"Run Energy Simulation\" component (see the attached pictures).\n\n\n\nI manage to get results from my energy simulation, but I was wondering if the the severe errors will have any major influence on the simulation results, if left unsolved? <br/><br/>And if so, any ideas how to solve them?\n\n\n\nThanks for your help\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1453514", "name": "2016.02.03 - Severe Errors.jpg"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1453515", "name": "2016.02.03 - The building.jpg"}], "created_by_name": "Nickolaj Feldt Jensen", "created_at": "February 2, 2016 at 6:11pm", "created_by": "NickolajFeldtJensen", "topic": "Severe Errors - Influence on the simulation results", "replies": [{"body": "\nHi Nickolaj,\n\n\n\nThe first error can cause large inaccuracies. It's usually a warning for when the direction of glazing surface is not the same as the parent surface. How are you generating the glazing surfaces? A quick way to check which surfaces are causing this issue is to import the idf file into OpenStudio and that will give you a report.\n\n\n\nThe second error is because you have non-convex surfaces in your model. As far as I can see it's not major in your case but you can always split non-convex faces into convex faces by splitting them into convex surfaces.\n\n\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "February 4, 2016 at 6:57am", "created_by": "MostaphaSadeghipour", "replies": [{"body": "\nHey Mostapha, \n\n\n\nThank you for the fast reply. \n\n\n\nThe windows were generated using Rhino geometry imported from Sketchup, but I also tried using the glazing based on ratio component, which resulted in the same error. \n\n\n\nI fixed the non-convex surfaces in the model, which in turn fixed the window error. Now there is only a small visualization thing, as shown in the attached picture. \n\n\n\n- Nickolaj\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1459636", "name": "Pic1.jpg"}], "created_by_name": "Nickolaj Feldt Jensen", "created_at": "February 10, 2016 at 3:15am", "created_by": "NickolajFeldtJensen", "replies": []}, {"body": "\nLooks like Z-fighting, check the faces, SU models can be pretty dirty in the matter, try to clean it up.\n", "attachments": [], "created_by_name": "Tim", "created_at": "February 11, 2016 at 2:11am", "created_by": "Timur582", "replies": []}, {"body": "\nAre you reading the idf file back for visualization? In that case the simulation is fine. The reason that you see the surfaces on top of each other is that Rhino fails to subtract the window from the base surface and you see two co-planar surfaces in view which is what Tim mentioned. This doesn't change the results for energy simulation as EnergyPlus takes the full surfaces for wall and window.\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "February 11, 2016 at 4:23pm", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nHey Mostapha, \n\n\n\nYes the attached pciture show the visualization of the idf file. Thank you for that info, quite usefull to know. \n", "attachments": [], "created_by_name": "Nickolaj Feldt Jensen", "created_at": "February 11, 2016 at 6:12pm", "created_by": "NickolajFeldtJensen", "replies": []}]}]}