{"body": "\nHi,\n\nI am trying to do a Cumulative Radiation Analysis study of a landscape.\n\nI have tried using mostaphaRoudsari's script from Hydrashare, however having some troubles getting it to work. \n\n1. When I run the script even with a large grid size (that I understand speeds up the run time) it still freezes for 20mins and forces me to restart my machine.\n\n2. If i connect a point component to testpts to see the test sampling, the points are not visible.\n\nMaybe I am missing something, any help would be greatly appreciated.\n\nTest files attached. (rhino file too big to upload) site is 1639073 x 1243694 mm\n\n\n\n\n\n \n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1460481", "name": "Cumulative_Radiation_Analysis_Edited.gh"}], "created_by_name": "Paddyf123", "created_at": "February 11, 2016 at 2:42am", "created_by": "PADDYFernandez", "topic": "Cumulative Radiation Analysis from large landscape", "replies": [{"body": "\nHi\n\n\n\nSo I ran your script and it works fine for me. It is probably an issue with genCumulativeSkyMtx. Are you running it on your own machine? You may want to define the workingDir and LadyBug_Ladybug defaultFolder if you are having access rights issues.\n\n\n\nDo you get any error message?\n\n\n\nThanks\n\n\n\nDuncan\n", "attachments": [], "created_by_name": "Duncan Cox", "created_at": "February 11, 2016 at 10:17am", "created_by": "DuncanCox", "replies": [{"body": "\n1. I would start with a smaller file before testing it for a large landscape. Can you successfully run the analysis for a smaller case?\n\n2. Are you using Honeybee for your simulation? In general you can right click on the component and change the preview. The preview of the getTestPoint component is set to False by default.\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "February 11, 2016 at 2:51pm", "created_by": "MostaphaSadeghipour", "replies": []}]}], "id": "1460482"}