{"body": "\nHi all,\n\nI am trying to use some ldt files for simulating optic fyber (to increase natural light) by Parans. Honeybee reads Ies file, so I decided to change my ldt file in Ies using Photoview ( an Oxytech software), but the example file of Sarith didn't work with this new Ies file. Is there a problem about the new ies file made with Photoview? can I use directly ldt file? \n\nAfter that, I am looking for a way to improve the model of a building with dynamic shading with the contribute of this technology. Natural light from optic fyber is produced when the sky is sunny. The fyber have to work When the sensor for dynamic shading reach the values of threshold. So the first idea was to use the light control component to switch on and off the light, and calculate the contribute of this technology in the UDI range. But the light control is usefull for electric consuption ( one of the input is the power of the light in watt and not lux or Ies file), and the new Luminaire compontent I don't know if can be used for this kind of study (on off during the year).\n\nThanks in advance\n\nDavid \n\n\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/p9ey71ICjWc-4phugQcnCmB6Neu6nZuFRdFJ2qURWet4f6ye1s1wPimwsSzdj-l-5WgD5WjOm-LpHSriLVMFUZqPzHDUInAa/IES.png?width=750\" width=\"750\"/>](http://api.ning.com:80/files/p9ey71ICjWc-4phugQcnCmB6Neu6nZuFRdFJ2qURWet4f6ye1s1wPimwsSzdj-l-5WgD5WjOm-LpHSriLVMFUZqPzHDUInAa/IES.png)\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1461370", "name": "Parans L1 Small.ldt"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1461371", "name": "Parans L1 Small.IES"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1461372", "name": "IES_Electric_Lighting_Basic_Example.gh"}], "created_by_name": "David Maimone", "created_at": "February 12, 2016 at 3:10am", "created_by": "DavidMaimone", "topic": "ldt file and IES file \\ Interior light contribute in annual analysis", "replies": [{"body": "\nHi David,\n\n\n\nI wasn't able to recreate the error that you got on my system as the file worked fine. See the screenshots below:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/p9ey71ICjWdzJDQE7Lgw35zVhANPS1wLqbxDxoM6t0SkqwdAz0uTFsvIxO7NF5bnehgijWv5XHt-lZAzSrURl79X*3dWlhXA/rhino.PNG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/p9ey71ICjWdzJDQE7Lgw35zVhANPS1wLqbxDxoM6t0SkqwdAz0uTFsvIxO7NF5bnehgijWv5XHt-lZAzSrURl79X*3dWlhXA/rhino.PNG)[<img class=\"align-full\" src=\"http://api.ning.com:80/files/p9ey71ICjWeoHTFkfW4iAu7Ya7VotyF3F61VnAYG1JXM9vgMzxUwByiqOcxrBXH3JVV3GmYuqNOYlVfkdV9qZid-UTS2Hsra/luminaire.PNG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/p9ey71ICjWeoHTFkfW4iAu7Ya7VotyF3F61VnAYG1JXM9vgMzxUwByiqOcxrBXH3JVV3GmYuqNOYlVfkdV9qZid-UTS2Hsra/luminaire.PNG)[<img class=\"align-full\" src=\"http://api.ning.com:80/files/p9ey71ICjWforOwR37VNWjZo5nqee5cMzdQoTTjReUvzTh5nGF3xHNwyXG-kmDyeAV1KI03Uxm9ZMah2cYl1-z62iKvwkjn3/render.PNG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/p9ey71ICjWforOwR37VNWjZo5nqee5cMzdQoTTjReUvzTh5nGF3xHNwyXG-kmDyeAV1KI03Uxm9ZMah2cYl1-z62iKvwkjn3/render.PNG)I have attached my gh file. Can you get this one to work ? The input from the electric lighting component will add to whatever daylighting you have in your scene. So, it should work the way you want. When you talk of lighting control and watts, are you using Daysim to run the annual calculations ?\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1461727", "name": "mine.gh"}], "created_by_name": "Sarith Subramaniam", "created_at": "February 12, 2016 at 8:27am", "created_by": "sarith", "replies": [{"body": "\nHi Sarith,\n\nThanks for your answer and your time. After two hours of work the file now run. I get your results. And the problem is incredible. First I tryed to update each component because often this was the problem with this kind of error. But it didn't help in this case. Finally I see something strange in the information I get from the panel that has as input the file path of my luminaire. The problem is that selecting a file path on my desktop the address stored for that file had two space between the words ( it was \" \\parans M1 small.IES\"). Changing the file's name into \"\\paransM1small.IES\" now it works fine.\n\n\n\nNow, the second problem is: I can controll the shading using a sensor or multiple sensors; the shading is open and closed when the sensor register less or more illuminance threshold . My intention is to switch off and on the lights ( they are system for bringing natural light when the sun is shining) at the same time the shading is open and closed. So the project should be: when the sun is shining the shadings are closed and the light on, when the sky is cloudy the shadings are open and the lights are off. I use daysim for climate based analysis with dynamic shading but now I don't know how add the contribute of the light in the annual analysis using this criteria and if it is possible.\n\nI hope I exlplain well the problem\n\nThanks in advance \n\n\n\nDavid M\n", "attachments": [], "created_by_name": "David Maimone", "created_at": "February 13, 2016 at 9:32am", "created_by": "DavidMaimone", "replies": []}, {"body": "\nHi David,\n\n\n\nYou can easily add electric lights to your annual simulation but controlling them might be an issue. Can you share your annual simulation gh file ?\n", "attachments": [], "created_by_name": "Sarith Subramaniam", "created_at": "February 13, 2016 at 7:19pm", "created_by": "sarith", "replies": []}, {"body": "\nHi Sarith,\n\nyes you are right but I need to control the light like the shading. The control recipe for lights is usefull for electric consuption but not for existimate the contribute in a dynamic system of optic fybers or solartube. Unfortunatly I don't have one file, but three at the moment for testing how each aspect of the analysis works. One for the building and annual analysis, one for dynamic shading, yours for the Ies light.\n\n\n", "attachments": [], "created_by_name": "David Maimone", "created_at": "February 14, 2016 at 1:51am", "created_by": "DavidMaimone", "replies": []}]}], "id": "1461373"}