{"body": "\nA bit off topic.\n\n\n\nI'm in the midst of a pedestrian comfort study and I'm currently analyzing wind velocities on 12 orientations. To do that I need an average velocity over the year for each of the orientations (0, 30, 60, ..).\n\n\n\nI use a simple definition with native components to extract this information from the epw file. However, I run into some 'trouble'.\n\n\n\nThere seem to be a lot of 0 values in the wind velocities. Most of these 0 values seem to be associated with the 0 direction (north direction is common in this weather file, i.e. Singapore, but I doubt it is so many 0s).\n\n\n\nI then proceeded to cull all the hours with 0 wind velocity and did the averaging over all the remaining hours (around 7100 for this weather file). However, I still get a bit of odd results that don't coincide with other data I have for the area. For example, average wind velocity in the north seems to be 1.12m/s while officially Singapore reports 2.1m/s. More discrepancies arise in the frequencies of the wind directions (the hours of each direction per year divided by total hours) from publically available data.\n\n\n\nAnyways, I don't want to tire you with so many specifics. The question to the forum is if anyone has used .epw files to collect wind data before and if we believe they are dependable for such calculations? If not, do you have any idea on where I could find open wind data of good quality?\n\n\n\nThank you very much in advance.\n\n\n\nKind regards,\n\nTheodore.\n\n\n\nP.S.: Will be adding the definition once I'm in the office, even though it is quite straightforward.\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "February 14, 2016 at 3:23am", "created_by": "TheodorosGalanos", "topic": "Question about the quality of wind data within DOE epw files", "replies": [{"body": "\nTheodoros,\n\nThis is an interesting one.\n\nFirst of all, without knowing how is the weather in Singapore, i don't agree and like annual averages for wind considerations. Yo can't bring together winter and summer (for instance) into the same calculation for the average. You should know, at least, what is going on in winter, summer, or any other period of time.\n\nSecond, you are right about your fears of the reliability of the weather files. But, unless you have a local station, there is not much you can do about this. Unfortunately this is a big constrain and limitation. The best is to have the station at your plot. Any other data you have will be an approximation to your site.\n\nThird, this is a wish for the wind analysis components. I wish to get the main first and second directions and their average velocities (in just 2 numbers and directions).\n\n\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "February 14, 2016 at 4:08am", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nYou can find daily mean and max values for singapore here, you can even download csv data which makes life much easier:\n\n[http://www.weather.gov.sg/climate-historical-daily/](http://www.weather.gov.sg/climate-historical-daily/)\n\nAs Abraham said, best thing would be a station near your plot and detailed data, but \"you can't always get what you want...but..sometimes...you get what you need\".\n\nHope this helps. \n\nregards, \n\nMauricio\n", "attachments": [], "created_by_name": "Mauricio Aguilar Cardenas", "created_at": "February 14, 2016 at 10:51am", "created_by": "MauricioAguilarCardenas135", "replies": []}, {"body": "\nhi Theodoros,\n\nUsually in wind data (at least here in the UK) when you have wind coming from north it is 360 deg and not 0. the wind direction 0 usually indicates calm, no wind condition that does no relate to the wind coming from north.\n\nI would suggest you to put a condition in you formulas that when wind speed is 0 and direction 0 it goes on a 13th category.\n\nI hoppe this helps.\n\nBest,\n", "attachments": [], "created_by_name": "amedeo scofone", "created_at": "April 25, 2016 at 4:33am", "created_by": "amedeoscofone", "replies": [{"body": "\nHi Amedeo,\n\n\n\nSince the original post I have realized that indeed and have filtered out the results. It has brought the frequencies to the expected number for each orientation.\n\n\n\nThe other mismatch of average velocities was my mistake. Apparently Singapore is unique in the way the average their velocites (@15m), which is different than what EPW files do (@10m).\n\n\n\nThanks!\n\n\n\nKind regards,\n\nTheodore.\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "April 25, 2016 at 10:09pm", "created_by": "TheodorosGalanos", "replies": []}]}, {"body": "\nLadybug windrose does already filter the hours with 0 wind speed. That's why it generates a separate circle for calm hours.\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "April 25, 2016 at 9:29am", "created_by": "MostaphaSadeghipour", "replies": [{"body": "\nHi Mostapha,\n\n\n\nDo you think it is easy to incorporate average wind velocity calculations to the windrose? That is if that isn't there already :)\n\n\n\nI can imagine the component cutting the rose into as many segments the user requires, and spiting out average velocities for each segment.\n\n\n\nKind regards,\n\nTheodore.\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "April 25, 2016 at 10:10pm", "created_by": "TheodorosGalanos", "replies": []}, {"body": "\nIt's not there but it's pretty doable. Let's add it to Ladybug's github.\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "April 26, 2016 at 6:53am", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nI developed a definition that gives you % of frequencies based on the beaufort scale and season, Is that something you might be interested in?\n", "attachments": [], "created_by_name": "amedeo scofone", "created_at": "April 26, 2016 at 9:16am", "created_by": "amedeoscofone", "replies": []}, {"body": "\nHi Amedeo,\n\n\n\nThat would be very interesting definition. It would be nice if you wanna share. It would be very helpful for single point pedestrian wind comfort assessment.\n\n\n\nHowever, for assessment of even the smallest grid the files produced by the current workflow we are testing will be way too large for GH lists. I think python coding will be needed. That said, that code is quite simple and doable (if I knew how). At the moment, my solution is working in R, which handles big data quite well. I will share my R code/process here in the morning (again a very simple code), in case it helps this. \n\n\n\nKind regards,\n\nTheodore.\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "April 26, 2016 at 10:00am", "created_by": "TheodorosGalanos", "replies": []}, {"body": "\nTheodoros,\n\nIt is still a WIP but I hope it helps, sometime the wind roses are a bit funny.\n\nSadly i don't know python so it is based on gh components\n\nRanges are &lt;3,3,4,5,6 and &gt;6 in order to correlate wind speeds with the lawson criteria which is the pedestrian wind comfort mostly used in the UK.\n\nBest,\n\n\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1517155", "name": "Beaufort scale Ranges.gh"}], "created_by_name": "amedeo scofone", "created_at": "April 26, 2016 at 10:31am", "created_by": "amedeoscofone", "replies": []}, {"body": "\nThank you very much for sharing Amadeo!\n\n\n\nWill give this a try and see the limits of native GH components in relation to how long can the lists imported be.\n\n\n\nKind regards,\n\nTheodore.\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "April 26, 2016 at 11:15pm", "created_by": "TheodorosGalanos", "replies": []}, {"body": "\nHi Amedeo,\n\nI couldn't get the file to work as I wasn't sure what is the excel data to be imported. I definitely think it's quite useful to map comfort on top of values. How do you use this? Do you map the values on top of the wind-rose or do you calculate percentages?\n\nI'm going to re-write wind-rose component soon and I can include this feature in the component. What about mapping the values as an annualHourlyData?\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "April 27, 2016 at 7:37am", "created_by": "MostaphaSadeghipour", "replies": []}]}]}