{"body": "\nHi,\n\nI have a question since i thought i had it clear but now i don't.\n\nI defined an individual surface as a wall. Defined the EPBC as adiabatic and also but right after the definition i connected this geometry to the HB_makeAdiabatic component.\n\nI expected that when creating the IDF file this surface will be registered as a \"surface\" (i.e. internal wall). Now revising the idf i see that this surface is registered as \"Outdoors\". So, no way, that the adiabatic condition will be applied or taken into consideration for the simulation.\n\nAm i missing something?\n\n\n\nThanks,\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "February 14, 2016 at 9:57am", "created_by": "AbrahamYezioro", "topic": "Adiabatic or Outdoors", "replies": [{"body": "\nTo be more accurate in my question: Defining EPCB as adiabatic sets the geometry as \"Outdoors\" non exposed to sun or wind.\n\nWithout the EPCB input but using the HB_makeAdiabatic sets the geometry as \"Outdoors\", sun and wind exposed.\n\nI was expecting the geometry to be \"Surface\" no exposed to sun and wind.\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "February 14, 2016 at 12:38pm", "created_by": "AbrahamYezioro", "replies": [{"body": "\nAbraham,\n\nI have read over your post a few times and I am still having trouble understanding your question.  It sounds like there is a solve adjacency component some where in your situation that changes some tings.  Can you send a picture or a GH file that re-creates the issue?\n\nAll that I can say right now is that setting the EPBC to Adiabatic and passing a srf through the Make Adiabatic component still results in an adiabatic surface:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/5ihJsFRcOvPzX*8iYFxnaXch4RhqqQSZH6FziY9WXU9N4ql4j*lbLWpyL3qA0vEcHXvK7XGNJ5APWJ3CMmGgOcVXahpGhASp/Adiabatic.JPG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/5ihJsFRcOvPzX*8iYFxnaXch4RhqqQSZH6FziY9WXU9N4ql4j*lbLWpyL3qA0vEcHXvK7XGNJ5APWJ3CMmGgOcVXahpGhASp/Adiabatic.JPG)\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "February 14, 2016 at 6:31pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nHi Chris,\n\nThere is in effect a solveAdjacency on the way. So now this is probably a misunderstanding on my side about how things are supposed to be working.\n\nAttached the case i'm working on (sorry for the size and mess). But just see the 3 red arrows.\n\nThe first on the left shows how i define for a specific zone the adiabatic conditions. The middle one show that it is correctly defined when i defined the stand aone zone. The third on the right show what happens after the solve adjacency applied. What was before adiabatic is now outdoors (look for the surface z2a3_w2 for instance).\n\nAttached also the rhino file. The geometry is not internalised.\n\nWhat i am supposed to do if i want to keep the surface as adiabatic?\n\nThanks,\n\n-A.\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1463188", "name": "munot o 09.02.16_AY.gh"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1463189", "name": "sim 1 - munot o 09.02.16_AY-03.3dm"}], "created_by_name": "Abraham Yezioro", "created_at": "February 14, 2016 at 9:18pm", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nOK. Updates on my side.\n\nI've learned that setting the removeCurrentAdjc_to True is the cause of the problem. Removing it makes this work as expected.I was using this setting as true as default, just to be sure everything is ok, but now i see that this assumption might spoil the whole thing.\n\nMore than that i've saved you a lot of time on future questions regarding the simulation itself :-) (Anyway i will open a discussion on that).\n\nIf you have any recommendations on the model please do, but i think it is well done now.\n\n\n\nThanks,\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "February 15, 2016 at 3:28am", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nAbraham,\n\n\n\nGlad that you were able to solve the issue.  Solve Adjacencies will rewrite all of your boundary conditions of your zone (except for ground surfaces) unless you set _removeCurrentAdjc to 'False'.\n\n\n\nA couple of tricks that might make your life easier:\n\n1) If you set the altBC on the Solve Adjacency component to 'Adiabatic', all internal surfaces will be set with an adabatic boundary condition (this is useful if you are not worried about inter-zone heat exchange and want a fast, multi-zone model).\n\n\n\n2) The most recent 'Make Adiabatic by Type' component was designed such that you should never have to construct a zone with HBSrfs if all that you want to do is set certain surfaces to adiabatic:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/k4bPQ8WfDNjIAz6oV4JBVFDw66YsB1*DM5r9NWtexBIOReKyZtiVvHH2t*dbMNbSuVy2JlMr*ArA7zW8Y*S4KLF3vJ8iRVSn/MakeAdiabaticbyType.JPG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/k4bPQ8WfDNjIAz6oV4JBVFDw66YsB1*DM5r9NWtexBIOReKyZtiVvHH2t*dbMNbSuVy2JlMr*ArA7zW8Y*S4KLF3vJ8iRVSn/MakeAdiabaticbyType.JPG)\n\nNotably, the 'Walls_' input can take a list of booleans and make surfaced adiabatic based on their cardinal orientation (North, East, South, West).  So you can construct your zones with the Mass2Zone component, which will make your file smaller.\n\n\n\n3) Assigning constructions after you have solved adjacencies will allow you to assign different constructions depending on whether surfaces are interior or exterior and might also help make it possible for you to use the mass2Zone component.\n\n\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "February 15, 2016 at 5:43pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nHi Chris and thanks for the tips.\n\nTrying to simplify the process i defined a test file (attached). So i have some questions and probably a bug report.\n\nThere are 3 zones. I want the internal walls between them to be adiabatic (at first. See later on for an alternative).\n\nThe whole process is fine/clear up to the solveAdjacencies: The walls are defined as \"outdoors\" and \"surface\" for the boundary conditions. So far so good.\n\nNow i get to the HB_makeAdiabaticByType, and some issues appear (See A in the file).\n\nSetting the interiorWalls to True doesn't change the condition from\"surface\" to \"adiabatic\" (A1 in file).\n\nSetting the walls set both internal and external, to adiabatic (A2 in file). Is this supposed to work like this? Why the just the internal doesn't make the change?\n\n\n\nIn addition to this i'll appreciate your advice in the following. Let's say that i want the internal walls to be divided in 2 parts each. One should be adiabatic and the other \"air wall\". How do you recommend to do this? Is the modeling in the file correct, or i must do surface by surface?Or using the Decompose Honeybee Zone ...?\n\nHow can i retain the air walls and still use the makeAdiabaticByType component?\n\n\n\nThanks for your help!!\n\n-A.\n\n\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1465059", "name": "TestBoundaryConditions.gh"}], "created_by_name": "Abraham Yezioro", "created_at": "February 17, 2016 at 4:57am", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nAbraham,\n\nYou are right that this was a bug an I have fixed it on the github:\n\n[https://github.com/mostaphaRoudsari/Honeybee/commit/febe790c19f8d01...](https://github.com/mostaphaRoudsari/Honeybee/commit/febe790c19f8d015be0ed80cc592d6ab5c31b944)\n\n... and in the attached file.\n\n\n\nFor your question, all that you have to do is use two solve adjacencies components in tandem:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/Arj-j*1Gcz1RXqGRLJnYrqOegxnQ*4TJCoIwtkBmTbmxNDLIOODbczeHN5lVdrpeJwO7yk94RPIcMriGgKqVX2ZulJPa*GiQ/SolveAdjInTandem.JPG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/Arj-j*1Gcz1RXqGRLJnYrqOegxnQ*4TJCoIwtkBmTbmxNDLIOODbczeHN5lVdrpeJwO7yk94RPIcMriGgKqVX2ZulJPa*GiQ/SolveAdjInTandem.JPG)\n\nThis example is also in the attached file.\n\n\n\n-Chris\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1466998", "name": "TestBoundaryConditions_CWM.gh"}], "created_by_name": "Chris Mackey", "created_at": "February 19, 2016 at 4:59pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nThanks Chris.\n\nThis is good.\n\nThe second question (half wall adiabatic, and half air wall) regarding the recommendation for modeling was not understood as i intended. See attached. The idea is half of each internal wall to have different boundary conditions. So the question i there is a way to do that with this masses modeling or should i do that with surface by surface (which i'm afraid is the way).\n\nThanks!!\n\n-A.\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/Arj-j*1Gcz1t0fG*Q9u*bfJArOv2zJ6r0fwoMQIHcaCJg3ulMg3UYruabiviQ5FiyuSBSoFze1UHINwzx78If*1J-7yxT23o/20160220_060758.png?width=721\" width=\"721\"/>](http://api.ning.com:80/files/Arj-j*1Gcz1t0fG*Q9u*bfJArOv2zJ6r0fwoMQIHcaCJg3ulMg3UYruabiviQ5FiyuSBSoFze1UHINwzx78If*1J-7yxT23o/20160220_060758.png)\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1467316", "name": "2016-02-20_06-07-58.png"}], "created_by_name": "Abraham Yezioro", "created_at": "February 19, 2016 at 9:22pm", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nAbraham,\n\nYes, you are right.  I can't think of any way of setting that situation up that does not involve the HBSurface component or decomposing the zone and editing individual surfaces.  If you have a lot of this same type of condition, however, it is likely possible to set up all of them with one set of HBSurface components, though.  In the end, smart list management can usually eliminate the need for large numbers of components on the canvas.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "February 20, 2016 at 9:28pm", "created_by": "ChrisMackey", "replies": []}]}], "id": "1463120"}