{"body": "\nHi,\n\nI'm in doubt here.\n\nHaving unconditioned spaces and applying the AdaptiveComfort recipe, how can i know what is the set temperature used for the calculation?\n\nSeems, from the results i'm getting it is around 21C, but i want to be sure, and if possible how can this setting be changed?\n\nIf you have the reference(s) how this temperature was set, i'll appreciate to get it.\n\n\n\nThanks,\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "February 15, 2016 at 4:04am", "created_by": "AbrahamYezioro", "topic": "Unconditioned, Addaptive Comfort set temperature", "replies": [{"body": "\nThe comfort temperature should be relative to outdoor temperature such that:\n\nT comfort = (0.33*T outdoor)+18.8\n\nI think that's the equation, not sure about the 0.33 and 18.8 values as they have been changed progressively over the years, but it should be something like that. Humphreys and Nicol have published several articles on that if you'd like more info. \n\n\n", "attachments": [], "created_by_name": "Mauricio Aguilar Cardenas", "created_at": "February 15, 2016 at 5:04am", "created_by": "MauricioAguilarCardenas135", "replies": [{"body": "\nThanks Mauricio,\n\n(This is so annoying. I'm sure i replied to this a couple of hours ago, and now i see it was not sent. Anyway ...).\n\nI've seen in Humprey's book (Adaptive comfort) the formula you mentioned. This is for European Standards (you remembered the right numbers). ASHRAE 55 is a bit different.\n\nBut my question is more intended to possible cultural, climate conditions accepted temperatures. We discussed those cultural aspects in a different thread. In my case i'm trying to check an historical building under its original conditions. So it is not fair to comply with today's requirements.\n\nSo ,my real question is if it is possible to set a range of comfort temperatures for the adaptive model. Hopefully it is possible, the other question is how/where.\n\n-A.\n\n\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "February 15, 2016 at 11:35am", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nAbraham, \n\nI would think that even though the adaptive comfort model is relatively new it should be applicable regardless of time...as people haven't changed physiologically, so comfort today should be the same as comfort yesterday. \n\nHowever, getting a hold of actual climate records would definitely provide a more accurate assessment, with the adaptive model or any other. \n\nI have no way of looking at the code atm, but I suppose a \"tolerance\" variable could be added to create a comfort range from any single value. I'll check it out tomorrow morning, hopefully it will be straight forward. \n\nbest wishes, \n\nMauricio\n", "attachments": [], "created_by_name": "Mauricio Aguilar Cardenas", "created_at": "February 15, 2016 at 1:33pm", "created_by": "MauricioAguilarCardenas135", "replies": []}, {"body": "\nAbraham,\n\nYou ask a very interesting question and one that is related to a lot of things that I have been thinking about after reading the recent books that Nicol and Humphreys have written.\n\n\n\nMauricio,\n\nBecause the Adaptive methodology is founded upon the notion that there are hundreds of social factors that influence comfort and that the best we can do to forecast comfort is to find variables with good correlations to these social factors (like outdoor temperature), the premise that these published Adaptive model holds regardless of cultural norms is dangerous.  Notably, the founders of the adaptive model have stressed that this particular linear correlation that you cite comes from recent surveys of buildings where people have both the the ability to open windows AND a great freedom to dress down.  Hypothetically, if occupants were able to open the windows in Abraham's building but the cultural norm was that everyone was expected to wear multi-layered suits or dresses (as in historic Britain), a different correlation between outdoor temperature and comfort temperature would exist. In fact, historical European comfort surveys show that people likely preferred cooler temperatures in buildings (about 1-2C cooler) than today's occupants. Accordingly, after recognizing this social premise in the Adaptive model, I have built in a few ways to adjust/alter the version in Ladybug based on the literature I have read (even though these alterations are not a part of any official ASHRAE or European standard).\n\n\n\nAbraham, you might have to be a bit more specific about how you would like to adjust the Adaptive comfort model for me to help your particular case and this may lead to me adding in new functionality.  For the time being, I can tell you that the '**Ladybug_Adaptive Comfort Parameters**' component is going to be your friend and I would recommend using the Adaptive Comfort Chart to visualize how you are changing the model.  You can plug these '**Adaptive Comfort Parameters**' into the '**Adaptive Comfort Recipe**' component to have the microclimate analysis run with these parameters.  Here are a few examples of how to alter the model:\n\n\n\n**1) Mixed-mode Building** - Humphreys and the European Adaptive comfort team derived two separate correlations.\n\nOne for naturally ventilated buildings:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/k4bPQ8WfDNhM*5g*lbisD8PzjuJcPAE2p4AKIg7hRWhPLpKbfnw7W6H-JhisyvCQg1HvuNeIZKv5JZfv4YXTmOINedjaq4qy/NoCondit.JPG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/k4bPQ8WfDNhM*5g*lbisD8PzjuJcPAE2p4AKIg7hRWhPLpKbfnw7W6H-JhisyvCQg1HvuNeIZKv5JZfv4YXTmOINedjaq4qy/NoCondit.JPG)\n\nand conditioned buildings:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/k4bPQ8WfDNgi8TI5UMIQqVYmV-276HeW*yTMsxGBT18UhbAy-9uuUwxYsP0QfX6KRqqnmTsN4OIZ7LkAM76n7o*RXDOYe6MZ/Condit.JPG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/k4bPQ8WfDNgi8TI5UMIQqVYmV-276HeW*yTMsxGBT18UhbAy-9uuUwxYsP0QfX6KRqqnmTsN4OIZ7LkAM76n7o*RXDOYe6MZ/Condit.JPG)\n\nThe dimensionless value between 0 and 1 for _levelOfConditioning allows you to create different correlations depending on whether occupants have complete freedom of dress and window operability (0) or have slight restrictions like in a mixed mode building (0.5, for example):\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/k4bPQ8WfDNhdqfQ1OKOsmRZp1umV6Dh5rF6kfk0NMLTFJORN7lovJQSlRPx3-qhUY2KN-70UmMSHJ09bZgLiQXNfY3Nwep2U/05Condit.JPG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/k4bPQ8WfDNhdqfQ1OKOsmRZp1umV6Dh5rF6kfk0NMLTFJORN7lovJQSlRPx3-qhUY2KN-70UmMSHJ09bZgLiQXNfY3Nwep2U/05Condit.JPG)\n\n\n\n**2) Changing Response Time of Occupants** - There has been a bit of a debate in Literature about whether it is better to use the average monthly temperature or a weekly running mean temperature.  The avgMonthORRunningMean input allows you to adjust this like so:\n\nAverage Month:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/k4bPQ8WfDNiUiN0GT87S2Ry3M1UCb8srEwTqPfJzJ5zlbwzQSyedGzcfKv2Sk6Gal9T-Cj9eXq40n5FmgYBXvjUr41bLJsQj/AvgMonth.JPG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/k4bPQ8WfDNiUiN0GT87S2Ry3M1UCb8srEwTqPfJzJ5zlbwzQSyedGzcfKv2Sk6Gal9T-Cj9eXq40n5FmgYBXvjUr41bLJsQj/AvgMonth.JPG)\n\nRunning Mean:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/k4bPQ8WfDNjNMxv3qkHT4nmXAHFfnkwTa5-HaYCmrfmAeKETHDGLpvEkdX58xnS-KgWC5GqzySDAGfU6PucPq0cWM7ZqFDkX/RunningMean.JPG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/k4bPQ8WfDNjNMxv3qkHT4nmXAHFfnkwTa5-HaYCmrfmAeKETHDGLpvEkdX58xnS-KgWC5GqzySDAGfU6PucPq0cWM7ZqFDkX/RunningMean.JPG)\n\n\n\n**3) Greater Temperature Range Tolerance -** While this last one is actually a part of the European and Adaptive standards, you can adjust the range of the comfort band with either the 'eightyOrNintetyComf' input or the comfortClass input like so:\n\nNinety Percent Comfortable\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/k4bPQ8WfDNhyKyyG0kGX4N1ddg1e3GmPyN6GcJOVR3CeqH2nXO2Fmcm0-CnHGLP7xtdHTICH2PsSWtn-wsfXKtgwaZa0jL65/Ninety.JPG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/k4bPQ8WfDNhyKyyG0kGX4N1ddg1e3GmPyN6GcJOVR3CeqH2nXO2Fmcm0-CnHGLP7xtdHTICH2PsSWtn-wsfXKtgwaZa0jL65/Ninety.JPG)\n\nEighty Percent Comfortable\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/k4bPQ8WfDNhxr-vJlep5krWlMHgvbC3SXQSclK5VFA1Pg3VD5X2LmbEp1jbbY0cAO6SL9gaSiSQZ8qKCRUS7FeZTiSME-ECa/Eighty.JPG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/k4bPQ8WfDNhxr-vJlep5krWlMHgvbC3SXQSclK5VFA1Pg3VD5X2LmbEp1jbbY0cAO6SL9gaSiSQZ8qKCRUS7FeZTiSME-ECa/Eighty.JPG)\n\n\n\nAbraham, let me know if you would like more controls over the model or if this is enough to do what you are thinking of.  This example file allows you to construct the images I have above:\n\n[http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;for...](http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;fork=hydra_2&amp;id=Adaptive_Comfort_Chart&amp;slide=0&amp;scale=1&amp;offset=0,0)\n\n\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "February 15, 2016 at 7:06pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nChris, \n\nYou are absolutely right, Brits would often wear three piece suits regardless of weather...style right!!??\n\nVery nice and thorough explanation, I'll have to play around with the component. \n\nThinking out loud...I remember that ASHRAE Standards 55 have a chart that considers humidity against temp in order to determine comfort...but as far as I can remember humidity is not included in the adaptive model, which may be misleading. \n\nkind regards, \n\nMauricio\n", "attachments": [], "created_by_name": "Mauricio Aguilar Cardenas", "created_at": "February 16, 2016 at 3:24am", "created_by": "MauricioAguilarCardenas135", "replies": []}, {"body": "\nThanks Chris,\n\nI like my new friend ('**Ladybug_Adaptive Comfort Parameters**') :-)\n\nThe think is: The building in my case is one from the Bauhaus. Built at the 1930's. Absolutely no mechanical systems. So i have to rely completely in passive means.\n\nTo speed things i'm calculating comfort for Extreme hot/cold week, thinking maybe on typical weeks instead.\n\nThe cool week is kind of \"right\", but the hot (extreme) is giving all night hours 100% comfort. Knowing the climate, there is no way this can be the case. Some of the settings with the european standards give sometimes the right tendency, but still, compared to ASHRAE's the average of % percentage is too high.\n\nAlso my assumptions for flexibility of use/clothing/etc is the maximal. I mean, no constrains on this respect (\"let's be passive as much as we can\").\n\nSo right now i have no specific questions, but rather your advice, if any: \"What you would do ...?? (I don't like these kind of questions, sorry).\n\nA request, yes, if it is possible to output the set temperature for each hour. For instance, when you give the degFromTargetMtx i'll like to know this target. This is for control, and i think this is important for better understanding this black box.\n\nAny other insights you may have, just shoot.\n\n\n\nNot related to the discussion, but if you happened to check the model, we are simulating 2 apartments in the building. The northern one is only one thermal zone. The southern is divided in rooms. I wanted to see how much difference e get between both ways. And there is. No doubt the more detailed modeling looks more reliable. Also if you have some points here, shoot again.\n\n\n\nBTW humidity, look at  page 32-33 in the AC book. Nicol is clear on the \"real\" influence of the humidity, arguing it is mostly psychological than real.\n\nThanks again, and to you too Mauricio.\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "February 16, 2016 at 8:36am", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nAbraham,\n\n\n\nI don't know the type of occupant that you are trying to simulate as well as  you do but, if the concern is that the night time comfort values do not seem realistic, you should keep in mind that both the ASHRAE and European Adaptive models were derived from surveys of awake occupants.  While the topic has not been investigated as well as it should be, the few adaptive-style surveys of sleeping occupants that have been conducted show that people tend to desire significantly cooler temperatures when they are sleeping as opposed to when they are awake.\n\n\n\nNotably, Chapter 8 of Humphrey's recently-published book on Adaptive Comfort ([https://books.google.com/books?id=lOZzCgAAQBAJ&amp;printsec=frontco...](https://books.google.com/books?id=lOZzCgAAQBAJ&amp;printsec=frontcover&amp;dq=Adaptive+Thermal+Comfort+Foundations+and+analysis&amp;hl=en&amp;sa=X&amp;ved=0ahUKEwi6npqSi__KAhUJMj4KHf7SCXMQ6AEIKjAA#v=onepage&amp;q=Adaptive%20Thermal%20Comfort%20Foundations%20and%20analysis&amp;f=false)) provides some interesting insights into this.  In a 1973 survey, Humphreys found that the quality of sleep started to deteriorate at temperatures above 24-26C regardless of the time of year and that there was no clearly-determinable lower limit to comfortable sleeping temperatures (in other words, people were fine at 12C if they were given enough blankets).  He surveyed only British occupants who were sleeping in traditional beds with mattresses and a wide range of blankets.  This is important because the nature of the findings is such that the comfort temperatures would be very different if the survey participants had been sleeping in a hammock or in closer contact with the ground (both popular practices for a number of cultures living in warmer climates).  Traditional mattresses cut the ability to radiate body heat in half as compared to a standing human body and I would venture a guess that this is a big reason why much cooler temperatures are desired while sleeping on mattresses as opposed to standing awake/uptight.\n\n\n\nSo for your case, if you want to account for a time of the day that occupants are sleeping on mattresses, I would change the comfort temperature for this these hours down to 24C.  Otherwise, if you are trying to show the comfortable hours of awake people in your space, your current 100% comfortable nighttime hours are a better estimate.  I have also noticed that nighttime temperatures become comfortable in extreme weeks of hot/dry climates.  This is what is happening in this extreme week simulation of Los Angeles' San Fernando Valley here:\n\n[https://www.youtube.com/watch?v=WJz1Eojph8E&amp;index=3&amp;list=PL...](https://www.youtube.com/watch?v=WJz1Eojph8E&amp;index=3&amp;list=PLruLh1AdY-Sj3ehUTSfKa1IHPSiuJU52A)\n\n\n\nI will put in the ability to set custom values for comfort temperatures into the Adaptive Comfort Recipe soon so that you can test out a 'sleeping comfort temperature' if you would like.  I have created a github issue for it here:\n\n[https://github.com/mostaphaRoudsari/Honeybee/issues/486](https://github.com/mostaphaRoudsari/Honeybee/issues/486)\n\n\n\nI was not so convinced by Nicol's argument about humidity on those pages as I was when I saw the correlations of both operative temperature and effective temperature to surveyed comfort votes in real buildings.  Humphreys shows these correlations on page 106 of the book I linked to above.  Notably, the correlation of Effective Temperature to comfort votes (0.257) is slightly worse than the correlation of just Operative Temperature (0.265).  In other words, trying to account for humidity actually weakened the predictive power of the metric.  This difference in correlation is not so great as for me to discount an Adaptive comfort model based on Effective temperature (as deDear once proposed).  However, the correlations of PMV (0.213) and SET (0.185) to comfort votes are so poor that I now use the PMV model only with great caution.\n\nThis reason for the decreased importance of humidity may be multi-faceted, whether it's Nicol's explanation or another.  Still, the data suggests that we are probably better off ignoring humidity when forecasting comfort and should only consider it when evaluating conditions of extreme heat stress where people's primary loss of heat is through sweating.\n\n\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "February 17, 2016 at 9:01am", "created_by": "ChrisMackey", "replies": []}]}]}