{"body": "\nWhen I complete many Solve Adjacencies (solveAdjc), the program fails to \"Decompose Based on Type\" for some reason, getting hung up. Granted this could be my crappy computer, but it does seem there is some garbage accumulating in the honeybee behind the scenes stuff that is clogging up my ability to get at the solutions as I step through building the model.\n\n\n\nThis occurs only at the final \"solve adjacencies\", where I join the previously solved sets of zones. There are 9 solves in all. In all I only have 32 zones, and I sequentially solve adjacencies so as to control the constructions joining sets of zones. Basically I was trying to have AIR WALLS connect floors and some adjacent zones similar to what was done in the YouTube tutorials created by Mr. Mackey.\n\n\n\nI've tried joining them in numerous ways to no avail. The program seems to get hung up only when I try to display the results, as in the surface sorting and what not.\n\n\n\nPerhaps there is a simpler way for me to stitch together my zones?\n\n\n\nAny help would be appreciated!\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1466371", "name": "eplus_generator_000.gh"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1466372", "name": "thermal_model_geometry.3dm"}], "created_by_name": "Robert Beach", "created_at": "February 18, 2016 at 4:05pm", "created_by": "RobertBeach", "topic": "Limit to Decomposing Zones", "replies": [{"body": "\nRobert,\n\nThis is the most detailed model of a house that I have seen with Honeybee.  Thanks for taking the components to places where they have not gone before.\n\nI opened your file and I was able to get the decompose based on type to run with your model, although, as you can see in the image below, it took 6 minutes:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/x5G1xVWcIZi7PgDf4283RApqWITmJQQXc9pGPGRElb3MACCgxpTTmZM7deMGrpxDY7jB2EwycJ2Zx-GqrShclEcQyNImkKwk/DecomposeWorking.JPG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/x5G1xVWcIZi7PgDf4283RApqWITmJQQXc9pGPGRElb3MACCgxpTTmZM7deMGrpxDY7jB2EwycJ2Zx-GqrShclEcQyNImkKwk/DecomposeWorking.JPG)\n\nI think that we will have to chalk this one up to the fact that you have 31 zones and at least 250 surfaces in your model, which is good if you are trying to study really detailed phenomena in this house but it probably more than you need to get decently accurate energy use profiles for the whole building.\n\n\n\nIt really boils down to what data you are trying to get out of the model.  If you are trying to do detailed comfort map studies, I would recommend the level of detail that you have, although it might be better to split the house up into a few different GH files / energy models unless the phenomena that you are studying really needs to be informed by the energy flow through the whole structure.  If you are just trying to get a good estimate for the energy use of the whole house, a lot of your zones can be combined into larger zones and surfaces combined into larger surfaces without affecting the results much.\n\n\n\nHope this helps,\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "February 20, 2016 at 1:22pm", "created_by": "ChrisMackey", "replies": [{"body": "\nI wonder if changing the access from item access to list access can help in this case for boosting up the performance. GHPython is not really efficient in branching data.\n\n\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "February 20, 2016 at 1:51pm", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nMostapha,\n\nI was intrigued by your suggestion and so I tried switching it to list access with a for loop inside of the component.  Unfortunately, it seems to have taken slightly more time (6.1 minutes), although I would call these runtimes pretty much equal:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/frolw-dWeEiptfF5CaIebeP6gUlOXIKjxIVfShNOmEnpnW2VXjRxyLuEWBM6gbd5KJicgnhc7DaUTgfBN4*X9T7AkQ44fnJy/ListAccess.JPG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/frolw-dWeEiptfF5CaIebeP6gUlOXIKjxIVfShNOmEnpnW2VXjRxyLuEWBM6gbd5KJicgnhc7DaUTgfBN4*X9T7AkQ44fnJy/ListAccess.JPG)\n\n(see attached GH file if you want to see for yourself)\n\n\n\nJudging from what I know of the time-consuming functions in Honeybee, I am nearly positive that the long runtime of the component is the result of the recallFromHBHive() function.  The fact that we make a deep copy of the zone and all of its properties really takes up the vast majority of time in many HB components.\n\nIt has occurred to me that, if we are not editing the zone, there is no need to make a deep copy of it.  If you can confirm that this is true, we really should make a function that just returns the zones as they are.  This would make this component and all of the result visualization components that I have written much, much faster.\n\n-Chris\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1467829", "name": "eplus_generator_000_CWM.gh"}], "created_by_name": "Chris Mackey", "created_at": "February 20, 2016 at 9:54pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nOk, we are going to make a faster function:\n\n[https://github.com/mostaphaRoudsari/Honeybee/issues/492](https://github.com/mostaphaRoudsari/Honeybee/issues/492)\n\nI should have done this a long time ago.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "February 21, 2016 at 10:05am", "created_by": "ChrisMackey", "replies": []}, {"body": "\nMostapha and Robert,\n\nThe \"Decompose Based on Type\" component now runs instantaneously with your 31-zone model (it's now just 35 milliseconds!!!!).\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/qYB6m6cSc*jcP-ha93AcAPg6k13cjsnzUMzfWKOSj4z1Svdw557QJ7EZ3pEWhmHEAogFOLa7qLW2wjI5iPuRxsdwTCValZnt/NewVisualizeFunction.JPG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/qYB6m6cSc*jcP-ha93AcAPg6k13cjsnzUMzfWKOSj4z1Svdw557QJ7EZ3pEWhmHEAogFOLa7qLW2wjI5iPuRxsdwTCValZnt/NewVisualizeFunction.JPG)\n\n\n\nThis change has also reduced the runtime of 10 Honeybee visualization components by a huge margin (many are less than 1% of the previous runtime).  The improved components can be seen in this github commit:\n\n[https://github.com/mostaphaRoudsari/Honeybee/commit/da7dd07efb4a86f...](https://github.com/mostaphaRoudsari/Honeybee/commit/da7dd07efb4a86fe989dcc05129da29ecd0a1ec7)\n\n\n\nI can't believe that I did not think of this earlier.\n\n-Chris\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1468191", "name": "eplus_generator_000_CWM_fast.gh"}], "created_by_name": "Chris Mackey", "created_at": "February 21, 2016 at 5:04pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nDude! I go away for the weekend and wham!\n\nThank you very much I will be testing this shortly.\n\n\n\nFYI, the model is indeed for a comfort analysis as it relates to a small diameter duct system we are prototyping and testing in a laboratory. We are going to create a rather complex airflow network looking into air distribution over a wide range of climates and what not. I personally prefer to use Rhino and Python wherever possible and greatly appreciate your work.\n\n\n\nThanks and I will probably be posting other questions soon!\n\n-Rob\n", "attachments": [], "created_by_name": "Robert Beach", "created_at": "February 22, 2016 at 8:27am", "created_by": "RobertBeach", "replies": []}, {"body": "\nHoney bee is now a killer bee!\n", "attachments": [], "created_by_name": "Robert Beach", "created_at": "February 22, 2016 at 8:51am", "created_by": "RobertBeach", "replies": []}, {"body": "\nThanks Chris! This is very helpful. I think there was another discussion that Grasshope posted while ago that can benefit so much from this change.\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "February 22, 2016 at 8:43pm", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nThanks for the encouragement, Robert!Mostapha, yes, I remember Grasshoper working with a model that had over 50 zones which would also benefit from the changes.  Anyone working with a model larger than 20 zones is likely to see some major improvements.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "February 25, 2016 at 8:28am", "created_by": "ChrisMackey", "replies": []}]}], "id": "1466373"}