{"body": "\nHi,\n\ni must be missing something important, but i couldn't figure it out so i am asking for help. In this script i attached, there are two simple zones for which the adjacency is not getting solved with the solve_adjacencies component. The adjacent wall doesn't turn to \"surface\", it just stays \"outdoors\".\n\nAny advice? thank you for your time\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1467564", "name": "problem with adjacency.gh"}], "created_by_name": "Iason Bournas", "created_at": "February 20, 2016 at 12:52pm", "created_by": "IasonBournas", "topic": "Solve adjacencies won't take effect", "replies": [{"body": "\nIason,\n\nI don't have time to open your model at the moment but have you seen the tutorial video that explains the geometry rules for solve adjacencies?\n\n[https://www.youtube.com/watch?v=cDvBWDA0aF0&amp;index=10&amp;list=P...](https://www.youtube.com/watch?v=cDvBWDA0aF0&amp;index=10&amp;list=PLruLh1AdY-SgW4uDtNSMLeiUmA8YXEHT_)\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "February 20, 2016 at 1:23pm", "created_by": "ChrisMackey", "replies": [{"body": "\nHi Chris,\n\nyes i have seen it before, and i was able to make it work in the past, but something is wrong particularly in this file, anytime you can look at it it's ok!\n\nthank you!\n", "attachments": [], "created_by_name": "Iason Bournas", "created_at": "February 20, 2016 at 1:43pm", "created_by": "IasonBournas", "replies": []}, {"body": "\nHi!\n\n\n\nI looked a bit at this and it puzzled me too, there might be a bug here. <br/><br/>Since you have sent me the Rhinofile, which is not posted here, I could recreate the problem. But I can only recreate the problem in this rhinofile, not when running the script you posted here without the accompanying geometry (btw the script you posted here lacks some geometry.. ;) <br/><br/>\n\nYou had built your geometry 60 kilometers from the origin point. This might be a cause for the bug, but correcting this in rhino did not do the trick either.\n\n\n\nIn the attached rhinofile, it seems the solve adjacencies works fine when the smaller surfaces of a box are aligned, not when the larger surfaces are.\n\nI posted the file here if anyone is interested to look closer at it, otherwise I would recommend rebuilding the rhinofile. Copy only your geometry to a new file and see if it works.<br/><br/><br/><br/>\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1467757", "name": "problemwithadjacency 2.gh"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1467758", "name": "Problemswithadjacency 2.3dm"}], "created_by_name": "Ludvig Haav", "created_at": "February 20, 2016 at 6:02pm", "created_by": "LudvigNyman", "replies": []}, {"body": "\nIason,\n\nYou did not internalize all of your geometry in your GH file so I cannot run your script:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/frolw-dWeEibkuKUgQloR3iuLiVqM-q0bflQXDyAB1wAeF5U7aTcWfGace30w5h2dyohrn-tzGb5g3i3eWRc1FfgDzSsPRns/NotInternalized.JPG\" width=\"704\"/>](http://api.ning.com:80/files/frolw-dWeEibkuKUgQloR3iuLiVqM-q0bflQXDyAB1wAeF5U7aTcWfGace30w5h2dyohrn-tzGb5g3i3eWRc1FfgDzSsPRns/NotInternalized.JPG)\n\nYou will either have to provide your rhino file or internalize the geometry.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "February 20, 2016 at 9:41pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nHi Chris,\n\ni am sorry for that, i forgot to internalize, now i checked with what Ludvig said, the rhino file was drawn at a long distance from the origin point, i move it to the origin point, reassigned the surfaces and it now works. I think it was the distance thing. Sorry for the trouble, i am a bit new to this, thank you\n", "attachments": [], "created_by_name": "Iason Bournas", "created_at": "February 21, 2016 at 2:52am", "created_by": "IasonBournas", "replies": []}, {"body": "\nAh, I should have read Ludvig's post before writing back here. Never forget the importance of refreshing the browser.\n\nMy guess is that it is related to the rhino tolerance and how Rhino stores the coordinate data.  Because Rhino stores all coordinates as floating-point values (that I believe are 16-bit), it only keeps the point data accurate to a certain number of decimal places (1 of 2^16 different values).  If your coordinates get so far from the Rhino origin with so many digits, the accuracy of the coordinates might become coarser than the Rhino model tolerance, causing Honeybee components that use this tolerance to behave weirdly.\n\nMoving your geometry closer to the origin is the safer solution but you could have also made your Rhino model tolerance coarser (by typing the 'Units' command in the Rhino toolbar and changing the tolerance) or you could have adjusted the tolerance_ input of the \"Solve Adjacencies\" component to get it to work.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "February 21, 2016 at 9:50am", "created_by": "ChrisMackey", "replies": []}, {"body": "\nChris,\n\nthis is really good knowledge that you are sharing, i checked the tolerance values as an experiment, and you are right, adjusting the tolerance in the \"solve adjacencies\" components works.\n\nNow keeping the drawing closer to the origin is the safest solution according to what you said, so that is the lesson! I had the plan layout imported from autocad and it \"landed\" somewhere completely off!\n\nI appreciate that you clarified things, case closed!\n\nT h a n k   y o u !\n", "attachments": [], "created_by_name": "Iason Bournas", "created_at": "February 21, 2016 at 10:05am", "created_by": "IasonBournas", "replies": []}]}]}