{"body": "\nHi Mostapha,\n\nThanks to new release of Honey bee. It is actually a great job.\n\nI have a very simple shoe box model with a window. I've tried to use all 8 CPUs of my system to run  just an static simulation (just for one hour 21 June @12:00). I got an Out of memory error.\n\nThe only special thing that I used is a dielectric material.\n\nwould you please help me to figure out this problem.\n\nThank you in advance.\n\n\n\nFazel\n\n\n\n\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1468865", "name": "01.png"}], "created_by_name": "Fazel Ganji", "created_at": "February 22, 2016 at 11:39am", "created_by": "fazelganji", "topic": "Out of memory error", "replies": [{"body": "\nHi Fazel,\n\n\n\nThat's a Radiance error. I found [this email](http://radiance-online.org/pipermail/radiance-general/2011-August/008119.html) on Radiance mailing list but the answer is not clear. What is the definition that you're using? Is the file works fine with plastic material?\n\n\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "February 22, 2016 at 8:39pm", "created_by": "MostaphaSadeghipour", "replies": [{"body": "\nThe culprit is the dielectric material....rays tend to get \"lost\" inside it (or something like that).  Especially if it is a solid where light is supposed to enter and leave. I used to think that it had something to do with total internal reflection. Since Radiance is a stochastic ray tracing engine, there will always be some rays that undergo total internal reflection.\n\nI once had an [online discussion](https://unmethours.com/question/11541/how-does-one-correct-errors-related-to-truncated-images/?answer=11571#post-id-11571) with Greg Ward  about this. I am pasting the relevant excerpt below:\n\n\n\nIs there a way to debug or track a rendering processes during runtime ie to know if it will render at all ? Secondly, is there a likelihood of something like total internal reflection happening and light rays not escaping ?\n\nThe progress reports are the best way to make sure that the renderings are progressing, which they seemed to be doing until they got killed. Even in cases where total internal reflection prevents rays escaping, the tracing will hit some limit (either -lw or -lr and setting both to 0 will give an error) to prevent an infinite loop. Believe me, if there were any infinite loops in Radiance, people would be complaining about it!\n", "attachments": [], "created_by_name": "Sarith Subramaniam", "created_at": "February 22, 2016 at 9:50pm", "created_by": "sarith", "replies": []}, {"body": "\nThank you Mostapha and Sarith\n\nI also predicted the effect of total internal refraction inside the water layer. and I actually wanted to simulate this effect. and I am pretty sure that I need more than 6 as ab_ parameter. \n\nwhat can I do?\n", "attachments": [], "created_by_name": "Fazel Ganji", "created_at": "February 23, 2016 at 4:38am", "created_by": "fazelganji", "replies": []}, {"body": "\nOK, I replaced the layers of Trans material with Glass (for layers) and kept the Dielectric Water. now it is working for ab 1 to 6. \n\nas you said Trans are very hungry :)\n", "attachments": [], "created_by_name": "Fazel Ganji", "created_at": "February 23, 2016 at 7:21am", "created_by": "fazelganji", "replies": []}, {"body": "\nHi Fazel,\n\n\n\nI would be careful about replacing materials (especially if it is for an actual project). Trans and Dielectric are two very different kinds of materials. Trans is usually used for modelling fabrics, certain types of plastics etc. while Dielectric is used for modelling glass, water etc. You can find more details here: [http://radsite.lbl.gov/radiance/refer/ray.html#Materials](http://radsite.lbl.gov/radiance/refer/ray.html#Materials)\n\n\n\nSarith\n", "attachments": [], "created_by_name": "Sarith Subramaniam", "created_at": "February 23, 2016 at 2:18pm", "created_by": "sarith", "replies": []}, {"body": "\n good notice. Thank you Sarith.\n\nBut I used Trans for clear ETFE foil and just replaced it with a glass (export of Optics 6 for Radiance).\n", "attachments": [], "created_by_name": "Fazel Ganji", "created_at": "March 4, 2016 at 2:04pm", "created_by": "fazelganji", "replies": []}]}]}