{"body": "\nI've started using Grasshopper recently and built up this energy &amp; daylight analysis analysis based on [Mostapha's example file](http://hydrashare.github.io/hydra/viewer?owner=mostaphaRoudsari&amp;fork=hydra_1&amp;id=Integrated_Daylight_and_Energy_simulation&amp;slide=0&amp;scale=1&amp;offset=0,0).\n\n\n\nI added zones because I want separate lighting schedules for each perimeter zone but I can't seem to visualize my daylight results. I'm trying to use the recolor mesh component but the number of results points is five times as long as the number of points in my mesh. I can see the source of the error using param viewer  - I do have (for example) 100 points in my mesh, but 500 results points from the UDI output. I've included a screenshot of the error, plus a screenshot of the param viewer \"mismatch\" and my grasshopper file. My gh file is large but I've grouped the problem areas in orange.\n\n\n\nMy initial guess was that it was calculating daylight results for each zone and for each mesh (5x5)?\n\n\n\nI'm also having trouble with my EPConstruction and RADMaterial items. They seem to work initially when I copy them from another file but they frequently \"fault out\" giving the error to Let Honeybee fly or Update Honeybee. I'll re-update HB, delete and re-add the components and maybe get them working again but it's happened so frequently I'm not sure if there's something else causing this error. \n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1472436", "name": "Error.PNG"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1472437", "name": "Mismatch.png"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1472438", "name": "Integrated_Daylight_and_Energy_2016-02-25.zip"}], "created_by_name": "Lizzie Adams", "created_at": "February 26, 2016 at 10:56am", "created_by": "LizzieAdams", "topic": "Daylight results visualization - length of results is 5x size of input mesh", "replies": [{"body": "\nI have actually just solved my own problem - with the help of a co-worker. I needed to get my lighting schedule from the zone program, not the HBZone. When I got the schedule from the HBZone, I got five lighting schedules, which then created five results per zone. Here's a screenshot. I'll upload the gh file when I've gotten the results to properly merge into one graph.\n\nHaven't solved the EPConstruction and RADmaterial issues if anyone has any suggestions. \n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1472263", "name": "Fixed.PNG"}], "created_by_name": "Lizzie Adams", "created_at": "February 26, 2016 at 1:19pm", "created_by": "LizzieAdams", "replies": []}, {"body": "\nThe edited GH file with visualization of daylight results is attached. \n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1472600", "name": "Integrated_Daylight_and_Energy_2016-02-25_Solved.zip"}], "created_by_name": "Lizzie Adams", "created_at": "February 26, 2016 at 6:50pm", "created_by": "LizzieAdams", "replies": []}]}