{"body": "\nis it possible to get the output (H/C/F) per zone and not total building energy for each category? I'm developing a matrix for building orientation and am able to get branched data for the other outputs, but the ones listed above are an hourly summary. Using VAV with reheat.\n\n<br/>thanks!\n\n<br/>joel\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1480844", "name": "honeybee branched data.jpg"}], "created_by_name": "Joel Yow", "created_at": "March 9, 2016 at 4:30pm", "created_by": "JoelYow", "topic": "Heating/Cooling/Fan Energy by zone for central OpenStudio systems", "replies": [{"body": "\nCan you also share with us about what is the output of heating, cooling and lighting looks like? It should be already branched. I'm not sure why it returns a list in your case.\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "March 10, 2016 at 8:51am", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nthe issue occurs when i change from ideal air loads to an OpenStudio system...I'm backchecking my inputs now to verify all the proper controls/systems are in place for an OS run. I can't figure out why it's basically performing a \"mass addition\" for the \"heating/cooling/fan energy\" for the OpenStudio system but branching the ideal air loads. I'll post my file tonight for review...thanks mostapha\n", "attachments": [], "created_by_name": "Joel Yow", "created_at": "March 10, 2016 at 2:23pm", "created_by": "JoelYow", "replies": []}, {"body": "\nBasically, I want to treat an array of Breps as separate, single zone buildings, not zones part of a larger whole...\n", "attachments": [], "created_by_name": "Joel Yow", "created_at": "March 10, 2016 at 2:52pm", "created_by": "JoelYow", "replies": [{"body": "\nJoel,\n\nWhen you specify a centralized HVAC system like VAV, the electric and fuel energy is consumed at the plant (or the central boiler / chiller) and not at the zone. If you specify a system where energy is consumed at the zone-level like Packaged Terminal Heat Pumps (PTHP) or ideal air loads systems, you get a different energy consumption for each zone.\n\nIf you really need a sense of how much each zone is consuming with a VAV system, I could build the capability to get zone-level sensible and latent heating/cooling and output it from the Honeybee-Read EP HVAC Result component.  However, it has to be clear to everyone that this energy is not electricity or fuel but just \"the amount of heat added to or removed from the zone.\"  In other words, adding up all of the cooling energy of the zones is not going to be equal to the electric energy consumed by the chiller.\n\nLet me know if this makes sense and whether you would use the zone sensible/latent capability if I built it in.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "March 11, 2016 at 12:01pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nThanks Chris,\n\nI understand the concept and the logic behind it, I'm looking to treat each Brep in the array as it's own building, not zone, so i can study the overall impact at the site energy consumption level as it relates to window-wall area ratio and orientation. if there was a way to pass breps as \"buildings\", so you can study different options simultaneously, instead of zones, that'd be awesome...but I understand if this isn't possible.\n\nthanks!\n\n\n\njoel\n", "attachments": [], "created_by_name": "Joel Yow", "created_at": "March 11, 2016 at 12:08pm", "created_by": "JoelYow", "replies": []}, {"body": "\nJoel,\n\n\n\nWhat you are asking for is very easy to do thanks to the beautiful simplicity of Grasshopper and Mostapha's brilliance in applying it.  All that you have to do if you want to assign a separate VAV system to each zone is graft the input into the Honeybee_OpenStudio Systems component like so:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/IReZCGmClNQrSfErr3mzH4PIwKUNhvtgW-4Ve2cvq6lE0HzQenWFvkDDCy8*MsBNTkYHk3nTXSQTf1jbfdHviDlpl80ZVITy/GraftedVAV.JPG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/IReZCGmClNQrSfErr3mzH4PIwKUNhvtgW-4Ve2cvq6lE0HzQenWFvkDDCy8*MsBNTkYHk3nTXSQTf1jbfdHviDlpl80ZVITy/GraftedVAV.JPG)\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/IReZCGmClNRgn30MgKQiDfuzVBGUZRJENjWdOhWVbknTPKxxZPoOOkxrK0tBYXSobUyCIBEO1lssOH66rzFXp*OVRv69Pkfh/VAV_SingleZone.JPG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/IReZCGmClNRgn30MgKQiDfuzVBGUZRJENjWdOhWVbknTPKxxZPoOOkxrK0tBYXSobUyCIBEO1lssOH66rzFXp*OVRv69Pkfh/VAV_SingleZone.JPG)\n\nBy default, the input into the Honeybee_OpenStudio Systems component is flattened so that you get one centralized system like this:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/IReZCGmClNS5kzao1Q1swNMz6unYBsTEW7ijTcwHMJL-Y20OOZSpNv*scJP*Pxc5oQtJq7gINrQyjbSSldqoaimkOaGQg8rO/FlattenedVAV.JPG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/IReZCGmClNS5kzao1Q1swNMz6unYBsTEW7ijTcwHMJL-Y20OOZSpNv*scJP*Pxc5oQtJq7gINrQyjbSSldqoaimkOaGQg8rO/FlattenedVAV.JPG)\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/IReZCGmClNS04K5lTBdm4K73Zfqji1pWSPYZWWdiqEuECm3Gh*DUwYh9gO-ULrClgseBQhqEYkM2Bd*LJ1oLE4WLsyzeb-3Y/VAV_TwoZone.JPG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/IReZCGmClNS04K5lTBdm4K73Zfqji1pWSPYZWWdiqEuECm3Gh*DUwYh9gO-ULrClgseBQhqEYkM2Bd*LJ1oLE4WLsyzeb-3Y/VAV_TwoZone.JPG)\n\nAs long as your zones are organized in a data tree / grafted list, you can assign separate systems to different groups of zones.\n\n\n\nLet me know if this is clear.  I remember it took me a good year of working with Grasshopper before I understood data trees and grafting.  It's a super-useful feature once you get the hang of it.\n\n\n\n-Chris\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1482973", "name": "FlatenedZoneGraftedZone.gh"}], "created_by_name": "Chris Mackey", "created_at": "March 12, 2016 at 9:34am", "created_by": "ChrisMackey", "replies": []}, {"body": "\nthanks chris, apologies for the delayed response (didn't get a notification that you posted a response). I'm quite familiar with data tree manipulation - i was thrown off by the default flattening of the inputs for the components...thought it was a necessary part of the process. now that i understand it's not, things are working quite well! thanks again.\n\n\n\njoel\n", "attachments": [], "created_by_name": "Joel Yow", "created_at": "April 14, 2016 at 9:41am", "created_by": "JoelYow", "replies": []}]}], "id": "1480845"}