{"body": "\nDear All,\n\nI'm doing my master study of how to determine the optimum window opening ratio (office space) using typical materials (glass and wall properties) for a single climatic location. the study will include how a proper window opening size can provide a good daylight and minimizing the usage of artificial lighting during most of the day times, in the same time i believe it can minimize the HVAC energy required to cool down overheated spaces that are a result of using excessive window openings.\n\n\n\nFor now i'm using LB+HB to study this model and i would love to get some feedback from expertise who went through similar process and advise with useful tips that can help me on this topic.\n\n\n\nAppreciate your help.\n", "attachments": [], "created_by_name": "Ataur Rahman", "created_at": "March 10, 2016 at 8:46am", "created_by": "AtaurRahman", "topic": "Daylighting and Energy Modeling", "replies": [{"body": "", "attachments": [], "created_by_name": "Dustin Altschul", "created_at": "March 10, 2016 at 9:13am", "created_by": "DustinAltschul", "replies": [{"body": "\nThanks dustin taking the time to respond on the topic,\n\n\n\nyour way of approach is the one I've already set to follow it make sense. and systematic.\n\nand actually maybe i forgot to explain this what i've already started to build, my test is on office space that i'm looking forward to experiment. The light value that i'm looking for is between 300 to 500 lux max on the work surface. then i built a parametric office space that i can modify by slider input, and now i'm working on to use genetic algorithm to find ideal window opening size with optimum day light value and eventually less energy consumption. but i'm having hard times to figure out how i can get accumulative or average daylight value by setting specific opening ratio each day rather than each hour, cause it will take a lot of time to study daylight value for every single hour of each day in a year then compare it to other day values. and after that how i can compare that daylight value along with energy consumption is it by heat gain and heat loss or rad temp or cooling requirement ... which one can give better indication of energy use for comparison ? \n\n\n\nthanks again\n", "attachments": [], "created_by_name": "Ataur Rahman", "created_at": "March 12, 2016 at 8:10am", "created_by": "AtaurRahman", "replies": []}]}]}