{"body": "\nHey HB &amp; LB community!\n\n\n\nI have a question regarding the display of results done by \"Recolour mesh\" component. \n\n\n\nWhen exporting results I like to blur the results, bake the colour mask into Rhino and then export it together with a plan drawing. When saving to PDF I normally export the plan with a vector style linework (lines are displayed better) and the mesh as raster, since the it cannot be exported as a vector.\n\n\n\nIs there another way that I can export a mesh as a vector from Rhino? Or maybe blur a hatch, since Rhino allows me to export as a vector?\n\n\n\nThanks!\n\n\n\n//Mihail\n\n\n\n \n", "attachments": [], "created_by_name": "Mihail Todorov", "created_at": "March 10, 2016 at 7:29am", "created_by": "MihailTodorov", "topic": "Recolour mesh result export as a vector style linework", "replies": [{"body": "\nLook at the new bakeIt options in the component.\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "March 10, 2016 at 8:15am", "created_by": "AbrahamYezioro", "replies": [{"body": "\nYes, I checked them. If I export the results as a hatch I cannot blur it. If I export it as a mesh and blur it I cannot export it as a vector-based result.\n", "attachments": [], "created_by_name": "Mihail Todorov", "created_at": "March 10, 2016 at 9:41am", "created_by": "MihailTodorov", "replies": []}, {"body": "\nMihail,\n\nThis is exactly the reason why we still have a \"Ladybug_Mesh-To-Hatch\" component in the 4 | Extra Tab.  This component allows you to take any colored mesh (blurred or otherwise) and convert it to a group of colored hatches.\n\nHowever, depending on what you mean by \"blur\" the mesh, you might encounter difficulty in the fact that you cannot have a gradient within a single hatch (each hatch can have only one color).  So, to be more specific about what I you are trying to do here, you don't want to \"blur\" or \"weld\" the mesh with the native GH \"weld\" or \"blur\" components since this will result in the same number of mesh faces and the same number of single-colored polygons when you convert it to a hatch.\n\nRather you want to \"subdivide\" the mesh it into smaller faces with interpolated colors between them.  This is exactly what Weaverbird was designed to do:\n\n[http://www.grasshopper3d.com/group/weaverbird](http://www.grasshopper3d.com/group/weaverbird)\n\nUsing Guilio's awesome plugin and particulatly the Catmull-Clark subdivision, you can get closer to a smooth gradient in a vector format:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/0cvLFld*ZY2sP6AlyFrurawVHSgrMZHj*gFw3PXlX1yIE1Gsu1B*O87MsEGC-T80h1c0XMnS6Rp-*38Oz-7jSJM-ZTYaau6p/SubdividedHatch.JPG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/0cvLFld*ZY2sP6AlyFrurawVHSgrMZHj*gFw3PXlX1yIE1Gsu1B*O87MsEGC-T80h1c0XMnS6Rp-*38Oz-7jSJM-ZTYaau6p/SubdividedHatch.JPG)\n\nHope this helps,\n\n-Chris\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1482384", "name": "Subdivided Hatch.gh"}], "created_by_name": "Chris Mackey", "created_at": "March 11, 2016 at 11:14am", "created_by": "ChrisMackey", "replies": []}]}], "id": "1481175"}