{"body": "\nStepping out the Rhino-sphere and into Revit and Dynamo. I'm looking to analyze environmental dependent facades and having trouble wrapping my head around how to get there? Current workflow is taking a jpeg of a heat map, reading the hues as values and assigning dependencies. Ideally, I'd like to analyze the facade through Ladybug and assign variables to the range of radiation values and further analyze the results post intervention. Any help would be appreciated. Thanks! \n\n\n\nB\n", "attachments": [], "created_by_name": "Bomin Kim", "created_at": "March 10, 2016 at 12:45pm", "created_by": "BominKim", "topic": "Ladybug + Dynamo", "replies": [{"body": "\nHi Bomin, I'm not sure what is exactly your question. The component in Dynamo does return the values for solar radiation or sunlight hours. You can take the numbers and run any post-processing that you want. Check this [example](http://hydrashare.github.io/hydra/viewer?owner=mostaphaRoudsari&amp;fork=hydra_1&amp;id=Sunlighthours_Ladybug_Dynamo&amp;slide=0&amp;scale=1&amp;offset=0,0) for sunlight hours. Radiation analysis is a very similar workflow but you need to generate a sky/instead of sunpath and use radiation analysis node.\n\n\n\n[<img class=\"align-full\" src=\"https://raw.githubusercontent.com/mostaphaRoudsari/hydra_1/master/Sunlighthours_Ladybug_Dynamo/definition.JPG\"/>](https://raw.githubusercontent.com/mostaphaRoudsari/hydra_1/master/Sunlighthours_Ladybug_Dynamo/definition.JPG)\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "March 10, 2016 at 5:54pm", "created_by": "MostaphaSadeghipour", "replies": [{"body": "\nThanks Mostapha\n\n\n\nLooking back, my question wasn't very well phrased. I currently have a facade where each panel's normal is perpendicular to the sun angle. The goal is to instead use radiation values as a parameter and have the facades angle to optimize interior radiation values. I used your test file and replaced all sunlight hour analysis with solar radiation and it still won't work. I get a non-sequence stackvalue error and occasionally, an error at the genskymatrix node. Any ideas?\n", "attachments": [], "created_by_name": "Bomin Kim", "created_at": "April 12, 2016 at 11:59am", "created_by": "BominKim", "replies": []}, {"body": "\nHi Bomin. There is an example file for running radiation analysis. Have you tried that? Also what is the error message that you get?\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1507174", "name": "05_radiationAnalysis.dyn"}], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "April 12, 2016 at 12:12pm", "created_by": "MostaphaSadeghipour", "replies": []}]}], "id": "1481640"}