{"body": "\nDear All,\n\nIs there a way to take-off average daylight results in LB+HB instead of hourly based results ?\n\n\n\ncause i'm trying to study more than 100 different parametric openings and their effect on daylight values so it will take me a veeery long time to study each of the window sizes on each hour every single day in a whole year. i know its not accurate to take the average but at least it can limit the options that i should consider.\n\n\n\nThanks and appreciated.\n", "attachments": [], "created_by_name": "Ataur Rahman", "created_at": "March 12, 2016 at 11:35am", "created_by": "AtaurRahman", "topic": "Average Daylight Results ?", "replies": [{"body": "\nHey Ataur,\n\n\n\nmy question would be - do you really need an annual simulation?\n\nWhat is really the goal of the testing?\n\n\n\nI don't know your project exactly but what I would do is following:\n\n\n\nDepending on the location of the project and the target of the testing I would choose a beginning sky+day.\n\n\n\nEasiest ist to begin with just overcast sky or even diffuse sky - the day does not matter that much - would probably choose some day in June or so.\n\nThe outcome of this - you get a rough estimation of daylight levels + distribution of your system under that sky. I guess one could pick a few winners at the end of the study  and then proceed to test these winners under more extreme conditions.\n\nI would probably thest somewhere in March, June and December - blue sky with sun.\n\n\n\nSo that would be my workflow for a general project here in Europe. Here overcast sky is present most of the year.\n\n\n\nHope it helped\n\n\n\nThomas\n", "attachments": [], "created_by_name": "Thomas Lechner", "created_at": "March 12, 2016 at 11:55pm", "created_by": "ThomasLechner", "replies": [{"body": "\nHi Thomas,\n\nwell annual simulation won't be necessary if i can run the test at least at the extreme periods of the year (Summer and Winter solstice) to reduce the complexity of the analysis as you said march june sep and dec.\n\n\n\nmy project is to determine the optimum opening size on each elevation separately  (north, south, east and west) that can provide best daylight around the year.\n\n\n\nwhat i did as following: modeled a parametric opening window with number sliders to control the window size on each elevation, and each window has 5 to 9 different dimensions ( Sizes in terms of H and W), then i want to run a simulation for each elevation to define the best window size that can provide maximum value of 500 lux average as an office space by examining the opening size against lux value each hour of the day from 8:00am to 6:00pm using galapagos. but the problem is when i used galapagos to run the simulation i couldn't find a way to get average window size of the 10 hours but instead i have to run the simulation each hour of the day which will result in 10 different windows instead of having a single window size that can provide me a decent daylight value during the whole day.<br/>\n\n\n\ni don't know if there is anyway around ?\n", "attachments": [], "created_by_name": "Ataur Rahman", "created_at": "March 14, 2016 at 11:32am", "created_by": "AtaurRahman", "replies": []}]}]}