{"body": "\nHello everyone,\n\n\n\nI am running a series of daylight and glare simulations and I think I see some inconsistency in my results.\n\n\n\nI am using the -x vector as my North vector, as it is visible by the first screenshot of the SunPath over the development. The day of analysis is 15th of July and you can clearly see the position of the sun at 12:00 noon on that day in the same screenshot.\n\n\n\nI am then running a glare simulation on one of the two big halls of the development (marked with green color in the same screenshot) for that specific date and time. My view orientation for the glare simulation is towards the West (so -y vector).\n\n\n\nI would expect that, given the position of the sun and the skylight on the roof of the room, the sun spot on the floor of the Hall would be on the left side (or right side if you look at it from the top view). However, the glare result (seen in the second picture attached) gives the opposite situation.\n\n\n\nIs it me not seeing something or could it be that the vector is lost somewhere? That spot coming from reflection on the wall seems very unlikely.\n\nI am uploading my definition (no geometry though), I believe it is the typical workflow shown by Mostapha.\n\n\n\nAny insight would be welcome. Thanks in advance.\n\n\n\nKind regards,\n\nTheodore.\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1485601", "name": "SunPath.jpg"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1485602", "name": "July15thHall.GIF"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1485690", "name": "Daylight&Glare.gh"}], "created_by_name": "Theodoros Galanos", "created_at": "March 15, 2016 at 11:05pm", "created_by": "TheodorosGalanos", "topic": "Sunpath and Glare not matching, or is it me?", "replies": [{"body": "\nHi Theodoros,\n\n\n\nCould it be related to my recent post about Daysim north point rotation? \n\nSee [http://www.grasshopper3d.com/group/ladybug/forum/topics/north-point...](http://www.grasshopper3d.com/group/ladybug/forum/topics/north-point-model-rotation-reversed-in-daysim-calculations)\n\n\n\n-M\n", "attachments": [], "created_by_name": "M. Söderlund", "created_at": "March 17, 2016 at 5:48am", "created_by": "MikaelSoederlund", "replies": []}, {"body": "\nHi Theodore, Have you tried to run a top view and see the shadows? Is that also reversed? Maybe we're making a mistake in rotating the sky. I will try to give it a try myself tomorrow morning if I get a chance.\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "March 17, 2016 at 11:23pm", "created_by": "MostaphaSadeghipour", "replies": [{"body": "\nHi Mostapha,\n\n\n\nSorry I was out of office all this time didn't have time to check it. I believe I will be running the case again tomorrow so I can check it then. Have you tried yourself in the meantime? Let me know if you do. I didn't try the top view per se I just saw the patterns of light and shadows seemed to be opposite, from the attached pictures.\n\n\n\nKind regards,\n\nTheodore.\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "March 22, 2016 at 8:23pm", "created_by": "TheodorosGalanos", "replies": []}]}], "id": "1485603"}