{"body": "\nHi everyone,\n\n\n\nI'm trying to do some energy simulations with honeybee. I usually use Diva but in last weeks I have started with Honeybee.\n\nI'm trying different work-flow to simulate various types of shading devices.\n\nIn file attached you can find all the different attempts. Unfortunately I have some problems with these simulations.\n\n\n\n1) - The first problem is related to EP Construction components: You need a newer version of ladybug to use this component.... so I can't create any new materials.\n\nI have tried to use the update components but it doesn't run and produces this error:\n\n**Downloading the source code...**<br/>**Removing Old Version...**<br/>**Runtime error (Win32Exception): WindowsError**<br/>**Traceback:**<br/> **line 235, in main, \"&lt;string&gt;\"**<br/> **line 264, in script**\n\n\n\n2) (Red Box) I have simulated a box with a single window facing south. Both with or without shading (and different shading combinations) I obtained always the same result. I used the window shade generator component and seems It is working well.\n\nWhat is the problem?\n\n\n\n3) In the box 3, I have only changed the approach to define the thermal zone. The E+ component gives me this error: Solution exception: 'hb_EPFenSurface' object has no attribute 'blindsMaterial'. I don't know what is the problem.\n\n\n\nAt the end, I tried to simulate a complex geometry shading device. As you suggest, in other post, I used HBContext component but during the E+ simulation compares this error message: **'None Type' object is unsubcriptable. **Maybe the geometry is too complex or something goes wrong with the mesh?\n\n\n\nThank you for your availability and help. And sorry for too many questions.\n\n\n\nBye\n\n\n\nAndrea\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1485284", "name": "HB attempts.gh"}], "created_by_name": "Andrea Zani", "created_at": "March 15, 2016 at 10:25am", "created_by": "AndreaZani905", "topic": "Some problems with E+ honeybee simulation", "replies": [{"body": "\nAndrea,\n\nYou didn't internalized all of the geometry. Some parts are missing. Do internalize and upload again.\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "March 15, 2016 at 10:34am", "created_by": "AbrahamYezioro", "replies": [{"body": "\nSorry.\n\n\n\nIn attached you can find the right version.\n\n\n\nThanks\n\nA\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1485626", "name": "HB attempts.gh"}], "created_by_name": "Andrea Zani", "created_at": "March 15, 2016 at 1:33pm", "created_by": "AndreaZani905", "replies": []}, {"body": "\nAttached a working file.\n\nBasically i updated manually some of the components (seems to be that this happens a lot lately).\n\nFor your 3rd case are you aware that the external shading is not dedfined since you disabled the  boundary surfaces component? I enabled it and it takes a lot to solve. Creates 54000 surfaces!!!\n\n-A.\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1485507", "name": "HBattempts_AY.gh"}], "created_by_name": "Abraham Yezioro", "created_at": "March 15, 2016 at 3:33pm", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nThank you so much. \n\nNow the components works well.\n\n\n\nI have tried to resimulate the energy needs, with different setting (no shade and different shading device configurations) but the results don't change. Is the workflow correct? \n\n\n\nAbout the complex shading, I kept it enabled because it takes a lot to start when gh file starts. I enabled it for the simulation. I know that it takes a lot to solve.\n\nDo you know some technique in order to reduce the number of surface? or other method to evaluated it? Doesn't the simulation run due to the surface number?\n\n\n\nThanks in advance\n\n\n\nBest,\n\n\n\nAndrea\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1486421", "name": "Simulation1.gh"}], "created_by_name": "Andrea Zani", "created_at": "March 16, 2016 at 2:09pm", "created_by": "AndreaZani905", "replies": []}, {"body": "\nI would recommend you to set a schedule for the blinds and be sure that the setpoint for the blinds to be on. You set 10 w/m2. I suspect the blinds are always on because of those conditions and then you don't get any change in the results.\n\nKeep in mind that the geometry the component is giving you is not relevant for the blinds. Only when you use the shadeBreps output as context.\n\nDon't know what to suggest to reduce the number of surfaces, beyond what Chris suggested in a different discussion. For your case it is not very effective. Maybe i'll use simple surfaces parametrically controlled.\n\n\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "March 17, 2016 at 2:23am", "created_by": "AbrahamYezioro", "replies": []}]}], "id": "1485285"}