{"body": "\nHi All,\n\n\n\nWe're running a simple box model using HB to size some window shades for a multifamily residential project in Washington, DC.  Specifically we're looking the model's peak cooling load to determine the amount of solar load we can shave off with the addition of exterior shading.  We noticed that peak cooling was occurring at night in autumn and dug a little deeper.  We found the following peak load components:\n\n\n\n1. Lighting 1.04 w/sf (ok)\n\n2. Equipment 0.5 w/sf (ok)\n\n3. People 0.43 w/sf (ok)\n\n4. Infiltation 0.5 w/sf (ok)\n\n5. Opaque conduction -.08 w/sf\n\n6. Glazing conduction - 0.2 w/sf\n\n7. Outside Air 3.6 w/sf (very high)\n\n8. Outside air temp @ peak  74F (DB), 72F (WB)\n\n\n\nIt appears default outside air loads are creating the equivalent of laboratory equipment cooling loads in our sapce.  We've disconnected all ventilation inputs from the _HBZones component to reduce the amount of outdoor air introduced to the space and are still finding very high OA loads.  Has anyone experienced similarly high OA loads or knows of opportunities to adjust this default?  Obviously it's throwing our studies off...\n\n\n\nThanks,\n\n\n\nColin\n", "attachments": [], "created_by_name": "Colin Schless", "created_at": "March 16, 2016 at 3:37pm", "created_by": "ColinSchless", "topic": "E+ Peak Load / High Default Outside Air", "replies": [{"body": "\nHi Colin,\n\nNice to see you on the forums!\n\nIt's difficult to know exactly what is going on without having the GH file.  If you upload the file on this thread, we can re-create the situation on our own machines and help you more precisely.\n\nIn the meantime, I can tell you that, if you are using the \"Run Simulation\" component and the ideal air system, I am certain that you will be able to use the existing components get the controls working in a manner that gives you results that make sense.  In particular, you should check out the \"Set EnergyPlus Loads\" component, the \"Set EnergyPlus Schedules\" component, and (most importantly) the \"Set Ideal Air Loads Parameters\" components.  Also, requesting zoneHVACParams on the \"Generate EP Output\" component and using the \"Read EP HVAC Result\" component will give you some more outputs to help debug your model:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/fOv0QAWOziitSpsO1qqpoAFgbw82mY5CdLeDvZ5FtUCzcBjibLP87fm9RLA5m80oONRV7HjE8BrryWRwymwpyqAzh6Fkf5t*/DebuggingIdealAirSystem.JPG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/fOv0QAWOziitSpsO1qqpoAFgbw82mY5CdLeDvZ5FtUCzcBjibLP87fm9RLA5m80oONRV7HjE8BrryWRwymwpyqAzh6Fkf5t*/DebuggingIdealAirSystem.JPG)\n\nHope this helps,\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "March 16, 2016 at 6:36pm", "created_by": "ChrisMackey", "replies": [{"body": "\nThanks Chris!  Really appreciate your quick and thorough reply.\n\n\n\nWe used the \"Read EP HVAC result\" component and found that the ideal air system is introducing 100% of outdoor humidity through ventilation.  Washington D.C. is humid and warm at night in September, so the peak load was occuring at 9pm. The outside air @ 3.6 w/sf I reference is mostly latent load.  This seems like a critical consideration for HB studies in humid climates- if one is modeling an ideal-air system, its possible that unrealistic amounts of humidity are being introduced into zones.  If studying passive strategies, the humidity load can dominate results, hiding the reported effectiveness of things like shades, SHGC, insulation, etc.  Interested in your thoughts on this!\n\n\n\nA couple follow up questions:\n\n\n\n1. We'd like to disect the peak sensible cooling-load hour with our ideal air system.  We've created a workaround by locating the peak sensible hour through the 'otherZonedata' output, running a second single-hour simulation for that hour, and using the energybalance component to look at the solar radiation, conduction, etc. components for that hour.  Is there an easier way to extract the peak sensible cooling hour from an HB simulation and then disect the hour into its individual load components?  I am skeptical about the results of a single hour simulation.  \n\n\n\n2. The 'zone ideal loads supply air sensible' output from 'otherZonedata' outputs really large numbers (days with cooling report 6-7 digit numbers whereas out actual load was only 5.4kW).  Do you know what units these results are in?  In our workaround method we're only using these numbers to locate the peak sensible day (they indicated morning mid-june which sounds right for an E facing room).  That said,  we'd like to understand the numbers so we can QC the output.\n\n\n\nThanks!  \n\n\n\nColin\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/zbUV0kjiVyd96SwoyKnz4gB47Q0HRgtX7joitfNhLazFZnMTBef2vMw6W31vGOcY1bLH8GubBtS6SsrML82Mk8Xz3bqNnUa5/pic2.png?width=721\" width=\"721\"/>](http://api.ning.com:80/files/zbUV0kjiVyd96SwoyKnz4gB47Q0HRgtX7joitfNhLazFZnMTBef2vMw6W31vGOcY1bLH8GubBtS6SsrML82Mk8Xz3bqNnUa5/pic2.png)[<img class=\"align-full\" src=\"http://api.ning.com:80/files/zbUV0kjiVycqie7xqP69LoCn77FQ9PY1kxVs6Gr1vKkIYj0moLfoBOH4oI4ef9Yc0o8FcU8tu81xCOh2iT1AAmIibr147wIZ/Pic1.png?width=721\" width=\"721\"/>](http://api.ning.com:80/files/zbUV0kjiVycqie7xqP69LoCn77FQ9PY1kxVs6Gr1vKkIYj0moLfoBOH4oI4ef9Yc0o8FcU8tu81xCOh2iT1AAmIibr147wIZ/Pic1.png)\n\n\n\n\n\n\n", "attachments": [], "created_by_name": "Colin Schless", "created_at": "March 17, 2016 at 11:43am", "created_by": "ColinSchless", "replies": []}, {"body": "\nColin,\n\n\n\nWe selected the defaults of the ideal air system to be in line with what we thought were common low-energy practices but, if we are to be honest with ourselves, many of these practices have a bias towards higher-latitude climates where high humidity is less of a issue.  The defaults do not include any humidity control, use a differential dry bulb air side economizer, and use the ASHRAE 62.2 ventilation specification, which uses a sum of ventilation/square meter + ventilation/person.\n\nThe unfortunate side of these default specs is that there is always some ventilation coming in (because of the ventilationPerArea), which often means that you're bringing in outdoor air in unoccupied hours that have a thermostat setback, minimal heat gains, and no need for cooling. Running the ventilation system without activating the cooling coil can mean that you are bringing in very humid outdoor air sometimes, particularly in evenings.  As such, you may want to use only a ventilationPerPerson specification or use a ventilationSchedule to shut off the ventilation during these unoccupied hours (using the \"Set EnergyPlus Loads\" component or the \"Set EnergyPlus Schedules\" component respectively).  This might mitigate your peak cooling at 9PM as well as your higher humidity in evenings, particularly if your space is not occupied then.\n\nThe differential dry bulb economizer might also introduce more outdoor air when it is humid outside, resulting in more \"unrealistic\" humidity values.  As such, switching to a differential enthalpy economizer or removing the economizer altogether can avoid these cases of bringing in more humid outdoor air to cool the zone.  You can do this with the \"Set Ideal Air Loads Parameters\" component.\n\nIf both these methods don't give you humidity values that you are happy with, you can always put in humidity control by setting a maxHumidity on the \"Set EnergyPlus Zone Thresholds\" component.\n\n\n\nTo be fair to the ideal air system, you would have to consider these ventilation/economizer/humidity control specifications for almost any air-based system that you are designing and I do not see these initially \"unrealistic\" humidity levels as a limitation of the ideal air system as much as a limitation of typical high-latitude HVAC controls.  This said, I will fully admit the limitations of the ideal air system in terms of not giving electricity/fuel values (just loads) and the fact that you don't have a single multi-zone boiler/chiller supply air temperature as you would for a centralized HVAC system.\n\n\n\nTo get to your questions:\n\n1) The danger of looking at energy balance variables for only a single hour is that you might not get them summing to something close to 0, since you are running a transient simulation.  Over a day, you will be more likely to get values summing to 0 and (because of your building's thermal lag) you will also probably get a better representation of the cause of the peak cooling.\n\n2) There was a bug in the code and you are not supposed to get the HVAC outputs with the \"Read EP Result\" component.  You are supposed to use the \"Read EP HVAC Result\" component like so:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/a0gZpI6iXILtl-3SaZpy95kh*CTa4TgybwsbhdhBprpsVUZ5N2cqfOREeSRsG6Ygx1dwi3Q89FIB3pukU5Qmv3wKQXOqKrOS/HVACOutputs.JPG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/a0gZpI6iXILtl-3SaZpy95kh*CTa4TgybwsbhdhBprpsVUZ5N2cqfOREeSRsG6Ygx1dwi3Q89FIB3pukU5Qmv3wKQXOqKrOS/HVACOutputs.JPG)\n\nI have fixed this in the attached GH file.  In case you were wondering what those units are, they are Joules.  All energy results output from EP are in joules and I convert them to kWh inside the HB components since this is what we are typically using in the building industry.\n\n\n\n-Chris\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1488383", "name": "HVACOutputs.gh"}], "created_by_name": "Chris Mackey", "created_at": "March 19, 2016 at 2:05pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nThank you so much for the thorough follow up Chris!  We'll try out the different enthalpy economizer settings, continue to play with ventilation rates, and re-examine our peak loads through the Read EP HVAC Result component.  We'll be sure to report back on our findings.  Hope all is well!\n\n\n\nColin\n", "attachments": [], "created_by_name": "Colin Schless", "created_at": "March 20, 2016 at 9:27pm", "created_by": "ColinSchless", "replies": []}]}], "id": "1486519"}