{"body": "\nHi Mostapha et al\n\n\n\nI need to do a view analysis from a floorplate to a specific building but am having some issues.\n\n\n\nGeometry - I have offset the finished floor surface 1650mm to be at eye level.\n\nContext - I have a mesh of the geometry to analysis. This is a city model.\n\nView points - These are the vertices of the Sydney Harbour Bridge mesh. \n\n\n\nThe problem is that I cannot use a surface as the input to '_geometry'. What I need is to have a surface which isn't self-occluding. If I extrude the surface to create a brep, the top surface will be coloured accurately, while the the bottom surface will be blocked and all shown 0. Controlling the normal of the surface and meshing it doesn't work because sometimes the view points will be above and other times below. Basically the '_geometry' isn't really geometry but a series of eye positions. Is that clear?\n\n\n\nAny ideas how to solve? View type doesn't really help because I want to focus on just one building (Sydney Harbour Bridge) rather than the entire city context geometry.\n", "attachments": [], "created_by_name": "Paul Wintour", "created_at": "March 21, 2016 at 12:36am", "created_by": "PaulWintour", "topic": "View analysis without self-occluding geometry", "replies": [{"body": "\nPaul,\n\nThis is something that I had been struggling with as well when I was adding in different viewTypes to this component a couple of months ago.  Some of the viewTypes go hand-in-hand with having the geometry blocking the view (like skyView) but many others do not.  While I originally thought that I should just set different \"geometry blocking\" values based on viewType, your post here has convinced me that this really needs to be exposed as an input on the component.  As such I just added in the ability to change whether the _geometry blocks the view or not:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/WlEYvnGKT6AkTF4GyJpeh-Cn7QBpGlMye52SVunm6QrJsc5GfM32mu8xz7Pdu6pWaOPZSk0xskhEQMv0A99WwLy-5zIooOjO/ViewGeoBlock.JPG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/WlEYvnGKT6AkTF4GyJpeh-Cn7QBpGlMye52SVunm6QrJsc5GfM32mu8xz7Pdu6pWaOPZSk0xskhEQMv0A99WwLy-5zIooOjO/ViewGeoBlock.JPG)[<img class=\"align-full\" src=\"http://api.ning.com:80/files/WlEYvnGKT6BsrqyHII1DME-XU50YfxFV2GcW0McYPMJrhXPwrh3Y3O*-pQd-mmGp-p-MmqNZbqm00X-0KOR6Hn1H7-Zr5ACq/ViewGeoNotblock.JPG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/WlEYvnGKT6BsrqyHII1DME-XU50YfxFV2GcW0McYPMJrhXPwrh3Y3O*-pQd-mmGp-p-MmqNZbqm00X-0KOR6Hn1H7-Zr5ACq/ViewGeoNotblock.JPG)\n\nI also changed the default for the viewPoints analysis to not have the _geometry block the view since this is usually what I want to do as well.\n\nSee attached file for the new component.\n\n-Chris\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1489646", "name": "ImprovedViewCalculator.gh"}], "created_by_name": "Chris Mackey", "created_at": "March 21, 2016 at 8:47am", "created_by": "ChrisMackey", "replies": [{"body": "\nThanks Chris that's fantastic. You guys are so speedy!\n\n\n\nAs an extension to this, I have another problem which I'm sure you have already come across. How do you generate view points? For example, if I have the Sydney Opera House that I want to evaluate, I could mesh it, extract vertices and use these as the input. If I don't include the building as context, it essentially becomes transparent making all points visible which is not correct. However, if I do include the building as context, the maximum points visible will only be 50% as half will be on the back face. So again, this skews the results because it is impossible to see those points in the first place. So what I think is needed, is a cull of all view points so that only those that are possible of being viewed are analysed. If all of these can be seen, then the result is 100%. Is there a Ladybug component for this already or do we need to generate this ourselves?\n\n\n\nAlso, clearly the meshing of the brep is important if we are extracting its vertices. I notice that Ladybug has a neat feature that when it generates the analysis mesh it is roughly the mesh grid size imput. This is significantly better than GH's native mesh brep component. Where is this function located - in Ladybug Ladybug or View Analysis? I would like to expose it to help solve the above issues.\n\n\n\nThanks again!\n", "attachments": [], "created_by_name": "Paul Wintour", "created_at": "March 21, 2016 at 4:23pm", "created_by": "PaulWintour", "replies": []}, {"body": "\nPaul,\n\nWriting a small script with native GH components to cull vertices to just one side is one way to do it.  Turning the geometry into a 2D surface (like the example in my last post) is another.  Personally, I find myself using the following method a lot:  I just take the highest value of the view study (typically around 50%) and use it to re-scale all of the results.  I can then use the recolor mesh component to have the results display with the correct legend like so:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/b8ZVJ4Q*UlIXxLJAVPoVugqXzycnfhEg5GOKejcaqOG*NqVfNygeDU7lgCgX07gTC8A*1OgbyywUpmZ1*NhHlTCs9sO-dz8k/PostPorcessView.JPG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/b8ZVJ4Q*UlIXxLJAVPoVugqXzycnfhEg5GOKejcaqOG*NqVfNygeDU7lgCgX07gTC8A*1OgbyywUpmZ1*NhHlTCs9sO-dz8k/PostPorcessView.JPG)\n\n\n\nThe meshing of the brep happens with just a few lines of code inside Ladybug_Ladybug:\n\n\n\nimport Rhino as rc\n\naspectRatio = 1<br/> meshParam = rc.Geometry.MeshingParameters.Default<br/> rc.Geometry.MeshingParameters.MaximumEdgeLength.__set__(meshParam, (gridSize))<br/> rc.Geometry.MeshingParameters.MinimumEdgeLength.__set__(meshParam, (gridSize))<br/> rc.Geometry.MeshingParameters.GridAspectRatio.__set__(meshParam, aspectRatio)<br/> mesh = rc.Geometry.Mesh.CreateFromBrep(inputBrep, meshParam)\n\n\n\nYou should be able to get the same functionality with native grasshopper components by using the \"Custom Mesh Settings\" component like so:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/b8ZVJ4Q*UlLbNBrYR7bkqPArKgTlHJ2zU4N6QnzT2G*rQ3XVdC-x642xFJ2-U7E8ogdmWgj2RV5o8gpZUm1touZDRstvREIJ/MeshingPar.JPG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/b8ZVJ4Q*UlLbNBrYR7bkqPArKgTlHJ2zU4N6QnzT2G*rQ3XVdC-x642xFJ2-U7E8ogdmWgj2RV5o8gpZUm1touZDRstvREIJ/MeshingPar.JPG)\n\n\n\nHope this helps,\n\n-Chris\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1490720", "name": "postProcessView.gh"}], "created_by_name": "Chris Mackey", "created_at": "March 22, 2016 at 11:41pm", "created_by": "ChrisMackey", "replies": []}]}]}