{"body": "\nHi Guys,\n\n\n\nI've run an annual result and tried to use the Read Annual Results component, but it gives an index error. I've worked a little with Sarith and he suggested that I post to the forum. He believes the issue is that I have multiple test surfaces. I've run the simulation with between 8 cores, so I got 8 different result files. My test points has 4 branches for the 4 test surfaces. The index error occurs at the line:\n\n\n\n\"for branchNum in range (_testPoints.BranchCount):\"\n\n\n\nSarith thinks that it might not know how to recombine the results and assign them to the test points. Also, I did a grid based analysis before and was able to get the results using the Read Rad component and was able to use the color mesh component to visualize results. Not sure if that's relevant, but I know that at least one Read Result component has succeeded in assigning my results to the correct test points.\n\n\n\nThanks guys.\n\n\n\np.s.\n\nI've linked my gh and my results folder\n\n\n\n[GH](https://drive.google.com/file/d/0B5rB4Oaa0lyfTUE4Q04xdzlOejA/view?usp=sharing)\n\n[Folder](https://drive.google.com/folderview?id=0B5rB4Oaa0lyfUEZ0T0g4dDFIRHM&amp;usp=sharing)\n\n\n", "attachments": [], "created_by_name": "John Keyes", "created_at": "March 22, 2016 at 11:29am", "created_by": "JohnKeyes", "topic": "Read Annual result error", "replies": [{"body": "\nHi Everyone,\n\nTo add to John's post:\n\nI wrote a script to combine all the ILL files (*_0.ill to *_7.ill) into a single file and then tried feeding that as an _illFilesAddress to \"Read Annual Results I\" and as a _resultsFileAddress to \"Read Annual Results II\". It seems to be working fine with the \"Results II\" component. With the \"Results I\" component I get an error stating that the number of data point per line in the ILL file is one less than the number of grid points.\n", "attachments": [], "created_by_name": "Sarith Subramaniam", "created_at": "March 22, 2016 at 3:57pm", "created_by": "sarith", "replies": [{"body": "\nHi John and Sarith,\n\nDo you still need help with this or Sarith's solution solves the problem for now?\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "March 27, 2016 at 12:42pm", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nMostapha, \n\n\n\nSarith actually figured it out. All that we needed to do to fix it was join and flatten the meshes and test points. Now everything works fine.\n\n\n\nThanks,\n\n\n\nJohn\n", "attachments": [], "created_by_name": "John Keyes", "created_at": "March 27, 2016 at 3:40pm", "created_by": "JohnKeyes", "replies": []}, {"body": "\nMostapha, \n\n\n\nI thought everything was working fine, but I just tried to read results and I'm getting the same error as before, an index out of range: 0. When we tested it out the last time and it worked, we used a 0 bounce run. Any help is appreciated.\n\n\n\nI've linked the updated file\n\n\n\n[GH File](https://drive.google.com/file/d/0B5rB4Oaa0lyfbGJYeThvMzdVR1k/view?usp=sharing)\n", "attachments": [], "created_by_name": "John Keyes", "created_at": "April 1, 2016 at 6:15pm", "created_by": "JohnKeyes", "replies": []}]}]}