{"body": "\nHi everyone,\n\n\n\nhow is it possible to simulate a perforated screen in energy simulation? \n\nWhich parameters can control the openess factor?\n\n\n\nThank you so much.\n\n\n\nBest,\n\n\n\nAndrea\n", "attachments": [], "created_by_name": "Andrea Zani", "created_at": "March 24, 2016 at 3:41pm", "created_by": "AndreaZani905", "topic": "Perforated screen energy simulation", "replies": [{"body": "", "attachments": [], "created_by_name": "Anastasios Kokkos", "created_at": "March 24, 2016 at 4:11pm", "created_by": "AnastasiosKokkos", "replies": [{"body": "\nAndrea,\n\nAdding the screen as shading context (as Tasos suggests) will get you pretty close.  If you want to model the screen super-accurately, you can also use the \"EnergyPlus Window Shade Generator\" component to model a screen in a manner that accounts for the surface temperature of the screen.  This example file includes a workflow for setting up such a screen:\n\n[http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;for...](http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;fork=hydra_2&amp;id=EnergyPlus_Window_Shade_Generator&amp;slide=0&amp;scale=1&amp;offset=0,0)\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "March 30, 2016 at 10:20pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nHi Chris,\n\nI have already used \"EnergyPlus Window Shade Generator\" for venetian blinds and it is a great component! Compliments!\n\nI have two questions about this:\n\n- perforated screen effectiveness depends on openness factor, holes diameters and thickness. How is it possible to set these characteristics using energy plus shade material? \n\n- I am trying to simulate complex geometry shading device using shading coefficient approach. I have created a shading plane with \"EnergyPlus Window Shade Generator\" and put a shading schedule but the results are quite similar to no shading case.\n\nCan I use this method? Is there any wrong settings? \n\nIn attached you can find the gh file and .csv\n\n\n\nThank you so much.\n\nBest,\n\n\n\nAndrea\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1498889", "name": "Test1.gh"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1498890", "name": "Louvers_shading_2020.csv"}], "created_by_name": "Andrea Zani", "created_at": "April 2, 2016 at 8:40am", "created_by": "AndreaZani905", "replies": []}, {"body": "\nAndrea,\n\n\n\nTo model a perforated screen correctly with the window shade generator:\n\n1) Make sure that shadeTpye_ is set to 1.\n\n2) Set the transmittance of your shadeMaterial to be equal to your openness factor (using the \"Honeybee_EnergyPlus Shade Material\" component)\n\n3) Set the airPermeability_ on the window shade generator to be equal to your openness factor.\n\n\n\nSeeing little changes from shades on the energy simulation is common.  Shades really don't have a meaningful effect on the overall room energy balance until you have low internal gains and you are in a tropical/arid climate.  However, shades are very important for mitigating glare and thermal discomfort in practically any climate and program.\n\n\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "April 3, 2016 at 11:40am", "created_by": "ChrisMackey", "replies": []}, {"body": "\nJust be sure that the sum of transmittance_ and reflectance_ in the HB_EPShadeMat are lower than 1. Otherwise the HB_runEnergySimulation will fail.\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "April 3, 2016 at 10:50pm", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nHi Chris,\n\n\n\nSorry if I can check this out simply by opening the definition (at home atm).\n\n\n\nWould I be able to export an .idf file of the wind shade generated by this component?\n\n\n\nThanks,\n\nTheodore.\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "April 17, 2016 at 6:20am", "created_by": "TheodorosGalanos", "replies": []}, {"body": "\nHi,\n\n\n\nProbably a silly question. Does it matter, in terms of Energy+ simulation capabilities, if the perforated surface is interior or exterior to the wall? I have a case where the pattern is interior to the wall, I'm guessing I could simulate that case by setting an exterior shading context, would that be accurate?\n\n\n\nAlso, I understand the case of having windows which then have a perforated screen pattern over them. What, in your opinion, would be a good solution for an actual wall perforated pattern (wall has the \"holes\" as windows). It's madness I know, any idea is welcome.\n\n\n\nP.S.: I'm baseing most of the above in the assumption that E+ only accepts equivalents of thermal mass in interior spaces and not actually, concrete surfaces. Let me know if that is wrong and we can actually input solid, existing interior surfaces in E+.\n\n\n\nThanks in advance!\n\nTheodore.\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "April 17, 2016 at 6:18am", "created_by": "TheodorosGalanos", "replies": []}, {"body": "\nTheodore,\n\nSorry for the very late response.  There are very big differences in thermal performance between having a shade on the outside or inside of a window. When the shade is on the inside, the vast majority of the solar heat hitting the shade still ends up inside the building as a heating load.  On the outside, much of the heat absorbed by the shade is transmitted to the outdoor air and any reflected solar heat is usually out of the equation of the building heat balance (this is not usually the case on the inside).  So simulating an interior shade as exterior is most likely not accurate.\n\n\n\nI am not sure what an actual wall perforated pattern is.  Do you mean a bunch of small windows?\n\n\n\nI also don't understand what actual concrete surfaces are as opposed to equivalent thermal mass.  Are you asking about how E+ defined materials?\n\n\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "April 29, 2016 at 11:11am", "created_by": "ChrisMackey", "replies": []}, {"body": "\nHi Chris,\n\n\n\nThanks for the response!\n\n\n\nYes that is exactly what I mean, a bunch of small, round windows on an opaque wall creating a kind of perforated screen pattern. Now I know how to input a shading component in E+ but that would mean I would have to have a really big window and shade it in a perforated screen pattern. That wouldn't work. Was just wondering if anyone had ever used a workaround to designing all the windows in such a case.\n\n\n\nAs for internal mass, I remember you told me once that interior surfaces are only thermal masses to E+ so I was wondering if an internal shading is even possible, if it is only accounted as a thermal mass.\n\n\n\nPerhaps a solution would be to split a roof like that to 2 zones.\n\n\n\nKind regards,\n\nTheodore.\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "April 29, 2016 at 7:10pm", "created_by": "TheodorosGalanos", "replies": []}, {"body": "\nTheodoros,\n\nI don't encourage to have a lot of windows in E+/ For me the rule is that if you can simplify the windows amount, do that. Meaning of that is that is that in effect you have small windows you want to unify them into one PROVIDING that they are under the same exposure conditions. Having lots of them will extend calculation time and probably the quality of results would not be much affected.\n\nSasying that i suggest to check [this example](http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;fork=hydra_2&amp;id=Indoor_Microclimate_Map&amp;slide=0&amp;scale=7.472547163781119&amp;offset=-2394.85570224981,-1498.7474686606456) in hydra to see how to include \"real\" geometry as thermal mass (using this HB_addInternalMass component).\n\nHope this helps you having this a bit more clear.\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "April 29, 2016 at 10:23pm", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nHi Abraham,\n\n\n\nThanks for the response. Yes I have thought of a typical WWR simplification. The external conditions are exactly the same, given that this is a roof in a more or less flat roof building, which will be situated in a quite open landscape (no buildings around shading). So while I agree that simplifying will not affect much on the exterior I still think it affects a lot on the interior. The roof spans many different zones, which will be impacted if there is one huge skylight in the centre.\n\n\n\nI am probably thinking of splitting the WWR in zones on the roof and then simplifying that per zone. I am guessing, really not sure, that will give more sensible results. I was just hoping there would be some workaround, e.g. using Window to produce some kind of perforated pattern or some shading component that could be applied. Guessing not though.\n\n\n\nAs for the InternalMass component, I believe it was Chris who said that the mass is only a thermal mass. So it won't really impact on solar radiation. I was looking for a way for internal shading (perforated screen pattern again).\n\n\n\nHey is there anyone out there working on an energy simulation software for such complex geometries? I know E+ is probably way ahead of anything and simplifying usually doesn't impact accuracy but it would be interesting to test.\n\n\n\nKind regards,\n\nTheodore. \n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "April 30, 2016 at 12:19am", "created_by": "TheodorosGalanos", "replies": []}, {"body": "\nI still think that the result won't be affected. From the radiation you get it doesn't matter if you have one window of 10 m2 or 10 windows of 1 m2.\n\nIt may affect daylight if you happen to put the sensor just behind the opaque envelope instead behind the window, since you have up to 2 sensors in E+.\n\nIn E+ you can model the geometry of the thermal mass (as is the case of the component i mentioned) or define an area (or volume) of it. This can make a difference.\n\nAgree that the looks may be more appealing if you show the openings but the results will be similar.\n\nI suggest you test with just a few windows (say 4) and one concentrated and see what you get.\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "April 30, 2016 at 1:15am", "created_by": "AbrahamYezioro", "replies": []}]}], "id": "1491835"}