{"body": "\nI have an apartment building that I am trying to model and I need to allow for each bathroom and kitchen extract that is present in each apartment. I know how to add HVAC and general ventilation, but I am unsure how to add specific ventilation items such as these. Can someone please advise which component to use to replicate these systems. I've had a bit of an attempt, but I'm pretty sure that it is wrong.\n\n<br/>Thanks\n\nChelle\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1492125", "name": "Great North Rd Energy Model-24 Mar.gh"}], "created_by_name": "Chelle Payne", "created_at": "March 24, 2016 at 8:29pm", "created_by": "ChellePayne", "topic": "Kitchen and Bathroom Extract Fans", "replies": [{"body": "\nWe don't have fans implemented in Honeybee however you can add fan objects to idf file using additionalStrings_ in Run Energy Simulation component.\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "March 27, 2016 at 1:01pm", "created_by": "MostaphaSadeghipour", "replies": [{"body": "\nHi,\n\n<br/>I'm very new to Honeybee (and I'm trying my best). Would you be able to give me an example of the additional string text that I would use to simulate bathroom extracts of 25l/s for each bathroom in the apartments for one hr per day (each apartment has 2 bathrooms) and kitchen extracts of 50l/s for one hour per day.\n\n\n\nThanks\n\nChelle\n", "attachments": [], "created_by_name": "Chelle Payne", "created_at": "March 28, 2016 at 7:31pm", "created_by": "ChellePayne", "replies": []}, {"body": "\nChelle,\n\nThere's a small correction that should be made to Mostapha's comment.  We do have the ability to model fans but it is a simple implementation that will require you to answer the question of where fresh outdoor air is being pulled in by this fan.  If fresh air is just being pulled in from a window or outdoor grille in the bathroom zone, you can use the NatVent component to easily model this fan.  Part 3 of this example file shows you how to set up such a fan:\n\n[http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;for...](http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;fork=hydra_2&amp;id=Natural_Ventilation&amp;slide=0&amp;scale=1&amp;offset=0,0)\n\n\n\nIf fresh air is being pulled from neighboring zones, then you have to set up a series of mixing objects between zones if you want to be super-accurate and this can get a bit messy.  In this case, I might just account for the extra heating/cooling energy from the bathroom fan by increasing the ventilationPerArea of the source zone using the \"Set EnergyPlus Zone Loads\" component.  Overall, I imagine that such fans are not going to greatly impact your energy use unless they are always on or on for all occupied hours.\n\n\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "March 30, 2016 at 10:17pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nHi Chris,\n\nThank you for replying. I feel a bit like royalty has replied as I've watched everyone of your youtube videos. Many more than once :)\n\n\n\nI've tried to replicate part 3 of the example file but when I select 3 for fan driven ventilation my component doesn't change to give me fan options (like I believe it should). Am I missing a key step somewhere? \n\nAlso whenever I close and reopen my gh file the EPsetzoneschedule component goes red and comes up with an error about ventilation schedules which I am a bit baffled about as nothing has changed in the interim. \n\nDo you if anyone has posted any examples on how to set up an apartment building multizone Honeybee model? I've been trying to put this together from scratch (I'm very new to Honeybee) and it would be much easier to follow someone else's example. I feel like I am making a lot of rookie errors everywhere. \n\n\n\nThanks for taking the time to reply.\n\nChelle\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1498011", "name": "Great North Rd Energy Model-30 Mar.gh"}], "created_by_name": "Chelle Payne", "created_at": "March 31, 2016 at 7:54pm", "created_by": "ChellePayne", "replies": []}, {"body": "\nChelle, Are you trying to calculate the energy that the fan will be using or you want to see the effect of extra airflow in an unconditioned zone?\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "April 1, 2016 at 8:24am", "created_by": "MostaphaSadeghipour", "replies": []}]}]}