{"body": "\nHi, I'm doing a article about how to use Rhino, Grasshopper, Ladybug and Honeybee to calculate energy efficiency in comercial buildings.\n\nI'm not creating the wheel, I've just seen a lot of video tutorials (Chris Mackey and Mostapha Sadeghipour, your videos were more than important, I really love it, thanks for that) and writing an method step-by-step to be followed.\n\nHere in Brazil there aren't almost nothing published about it and I think  it must be introduced in Architecture's Schools and events, to brazilian students and professionals.\n\n\n\nLet's talk about my doubt.\n\n\n\nI've choose a building. The building isn't a cube that matches with the \"standard\" of Energy Plus.\n\nI can't use \"Ratio\" of glazing, cause I have planes with windows and planes 100% glazed.\n\nI've used the tool that adjust windows in the planes, but with this I'd ignore the 100% glazed pla. \n\n\n\nTake a look of this photos, the real building, my building modeled in Rhino and if you could help me, I would really thankful.\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/iu4CP0*NRsLg-KLfWRXSkaxcSh82j-OLe2q*k-j2jeGolr2m6Ruam*yhdls8o7dRjH2pIpKGj5cSmUDCQUZm8*gu018PWuDO/1710.jpg\" width=\"600\"/>](http://api.ning.com:80/files/iu4CP0*NRsLg-KLfWRXSkaxcSh82j-OLe2q*k-j2jeGolr2m6Ruam*yhdls8o7dRjH2pIpKGj5cSmUDCQUZm8*gu018PWuDO/1710.jpg)\n\n\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/iu4CP0*NRsJb6stmGXHL9B98xPoS75JG0Juro-MPlYJ*nXG76Gr88daqPAt1xDQHhn7wJT3CzNGevJMBpTGM10Bh5AGkD8U4/Capturadetela2015112620.28.05.png\" width=\"317\"/>](http://api.ning.com:80/files/iu4CP0*NRsJb6stmGXHL9B98xPoS75JG0Juro-MPlYJ*nXG76Gr88daqPAt1xDQHhn7wJT3CzNGevJMBpTGM10Bh5AGkD8U4/Capturadetela2015112620.28.05.png)This is my model with honeybee adjustment windows.. I had to add surfaces 100% glazed in the model, when you see the pics of the building you'll understand what I mean...\n\n\n\n[https://arcoweb.com.br/projetodesign/arquitetura/konigsberger-vannu...](https://arcoweb.com.br/projetodesign/arquitetura/konigsberger-vannucchi-prime-tamandare-office-goiania)\n\nMore pics of real building\n\n\n\nI want to achieve really close values of energy consumption of the building, so, my geometry in honeybee must be similar to the real building and I don't know how to add this 100% glazed planes with the other planes that have windows, for each pavement. It's possible? How?\n\n\n\n\n\n\n\nI'm sending the files attached.\n\n\n\n\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1493329", "name": "analise de eficiencia.gh"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1493330", "name": "GO_Goiania.epw"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1493331", "name": "ThePrime tentativa final.rar"}], "created_by_name": "Valdir José Ribeiro Júnior", "created_at": "March 27, 2016 at 8:34am", "created_by": "ValdirJoseRibeiroJunior", "topic": "How to setup complex geometry in Honeybee for thermal analysis", "replies": [{"body": "\nVladir,\n\nThanks for spreading the knowledge of the bug and bee to Brazil.  A few quick notes about your model:\n\n1) You are using an older version of Honeybee and I would suggest updating to the latest one.\n\n2) There is no need to decompose the zones into surfaces.  The new HBGlzSrf component can just take all your zones and all of your window geomtries and assign them to correct zones.  E+ cannot take 100% glazing surfaces and there must always be some offset between window boundaries and wall boundaries.  Just add the window geometries manually after scaling the wall surfaces down a bit.\n\n3) The most important part of having a decently accurate energy model is that you get the programs and uses of the zones correct.  As such, I would recommend organizing your model with each program type having its own mass2Zone component.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "March 30, 2016 at 10:02pm", "created_by": "ChrisMackey", "replies": [{"body": "\nThank you, Chris! My problem was with my geometry... I gave it up.\n", "attachments": [], "created_by_name": "Valdir José Ribeiro Júnior", "created_at": "April 24, 2016 at 11:36am", "created_by": "ValdirJoseRibeiroJunior", "replies": []}]}]}