{"body": "\nHey guys,\n\nI'm trying to asses the local thermal discomfort related to radiant asymmetry. To do that I need to calculate the radiant asymmetry, which is done by multiplying surface temperatures with their view factor and summing it all together. \n\nFrom what I can read this is basically the same way you calculate MRT right? So my question is can I replace t_pr in the equations of EN 7730-2006 with MRT?\n\nIf not is there a way to use HB's view factor component to calculate radiant asymmetry?\n\nEDIT: I now see that you have to use radiant temperature asymmetry (delta_t_pr) and not t_pr for the EN calculation. Do anyone have an idea how to calculate that from the HB components?\n\n\n\nThanks,\n\nChristian \n", "attachments": [], "created_by_name": "Christian Kongsgaard", "created_at": "March 27, 2016 at 7:10am", "created_by": "ChristianKongsgaard", "topic": "Radiant Asymmetry and MRT", "replies": [{"body": "\nChristian,\n\n\n\nTo respond to your edited question, there is presently a dearth of research on how to forecast discomfort from radiant asymmetry.  The only study that seems to have a consensus around it is Fanger's original one that held the PMV of people in a cube-like test chamber at 0 and just modulated the temperature of 1 of the 6 surfaces until the subjects felt discomfort.\n\n\n\nThe results give a super simple model that requires to you assume that the surface with a different temperature has the same view factor as you would have in a cube. I question how generalizable it is to many real-world cases.  Still, if you want to test for radiant asymmetry, I suggest that you use the \"local discomfort\" button on the [CBE tool](http://comfort.cbe.berkeley.edu/).\n\n\n\nSince the calculation is so simple, I don't see much purpose in putting in a special component in Ladybug/Honeybee (since you could calculate it with 1 or 2 native GH components).\n\n\n\nI hope this helps and let me know if you have any suggestions.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "March 30, 2016 at 9:48pm", "created_by": "ChrisMackey", "replies": [{"body": "\nHey Chris,\n\nI'm not sure that I follow. To me the view factor calculation seems a bit complicated. To my understanding you would have to split your view factors with a parallel plane, going through your test point, to the surface of interest. And then you take the temperature difference between each side of your plane to get Δt_pr.\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/Wgfeh6*JLPYYeN6u1E-L-0FCp0rM72-JrOASsqY0pzSIEcO5FVpr4tWgMIPiER9GbTqf9XKTJItKFb0GSxqeU0RHAthBdMEU/Udklip.PNG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/Wgfeh6*JLPYYeN6u1E-L-0FCp0rM72-JrOASsqY0pzSIEcO5FVpr4tWgMIPiER9GbTqf9XKTJItKFb0GSxqeU0RHAthBdMEU/Udklip.PNG)\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/Wgfeh6*JLPaFXZrpi6arHV5YXlGWyqGDM3MwcEcR-bypaBT5tctEpjwSQGHjCI-pEaYQk1oLL4D5pIMEqn-k5DgNHCt5wyv9/Udklip2.PNG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/Wgfeh6*JLPaFXZrpi6arHV5YXlGWyqGDM3MwcEcR-bypaBT5tctEpjwSQGHjCI-pEaYQk1oLL4D5pIMEqn-k5DgNHCt5wyv9/Udklip2.PNG)And you can then throw Δt_pr into the comfort equations from EN-7730.\n\n/Christian\n\n\n", "attachments": [], "created_by_name": "Christian Kongsgaard", "created_at": "April 5, 2016 at 3:28am", "created_by": "ChristianKongsgaard", "replies": []}, {"body": "\nHi Christian,\n\nThank you so much for this explanation and for the image describing the method that you are trying to use.  I have realized that I may have been misinterpreting the section on radiant asymmetry that has been published in ASHRAE 55 and/or EN-7730 for almost a year now.  I originally thought that this section was just a reiteration of the results from Fanger's study and I had not realized that it had been fleshed-out into a generalizable method for all radiant asymmetry.\n\n\n\nMaking a component that allows you to perform the method that you have posted here should be relatively quick and straightforward.  We already have the functions in the Ladybug code to calculate view factors into a plane and we have validated them as you see in this conversation:\n\n[http://www.grasshopper3d.com/group/ladybug/forum/topics/discussion-...](http://www.grasshopper3d.com/group/ladybug/forum/topics/discussion-sky-view-factor)\n\n\n\nThis method is also similar that which is used inside the \"Indoor View Factor Calculator\" component.  However, this component is not projecting the view factors into the plane of a surface (it is just computing views from a point for MRT calculation) and the component has been streamlined so much for the microclimate maps that it's difficult to pull out the view factor information for something as specific as this. In other words, all that we really have to do to make your method realizable with Ladybug is expose these capabilities in a new component that gives you more access and control over the view factor calculation.  As such, I have added this to the github and I can pull together a component in a few days:\n\n[https://github.com/mostaphaRoudsari/ladybug/issues/251](https://github.com/mostaphaRoudsari/ladybug/issues/251)\n\n\n\nHowever, before I flesh out this component, I have a question about the \"comfort equations from EN-7730\" into which you will throw Δt_pr.  I know that ASHRAE has published the following figure for calculating the percentage of people dissatisfied (PPD) from different types of radiant asymmetry:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/MlwUY2Ci1em0JFwPhV0JHHEXb4wZtjAKoxdWr2IrZ2EDEades43Sf5-6WYn51ibQ8zU7lzGzrETJ7VdTNNmnJY0UXSwOuTwP/RadiantAsymmetry.jpg\" width=\"448\"/>](http://api.ning.com:80/files/MlwUY2Ci1em0JFwPhV0JHHEXb4wZtjAKoxdWr2IrZ2EDEades43Sf5-6WYn51ibQ8zU7lzGzrETJ7VdTNNmnJY0UXSwOuTwP/RadiantAsymmetry.jpg)\n\nI am assume that these are the same \"comfort equations from EN-7730\" that you are referring to and please correct me if I am wrong.  If these are the equations that you are referring to, here is my question:\n\nIn the method that you describe, the radiant asymmetry is only defined as the difference in temperature from one side of a plane to another and so there does not seem to be any distinction between what would count as a \"cool wall\" radiant asymmetry as opposed to a \"warm wall\" asymmetry.  The asymmetry could be either cool or warm depending on which side of the plane you are saying is the cause of radiant asymmetry.  Clearly there is a big difference between these two in the figure and I am wondering how the method you have posted here deals with this situation.  Also, if you could confirm that source of the image that you have posted, this will also help me implement this capability in Ladybug faster and more relaibly.\n\n\n\nThanks again for posting here.  All of this has been really insightful and I'm looking forward to the new capabilities that we can add because of it!\n\n\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "April 6, 2016 at 8:56am", "created_by": "ChrisMackey", "replies": []}, {"body": "\nHey Chris,\n\nThank you for taking the time to do this. \n\nAs I can see from the comfort equations in EN 7730, it looks very much like the graph you posted above.\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/cLNDn7vrsS91x8-3LuCGlqp9bbLwlleUa2meUIxX6x19I7OmsnFVsvHpZqkKTSpJH7OGeLz3i2uq3jJUJ6L21HwbE3JDpe-a/Udklip3.PNG?width=500\" width=\"500\"/>](http://api.ning.com:80/files/cLNDn7vrsS91x8-3LuCGlqp9bbLwlleUa2meUIxX6x19I7OmsnFVsvHpZqkKTSpJH7OGeLz3i2uq3jJUJ6L21HwbE3JDpe-a/Udklip3.PNG)As for your last question; I am no expert on this, but to my understanding, the Δt_pr used is the same -  the equations used to calculate are not. Take a look at this (from EN 7730 as well):\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/cLNDn7vrsS-QfuR7Myp-kqni1lH9MCPp0nZB3xwnrLZZOWsA0LbUcMyBnvAoisjeL64LTza6pDXJ-rD6nvuI*2tdfqasrXmw/Udklip4.PNG?width=500\" width=\"500\"/>](http://api.ning.com:80/files/cLNDn7vrsS-QfuR7Myp-kqni1lH9MCPp0nZB3xwnrLZZOWsA0LbUcMyBnvAoisjeL64LTza6pDXJ-rD6nvuI*2tdfqasrXmw/Udklip4.PNG)\n\nIf I can make some wishes too; it would be cool, if you included the last local comfort metrics from EN7730 in LB/HB as well. Besides the local asymmetry there are: an equation for warm/cold floors, stratification and draught. I know, that you will need preform a CFD simulation to properly calculate stratification and draught, but the comfort equations are really simple and seeing that you have(might have) a CFD tool under way it could be useful. Anyways I think it would possible to import external generated CFD data to grasshopper.  \n\n\n\nThe pictures in my previous post are from a paper called: \"A simplified calculation method for checking the indoor thermal climate\" by B.W. Olesen, it can be found in ASHRAE 1983, vol. 25, issue 5. I don't know if there have been any updates to it since '83. <br/>\n\n\n\nLooking forward for the new components, and if there is anything I can help with please let me know.\n\n/Christian\n\n\n\n\n", "attachments": [], "created_by_name": "Christian Kongsgaard", "created_at": "April 6, 2016 at 12:47pm", "created_by": "ChristianKongsgaard", "replies": []}, {"body": "", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "April 6, 2016 at 5:31pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nI understand your issue with the equations, unfortunately I don't have an answer. If you want, I can try and ask Olesen? He will be teaching a class I'm taking on Tuesday.\n", "attachments": [], "created_by_name": "Christian Kongsgaard", "created_at": "April 7, 2016 at 8:03am", "created_by": "ChristianKongsgaard", "replies": []}, {"body": "\nChristian,\n\n\n\nI have finished putting together two new Ladybug components that will streamline the use of the method that you have posted here.  The components are:\n\n\n\n**Ladybug_Surface View Analysis** - A component that calculates view factors from a point or plane to a set of surfaces.  The component uses a ray-tracing method that increases with accuracy as you increase the viewResolution (I recommend using a value of 2 to ensure that your view factor error is below 1%).  Because of the ray-tracing method, the component should be able to handle any surface geometry that you put into it. Importantly, if you input a point, the view factors will be calculated without a bias in direction but inputting a plane will calculate the view seen by a surface in the plane, which includes the directional bias induced by the direction the surface faces. This image gives you a sense of how the component works showing you the surface temperatures from EnergyPlus mapped onto the sphere of view:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/iRPFRg2AvJEDIk**T6J6AaRELMVyTWUjkOI1A2uWVxsCmZ-ajxPH4jyhE-hWm7bUx6ftzOWyKVw57DgqkaH3drvsQPQ0eR0q/RadiantTemperatureField.JPG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/iRPFRg2AvJEDIk**T6J6AaRELMVyTWUjkOI1A2uWVxsCmZ-ajxPH4jyhE-hWm7bUx6ftzOWyKVw57DgqkaH3drvsQPQ0eR0q/RadiantTemperatureField.JPG)\n\n\n\n**Ladybug_Radiant Asymmetry Discomfort** - A component that calculates the percentage of people dissatisfied (PPD) from radiant asymmetry.  It uses the formulas that Christian has posted on this discussion, which are also the formulas published in ASHRAE 55:\n\n[https://www.scribd.com/doc/194468127/Ashrae-Std-55-2010](https://www.scribd.com/doc/194468127/Ashrae-Std-55-2010)\n\nAnd in the CBE comfort tool:\n\n[http://comfort.cbe.berkeley.edu/](http://comfort.cbe.berkeley.edu/)\n\n[https://github.com/CenterForTheBuiltEnvironment/comfort_tool/blob/m...](https://github.com/CenterForTheBuiltEnvironment/comfort_tool/blob/master/static/js/local-discomfort.js#L11-L14)\n\nWith this component, you can convert the temperature difference across a plane:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/iRPFRg2AvJEVrFbw-4V5wocgJtx5FOtL-priTsuL9YIWlAiuWLI029fTpipxTi-9ew2ALNrCotzOOwEOD5hvt7ADWTXuwcJh/TempDiff.JPG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/iRPFRg2AvJEVrFbw-4V5wocgJtx5FOtL-priTsuL9YIWlAiuWLI029fTpipxTi-9ew2ALNrCotzOOwEOD5hvt7ADWTXuwcJh/TempDiff.JPG)... to a percent of people dissatisfied (PPD) from radiant asymmetry:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/iRPFRg2AvJEzkQ4QAdW8IbfHpDsTKWrz*N4pzWRb7FmvJOqSi4N2YHDrM5CwPks27VgtGjl-KgYXNUwEWurXH39wMkbs12Yf/PPD.JPG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/iRPFRg2AvJEzkQ4QAdW8IbfHpDsTKWrz*N4pzWRb7FmvJOqSi4N2YHDrM5CwPks27VgtGjl-KgYXNUwEWurXH39wMkbs12Yf/PPD.JPG)... and then to a temporal plot of radiant discomfort risk:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/iRPFRg2AvJHaQWXymfQi-LjLHF-Nn9BXhwR*wJAe0pBECxUxOuh2yswyPUNs-I4r3Z1uAvEJ8ZNBJWx0YvMQyy5U4v-w9rDI/RadAsymDiscomf.JPG\" width=\"717\"/>](http://api.ning.com:80/files/iRPFRg2AvJHaQWXymfQi-LjLHF-Nn9BXhwR*wJAe0pBECxUxOuh2yswyPUNs-I4r3Z1uAvEJ8ZNBJWx0YvMQyy5U4v-w9rDI/RadAsymDiscomf.JPG)\n\n\n\nIf you sync with the github, you can find these components under the WIP section.\n\n\n\nHere you can find an example file that shows you how to estimate radiant asymmetry discomfort using these components and the results of an EnergyPlus simulation:\n\n[http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;for...](http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;fork=hydra_2&amp;id=Radiant_Asymmetry_Discomfort&amp;slide=0&amp;scale=1.0000000000000004&amp;offset=64.23627386566636,-8.784339845403167)\n\n\n\nLet me know if you have any feedback, Christian.  If you get the chance to ask Olesen the question about the wall asymmetry, please let us know.\n\nThanks again for all of the info that you have posted here.\n\n\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "April 8, 2016 at 1:23pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nI talked to Olesen.\n\nHe said, that you determine if the wall/ceiling is cold/hot by comparing it's temperature with the air of the room. If it has a higher temperature than the air's, you should use the equation for hot wall/ceiling and vice versa. He also said that there is no equation for radiant asymmetry for the floor. The local discomfort caused by it, is purely based on contact, like if you touch the floor. That is why there are an equation for if you sit/lie on the floor. I hope that it answers your questions Chris.\n\n\n\nI haven't had the time to examine the components yet. When I have, I will return with some feedback. \n", "attachments": [], "created_by_name": "Christian Kongsgaard", "created_at": "April 13, 2016 at 8:19am", "created_by": "ChristianKongsgaard", "replies": []}, {"body": "\nThese are so cool Chris. Can't wait to play around and learn smth new concerning thermal comfort.\n\n\n\nThanks!\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "April 17, 2016 at 5:36am", "created_by": "TheodorosGalanos", "replies": []}, {"body": "\nI have now had some time to look at the new components. I think they work well for your example, but they can't really be applied to my case. I was interested in making a spacial visualization of the local discomfort in a room, just like you can do the your PMV comfort tool. I don't think it makes much sense to split up the geometry for each testpoint(or row of points). This is my example room. There is 104 points. Splitting the zone in 10 slices (number of rows) seems silly. And what if I wanted to investigate a different surface or change the point grid? Then I would have to remake the geometry and make new slices.  \n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/3D9Q6Zd9hf*W7IeEJh2sjDH-vzPpi7HY0FaUaE8kMJe3q37h5t86v1XZ5IDDPJYwQwMXoqd9tOCPEBwocMEYJuGb51LvLRwO/Udklip.PNG\" width=\"474\"/>](http://api.ning.com:80/files/3D9Q6Zd9hf*W7IeEJh2sjDH-vzPpi7HY0FaUaE8kMJe3q37h5t86v1XZ5IDDPJYwQwMXoqd9tOCPEBwocMEYJuGb51LvLRwO/Udklip.PNG)My initial thought was to do the geometry splitting in the view factor (VF) calculation, that way you just have to run the view factor component again if you want to investigate another surface. In my head the component took the inputs: Testpoints, HBzone and Testsurface. The component would then for each point return two lists. One containing the VFs to the surfaces between the testpoint and testsurface (including the VF to the testsurface of course). The other one contain the VF to the remaining surfaces of the room.\n\nI hope it makes sense.\n\n/Christian \n\n\n", "attachments": [], "created_by_name": "Christian Kongsgaard", "created_at": "April 17, 2016 at 7:26am", "created_by": "ChristianKongsgaard", "replies": []}, {"body": "\nChristian,\n\n\n\nThanks for posting the information from your talk with Olesen.  They say that good answers to questions leave you desiring more knowledge and this seems to be one of them.  In particular, knowing how to deal with the case of a person between a radiant vertical heating panel and a cool window really merits some more research.  Still, it is great to know Olesen's thoughts and how his cases were defined.  It is also great to know that conduction discomfort is supposed to govern cases of radiant floors and not any radiant asymmetry discomfort.  Thanks again for sharing.\n\n\n\nProducing a spatial map of radiant asymmetry PPD can also be accomplished with the two new components.  Particularly, if you are ok with the assumption that all opaque surfaces are at the same temperature and all window surfaces are also at the same temperature, you can produce one of these maps fairly quickly.  Here is an example file showing you how to set up such a map off of EnergyPlus results:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/8ATjcWHatZqepWQXpok5ty7Z9Kbv7T63lMfIsBaR7PZT8EawIIUo8XcxelEDDAkvWp4taWAA43k4C8mHanKX1Z5mteOj5h6V/Radiant_Asymmetry_Spatial_Map_Rhino.png?width=721\" width=\"721\"/>](http://api.ning.com:80/files/8ATjcWHatZqepWQXpok5ty7Z9Kbv7T63lMfIsBaR7PZT8EawIIUo8XcxelEDDAkvWp4taWAA43k4C8mHanKX1Z5mteOj5h6V/Radiant_Asymmetry_Spatial_Map_Rhino.png)\n\n[http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;for...](http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;fork=hydra_2&amp;id=Radiant_Asymmetry_Spatial_Map&amp;slide=0&amp;scale=1&amp;offset=0,0)\n\n\n\nAs you can see in the file, I take the average temperature of all interior surfaces and the average window temperature to produce the maps and I would say that this is usually a decent assumption for any shoebox model with windows on only one side and a reasonable amount of insulation on the exterior opaque surfaces.  If you need to account for different surface temperatures other than the opaque vs glazed, you should probably break up the zone into a few surfaces like the first file that shared.\n\n\n\nHope this helps,\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "April 17, 2016 at 6:56pm", "created_by": "ChrisMackey", "replies": []}]}, {"body": "\nHi Chris,\n\n\n\nI download the file which was posted by you,\n\n<img class=\"align-full\" src=\"http://api.ning.com:80/files/uTe6u2oo9t*rKXkz-WkyHdaOsIQg7rb1Q-cWIwfYDwuwiwrNd9Ln5kytQ3P8hXN5*O-ExMPGBwhLFzbmJtb-cFjBRFhena5h/RadiantAsymmetry.png?width=721\" width=\"721\"/>\n\n\n\nBut I can not understand a part of this logic, as following:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/uTe6u2oo9t8K3D7GOPOMa7Xuur*Qo0hviTqT7wxh-bRJfuyeSsBxqhJsCxJ9ZON*0*mzJ*2k0akfhZDgL*mctM*3549QMvtm/RadiantAsymmetry2.png\" width=\"719\"/>](http://api.ning.com:80/files/uTe6u2oo9t8K3D7GOPOMa7Xuur*Qo0hviTqT7wxh-bRJfuyeSsBxqhJsCxJ9ZON*0*mzJ*2k0akfhZDgL*mctM*3549QMvtm/RadiantAsymmetry2.png)\n\nCould you please give some instruction to me, or tell me which does the standard include this logic.\n\n\n\nThanks,\n\n\n\nSolon\n\n\n\n\n", "attachments": [], "created_by_name": "Solon", "created_at": "January 3, 2017 at 7:11am", "created_by": "w9002", "replies": []}], "id": "1493230"}