{"body": "\nHi all,\n\n\n\nI try to simulate the influence of switchable (EC) glazing on the energy budget.\n\nThe shading (EC) should be controlled by illuminance on workplane, glare or/and temperature in office.\n\nI've done illuminance and glare based simulations in DIVA for Rhino, but in DIVA the control options are limited.\n\n\n\nSince I'm a beginner in HB, I could use some help.\n\nLet's say we have 3 shading states (+ base state)\n\n\n\n1. When running an Annual Daylight Simulation like this (Glare)[<img class=\"align-full\" src=\"http://api.ning.com:80/files/m-rUv2ZKei79y690DsBHPVzEHasvVa4if6dWflfWDYO6Kt7QIDSlBJhYHVCf9aCWZm9eDWg6Way11vhZ3L0leZvOJYOgGxr2/ok1.PNG?width=750\" width=\"750\"/>](http://api.ning.com:80/files/m-rUv2ZKei79y690DsBHPVzEHasvVa4if6dWflfWDYO6Kt7QIDSlBJhYHVCf9aCWZm9eDWg6Way11vhZ3L0leZvOJYOgGxr2/ok1.PNG)Is the shading controlled on DGP(0.4) or on radiance(W/m²)?\n\nThe DGP values in the result file/data are all below 0.4.\n\nThere is no schedule file, whence I know when and which shading state is active? Can I generate such a schedule from the Data in HB and use it later in the energy simulation?\n\n\n\n2. How to properly build this kind of control strategy in GH/HB?\n\n\n\n3. Is it possible to control the ECs by temperatur?\n\n\n\nGreetings and thanks in advance,\n\nJakob\n", "attachments": [], "created_by_name": "Jakob Schmidt", "created_at": "March 30, 2016 at 3:40am", "created_by": "JakobSchmidt", "topic": "Electrochromic Glazing in Energy Simulation", "replies": [{"body": "\nJakob, \n\n\n\nAs far as I know there is no straightforward solution for temperature responsive parameters. I think (don't quote me on this) Energy Plus, Radiance and all packages will calculate thermal transfer (u-values, material transmittance,absorptance and reflectance by timesteps, in a dynamic calculation, however there is no way to tap or alter any of these material characteristics mid-calculation; so it kind of behaves like a steady state calculation in that sense. \n\nI don't know of any straightforward way to simulate dynamic materials that rely on E+ outputs (internal temp). However, as an ugly solution you could try to recursively generate a schedule by running multiple simulations and setting the shading schedule based on temperature outputs. E.g. first simulation without shading will give you a desired time to activate shading. Second sim will include shading starting at the previous time and will indicate when shading is no longer needed. you can repeat this until you have gone through the desired simulation period. \n\ngood luck. Let me know if you figure out a better solution. \n\n\n\nregards,\n\nMauricio\n", "attachments": [], "created_by_name": "Mauricio Aguilar Cardenas", "created_at": "March 30, 2016 at 4:01am", "created_by": "MauricioAguilarCardenas135", "replies": [{"body": "", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "March 30, 2016 at 7:16am", "created_by": "ChrisMackey", "replies": []}]}, {"body": "\nChris, Mauricio,\n\n\n\nThanks for your help. I perceive there are a lot of things about GH/HB I need to learn.\n\nRegarding the example file, I build up the attached file.\n\nI try to simulate two windows (window in window, image attached, model is a simple box).\n\nThe Big Window shall be controlled by Temperature and the Small Window by Glare (DGP, not illuminance threshold).\n\n\n\n**Q1** After running a daylight simulation with base material I get the DGP values.\n\nI want to set an expression like if(\"x\"&gt;\"0.4\",1,0) to get the values for the csv schedule, but all results are 1 though there are dgp values above 0.4? (No syntax error in expression)\n\nBesides, I already have dgp files from previous simulations with DIVA, but can't import them into GH, the  **importDGP** component is green but the outputs are empty...\n\n\n\n**Q2 **Creating an EP model with a window in window surface (see attached file) is no problem. When I try to add the shade from the **windowshadegenerator** the complete wall disappears.\n\nHow do I correctly build this with two seperate controlled windows in one wall? Do I have to use the addGlazing component or can I simply use an hbsurface component and add the right epconstruction?\n\n(There is a note that for EP simulations I should use addGlazing when setting srftype).\n\n\n\n**Q3** Like the problem in Q2, when adding multiple times the same wall/shading construction, how do I set up Electrochromic Glazing with several dimming stages? For example 3 dimming stages controlled by temperature(22,24,26°C) or glare(3 different schedules/materials).\n\n\n\nBest,\n\nJakob\n\n\n\n\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1498079", "name": "WinW.PNG"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1498080", "name": "ECexample.gh"}], "created_by_name": "Jakob Schmidt", "created_at": "April 1, 2016 at 7:06am", "created_by": "JakobSchmidt", "replies": [{"body": "\nJacob,\n\nI don't understand what you are trying to run with the \"window in window\" situation.  A window cannot be the child of another window. Input the two separate window surfaces with one AddHBGlz component and make sure that these two window surfaces do not overlap.  In other words, trim out the area of the small window form the large window.  To answer your questions:\n\n\n\n1) In what format do you have the DGP values?  If you have DGP values in a csv format, just import them into GH like so:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/iwhKaf*i-h2N8yn*xaPc3xJNOZaDiYsuPS9f1TDo7VW0*VgPix5OKgAbgKpJ17O3dBMJGXLFtLMRLRFOjhPHW*-L78BvC7Eb/CsvFileParser.JPG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/iwhKaf*i-h2N8yn*xaPc3xJNOZaDiYsuPS9f1TDo7VW0*VgPix5OKgAbgKpJ17O3dBMJGXLFtLMRLRFOjhPHW*-L78BvC7Eb/CsvFileParser.JPG)\n\n2) See above.  Your initial \"window in window\" case is \"not a problem\" because your large window is being modeled as opaque.\n\n\n\n3) Several dimming stages with a single setpoints is not currently an option with EnergyPlus's switchable glazing object.  If you want to have dimming, you are going to have to create a custom csv schedule of 8760 fraction values (from 0 to 1) that represent how dimmed the window is.  You will have to figure out these 8760 values before running the simulation using the DGP value and the temperature (from an EPW file if outdoor or perhaps from an initial energy simulation if indoor).  Plug this schedule into the shadeSchedule of the \"EnergyPlus Window Shade Generator.\"\n\n\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "April 1, 2016 at 9:50am", "created_by": "ChrisMackey", "replies": []}, {"body": "\nChris, hello. Here you mention that you can drive dimming of electrochromics with a pre-built schedule. That sounds nifty, so I tried it, but can't get the system to respond to a fractional schedule - only to a boolean 1/0 schedule. It may be that this is not actually possible, but if you've done it, I'd like to replicate it. \n\nI was working with a version of the file in this thread, copy uploaded. Any ideas you have, I'm all ears. \n\n\n\nThanks!\n\n\n\nNick.\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1554820", "name": "NoCenPT_AY _NN.gh"}], "created_by_name": "Nick Novelli", "created_at": "June 23, 2016 at 5:53pm", "created_by": "NickNovelli", "replies": []}]}, {"body": "\nThe small window is intended for user comfort and the big window to enhance the energy efficieny.\n\nThe DGP data format is the same as you get from the HB simulation. (it works when the file is in the annual simulation folder - looks like the other data from the folder is needed(ViewPoints/Direction)? I have attached a file))\n\n\n\nI put both windows in one AddHBGlz component. This is what I got\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/Wgfeh6*JLPZ-hDZ-E56OljmyX*lRcal6ADW6Z2uGzH8iZyNRSUf8FGSUIMVfp-loTVuLXrD3cfPO6m3Qnc1BJOvuCE5zA3KF/Windows.PNG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/Wgfeh6*JLPZ-hDZ-E56OljmyX*lRcal6ADW6Z2uGzH8iZyNRSUf8FGSUIMVfp-loTVuLXrD3cfPO6m3Qnc1BJOvuCE5zA3KF/Windows.PNG)Now I have two windows in the AddHBGlz output, but is it even possible to control them separatly?\n\n\n\nConcerning dimming, did I understand you correctly, the values in the csv determine how much the window is dimmed? Like 0.25=25%, 0.5=50%?\n\nWhen I set the darkest dimming state as shade material, what about the characteristics (reflectance and transmittance) of the shade material? Does it adapt?\n\n(Apropos characteristics, is it the solar or the visible reflectance?)\n\n\n\n-Jakob\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1501191", "name": "DGP_DIVA.dgp"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1501192", "name": "windowsurfaces_baked.PNG"}], "created_by_name": "Jakob Schmidt", "created_at": "April 5, 2016 at 6:02am", "created_by": "JakobSchmidt", "replies": [{"body": "\nRegarding the attached image, there are two overlapping surfaces. When creating a usual window (AddHBGlz/byRatio) the surfaces don't oberlap. Will this cause problems or falsify the results?\n\nIf not, I thought about two concepts.\n\n\n\n**Concept1:** Building the two windows separatly with **WindowShadeGenerator**, put it in the Mass2Zones component, solve adjacencies and put it in the E+ Simulation component.\n\nProblem: when I set **writeIDF** to true it says **'EPZone' object has no attribute 'cenPt'**?\n\n\n\n**Concept2** is about the **WindowShadeGenerator**. When you have Electrochromic Glazing, the **shadeBreps** output is empty, but what about the **windowBreps**. With ECs, is this output just the base geometry brep or is it the current shading state and does it contain any shade material data?\n\nThe thought behind this is, if you have the data when and which shading state (geometry+material) is active, you can use it as child surface in an AddHBGlz component and tell E+ when and which shading material is active (hourly).\n\n\n\nDoes this make any sense, can E+ even handle this?\n\nJakob\n", "attachments": [], "created_by_name": "Jakob Schmidt", "created_at": "April 7, 2016 at 6:30am", "created_by": "JakobSchmidt", "replies": []}, {"body": "\nI didn't understand quite good what you asked, but i won't recommend to leave the overlapping as an option. E+ won't crash for that (you will amazed how much garbage can E+ eat), but the results will not be reliable.\n\nDid you think about sectioning the windows in5 portions? One in the center and 4 on the sides. This should work. I see that you input the geometry of the windows, so you can be set with such option.\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "April 7, 2016 at 7:25am", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nI just tried it. Made 5 surfaces, added them as glazing, every surface in one WinShGen, put them together and the E+ simulation component says\n\n**1. Solution exception:'EPZone' object has no attribute 'cenPt'**\n\nHow can I solve that error?\n", "attachments": [], "created_by_name": "Jakob Schmidt", "created_at": "April 7, 2016 at 8:18am", "created_by": "JakobSchmidt", "replies": []}, {"body": "\nCan you upload the GH? (Internalize the geometry or add also the Rhino file).\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "April 7, 2016 at 8:52am", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nSorry for the late reply, here is the file.\n\nAfter creating two csv schedules, one with fraction values and one with only 0 and 1, I ran simulations with one window... results are the same.\n\n\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1507813", "name": "NoCenPT.gh"}], "created_by_name": "Jakob Schmidt", "created_at": "April 13, 2016 at 1:36am", "created_by": "JakobSchmidt", "replies": []}, {"body": "\nI'm not sure what we are supposed to check in the file you uploaded, but it was built badly. You joined the same surface 5 times (as the windows you have). It is like having the same wall 5 times (now i see this is what you wrote above).\n\nI fixed this and it runs the simulation (see purple groups). Go ahead and see if this works for you and for what you want to do.\n\n-A.\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1508242", "name": "NoCenPT_AY.gh"}], "created_by_name": "Abraham Yezioro", "created_at": "April 13, 2016 at 12:06pm", "created_by": "AbrahamYezioro", "replies": []}]}], "id": "1496352"}