{"body": "\nHello guys,\n\nIs it possible to get from any of the components from EnergyPlus the SHGC?\n\nI am trying to know how much is the contribution in terms of reduction of incoming solar energy of a group of shading devices in a window, by now I have been using with the TotalWindowEnergy output from the Eplus SurfaceReader, which by the way can only by annual, or is it possible to change it to specific time lapse, lets say for only 3 months?<br/><br/>Is total TotalWindowEnergy my best option? <br/><br/>The output of the indicator will be lately used for a multi-objective optimization process.\n\nThe shading devices were generated by GH native components not by the HB Shade Generator. \n\n\n\nCheers.\n", "attachments": [], "created_by_name": "Luis E. Lopez", "created_at": "March 31, 2016 at 3:41pm", "created_by": "moxshinobi", "topic": "Assessing for SHGC", "replies": [{"body": "\n1. You can use windowTotalSolarEnergy output.\n\n2. Set the timeStep_ in EPOutput component to monthly or hourly to get the results for each month or each hour of the year.\n\n3. Change _analysisPeriod_ in runEnergySimulation to a shorter analysis period to get the results for a couple of months and not the whole year.\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "April 1, 2016 at 7:53am", "created_by": "MostaphaSadeghipour", "replies": [{"body": "\nIn addition to Mostapha's comments, you don't need to run a full energy model if you are only evaluating the solar radiation reduction of an external shading device.  Just a Ladybug radiation study will tell you how much solar energy is getting through the shade.\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "April 1, 2016 at 9:02am", "created_by": "ChrisMackey", "replies": []}, {"body": "\nThanks for both your answers, I will try all that. Sounds logical. \n\n\n\nI have other questions, since I am trying to optimize the design of shading devices, in the steps I am following to link GH to the software I am using which is ModeFrontier, in order to collect the data I have to give the same level of priority to _HBZones than HbContext_ and for now the component is set for the context to be optional is there a way to make the component to take context as mandatory? Although Chris´s answer simplifies everything a lot isn´t it more precise from an energy model? \n\n\n\n\n", "attachments": [], "created_by_name": "Luis E. Lopez", "created_at": "April 1, 2016 at 9:13am", "created_by": "moxshinobi", "replies": []}, {"body": "\nLuis,\n\nI do not understand what you mean by optional/mandatory context?  Do you mean having the energy simulation component require that context be connected?  Whay would you need to change the component like this?\n\n\n\nRadiation is not necessarily more precise in an energy model than in an simple radiation study.  In an energy model, the accuracy of the radiation calculation depends upon the shadowPar and the solarDistribution of the \"Energy Simulation Par\":\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/iwhKaf*i-h0f9oyeOp6xDCe8Nk*2i9A0erbs6Kh3k2LAn*fUh*a6Y4Kw0TMC40zByaefhwUCspBZFVYPf7UINd-Vo9*fAb6-/Shadowpar.JPG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/iwhKaf*i-h0f9oyeOp6xDCe8Nk*2i9A0erbs6Kh3k2LAn*fUh*a6Y4Kw0TMC40zByaefhwUCspBZFVYPf7UINd-Vo9*fAb6-/Shadowpar.JPG)\n\nIn a simple ladybug radiation study, the accuracy depends upon the grid size:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/iwhKaf*i-h1HuPMrNemrUEIPc65rHTMCFHuXmm1*l9WWK8PI8*PThIPUquol-ohBXNTzjP6tNAF7DZwPmCw-vgWOOPPsjLJO/LadybugPar.JPG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/iwhKaf*i-h1HuPMrNemrUEIPc65rHTMCFHuXmm1*l9WWK8PI8*PThIPUquol-ohBXNTzjP6tNAF7DZwPmCw-vgWOOPPsjLJO/LadybugPar.JPG)\n\nIn a Daylight/Radiance study, the accuracy depends upon the grid Size and the radParameters:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/iwhKaf*i-h2gP47Z8I0NpNrXX*XkjVhTz7q7EU-7Lw*ZeKWMBMEJVHwK36Obka*PY*jMzFRz-8jTkQXU0YSO33Qm-d35A5YT/RadiancePar.JPG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/iwhKaf*i-h2gP47Z8I0NpNrXX*XkjVhTz7q7EU-7Lw*ZeKWMBMEJVHwK36Obka*PY*jMzFRz-8jTkQXU0YSO33Qm-d35A5YT/RadiancePar.JPG)\n\n\n\nIn all cases, the accuracy is driven by the amount of time that you are willing to wait for the simulation to complete.  The accuracy of one of these simulations can be more or less than any of the others depending upon what these parameters are.  If you are after the most accurate simulation possible with a long run time, the Daylight/Radiance workflow (the last one) should be your choice.\n\n\n\n-Chris\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1498342", "name": "RadiAccuracy.gh"}], "created_by_name": "Chris Mackey", "created_at": "April 1, 2016 at 10:06am", "created_by": "ChrisMackey", "replies": []}, {"body": "\nChris,\n\n \n\nAnswering your question of why is it needed that the context has to be required to run the simulation, perhaps its just in the particular case for making multi-objective optimization for shading devices in software outside from GH environment.\n\nIn the workflow I am trying to propose I need to collect the data from the result of the radiation in the system as a whole (window + shading devices) my point of departure for example is when the shading devices are geometrically at their minimum size, rotation, etc.\n\nTherefore from that minimum I can begin my optimization towards the maximum radiation on the window over any period of time.\n\nSo since the context is optional, when I run the optimization software linked to GH, the necessary inputs are in the RunEnergySimulation to run (with or without the shading devices), the optimization loop never gets completed since it will run all the time. \n\nIn the end I want to aim for a workflow that delivers the user an informed design decision where he can be able to be informed of the contribution of every design parameter on to a certain design. \n\n \n\nDoes this make my question less confusing?\n\n \n\n \n", "attachments": [], "created_by_name": "Luis E. Lopez", "created_at": "April 1, 2016 at 10:35am", "created_by": "moxshinobi", "replies": []}]}]}