{"body": "\nso after a lot of using ladybug i finally stepped into honeybee. nice videos on youtube, but quite outdated and i'm getting lost easily.<br/> <br/> for instance, in \"honeybee workshop part 1\" many things are outdated and changed since then:<br/> <br/> 1)i'm not even able to generate \"sky with certain illuminance level\" ...the default value has disappeared through the versions and i don't know what to put... 1? 0,5? ..boooh..<br/> <br/> 2) how do I apply materials to objects? the \"generic material\" component is gone, and the video starts with that, so i'm stuck from the beginning\n\n\n\n3) and then i get a strange error when attempting to generate the RAD file. unfortunately i'm using the machine of a colleague and the message is notified in the native language and can be translated as \"the specified key was not present in the dictionary\".<br/> this appears immediately after i toggle \"write rad\" to True.<br/> Maybe does it have something to do with the fact i didn't set up materials because couldn't figure out how?\n\n[<img class=\"align-center\" height=\"368\" src=\"http://api.ning.com:80/files/CGXSPqmGVn3Yu5HlDJ4YEjHZxqSL6gvD5WbG5XRHsyypsfCGK*VXdOsDDr13AXGVRYHnA7-kuaSDPg3a-eJr-dUj-RD*7Is-/upload.png?width=750\" width=\"656\"/>](http://api.ning.com:80/files/CGXSPqmGVn3Yu5HlDJ4YEjHZxqSL6gvD5WbG5XRHsyypsfCGK*VXdOsDDr13AXGVRYHnA7-kuaSDPg3a-eJr-dUj-RD*7Is-/upload.png)thanks for helping!<br/><br/>ps i went to check and it seems that a folder has been created with a .sky and .typ file\n\n\n", "attachments": [], "created_by_name": "Jay Ramos", "created_at": "April 2, 2016 at 11:10am", "created_by": "JayRamos", "topic": "noob with honeybee", "replies": [{"body": "\nHi Jay,\n\n\n\nPeople on this discussion board will be able to guide you better if you post your grasshopper(.gh) file along with the discussion.\n\nThe default value for illuminance before was 1000 lux. So, you can use that as your input.\n\n\n\nThe generic material for Radiance in most cases is 'plastic'. This is implemented as Honeybee_Radiance Opaque Material. If you are trying to model a glazing, then the material to use would be glass. You can find some recent Grasshopper examples on Hydrashare: [http://hydrashare.github.io/hydra/](http://hydrashare.github.io/hydra/)\n\n\n\nSarith\n\n\n", "attachments": [], "created_by_name": "Sarith Subramaniam", "created_at": "April 3, 2016 at 2:55pm", "created_by": "sarith", "replies": [{"body": "\nSorry to hear that. Maybe I should record the next coming workshop! As Sarith suggested try to check files on Hydra. They are put together for very similar cases.\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "April 4, 2016 at 7:32pm", "created_by": "MostaphaSadeghipour", "replies": []}]}]}