{"body": "\nHi\n\n\n\nI have a simple script to make a series of tower objects in a spreadsheet. These are read into Grasshopper using Bumblebee and the boundary objects are created as simple mesh boxes of the matching dimensions. I am also in a separate exercise reading some shape files (.shp format) of real buildings with database links to their heights so that I can extrude these towers from their boundary plan shapes to their real height - to visualise the city geometry. \n\n\n\nUnfortunately, I cannot get the Ladybug or Honeybee geometry input functions to recognise these meshobjects. It seems the geometry input requires breps? But I cannot find a means of converting my geometry to a form that HB/LB can understand. Any help you can provide would be gratefully accepted.\n\n\n\nM\n", "attachments": [], "created_by_name": "Michael Donn", "created_at": "April 1, 2016 at 10:43am", "created_by": "MichaelDonn", "topic": "Ladybug / Honeybee not handling extruded polygon geometry?", "replies": [{"body": "\nMichael,\n\nCan you attach the GH file you are trying to use?\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "April 1, 2016 at 10:49am", "created_by": "AbrahamYezioro", "replies": [{"body": "\nMichael,\n\n\n\nI second Abraham's suggestion. There should be different ways to get your workflow to work.\n\n\n\nLadybug works fine with meshes and Honeybee converts meshes to brep under the hood to be able to use functionalities like add glazing based on WWR. You can also use MSH2RAD path which is straight path from Mesh to Radiance.\n\n\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "April 1, 2016 at 11:10am", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nHi\n\nUnfortunately I would have to get someone else's permission to upload the .shp import file (using @it - thanks for the example Mostapha). Therefore, I cannot supply the import .shp plus extrude example, but this file creating towers of a particular volume linked to their equivalent low-rise volume where I make boxes using Bumblebee so I can build performance graphs etc in Excel should suffice. \n\nUltimately what I had in mind was to build an analysis tool that allowed me to explore the Simple Static Heat Losses in the spreadsheet for the design alternatives, or even to have a set of heat losses for each 5 storeys of the building height from 5 through 100 storeys - to understand heat loss, linked to Rhino/GH to plot a 3D landscape of these options. This would then be linked to HB so that I could (first) plot the solar gains on the building facades for one building in a neighbourhood of similar height, and then divide up these basic towers into bottom middle and top floor Energy Plus and Daysim analyses of a standard 5 zone division of the floor.\n\nFailing the intelligence test, and not even being able to move from simple mesh to simple analysis in LB has the grand vision stalled at step 2!\n\nBTW: with my (2016) version of Excel I get Excel.Interop error messages if I try to use the &lt;Live&gt; option for streaming the spreadsheet into Rhino/GH, so I re-read the spreadsheet manually by toggling the Boolean &lt;Runit&gt; option to read in the data.\n\nM\n\n\n\n\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1499686", "name": "heat Loss Calculator ver2 copy.xlsx"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1499687", "name": "Read_tall_buildings_spreadsheet_honeybee_beginnings.gh"}], "created_by_name": "Michael Donn", "created_at": "April 4, 2016 at 1:39am", "created_by": "MichaelDonn", "replies": []}, {"body": "\nMichael,\n\nThe issue is not related to the geometry as you originally suspected. You were missing the LB_selectSkyMtx.\n\nSee image for your example working.\n\n-A.\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/PFt8hYehZ84wVDDZLSMlS6YL7NdVDsAik1IOrZpCXTwFZ9qpd56Q0rpETiDaka7AiJybpjcpyVUrm7jcnAsLsbJmfJXozlUW/Canvasat170127.png?width=721\" width=\"721\"/>](http://api.ning.com:80/files/PFt8hYehZ84wVDDZLSMlS6YL7NdVDsAik1IOrZpCXTwFZ9qpd56Q0rpETiDaka7AiJybpjcpyVUrm7jcnAsLsbJmfJXozlUW/Canvasat170127.png)\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "April 4, 2016 at 9:32am", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nThanks Abraham for checking the file! In the new version we're doing a much better job in checking the inputs and giving meaningful warning messages.\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "April 4, 2016 at 6:57pm", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nThanks!\n\n\n\nVery helpful..\n\n\n", "attachments": [], "created_by_name": "Michael Donn", "created_at": "April 11, 2016 at 8:59am", "created_by": "MichaelDonn", "replies": []}]}], "id": "1498208"}