{"body": "\nHi guys,\n\nI know you are super busy right now rewriting and improving the code. If it is possible (and maybe a good time to?) I'd like to ask for adding a functional transparency to PNGs (without color loss or baking). Once again quite often instead of pasting a diagram, I have to clean up white background from the image (which is not hard but leaves some artefacts).\n\nAnyway, I brought this issue up before and if it is something useful for others too, it would be mega awesome to see this feature in the next release.\n\nWhat do you think? What people think, is it just me?\n\nHave a nice day.\n", "attachments": [], "created_by_name": "Tim", "created_at": "April 5, 2016 at 1:19am", "created_by": "Timur582", "topic": "Wish: Add transparency to Capture View component", "replies": [{"body": "\nTim,\n\nThis has also been a hassle in my workflows.  It I had to deal with PowerPoint's artifact-ridden \"set transparent color\" method again, I was going to flip.  Thankfully, it was easy to implement on the component:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/4-r35uyukEYW291gGyT7Ox-ULoz0*bOXmom26iTPkaI6iKbNTi3HZgU4uIzNbjIwQcobL-1BNp6CfOt8m2F81HP7OYEAYOBF/TransparBack.JPG\" width=\"583\"/>](http://api.ning.com:80/files/4-r35uyukEYW291gGyT7Ox-ULoz0*bOXmom26iTPkaI6iKbNTi3HZgU4uIzNbjIwQcobL-1BNp6CfOt8m2F81HP7OYEAYOBF/TransparBack.JPG)\n\nEnjoy!\n\n-Chris\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1505997", "name": "TransparentBackground.gh"}], "created_by_name": "Chris Mackey", "created_at": "April 11, 2016 at 12:24pm", "created_by": "ChrisMackey", "replies": [{"body": "\nHi Chris,\n\nI love you man. I was hoping to see at least a couple of people backing me up on this, but unfortunately nobody did and I felt that what I was asking for is something superfluous.\n\nYou understand me, thank you so much for this tiny feature, my life is complete for now.\n\n\n\nI just updated LB's user objects and checked the new sweet feature but it didn't work. Is there something I forgot to check? I didn't touch HB and I didn't forget to update all the LB components on the canvas as well as change the old component with a new one. I also tried to play with the inputs to no avail. I tried to download your file and see if it works, but it was the same.\n\nI usually use Wireframe top view with white background if this can help. As I get it you let rhino change background color to transparency?\n\n\n\nCapture view components is awesome, I always use it to capture stuff in rhino. I'll wait for your reply to see if I can help to solve this issue.\n", "attachments": [], "created_by_name": "Tim", "created_at": "April 11, 2016 at 10:55pm", "created_by": "Timur582", "replies": []}, {"body": "\nTim,\n\nThis works fine at my end. Check the date of both LB_LB and LB_CaptureView. They both need to be Apr_11.\n\nChris: Thanks. The truth is that didn't use this feature ... until now. Extremely useful.\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "April 11, 2016 at 11:29pm", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nHi Abraham,\n\nlooked them up, they are same. Could you, maybe, share definition where it works? There must me something else on my side.\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/dk-AyGBsVPAaUNvtGWsdsDcbkyLuIm8GecqMuoqEERj8NWc4EUZPJua-f80g0K1g3ya0ItYLv*Z9tMMCJCHpptnfC1a7n*AZ/Untitled.png\" width=\"615\"/>](http://api.ning.com:80/files/dk-AyGBsVPAaUNvtGWsdsDcbkyLuIm8GecqMuoqEERj8NWc4EUZPJua-f80g0K1g3ya0ItYLv*Z9tMMCJCHpptnfC1a7n*AZ/Untitled.png)\n", "attachments": [], "created_by_name": "Tim", "created_at": "April 12, 2016 at 3:15am", "created_by": "Timur582", "replies": []}, {"body": "\nTim,\n\nI can send something that works for me, but this will be the same file as Chris uploaded. I tried different scenarios and all of them work fine.\n\nSo wait for his opinion.\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "April 12, 2016 at 6:35am", "created_by": "AbrahamYezioro", "replies": []}, {"body": "", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "April 12, 2016 at 10:52am", "created_by": "ChrisMackey", "replies": []}, {"body": "\nHey Chris,\n\nYeah, I was expecting it to work just fine since I set my background color to a nice clean white. Strange stuff. I'll upload my LB definition as well as my viewport settings (make sure to back yours up first if you want to see the again XD). I didn't have any geometry at that point, just a new rhino document and wireframe top view with LB's diagram.\n\nOh, really?  Thanks, that's nice to hear because I felt like I was one of those typical apple users complain about some aesthetic feature being not \"cool\" enough or something. Up to a point I wish I could just quickly code something myself and see if it looks as good as I thought it would, so yeah, it would be a pleasure for me to help you guys even a little bit. \n\nI am currently learning Java's Processing (because it is said to be great for beginners and fun to learn and indeed it is). Before that I only learnt Visual Basic in chinese XD as one of compulsory courses after which I had enough XD. So right now despite my growing love for coding I had to slow down because of my graduation project. So yeah, let me jump right in Python after I graduate and find a job otherwise I'm afraid I'll spread too thin and won't accomplish anything. \n\nAnyway, I'm really looking forward helping your team and learning something new and awesome, let's come back to this topic after I deal with uni and job if that's ok?\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1507352", "name": "Wireframe.ini"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1507353", "name": "Rendered.ini"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1507354", "name": "01_Wind.gh"}], "created_by_name": "Tim", "created_at": "April 12, 2016 at 9:29pm", "created_by": "Timur582", "replies": []}, {"body": "\nHey Chris,\n\nJust noticed a strange behaviour and thought to tell you here, didn't want to create a discussion for it. Capture view doesn't work with a timer on, is it something common? I'd add a workaround if I could, just in case. It works fine when I disable the timer, a possible problem for any animation enthusiast.\n\n\n\nP.S. I didn't figure out the transparency ((\n", "attachments": [], "created_by_name": "Tim", "created_at": "April 14, 2016 at 4:36am", "created_by": "Timur582", "replies": []}, {"body": "\nHey Tim,\n\nI imported your .ini files and I was able to replicate the error.  I have not re-written the capture view component to deal with your case yet but I know what is causing the error.  You should be able to get the transparency to work on your machine by going to Options&gt;View&gt;Display Modes and, for each display mode, set the Background under Viewport settings to \"Use Application Settings.\"  For the Rendered mode, you should change this Background to \"Use Render Settings.\"  Right now, you have all of these set to \"Solid Color\", which does not currently work.\n\nI'll try to rewrite the component code to sense this in the future and I will post back here once I do so.\n\nI don't know how you are trying to use the component with the timer.  If you post an example GH file showing the issue, that might make it easier to understand.\n\n\n\nThe plan for getting involved in coding sounds great.  Let me know when you get some time to delve into python and I'll send you a list of resources.  Good luck with finishing up uni and the job search!\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "April 14, 2016 at 9:28pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nHi Chris,\n\nI did like you said and made a quick screenshot, transparency is back, wohoo. Thanks for the help, I can work with that much faster.\n\nI attached the file were I had timer problem.\n\nThanks Chris, let's talk again at a better time.\n\nHave a nice day.\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1508972", "name": "01_Wind.gh"}], "created_by_name": "Tim", "created_at": "April 14, 2016 at 9:43pm", "created_by": "Timur582", "replies": []}, {"body": "\nTim,\n\nSorry for the late reply.  I can't seem to recreate your timer error from your file.  Are you getting an error message from the timer?  If so, could you post that error message here?\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "April 29, 2016 at 11:36am", "created_by": "ChrisMackey", "replies": []}]}], "id": "1501155"}