{"body": "\nHi all,\n\n\n\nI want to develop a program to calculate the solar factor of a facade, for any atypical configuration.\n\nI used Honeybee components to define all the materials of the scene, the sky, and the radiance parameters. Then I define the analysis grids: one before the system “shading+facade” to determine the incident solar energy, and one inside my “box” to determine the transmitted solar energy. The ratio of the two energies for each point of the grid give the solar factor on those points. I average all the points of the grid and obtain hourly values of the solar factor of the system. (Attached files)\n\nI have done a test with an extremely simple “box”, without shading system, with a window for which I defined a RGB transmittivity of 0.5, and I obtained an annual solar factor of 0.33.\n\n\n\n1)     Can you indicate what is wrong about my program?\n\n2)     Facing this result, I’m wondering if the program is really adapted to the calculation of the solar energy. I mean the Ray tracing method used by Radiance is interesting for my problematic but the calculations under the hood may be not relevant for solar energy. The “solar irradiation” calculated take into account only reflexions (and not transmissions). Am I right for this point? ! I really want to understand what is going on under the hood …\n\n3)     Do you know if it’s possible to use this Ray Tracing method for solar energy calculations? (If it exists a program or a way to, even without use HB or LB components ?)\n\n\n\nFor now I can use the program to determine the “solar factor” of the opaque shading system (alone) and then apply this factor to the solar factor of the glazing system (given by suppliers). So that I can have the solar factor of the complete system “shading+window”. It is an idea but still arises the problem of modeling a canvas shading, for instance, which transmits a diffuse part of the solar energy it receives. Or the problem of determining the solar factor of a double glazing system with a venetian blind placed between the panes, or an inside blind for which we must take into account its infrared heating... \n\n \n\nThe conception of this tool constitute my project graduation… so I would be really thankful if you can help me !!\n\nThanks in advance,\n\n \n\nSeverine\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1502225", "name": "SolarFactor_severine.gh"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1502226", "name": "CaptureSolarFactor-withoutshading.PNG"}], "created_by_name": "Severine", "created_at": "April 6, 2016 at 4:41am", "created_by": "Severine", "topic": "Determination of the Solar Factor of a facade", "replies": [{"body": "\nHi Severine, How your work is different from what you can do with EnergyPlus calculating transmitted solar energy?\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "April 6, 2016 at 8:28am", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nHi Mostapha,\n\n\n\nThanks for your quick answer !\n\n\n\nThe program I have to develop must provides hourly values of solar energy (diffuse and direct incident and transmitted) and takes into account multiple transmissions and reflexions of diffuse and direct solar radiations. The tool must be adapted for the study of any atypical facade configuration (in terms of material and geometry).\n\n\n\nI am not sure to know how to use EnergyPlus HB components.\n\nIt is possible to define analysis grids ? because it could be interesting to have the solar energy reached on a particular point for instance. \n\nDoes EnergyPlus use the \"Ray-Tracing\" method to calculate the solar energy ? I think this method is really adapted for my problematic.\n\nEnergyPlus seem to suit more for global energy simulation.. (?)\n\n\n\nIf I use my program to determine the \"solar factor\" of the shading system only (opaque material), Do the results take into account the multiple reflexions of the rays when they are launched ? (At last the reflexion..)\n\n\n\nFor a moment, I though to convert R G B radiances calculated to solar energy but couldn't find some works on that possibility. like \"daylight simulation\" but transposed to solar energy...\n\n\n\nI'm trying to be clear about my problematic, let me know if I am not. \n\n\n\nAmbitious work,\n\nThanks in advance for your help !\n", "attachments": [], "created_by_name": "Severine", "created_at": "April 6, 2016 at 10:05am", "created_by": "Severine", "replies": []}, {"body": "\nHi Severine, \n\nIf you want to know what sort of calculations are going under the hood you could perhaps find useful info here: \n\nRadiance - [http://radsite.lbl.gov/radiance/framer.html](http://radsite.lbl.gov/radiance/framer.html)\n\nDaysim - [http://daysim.ning.com/](http://daysim.ning.com/)\n\nWhen you run the simualtion you will notice on the batch terminal that Daysim is also being called, so you may want to consider how Daysim uses Radiance files &amp; data. \n\n \n\nRegarding your current problem, I think you stumbled onto something weird and interesting.\n\nInterior and exterior readings appear to differ by 40 in the best case scenarios. Even setting the transmittance to 1 yields similar results. I tried changing from cummulative sky to climate sky and got similar values. Changing the test points did nothing either. \n\nI think, (yet I'm too lazy to prove this) that the difference in values stems from diffuse radiation over the sky dome. \n\nIf you delete everything except the glass you'll notice that interior values are like 80-90% of the exterior values (this seems like the expected behaviour with a transmittance of 1). So, if we consider that a vertical window, part of an opaque box, is receiving radiation from 25% of a sphere, as you start to inset the interior test points the radiation they receive will be a fraction of the 25%. \n\nLet me try to explain this better...The exterior surface receives radiation from a section of a sphere calculated by 180degrees on the xy plane (let’s call this angle theta) and by 90degrees (let’s call this angle phi) in azimuthal elevation. If you integrate this over spherical coordinates (theta from 0 to pi; phi from 0 to pi/2) you will find that it comes to a quarter of a sphere. By comparison, the interior surface will not integrate theta from 0 to 180degrees,nor phi from 0 to 90degrees, instead it will be the subtended angle from the exterior surface as a function of their separation; the farther in you go the smaller the view of the outside. \n\nIf my hypothesis is correct there shouldn't be that much difference since the separation is only 10cms...the subtended angle would be like 170 instead of 180 for theta and 85 instead of 90 for phi...overall if you integrate both spherical areas there should only by a difference of 10%.\n\nIn conclusion, I believe the unexpected behaviour stems from the previous subtended angle thing. If direct radiation was the only factor the difference would be the aforementioned 10%, which suggests that an additional source of energy is also affected by this. Perhaps indirect and diffuse radiation from other areas of the sky dome.\n\nI’m definitely intrigued on why this is happening. Please post if you figure it out.\n\nRegards,\n\nMauricio\n\n \n", "attachments": [], "created_by_name": "Mauricio Aguilar Cardenas", "created_at": "April 6, 2016 at 11:06am", "created_by": "MauricioAguilarCardenas135", "replies": [{"body": "\nHi Mauricio ! \n\n\n\n1) Your answer is quite interesting ! I have tried to understand what you noticed. The schema attached shows that for direct radiation the \"red part\" shouldn't be reached by the sun path (60° max in Paris), but the problem stil arises for the angle theta (for the south but also for the others orientations). For the diffuse radiation, this difference should be 10% as you noticed.\n\n \n\n2) I have done some simulations and tried to analyse the weather file used. You can find my results in the Excel File attached. Some simulations take into account the glazing and others just determine the \"occultation factor\" of the shading device, to which I apply then the solar factor of the window. I found there is a noticeable difference between \"_shading_1\" and \"_Focc_1\" for exemple, we should have found similar values ... ? It seems to happen something strange when the rays passe through the glass to reach the analysis points. Facing those results, I still have trouble to draw conclusions. I also determined the diffuse part of radiations for each day from the weather file used, it may help to understand ... If you have any suggestion to explain those results, please let me know.\n\n\n\n3) Another point attracts my attention :\n\nThe horizontal infrared radiation intensity of the weather file is quite high and constant. I'm wondering if HB take into account this solar radiation's component which represent about 50% of the solar energy ?!\n\n[http://bigladdersoftware.com/epx/docs/8-3/auxiliary-programs/energy...](http://bigladdersoftware.com/epx/docs/8-3/auxiliary-programs/energyplus-weather-file-epw-data-dictionary.html#field-horizontal-infrared-radiation-intensity)\n\n\n\nI continue my research about what is going under the hood (reading documents on Radiance and Daysim calculations) and let you know about the progress of my searches.\n\n\n\nThank you again for your support !\n\n\n\nRegards,\n\nSeverine \n\n\n\n\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1506475", "name": "schema.jpg"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1506476", "name": "Results.xlsx"}], "created_by_name": "Severine", "created_at": "April 12, 2016 at 4:24am", "created_by": "Severine", "replies": []}, {"body": "\nHi all, \n\n\n\nI come to you again to keep you informed about my progress.\n\nEncounting difficulties to interpret my results, I have actually oriented my research to the \"genBSDF\" Radiance program. (interesting document here : [http://www.radiance-online.org/learning/tutorials/Tutorial-genBSDF_...](http://www.radiance-online.org/learning/tutorials/Tutorial-genBSDF_v1.0.1.pdf) )\n\nThis program can determine the quantity of energy which passes through a Radiance geometry, using the ray tracing method. (quite powerful program !!)\n\n\n\nUnfortunately, when I want to run the program it says \"can't load the Radiance input\"\n\n(Windows 7 &amp; Radiance version : 5.0.a.8)\n\n\n\nMy batch file is :\n\n@REM DIVA for Grasshopper Illuminance Batch File<br/>SET RAYPATH=.;C:\\DIVA\\Radiance\\lib;C:\\DIVA\\Radiance\\bin;C:\\DIVA\\DaysimBinaries;$RAYPATH<br/>SET PATH=.;C:\\DIVA\\Radiance\\lib;C:\\DIVA\\Radiance\\bin;C:\\DIVA\\DaysimBinaries;$PATH<br/>c:<br/>cd C:\\Users\\shuet\\Desktop\\Test_fonctions_Radiance\\batch04\n\n\n\n<br/>C:\\Radiance\\bin\\objview.exe C:\\Users\\shuet\\Desktop\\Test_fonctions_Radiance\\Batch04\\blinds.rad\n\npause<br/>C:\\Radiance\\bin\\getbbox C:\\Users\\shuet\\Desktop\\Test_fonctions_Radiance\\Batch04\\blinds.rad<br/>pause\n\nC:\\Radiance\\bin\\genBSDF.exe +f +b -c 500 -geom inch blinds.rad &gt; blinds.xml<br/>pause\n\n\n\nDo you have any idea about what is wrong with my batch file (or the program ?) ?\n\n\n\nThank you in advance to help me, \n\n\n\nBest regards,\n\n\n\nSeverine\n\n\n", "attachments": [], "created_by_name": "Severine", "created_at": "April 26, 2016 at 2:32am", "created_by": "Severine", "replies": []}]}]}