{"body": "\nHi\n\nI have just noticed (amongst my many other newbie missed messages) that the Honeybee \n\ncomponent itself has an error report: It cannot find Radiance.\n\n\n\nI have the latest Radiance from NREL installed within OpenStudio (C:\\Program Files\\OpenStudio 1.10.0\\share\\openstudio\\Radiance\\bin ) AND separately in the now normal C:\\Program Files\\Radiance\\bin directory.\n\n\n\nI have looked at the Honeybee code - which is clearly looking for the spaces in C:\\Program Files\\ but beyond that I cannot fathom what it is doing that it misses both these instances of Radiance. (I thought it might be obvious in the code)\n\n\n\nAny thoughts?\n\n\n\nCode snippet from lines 356-369 in Honeybee\n\n\n\nfpath, fname = os.path.split(program)<br/> if fpath:<br/> if is_exe(program):<br/> return program<br/> else:<br/> for path in os.environ[\"PATH\"].split(os.pathsep):<br/> path = path.strip('\"')<br/> exe_file = os.path.join(path, program)<br/> if is_exe(exe_file):<br/> # This is a change to catch cases that user has radiance inastalled<br/> # at C:\\Program Files\\Radiance<br/> if path.strip().find(\" \") == -1:<br/> return path, exe_file<br/> return None, None\n\n\n\n M\n\n\n\n\n", "attachments": [], "created_by_name": "Michael Donn", "created_at": "April 11, 2016 at 9:07am", "created_by": "MichaelDonn", "topic": "Honeybee check for Radiance", "replies": [{"body": "\nHi Michael, Honeybee currently can't handle filepath with white spaces. You need to install radiance at C:\\radiance (exe file will be installed under C:\\Radiance\\bin).\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "April 11, 2016 at 9:11am", "created_by": "MostaphaSadeghipour", "replies": [{"body": "\nHi\n\n\n\nMy mistake. I will install Radiance in a third location on my system (it needs to be compatible with all the different ways in which I use it)\n\n\n\nSorry to bother you again on this question. I had (mis)understood that the installation no longer required this file location for Radiance.\n\n\n\nM\n", "attachments": [], "created_by_name": "Michael Donn", "created_at": "April 12, 2016 at 4:54am", "created_by": "MichaelDonn", "replies": []}]}]}