{"body": "\nHello,\n\n\n\nI was wondering if this cool application could be included in HB. \n\n<br/> I apologize if what it does can already be performed through the daysim components, I just now started using them in actual cases.\n\n\n\nIf this is not very easy or probable to happen soon, is there a way to export my .rad scene with HB? Again I sincerely apologize if that is what happens when I press true in daylight simulation.\n\n\n\nKind regards,\n\nTheodore.\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "April 17, 2016 at 8:30am", "created_by": "TheodorosGalanos", "topic": "DAYSIMps", "replies": [{"body": "\nHi Theodoros, are you referring to the Penn State Version of Daysim? The one available [here](http://daysim.ning.com/page/download) ?\n", "attachments": [], "created_by_name": "Sarith Subramaniam", "created_at": "April 17, 2016 at 2:48pm", "created_by": "sarith", "replies": [{"body": "\nHi Sarith, yes that's the one.\n\n\n\nI know it's available, and I might go ahead and play around with it this week. Was just wondering if it is compatible with the whole LB/HB project (by compatible I meant easily transferred). I know the amount of work that is going on atm behind the scenes though so this isn't really a (high priority) request. I'm just wondering.\n\n\n\nKind regards,\n\nTheodore.\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "April 19, 2016 at 12:01am", "created_by": "TheodorosGalanos", "replies": []}, {"body": "\nHi Theodore,\n\nSarith can tell you more about DaysimPS but back to your original question I assume except for the header (*.hea) the input files should be the same. The header should also be very similar but I assume they should have a couple of new lines for photo sensors (ps).\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "April 19, 2016 at 7:07am", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nHi Theodore and Mostapha,\n\n\n\nI concur with Mostpaha. The input files are mostly same. Since we already have electric lighting in Honeybee we should even be able to do lighting zones, control algorithms like integral reset, proportional control etc.\n\nThe only challenge that I foresee is that one would have to replicate logic that is present within the javascript interface. DaysimPS isn't being actively developed anymore since Penn State is now developing [STADIC](http://www.radiance-online.org/community/workshops/2015-philadelphia/presentations/day1/Mistrick-STADIC.pdf). The last developed features of Daysim can be found in this  [presentation](http://www.radiance-online.org/community/workshops/2013-golden-co/Mistrick_Daysim-Development.pdf).\n\n\n\nTheodore, What functionality are you looking to leverage from DaysimPS?\n\n\n\nSarith\n", "attachments": [], "created_by_name": "Sarith Subramaniam", "created_at": "April 19, 2016 at 4:47pm", "created_by": "sarith", "replies": []}, {"body": "\nHi Sarith,\n\n\n\nWas mostly interested in the control algorithms and the evaluation of photosensors and their impact to energy consumption. As I said I'm only just starting to scatch under that surface I knew about these tools. I do remember however that photosensors and their distribution in space was hard to do (or a bit limited in any case) in E+. Daysim might be an answer (even though I do wish I could use my BSDF files) to this. \n\n\n\nI guess if Daysim already does all this in HB then I probably should just go through a tool first before I ask :)\n\n\n\nBtw, thanks a bunch for the electric lighting components. It's amazing having them in an interface like GH and the possibilities for parametric design that gives. I'm working on a definition about this, I'll post it soon for feedback.\n\n\n\nKind regards,\n\nTheodore.\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "April 21, 2016 at 8:42am", "created_by": "TheodorosGalanos", "replies": []}, {"body": "\nHi Theodore,\n\n\n\nMostapaha and I had a discussion about this issue a couple of days back. We are working on expanding the capabilities of Honeybee by moving towards matrix-based calculation methods.\n\nBoth Daysim(inside Honeybee) and DaysimPS rely on the daylight-coefficient method which offers almost no potential for incorporating complex shading systems. Any new DaysimPS-related development that we undertake at this point is likely to be redundant within this year.\n\nI had used DaysimPS extensively for my MS Thesis work so I have some idea of what it is all about. You are welcome to contact me at sarith@sarith.in with questions/clarifications if you plan to use it with it's java interface.\n\n\n\nRegards,\n\nSarith\n", "attachments": [], "created_by_name": "Sarith Subramaniam", "created_at": "April 23, 2016 at 8:26pm", "created_by": "sarith", "replies": []}, {"body": "\nThanks Sarith,\n\n\n\nI am looking forward to the new 3 and 5-phase(?) methods to be implemented to HB :)\n\n\n\nThanks for offering for feedbacks. I might call you up on that, if necessary ofc, after I start diving more into electrical lighting control. Just need to finish some CFD studies first.\n\n\n\nKind regards,\n\nTheodore.\n\n\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "April 25, 2016 at 11:17pm", "created_by": "TheodorosGalanos", "replies": []}]}]}