{"body": "\nHi, I was thinking about if is possible configure two EP constructions in a ExternalWall, for example, first, I have a beam + covering, and, above, I have an brick's wall. Detail: specifying the height of each EP construction. (See the picture)\n\nAnother issue, when I tryed to add a window material (simple glass) to cover a ExternalWall (in cases of buildings completely covered of glass), the energyplus simulation give me an error. How to solve this?\n\n\n\nI just want to represent a construction like this\n\n[<img class=\"align-full\" src=\"http://api.ning.com/files/COTpG8VCG7QPp*3ms-xHxb43SoFJ6o*94vWVTYOkY3I4xDeM7Neb*eah2DpRxcIDhFXFtlX3E5QVDlCOlP9VUAXUhPxbIaBc/IMG_2405.JPG?width=750\" width=\"750\"/>](http://api.ning.com/files/COTpG8VCG7QPp*3ms-xHxb43SoFJ6o*94vWVTYOkY3I4xDeM7Neb*eah2DpRxcIDhFXFtlX3E5QVDlCOlP9VUAXUhPxbIaBc/IMG_2405.JPG)\n", "attachments": [], "created_by_name": "Valdir José Ribeiro Júnior", "created_at": "April 24, 2016 at 11:54am", "created_by": "ValdirJoseRibeiroJunior", "topic": "How to insert more than one EP construction in a surface", "replies": [{"body": "\nValdir,\n\n1) Just make one construction by decomposing the two constructions that you have with the \"Decompose EP Construction\" component and connecting the materials up to a new \"EnergyPlus Construction\" component. \n\n2) EnergyPlus does not allow you to make a window that goes all of the way to the edges of the parent opaque surface.  Just offset your window a little and it will work.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "April 26, 2016 at 6:37pm", "created_by": "ChrisMackey", "replies": [{"body": "\nOk, thank you Chris!\n\n\n\nDo you have any file of a tall building that you configure every material on HB and applied to respective surface, (exterior and interior wall, floor, roof, ceiling...) to free up? Just to use as reference?\n\n\n\nI still have problems :/ \n\nTo set interior constructions (Set_Ep_Zone_Interior_Constructions) after set main constructions (Set_Ep_Zone_Constructions) - It returns surfaces adjacents errors\n\n\n\nThank you again!\n", "attachments": [], "created_by_name": "Valdir José Ribeiro Júnior", "created_at": "April 27, 2016 at 12:58pm", "created_by": "ValdirJoseRibeiroJunior", "replies": []}, {"body": "\nValdir,\n\nIs the error occurring on the Run simulation component?  If so, this might be related to an issue that I was experiencing this past week.  I was able to work around it by right clicking on the GH canvas and hitting \"Recompute\" but this is something that we should fix in the workflow.  In any case, can you upload a simple GH file that shows the issue?\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "April 29, 2016 at 12:51pm", "created_by": "ChrisMackey", "replies": []}]}]}