{"body": "\nHi dears,<br/> I have some problems in Therm component. First of all I wanted to calculate heat transfer rate for a profile section but therm components couldn't export the real shape to therm software and I faced some errors in grasshopper algorithm. I tried a simpler form to make sure the algorithm works, it did but not with my profile section. I really appreciate if you could guide me how to fix this. \n\n \n\nMoreover, I couldn't import window glazing text file in to grasshopper. Actually window save the file and I define the path but the component shows an error: \"1. Solution exception:invalid literal for float(): y 10.0 S\" \n\nThanks in advance. \n\n \n", "attachments": [], "created_by_name": "s.ali", "created_at": "April 25, 2016 at 3:31am", "created_by": "seyedali", "topic": "Therm", "replies": [{"body": "\nI attache Rhino and Grasshopper files.\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1516128", "name": "001.3dm"}], "created_by_name": "s.ali", "created_at": "April 25, 2016 at 3:34am", "created_by": "seyedali", "replies": [{"body": "\nS.Ali,\n\nIt seems that you forgot to attach your GH file but, looking at your Rhino file, you have a bunch of overlapping surfaces.\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/N82BGgaL3u1ERhLoK0lQC3g-b1aYQbjQgv3MD3FZc6ZYnCCqThPtcGhSXApg*3U2ANlsm3Non9UYkGQONa-fw*rcZ**va2Eb/OverlappingSurfaces.JPG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/N82BGgaL3u1ERhLoK0lQC3g-b1aYQbjQgv3MD3FZc6ZYnCCqThPtcGhSXApg*3U2ANlsm3Non9UYkGQONa-fw*rcZ**va2Eb/OverlappingSurfaces.JPG)\n\nThe component should give you an error when it finds these overlaps as THERM cannot run with overlapping surfaces like this.  Just like any heat flow model, you usually have to do some cleaning of your geometry before you send it through the engine.  One of the main purposes of this GH interface for THERM is that you get to do this cleaning in a familiar interface with good geometry capabilities (Rhino) instead of the THERM drawing interface.\n\n\n\nUpload your detailed report from WINDOW and I will see if it works on my system.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "April 26, 2016 at 7:58pm", "created_by": "ChrisMackey", "replies": []}]}], "id": "1516124"}