{"body": "\nHi Mostapha, I'm trying to use your Honeybee's therm component, but i am facing too many problems in turning stage of Rhino surfaces into therm geometries. As you can see the shapes would change. I tried to omit curves, or to add more vertexes or omit the holes, but none of them worked, except omitting the holes which solved one of the errors.  I am wondering if you have any idea or tips to solve these problems. Many thanks in advance.<br/> about the holes, it seems still it cannot simulate a hollow shape, could you check this as well? Thanks.\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1516797", "name": "Capture.JPG"}], "created_by_name": "Farnaz", "created_at": "April 26, 2016 at 3:25am", "created_by": "Farnaz609", "topic": "Therm", "replies": [{"body": "\nFarnaz,\n\nIf you upload your GH and Rhino files, I can have a look at what's going wrong.  My initial guess is that it has to do with your Rhino model tolerance.  Also, the \"THERM Export\" component from the last stable release did not allow you to export a THERM file if the model had holes in it.  I later realized that this was needlessly limiting people who intended to finish their models in THERM over the course of this discussion:\n\n[http://www.grasshopper3d.com/group/ladybug/forum/topics/therm-workf...](http://www.grasshopper3d.com/group/ladybug/forum/topics/therm-workflow-question-comment)\n\nIf you sync your components with the github, you will find that the most recent components allow you to export a model with holes.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "April 26, 2016 at 9:04pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nHi Chris,  It solved by updating the components.Thank you.\n", "attachments": [], "created_by_name": "Farnaz", "created_at": "April 30, 2016 at 12:41am", "created_by": "Farnaz609", "replies": []}]}