{"body": "\nGreetings, \n\n\n\nHas anyone had any success in modeling tree transparency with regards to outdoor thermal comfort? I am attempting to utilize the UTCI calculator in Ladybug with the use of the Solar Adjusted MRT component. There current does not seem to be a method for applying difference transparencies, or shading coefficients, to objects. Ideally, I would like to be able to group my trees into layers by species and then apply a shading coefficient per tree type while keeping these separate from the opaque context.\n\nThanks in advance for the feedback.  \n", "attachments": [], "created_by_name": "Kit Elsworth", "created_at": "April 27, 2016 at 9:06am", "created_by": "KitElsworth", "topic": "Outdoor Comfort and Tree Transparency", "replies": [{"body": "\nKit,\n\n\n\nThis is a very good point.  We don't currently have the ability to set transparency on the solar adjusted MRT component or in the radiation study component and it seems like this is something that would be really useful.  Unfortunately, it would take a bit of time to implement this on these components right now because the radiation studies in Ladybug join the context surfaces into one mesh before running ray tracing analyses on it (this is done for speed).  This makes it difficult to assign different transparencies for different surfaces.  In the new version of the radiation study that Mostapha is making right now, we should take this into account, if possible, and I've posted a github issue here:\n\n[https://github.com/ladybug-analysis-tools/honeybeex/issues/12](https://github.com/ladybug-analysis-tools/honeybeex/issues/12)\n\n\n\nIn the meantime, there is a way to factor in tree transparency in thermal comfort calculations using the Honeybee microclimate maps, which uses the same method to compute solar adjusted MRT as the solar adjusted MRT component.  The microclimate components do not allow much flexibility with occupant body position (the occupant is always assumed to be seated) but they will enable you to account for the effect of tree shade on ground surface temperature (very important for microclimate modelling), and they will allow you to see the effect of the tree over large stretches of both space and time.\n\n\n\nI put together an example file showing you how to use the microclimate maps for this purpose here:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/Yh-B8VrdxHjmaN8UZUQd4kUckxlwiZJTGfd2iAlECrujsyaTfuB-BHrSllK1alupaksxdGWDLO7xyd4V7W2tbTkQMiHyCp7k/Trees_in_Outdoor_Thermal_Comfort_Rhino.png?width=721\" width=\"721\"/>](http://api.ning.com:80/files/Yh-B8VrdxHjmaN8UZUQd4kUckxlwiZJTGfd2iAlECrujsyaTfuB-BHrSllK1alupaksxdGWDLO7xyd4V7W2tbTkQMiHyCp7k/Trees_in_Outdoor_Thermal_Comfort_Rhino.png)\n\n[http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;for...](http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;fork=hydra_2&amp;id=Trees_in_Outdoor_Thermal_Comfort&amp;slide=0&amp;scale=1&amp;offset=0,0)\n\n\n\nHope this helps!\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "April 29, 2016 at 12:45pm", "created_by": "ChrisMackey", "replies": [{"body": "\nThanks Chris,\n\nI'll give it a try and see if I can implement it into my workflow. \n", "attachments": [], "created_by_name": "Kit Elsworth", "created_at": "April 30, 2016 at 10:57am", "created_by": "KitElsworth", "replies": []}, {"body": "\nHi,\n\nUpdating this example to the last github versionb fails to run on the HB_exportToOpenStudio component, complaining about:\n\n1. Solution exception:OSLibPath\n\nHappening at line 97 of the component:\n\n    if sc.sticky[\"honeybee_folders\"][\"OSLibPath\"] != None:FYI.\n\n\n\nThanks,\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "September 28, 2016 at 7:31am", "created_by": "AbrahamYezioro", "replies": []}]}, {"body": "\nI'm unsure the topic has moved since the question was asked, but : can we use the sunpath shading component with the radiation analysis component ?\n\n\n\nI understand that the sunpath shading component is made for the solar energy part, but since you input tree geometry and it ouputs kwh/m² losses maybe there's a workaround. The best one I courd find is just to substract, which not all that great if you study anything but a small wall…\n\n\n\nIs it possible or am I making shortcuts in my ignorant mind ?\n\n\n", "attachments": [], "created_by_name": "Etienne Burdet", "created_at": "July 22, 2016 at 7:14am", "created_by": "EtienneBurdet", "replies": [{"body": "\nHi Etienne,<br/><br/>Yes, you can use the \"Sunpath shading\" component to account for the transparency of the trees.<br/>Check the attached example below. Enable the \"Sunpath shading\" component to run the definition (right click on it, and choose \"Enabled\").\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1570007", "name": "trees_transmission_indices.gh"}], "created_by_name": "djordje", "created_at": "July 22, 2016 at 6:02pm", "created_by": "djordje", "replies": []}, {"body": "\nAwesome, thanks a lot ! \n\nI didn't think of the generate test points/recompose mesh trick… clever ;-)\n", "attachments": [], "created_by_name": "Etienne Burdet", "created_at": "July 26, 2016 at 8:22am", "created_by": "EtienneBurdet", "replies": []}]}]}