{"body": "\nHi all,\n\nI'm studying the effect of sunspace (glazed balcony) towards daylight and energy performance in the adjacent building. The daylight simulation works fine, but I have some question regarding the windows between the sunspace and the adjacent space.\n\nHere is the model that I am studying:\n\n[<img class=\"align-center\" src=\"http://api.ning.com:80/files/IHl76p8QjsvH0eoz9pY995s10MWiIg0d8PBL54IxjrNSIi6jRLbw24*BogUvNVuot0B-4DjIxK9bWR-C22up7a1zMzrAAPdN/sunspaceapartment.png?width=750\" width=\"750\"/>](http://api.ning.com:80/files/IHl76p8QjsvH0eoz9pY995s10MWiIg0d8PBL54IxjrNSIi6jRLbw24*BogUvNVuot0B-4DjIxK9bWR-C22up7a1zMzrAAPdN/sunspaceapartment.png)\n\n[](http://api.ning.com:80/files/IHl76p8QjsvjBYwhUFYvDF7DSL5MmWo7PdMjOynOIsmndGLZ3QY*AJ8aAPqZIyvHj0XujaRlmuNrKxFaBBMv9q079zRY3-2B/sunspaceapartment.png)In total I have 6 windows on the adjacent building and 4 windows on the sunspace, in this case 2 windows are connected to the sunspace and the adjacent sunspace, so it became interior windows. So, 10 windows in total, 8 are considered exterior windows, 2 are interior windows.\n\n\n\nThe simulation works fine with the solve adjacency between the zones and using fullexteriorandinteriorwithreflections as the solar distibution. But, when I checked the readEPsurfaceresults, I found out that only 8 windows are considered in the total solar gain results and the 2 interior windows are not included. The 2 interior windows are only receiving the beam solar energy and not the diffuse energy. I still think that the interior windows should still receive the diffuse solar energy gathered in sunspace and pass it through to the adjacent space.\n\n\n\nIs this how EP works (excluding the interior windows in the total solar gain) or is there something wrong in my model? Can someone please explain? Thanks before!\n", "attachments": [], "created_by_name": "Stephanie Jenny Angeraini", "created_at": "May 2, 2016 at 3:48pm", "created_by": "StephanieJennyAngeraini", "topic": "Interior window not shown in total solar gain results", "replies": [{"body": "\nHi Stephanie, Check [this discussion](http://www.grasshopper3d.com/xn/detail/2985220:Comment:1461067).\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "May 3, 2016 at 6:55am", "created_by": "MostaphaSadeghipour", "replies": []}]}