{"body": "\nHi everyone,\n\nI would like to have precisions on the different methods to calculate mean radiant temperature.<br/>If you have some time, could you please confirm/correct/comment the following asumptions?\n\n\n\n1. From the Thermal Comfort Indices component, Comfort Index 11 (TCI-11):<br/>MRT = f(Ta, Tground, Rprim, e)\n\nwith:<br/>- Ta = DryBulbTemperature coming from ImportEPW component<br/>- Tground = f(Ta, N) where N comes from totalSkyCover input. Tground influences the long-wave radiation emitted by the ground in the MRT calculation.<br/>- Rprim defined as solar radiation absorbed by nude man = f(Kglob, hS1, ac)<br/>- ac is the clothingAlbedo in % (bodyCharacteristics input)<br/>- I can't find any definition in the code of Kglob and hS1. Could you tell me please what are those values referencered to? --&gt; probably the globalHorizontalRadiation but how?<br/>- e = vapour pressure calculated from Ta and Relative Humidity input\n\nDo you agree that in this case the MRT does not depend on these inputs: location, meanRadiantTemperature, dewPointTemperature and wind speed?<br/>It does not depend neither on the other bodyCharacteristics like bodyPosture, age, sex, met, activityDuration...?\n\nMRT calculated by the TCI-11 method is the mean radiant temperature of a vector pointing vertically with a sky view factor of 100%?<br/>For ParisOrly epw,\n\n2. From the SolarAdjustedTemperature component (that seems to be more used for the UTCI calculation examples on Hydra compared to TCI-11).\n\nIn contrast to the TCI-11, this component distinguishes diffuse and direct radiation and contextualizes the calculation thanks to _ContextShading input, right? <br/>It can also be applied to a mannequin thanks to the CumSkyMatrix and thus evaluate the dishomogeneity of radiation exposure.<br/>This component seems not to consider the influence of vapour pressure on the result --&gt; is it then more precise to put the MRT output (from the TCI) as an input of meanRadTemperature for SolarAdjustedTemperature?<br/>The default groundReflectivity is set to 0.25 --&gt; is GroundReflectivity taken into account in the Tground or MRT calculation in the TCI component? If yes, what is the hypothesised groundReflectivity?<br/>The default clothing albedo of 37% (TCI-11 bodyCharacteristics) corresponds to Clothing Absorptivity of 63%?\n\nIf the CumSkyMatrix input is not supplied, <br/>I get 9 results for the mannequin --&gt; where are those points/results coming from?\n\nIf the CumSkyMatrix input is supplied,<br/>I suppose the calculation of the 482 results correspond to a calculation method similar to the radiation analysis component that is averaged over the analysis period. Right?<br/>But I don't understand why the mannequin is composed of 481 faces and meshFaceResult gives 482 results.\n\nFinally, what is the link between the MESH results, the solarAdjustedMRT and the Effective Radiant field ? Is there a paper to have a detailed explanation of the method?\n\n<br/>3. Here are some results for the ParisOrly energyplus weather data. You can find here attached the grasshopper definition.<br/>There is no shading in this simulation and the result coming from the ThermalComfort indices for MRT is very different compared to the solar adjusted MRT.<br/>Why such a big difference and which of the result should be plugged into the UTCI calculation component?\n\nResults for ParisOrly.epw<br/>M,D,H:1,1,12\n\nTa : 6.5°C<br/>rh: 100%<br/>globalHorizontalRadiation: 54 Wh/m2<br/>totalSkyCover: 10<br/>MRT (TCI-11): 1.2°C\n\n_CumSkyMtxOrDirNormRad = directNormalRadiation : 0 Wh/m2<br/>diffuseHorizontalRad: 54 Wh/m2<br/>_meanRadTemp = Ta<br/>solarAdjustedMRT: 10.64°C<br/>MRTDelta: 4.14°C\n\n_CumSkyMtxOrDirNormRad = CumulativeSkyMtx<br/>diffuseHorizontalRad: 54 Wh/m2<br/>_meanRadTemp = Ta<br/>solarAdjustedMRT: 10.47°C<br/>MRTDelta: 3.97°C\n\n_CumSkyMtxOrDirNormRad = CumulativeSkyMtx<br/>diffuseHorizontalRad: 54 Wh/m2<br/>_meanRadTemp = MRT (TCI-11)<br/>solarAdjustedMRT: 5.17°C<br/>MRTDelta: 3.97°C\n\n<br/>Thanks a lot for your help<br/>Regards,\n\nAymeric\n\n\n\n\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1520582", "name": "Comparaison_MRT.gh"}], "created_by_name": "Aymeric", "created_at": "May 2, 2016 at 8:29am", "created_by": "AymericDELABACHELERIE", "topic": "Difference between MRT calculation methods", "replies": [{"body": "\nHi Aymeric,<br/><br/>First of all, thank you for the constructive discussion and questions.\n\n\n\n- I can't find any definition in the code of Kglob and hS1. Could you tell me please what are those values referencered to? --&gt; probably the globalHorizontalRadiation but how?\n\nYou are right. Kglob is Global horizontal radiation from the .epw file, in W/m2.<br/>hSl is the sun elevation angle in degrees.\n\n<br/>Do you agree that in this case the MRT does not depend on these inputs: location, meanRadiantTemperature, dewPointTemperature and wind speed?\n\nIt depends on location, as location determines the sun vector's elevation, zenith and azimuth angles.<br/>It does not depend on meanRadiantTemperature, dewPointTemperature and windSpeed.\n\n<br/>It does not depend neither on the other bodyCharacteristics like bodyPosture, age, sex, met, activityDuration...?\n\nI think you are correct. It is based on the following assumptions:<br/>sex_: male<br/>bodyPosture_: standing<br/>metabolicRate_: 2.32 mets (walking 4km/h)\n\n\n\nMRT calculated by the TCI-11 method is the mean radiant temperature of a vector pointing vertically with a sky view factor of 100%?\n\nThe sun vector depends on the sun elevation angle.<br/>If \"Sunpath shading\" component is not used to account for shading, then yes, the sky view factor of 1 (100%) is used.\n\n<br/>It can also be applied to a mannequin thanks to the CumSkyMatrix and thus evaluate the dishomogeneity of radiation exposure.\n\nYes, the MRT in Thermal Comfort Indices component, threats the subject as a single uniform body. Outdoor Solar Adjusted Temperature Calculator component's feature of being able to evaluate different parts of the body is indeed impressive.\n\n\n\nIn contrast to the TCI-11, this component distinguishes diffuse and direct radiation and contextualizes the calculation thanks to _ContextShading input, right?\n\nMRT in Thermal Comfort Indices component is based on Man-Environment Heat Exchange Model 2005 by Krzysztof Blazejczyk, one of the authors of UTCI index. MRT MENEX 2005 model has 4 version of solar radiation accounting. I am using the one with global solar radiation. The reason is because it cooperates well with other indices in the component, those that require solar radiation as an input.<br/>I implemented the MRT MENEX 2005 version which separatelly takes into account the direct, diffuse and reflected radiation in the attached file below.<br/>You can read more about the MRT and the whole MENEX 2005 model in general in the .pdf paper attached below.\n\n\n\nThe default groundReflectivity is set to 0.25 --&gt; is GroundReflectivity taken into account in the Tground or MRT calculation in the TCI component? If yes, what is the hypothesised groundReflectivity?\n\nThe MENEX 2005 model does not provide this information, but I assume that it's possibly 0.2 - 0.25 as you said, which is widely used as urban/suburban default annual average albedo value.\n\n\n\nThe default clothing albedo of 37% (TCI-11 bodyCharacteristics) corresponds to Clothing Absorptivity of 63%?\n\nYou are correct again.\n\n\n\nWhy such a big difference and which of the result should be plugged into the UTCI calculation component?\n\nThis is a complex question.<br/>One of the reasons might be the fact that MENEX MRT version is using a simplified formula to calculate the ground temperature, which may significantly affect the final results. It could be beneficial if groundTemperature_ is set as an input.<br/><br/>Another reason why this might be is that the [study](http://escholarship.org/uc/item/89m1h2dg#page-4) which corrects the Mrt for the influence of local heating of the sunlit parts of the floor, is meant to be used for indoor analysis.<br/>It should be said that a number of outdoor indices have been derived from indoor indices and studies, but with edition of its parameters.<br/>In this case we are simply applying the same indoor formulas to outdoor analysis. The study itself does not provide any suggestion that this kind of approach may be valid.\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1523897", "name": "Comparaison_MRT2.gh"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1523898", "name": "MENEX_2005_Blazejczyk.pdf"}], "created_by_name": "djordje", "created_at": "May 6, 2016 at 1:37am", "created_by": "djordje", "replies": [{"body": "\nThanks a lot Djordje for your answer! I will investigate on these papers and I will eventually come back to you.\n\n\n\nRegards,\n", "attachments": [], "created_by_name": "Aymeric", "created_at": "May 9, 2016 at 8:56am", "created_by": "AymericDELABACHELERIE", "replies": []}, {"body": "\nAymeric and Djordje,\n\n\n\nThank you both very much for pointing out this difference and for all of the knowledge and insight that you have shared here.  I think that I can explain where the difference between the two components is coming from and I have realized that I have been making a very misleading assumption in my example files that I intend to correct immediately.\n\n\n\nI can assure you that both the SolarCal and MENEX models are applicable to the outdoors (even though I know that the authors of SolarCal do not explicitly state this in their paper).\n\n\n\nThe key difference between the two MRT methods (and corresponding components) is that the \"solar adjusted temperature\" component assumes that you have already computed a starting MRT for long wave radiation in the absence of any short wave radiation.  True to its name, the component only adds a MRT delta to this long wave MRT to account for additional short wave radiation from the sun.  On the other hand, the MENEX model and the Thermal Comfort Indices component are doing a full long wave radiation balance in addition to the short wave radiation balance to give you a MRT for a person standing out in a field under an open sky.\n\n\n\nThe Thermal Comfort Indices component was giving much lower MRT values because it accounts for the fact that the sky (in the absence of sun) tends to be at a much lower perceived temperature than the air at Earth's surface or the ground (since the temperature of clouds and other objects higher in the atmosphere are cooler than those at the surface).  The great misleading assumption that I have been making in my example files is that, by plugging in the EPW dryBulbTemperature into the \"solar adjusted temperature\" component, I have been assuming that the temperature of the sky is the same as the temperature in the EPW air, which is almost never the case for the reason that I just stated.\n\n\n\nI have just added an option for a long wave radiation balance into the \"solar adjusted temperature\" component with [this github commit](https://github.com/mostaphaRoudsari/ladybug/commit/2261a222787f42016a763208f9da7b04f339bdca).  You can see below and in the attached file that the solar adjusted component can now give results that align more closely with the MRT of the thermal indices component:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/8p51V5ywRUKGdLMHaVe9XPVDFWO0o2AhwtWYJ4Yj0NHobSw6K2lwHP*vse9FnMIOSwZheB5qXOOXFB6-7wxD3gUpD0OD8W-v/MRTDifferences.JPG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/8p51V5ywRUKGdLMHaVe9XPVDFWO0o2AhwtWYJ4Yj0NHobSw6K2lwHP*vse9FnMIOSwZheB5qXOOXFB6-7wxD3gUpD0OD8W-v/MRTDifferences.JPG)\n\nThe typical difference between the two components is not much more than 1 degree C and the only major differences occur at high levels of solar radiation.  This is to be expected given that the SolarCal method is doing a much more detailed approximation of short wave radiation falling on the human than the MENEX model, which I believe is approximating the geometry of the human body with a cylinder and only differentiating between a few solar angles.\n\n\n\nOver the next few hours, I am going to correct my outdoor comfort example files and ensure that I am also accounting for sky temperature in the outdoor microclimate maps.  I will post back here once I do so.\n\n\n\nThanks again for bringing this up and for all of the knowledge you have shared.\n\n-Chris\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1530678", "name": "correctOutdoorSolarMRT2.gh"}], "created_by_name": "Chris Mackey", "created_at": "May 15, 2016 at 3:01pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nDjordje and Aymeric,\n\n\n\nI have finished going through all of the components and example files and I think it is safe to say now that the bug has been squashed.  I can also confirm that all of the difference between the Thermal Comfort Indices component and the Solar Adjusted Temperature component has to do with the amount of shortwave radiation falling on the occupant (the long wave radiation balances are matching well).  Djordje, I think that the use of the globalHorizontalRaditiaion formula instead of the one that separates direct and diffuse radiation might be causing the thermal comfort indices component to underestimate the amount of shortwave radiation on the occupant by a small amount.  This said, the occupant geometry can influence the amount of shortwave radiation so much that I think this underestimation is fine given all of these typical unknowns of occupant geometry.\n\n\n\nJust to summarize all of the example files that have been updated with the fixing of this bug, they are as follows:\n\n[Outdoor Microclimate Map](http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;fork=hydra_2&amp;id=Outdoor_Microclimate_Map&amp;slide=1&amp;scale=1&amp;offset=0,0)\n\n[Trees in Outdoor Comfort](http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;fork=hydra_2&amp;id=Trees_in_Outdoor_Thermal_Comfort&amp;slide=1&amp;scale=1&amp;offset=0,0)\n\n[Simple Spatial UTCI](http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;fork=hydra_2&amp;id=Urban_Microclimate_-_Simple_Spatial_UTCI&amp;slide=1&amp;scale=1&amp;offset=0,0)\n\n[Microclimate Map Simple](http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;fork=hydra_2&amp;id=Microclimate_Map_-_Simple&amp;slide=1&amp;scale=1&amp;offset=0,0)\n\n[Outdoor Comfort Shade Benefit](http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;fork=hydra_2&amp;id=Outdoor_Comfort_Shade_Benefit&amp;slide=1&amp;scale=1&amp;offset=0,0)\n\n[Accounting for Solar Radiation in Comfort](http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;fork=hydra_2&amp;id=Accounting_for_Solar_Radiation_in_Comfort&amp;slide=1&amp;scale=1&amp;offset=0,0)\n\n\n\nThanks again, Djordje and Aymeric, for bringing this issue to the forefront.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "May 15, 2016 at 9:56pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nThanks a lot Chris for these updates!\n", "attachments": [], "created_by_name": "Aymeric", "created_at": "May 20, 2016 at 9:12am", "created_by": "AymericDELABACHELERIE", "replies": []}, {"body": "\nHi Chris,\n\n<br/>Thank you for the useful comments!\n\nJust a couple of comments based on last two replies.\n\n<br/>MENEX model, which I believe is approximating the geometry of the human body with a cylinder and only differentiating between a few solar angles.\n\nI believe that this is correct although some equations could have been derived by assuming the body to be a plane. This is very usual approach when estimation of the radiation absorbed by a person is conducted.\n\n\n\nI think that the use of the globalHorizontalRaditiaion formula instead of the one that separates direct and diffuse radiation might be causing the thermal comfort indices component to underestimate the amount of shortwave radiation on the occupant by a small amount.  This said, the occupant geometry can influence the amount of shortwave radiation so much that I think this underestimation is fine given all of these typical unknowns of occupant geometry.\n\nThis could be the case, although noticed, the final difference between global and direct,horizontal,reflected radiation usage is small.\n\n\n\nThe Thermal Comfort Indices component was giving much lower MRT values because it accounts for the fact that the sky (in the absence of sun) tends to be at a much lower perceived temperature than the air at Earth's surface or the ground (since the temperature of clouds and other objects higher in the atmosphere are cooler than those at the surface). The great misleading assumption that I have been making in my example files is that, by plugging in the EPW dryBulbTemperature into the \"solar adjusted temperature\" component, I have been assuming that the temperature of the sky is the same as the temperature in the EPW air, which is almost never the case for the reason that I just stated.I have just added an option for a long wave radiation balance into the \"solar adjusted temperature\" component with [this github commit](https://github.com/mostaphaRoudsari/ladybug/commit/2261a222787f42016a763208f9da7b04f339bdca).\n\n<br/>It is important to notice that the current Solar Adjusted Temp Stefan Boltzmann formula is now treating the sky to be a gray body of a constant emissivity coefficient.<br/>Due to cloud cover, the emissivity coefficient of the sky is constantly changing. Therefor the constant emissivity coefficient of 0.95 may result in underestimation of the actual incoming long-wave radiation at all the time when the sky is not clear.<br/>My modest suggestion would be to use some empirical sky temperature formula from the ones attached below instead.<br/>There are of course other formulas, but it looks like Swinbank Cole and Berdahl Martin seem to be popular in USA.\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1534650", "name": "Ts__SwinbankCole_BerdahlMartin_Melchor.zip"}], "created_by_name": "djordje", "created_at": "May 21, 2016 at 6:46am", "created_by": "djordje", "replies": []}, {"body": "\nDjordje,\n\n\n\nThanks for all of the knowledge you have shared.  If what you say is correct about the small difference between the global horizontal and direct/diffuse calculations in the MENEX model, than the discrepancy likely has more to do with the difference between the approximation of human geometry in the MENEX model (plane or cylinder) and the human geometry approximation in the SolarCal model (some coefficients derived from radiation studies of mannequins).  I noticed some fairly large differences between using a suggested global horizontal method and a direct/diffuse method with the SolarCal model (differences on the order of 20%) but I imagine that this is because a mannequin human geometry is more sensitive to changes in solar orientation than a cylinder or plane.  All of this is very good to know.\n\n\n\nAm I correct in understanding that you recently corrected the grey-body assumption about sky temperature in the Thermal Comfort Indices component with this commit?\n\n[https://github.com/mostaphaRoudsari/ladybug/commit/a2a37b6dccc4e750...](https://github.com/mostaphaRoudsari/ladybug/commit/a2a37b6dccc4e750738237212c8e92d1945f4161#diff-163718ba0eb0fcfd1ffc7969808f01eeR842)\n\nI have tried to check whether the formulas match between the literature you posted and your new code and they seem to.  If you could confirm this, I will make the same change to the solar-adjusted temp component and the comfort maps.\n\n\n\nThanks again for all of the knowledge!\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "May 23, 2016 at 4:53pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nHi Chris,\n\n<br/>Thank you for the information again. Looks like we are making the Mean radiant temperature more precise with each reply and mutual support.<br/><br/>\n\n<br/>    Thanks for all of the knowledge you have shared.  If what you say is correct about the small difference between the global horizontal and direct/diffuse calculations in the MENEX model, than the discrepancy likely has more to do with the difference between the approximation of human geometry in the MENEX model (plane or cylinder) and the human geometry approximation in the SolarCal model (some coefficients derived from radiation studies of mannequins).  I noticed some fairly large differences between using a suggested global horizontal method and a direct/diffuse method with the SolarCal model (differences on the order of 20%) but I imagine that this is because a mannequin human geometry is more sensitive to changes in solar orientation than a cylinder or plane.  All of this is very good to know.\n\n\n\nYes, I guess this might be the case: the sensitivity of the SolarCal model to different parts of human body surfaces and surfaces areas.\n\n\n\n<br/><br/>    Am I correct in understanding that you recently corrected the grey-body assumption about sky temperature in the Thermal Comfort Indices component with this commit?<br/><br/>    [https://github.com/mostaphaRoudsari/ladybug/commit/a2a37b6dccc4e750](https://github.com/mostaphaRoudsari/ladybug/commit/a2a37b6dccc4e750)...\n\nThe previous incoming long-wave radiation was derived by Ångström for clear sky conditions. The added correction \"(1 + 0.22*((N/10)**2.75))\" is a fractional cloudiness factor by Maykut and Church (I attached the publication below which mentions it).\n\n<br/>So the emissivity coefficient of the (cloudy) sky is now:\n\nepsilon_sky = (0.82 - 0.25*(10**(-0.094*0.75*e))) * (1 + 0.22*((N/10)**2.75))\n\nI do not think that you could use the same value to calculate the sky temperature with Stefan-Boltzmann law, as the incoming long-wave radiation has been derived from the air temperature (2 meters above the ground), not the sky temperature. So by:\n\n​​​skyTemp = (La / [epsilon_sky * sigma])^0.25 - 273.15​\n\n<br/>One would get the **air temperature** from which **La** is derived, not **skyTemp**.<br/><br/>The possible reason why SolCal Mean radiant temperature is currently getting similar values to Thermal Comfort Indices Mean radiant temperature could be that fact your epsilon_sky is almost equal to 1 (0.95), so it depends solely on **La**.<br/><br/>I spoke with Dr. Blazejczyk, and got a publication on different sky temperature models. Apart from upper mentioned Swinbank, Berdahl-Martin, Melchor it has a lot more methods with mutual comparison of their resulting values. I attached it below.\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1537961", "name": "Parametrization schemes of incident radiation in the North Water polynya.pdf"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1537962", "name": "Survey of Sky Effective Temperature Models.pdf"}], "created_by_name": "djordje", "created_at": "May 28, 2016 at 8:14am", "created_by": "djordje", "replies": []}, {"body": "\nDjordje,\n\n\n\nThanks for all of the information and I apologize for the late reply.  I agree that we are improving the components with each iteration and hopefully this reply will count as another one!\n\n\n\nI have come to realize thanks to your publications that I have been abusing the word \"sky temperature\" to mean something other than how it is traditionally used.  I was using it to refer only to the long wave radiation loss and not to the full radiative balance to the sky.  As such, I will refrain from using this term here on out.\n\n\n\nMore importantly, a very knowledgeable friend of mine who maintains the [Urban Weather Generator](https://github.com/hansukyang/UWG_Matlab) just recently enlightened me to the fact that all EPW files that contain radiation (which is essentially all EPW files for our purposes) also contain actual recorded values for the long wave ambient (La) term that we have been trying to derive from relative humidity, cloud cover, and air temperature.  Specifically, the field is called \"Horizontal Infrared Radiation Intensity\" and you can see it shows up in the EPW documentation as field N12 [here](http://bigladdersoftware.com/epx/docs/8-3/auxiliary-programs/energyplus-weather-file-epw-data-dictionary.html).  My friend was using this infrared value from the EPW to simulate urban heat balances and he told me that this is more accurate than trying to derive the radiative loss from humidity and cloud cover as this measured value already accounts for all things the could prevent long wave loss to space (including cloud cover and wayer vapor among other smaller things).  As such, I have modified the \"Import EPW\" component to now bring in this infrared data with [this commit](https://github.com/mostaphaRoudsari/ladybug/commit/d3d92748c10c18aaa4972072ae82ba94d8a96e0f).\n\nI did a quick validation for myself comparing the values from the formula that you posted here, Djordje, and the measured values in the EPW file.  You can run this validation for yourself in the attached GH file and, from the image below you can see that both the formula from the Maykut and Church model and the EPW values are relatively close:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/kpFJ*-3Tpnv8aVpmph*hTQF6NCP0evhIt*OTAgCvM1n2gs4nkF9gw0ePtN5IjicJMEnCRyIdDODJn14QgS8F7YG5M2EDvOZv/ValidationofDownwellingRad.JPG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/kpFJ*-3Tpnv8aVpmph*hTQF6NCP0evhIt*OTAgCvM1n2gs4nkF9gw0ePtN5IjicJMEnCRyIdDODJn14QgS8F7YG5M2EDvOZv/ValidationofDownwellingRad.JPG)\n\n\n\nSince I trust my friend who runs the UWG and my general instinct that a physically measured value is probably more accurate than one derived from other measurements, I will replace the outdoor long wave functions in all of the comfort maps with these infrared values from the EPW.  I will also change the \"Solar Adjusted Temperature\" component to take this long wave radiation and an input instead of the relative humidity.  I will post back here once I do so, which should be relatively soon.\n\n\n\nI feel that another update of all of my example files is due but the error does not seem as large as my previous one and so I will just aim to have all example files updated by the next stable release in a month.  Djordje, I also want to hear your thoughts on this method before I make such a big move of changing the example files.\n\n\n\nAnd thanks again, Djordje, for all of the knowledge.  This is shaping up to be a major learning experience for me.\n\n\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "June 7, 2016 at 6:02pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nDjordje and all following,\n\n\n\nI have finished editing the Solar Adjusted Temperature component to use the EPW down-welling infrared radiation instead of trying to calculate this from sky cover and humidity.  I also realized an error in my previous validation, which I have corrected in the attached GH file and has resulted in better overall agreement between the Maykut/Church model that Djordje posted here and the EPW data.  It seems that the only major difference between the two is that the Maykut and Church model seems to be overestimating the long wave radiation loss to the sky in very cold conditions.  Otherwise the models show fairly good agreement:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/kpFJ*-3TpnuZgM1dC1CfH5sMytP*tnVkKomxpaT5Uf3i7yxos-qQibNC9O-K5oYSaeML6e8XFjjSVIaKzUQgqcUTSu58HHF9/ValidationofDownwellingRad.JPG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/kpFJ*-3TpnuZgM1dC1CfH5sMytP*tnVkKomxpaT5Uf3i7yxos-qQibNC9O-K5oYSaeML6e8XFjjSVIaKzUQgqcUTSu58HHF9/ValidationofDownwellingRad.JPG)\n\n\n\nFor the benefit of all following the post, I have also posted a comparison between the thermal indices component MRT and the Solar Adjusted MRT:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/kpFJ*-3Tpnsp8nTJMp4wXPIqFBDbeRuzdhFucIJc5HpE2kVwUXZRNupu3vvrfPPBw7SgN7LZHbfkMMF96XlTKO231C*0kTd7/ComparisonofMRTCalculating.JPG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/kpFJ*-3Tpnsp8nTJMp4wXPIqFBDbeRuzdhFucIJc5HpE2kVwUXZRNupu3vvrfPPBw7SgN7LZHbfkMMF96XlTKO231C*0kTd7/ComparisonofMRTCalculating.JPG)\n\n\n\nIn the end, the change introduced by using the recorded EPW downwelling radiation is relatively small and the biggest difference between the two components is still the shortwave radiation calculation, which is larger in the SolarCal model resulting in higher MRT values during the day.\n\n\n\nNow I only have to update the comfort maps and my components should be in a good place.  I'll post back here once it's done.\n\n-Chris\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1543816", "name": "AddDownwellingRad.gh"}], "created_by_name": "Chris Mackey", "created_at": "June 7, 2016 at 8:08pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nHi Chris,<br/><br/>Again, thank you again for the useful information, and the comparisons!!<br/><br/>Just for any future references and for the people who might be following this topic, a small clarification:<br/>The current **Thermal Comfort Indices** incoming long wave radiation uses Ångström clear sky conditions emissivity coefficient, with Maykut and Church cloudiness factor so that it accounts for cloudy sky conditions. So basically this corrections creates the cloudy (all) skies emissivity coefficient.\n\n\n\n<br/>I was not aware of the fact that .epw files have been shipped with the **horizontalInfraredRadiation**. Thank you for posting this information!<br/><br/>I took a look at EnergyPlus [horizontalInfraredRadiation page](http://bigladdersoftware.com/epx/docs/8-3/auxiliary-programs/energyplus-weather-file-epw-data-dictionary.html#field-horizontal-infrared-radiation-intensity).<br/>In there they state that: **\"If it is missing, it is calculated\"**.<br/><br/>I am pretty much certain that in Serbia, government weather stations do not record the long-wave radiation data.<br/>So I thought that this data is probably recorded in more developed countries, definitively in USA.<br/>I replicated the formula provided by mentioned bigladdersoftware.com [page](http://bigladdersoftware.com/epx/docs/8-3/auxiliary-programs/energyplus-weather-file-epw-data-dictionary.html#field-horizontal-infrared-radiation-intensity) in cases when \"Horizontal Infrared Radiation Intensity is missing\".<br/>This is the same Clark and Allen (1978) formula mentioned in upper attached **Survey of Sky Effective Temperature Models.pd**f, Table 3.<br/><br/>Once I checked the differences between the Clark and Allen formula and the **horizontalInfraredRadiation** from the epw file, they were not actually really close, but the same.<br/>I checked for a couple of locations in USA, but also outside of it, for different climates. The results were again the same:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/zxy*xRp5iQ7Ypmwpr*QkgAwEOC1sKXO1gCptCfDhnFYnttq1IsVUt-waGSOFg-kENJLkiCFMgmrEq0lwR7NoegAhaUvgMjtO/calculatedLa_vs_measuredLa.jpg?width=300\" width=\"300\"/>](http://api.ning.com:80/files/zxy*xRp5iQ7Ypmwpr*QkgAwEOC1sKXO1gCptCfDhnFYnttq1IsVUt-waGSOFg-kENJLkiCFMgmrEq0lwR7NoegAhaUvgMjtO/calculatedLa_vs_measuredLa.jpg)\n\nI attached the file below.<br/>I must admit that there are also hours when -1/+1 difference Wh/m2 exists, but my guess is that this is due to rounding of the values which is performed by EnergyPlus as shown in the example at [bigladdersoftware.com page](http://bigladdersoftware.com/epx/docs/8-3/auxiliary-programs/energyplus-weather-file-epw-data-dictionary.html#field-horizontal-infrared-radiation-intensity) (0.036, 0.815, 340.6).\n\n<br/>So it's either the Clark and Allen formula is super precise and can predict the long wave radiation to be exactly the same as the physically measured value, or .epw weather files are in fact not using physically measured values but calculated ones.<br/>My assumption would be that it is the second case.\n\n\n\nIt seems that the only major difference between the two is that the Maykut and Church model seems to be overestimating the long wave radiation loss to the sky in very cold conditions.  Otherwise the models show fairly good agreement\n\nBased on upper assumption, I do not think that we can distinguish whether either of these two incoming long-wave radiation methods is more precise or if the other one overestimates the **La** values.<br/><br/>Thank you too for the knowledge and the shared information!!\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1544279", "name": "horizontalInfraredRadiation_Clark_Allen_1978.gh"}], "created_by_name": "djordje", "created_at": "June 8, 2016 at 10:28am", "created_by": "djordje", "replies": []}, {"body": "\nOk.  The mircroclimate maps have been updated to use the EPW down-welling infrared radiation:\n\n[https://github.com/mostaphaRoudsari/Honeybee/commit/f30f808278fbd24...](https://github.com/mostaphaRoudsari/Honeybee/commit/f30f808278fbd24bbfb7a31b7b8cb08addf99aef)\n\nAt this point, the only thing that needs correcting is the example files, which I will do before the next release.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "June 8, 2016 at 10:39pm", "created_by": "ChrisMackey", "replies": []}]}], "id": "1520583"}