{"body": "\nA once simple SolarAdjustedMRT to UTCI calculation has exploded into a multifaceted and high resolution study. Due to the high density of points in my analysis mesh, the SolarAdjustedMRT calculation takes considerable time. I am finding that an annual analysis will take approximately 1min per grid point with useOldRes active for genCumulativeSkyMtx and Parellel activated on the SolarAdjustedMRT component. For a practical resolution in an outdoor setting, I am finding that analysis runs are taking me 2-3 hours.\n\nDue to the long run-time, I am attempting to develop a workflow that allows me to re-import the SolarAdjustedMRT output into the model for quick and repeated study after the initial analysis. Please find the GH script attached for a stripped down version of what I have been working with. You will find the EPW import connecting to the UTCI calculator for all metrics except MRT. This is where I used the output of SolarAdjustedMRT. I streamed the contents from the SolarAdjustedMRT to both CSV and TXT and attempted to re-import them with a Read File component.  \n\nWhen the imported file is brought into the UTCI component, I get the error \"calculation terminated by the user\". Looking at the script this seems to be a runtime error and reading past forums, this occurs when users hit the Escape key during the calculation. After ensuring that I was not subconsciously hitting escape every time I tried this method, I cannot determine what the error might be. \n\nThe GH script is attached if you care to recreate this issue. I can send the TXT and CSV files that I am using per request. They are too large to attach here. \n\nPlease let me know if you have encountered this issue and developed any work around techniques. The UTCI calculation is extremely informative but the long run time associated with grid resolutions usable by designers make its counterproductive at times. \n\n\n\n[<img class=\"align-center\" src=\"http://api.ning.com:80/files/teNLbyfAUPLyy9c3gWO83E8q85CmCGnljYBauXh9q-uZuID5TC8YAcI0k-U787N9RqOt18f*xxYSzxRJEWNpMXO07FEn4mBY/UTCICalcError.JPG?width=750\" width=\"750\"/>](http://api.ning.com:80/files/teNLbyfAUPLyy9c3gWO83E8q85CmCGnljYBauXh9q-uZuID5TC8YAcI0k-U787N9RqOt18f*xxYSzxRJEWNpMXO07FEn4mBY/UTCICalcError.JPG)\n\n\n\n\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1521682", "name": "UTCI-outdoor comfort_160503-clean.gh"}], "created_by_name": "Kit Elsworth", "created_at": "May 3, 2016 at 12:56pm", "created_by": "KitElsworth", "topic": "Existing MRT + UTCI Calculation Error", "replies": [{"body": "\nKit,\n\nI apologize for such a late reply.  I cannot run your file without either the Rhino geometry or the text file.  However, I can say that the long run time of a detailed mannequin radiation study is the reason why we have built three alternative workflows into LB+HB for cases when you are not so concerned about how exactly the radiation is falling on the person.  They are as follows:\n\n1) If you plug in the EPW directNormalRadiation and diffuseHorizontalRadiation into the \"Solar Adjusted Temperature\" component instead of the cumulativeSkyMtx, the component will use a much faster formula for calculating solar-adjusted MRT that approximates the human geometry with a few coefficients and only ray-traces sun vectors from a few points instead of an entire human geometry.  You can see this in this example file:\n\n[http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;for...](http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;fork=hydra_2&amp;id=Urban_Microclimate_-_Simple_Spatial_UTCI&amp;slide=0&amp;scale=1&amp;offset=0,0)\n\n2) Djordje Sapcic added an even faster means of estimating outdoor MRT into the \"Ladybug_Thermal Comfort Indices\" component, which is only applicable to the case where you have a person standing in an open filed without any context shading.  It's very useful if you just want to see what it is like for an person in sun vs shade.\n\n3) If you want to produce a high-accuracy map of temperature that does a detailed accounting of surface temperature for context shading and the ground, you can use the microclimate maps as this example does:\n\n[http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;for...](http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;fork=hydra_2&amp;id=Trees_in_Outdoor_Thermal_Comfort&amp;slide=0&amp;scale=1&amp;offset=0,0)\n\nThese maps assume a seated human that is facing in one direction but the calculation is fast and is what I would recommend if you need a decently accurate spatial map of microclimates.\n\nHope this helps,\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "May 16, 2016 at 12:51pm", "created_by": "ChrisMackey", "replies": []}]}