{"body": "\nHi all,\n\nI've been running two same environmental models of a simple box with one south facing window using Ladybug/Honeybee and another with IES Virtual Environment in order to fully understand the different features of the grasshopper plugin.\n\nComparing the results I have noticed a bug (or I'm completely missing out on something I've plugged in wrong).\n\n\n\nWhen comparing solar gains from one to the other I first noticed the results Honeybee were shifted by an hour (winter) or two (summer) compared to the IES ones, and that the results were shifted by 1 hour for the entire year compared to running the IDF file and EPW seperately in EnergyPlus. I have used the same weather file (Leuchars.epw) for each simulation.\n\n\n\nMy findings are resumed in the 4 graphs attached to this post.\n\n\n\nMy question is: why is this happening? I understand EnergyPlus/Honeybee are not accounting for daylight savings which is why the IES model is shifted an hour further during the summer, but why is the EPW processed through ladybug shifted one hour back?\n\n\n\nAlso, I managed to get similar solar gains by assuming a frame factor of 15% on my IES windows, what exactly is assumed in honeybee/energyplus regarding frame factors? And can it be changed using honeybee components?\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1522189", "name": "Winter condition.PNG"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1522190", "name": "Summer condition.PNG"}], "created_by_name": "Antoine Dao", "created_at": "May 4, 2016 at 8:16am", "created_by": "AntoineDao", "topic": "EPW Weather misread + Solar gain issues", "replies": [{"body": "\nHi Antoine,\n\n\n\nThank you for checking the results and opening the discussion.\n\n\n\nI can't recreate the difference between EnergyPlus run and EnergyPlus through Honeybee. Can you share idf file(s) or result file(s). Did you check the csv files? Are the values shifted inside the files? I'm trying to understand if it is an error in the results parser or the file itself.\n\n\n\nBack to the second question we don't add frames to Windows and leave the fields empty in EnrgyPlus. We currently don't support Frame and Dividers in Honeybee but it can be provided if there is enough need to use it. Back to the difference are you using the same Glass properties in IES and EnergyPlus? With and without the frame the rate should stay the same however the total value will be different.\n\n\n\nMostapha\n\n\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "May 4, 2016 at 8:42pm", "created_by": "MostaphaSadeghipour", "replies": [{"body": "\nAlright so I ran through the whole thing again as an extra check and it turns out it was a false alert (terribly sorry about that) where I was pushing the list from honeybee one index down through a rogue script I wrote. Again, apologies for the false alert.\n\nHowever the comparison for solar gains between IES and HoneyBee still stands. I get an average error of roughly 25% in the Summer (when I account for daylight savings) where HoneyBee is underestimating compared to IES. In the Winter both results are very similar but gradually deteriorate as they go into the summer. I have constructed a fairly simple window and expected only the G-value (SHGC) to affect solar gains. In both programs there is only 1 south facing window (9.6m2) with a G-value of 0.4. Is making a window out of 1 layer of glass the issue? \n\n\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/uoL1jM-yecAXryRQseEjvOST9kghy1ZeJh7ql4XzN9VvfV95hS4nKsPzk1bIwFnCQIwpLkGrJL5bT14h1AN-6CKwHqCxhFmD/HBWindow.PNG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/uoL1jM-yecAXryRQseEjvOST9kghy1ZeJh7ql4XzN9VvfV95hS4nKsPzk1bIwFnCQIwpLkGrJL5bT14h1AN-6CKwHqCxhFmD/HBWindow.PNG)\n\n\n\nOther quick question, is there any way to make EnergyPlus model with daylight savings through HoneyBee? \n\n\n\nI'm also having trouble with natural ventilation (maybe I should post this in a different conversation?), I have set up the windows to open for the same interior and exterior temperature conditions and with the exact same infiltration+auxiliary vent rates but results are very different. Auxiliary vent and infiltration are the same throughout the entire year but whenever the windows open it seems HoneyBee calculates higher flow rates. Windows in both models also have the same operable area (10%).\n\n\n\nI thought maybe the windows weren't opening right for some reason so I created a schedule from the IES window opening to limit the degree of opening of the windows but the results were still very off. Any ideas what might be causing this?\n\n\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/BjPsdF1MrUnc1LvCsCPkiWUZ8opge2HKrUj*KfyqKM5OzwbEgd2oWa3I**MeGCpen2mcnxpm1rRh6LylK6Ela4HoxJu*rN8U/Airflowvolume.PNG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/BjPsdF1MrUnc1LvCsCPkiWUZ8opge2HKrUj*KfyqKM5OzwbEgd2oWa3I**MeGCpen2mcnxpm1rRh6LylK6Ela4HoxJu*rN8U/Airflowvolume.PNG)\n\n\n\nI realise this is quite a mouthfull of stuff to go through, sorry about that, but I've attached the file I'm modelling with as well as the excel sheet I'm writing my results to. I'm also using Bumblebee to read/write data from/to excel.\n\n\n\nThank you!\n\n\n\nAntoine\n", "attachments": [], "created_by_name": "Antoine Dao", "created_at": "May 6, 2016 at 4:22am", "created_by": "AntoineDao", "replies": []}, {"body": "\nSorry, turns out the excel sheet is way too big.\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1524194", "name": "HB IES Box comparison.gh"}], "created_by_name": "Antoine Dao", "created_at": "May 6, 2016 at 4:25am", "created_by": "AntoineDao", "replies": []}]}]}