{"body": "\nHello all,\n\nI am very new to Grasshopper/LB/HB but have some experience using OpenStudio and EnergyPlus. I am also in the process of working on my masters and would like to gear my research towards this software. Anyone have any good starting points on a research topic? <br/><br/>This may be a bit vague, but my program (for better or worse) is pretty open to letting students develop their own research topics, so far as it meets the professors expectations and is related to building energy efficiency. \n", "attachments": [], "created_by_name": "JonnyK", "created_at": "May 5, 2016 at 4:27pm", "created_by": "JonnyK", "topic": "Research Thesis Ideas?", "replies": [{"body": "\nHi Jonny,\n\nIn order for other people to be able to help you, you need to provide more information about your abilities and interests. Do you want to get involved in the development or do you want to use ladybug and honeybee as part of a workflow. I can also imagine so much that can be done out of Grasshopper environment for data visualization of energy and daylight simulation. What are you interested to work on for your thesis?\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "May 5, 2016 at 5:26pm", "created_by": "MostaphaSadeghipour", "replies": [{"body": "\nHi Mostapha,<br/>Thank you for answer. I currently do not have any coding experience, but I am willing to learn! I'm a bit interested in coupling a Life Cycle Assessment to Ladybug/Honey Bee to try to minimize the overall carbon footprint of a building. I read a previous post that their is some work to be done in linking Tortuga to Ladybug that may be able to do this. Not sure where this is in development or how I could help.<br/><br/>Thanks!<br/>Jonny\n", "attachments": [], "created_by_name": "JonnyK", "created_at": "May 5, 2016 at 5:56pm", "created_by": "JonnyK", "replies": []}, {"body": "\nI'm a bit interested in coupling a Life Cycle Assessment to Ladybug/Honey Bee to try to minimize the overall carbon footprint of a building.\n\n\n\nThat's an on-going topic. We couldn't find an open resource that has both thermal values and the values for LCA and we didn't want to do it manually one by one. I haven't checked recently though.\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "May 5, 2016 at 6:20pm", "created_by": "MostaphaSadeghipour", "replies": []}]}]}