{"body": "\nHi Chris,<br/>May I ask you a question about Therm? I have trouble in understanding the way Therm calculates the U value. I think that it should be like this: lambda(W/mk which Therm knows as Conductivity of the material) divided to depth(m). Then for adjacent materials, They should  be summed up according to their areas or here since it is 2D according to their lengths in proportion to the whole length. This means that for a singular material Lambda and U-value must be equal if the depth is 1000 mm, But in Therm they are significantly different. Am I missing something? <br/>\n", "attachments": [], "created_by_name": "Farnaz", "created_at": "May 9, 2016 at 11:00pm", "created_by": "Farnaz609", "topic": "Therm", "replies": [{"body": "\nFarnaz, \n\nWhile I have never seen the code behind therm I am almost sure they are also considering surface resistance to account for radiative and/or convective heat transfer.\n\n\n\nWhat you mentioned previously accounts for the thermal resistance in solid conduction through the width of the material. U = R^(-1).... R= L / lambda-solid ( per unit area - m^2 K / W)\n\nThe boundary conditions are likely being considered for convection and radiative transfer. Esentially the U-Value as used in the building industry is a coupling for:\n\nSolid Conduction = ( lambda-solid / Length )* (T1 -T2)\n\nRadiative Transfer = (1- reflectance) (irradiance) ... this is a simplification, it can get super complex\n\nConvective Transfer = hahaha I cannot remember this... but it's essentially (Tsurface - T1) / Convective Resistance. \n\n\n\nI just want to reiterate that I am not certain of the calculations carried out in therm. However, I am confident that the U-value is a simplification that couples all thermal exchange mechanisms into the reciprocal of a single resistance. U = 1 / R-coupled. \n\n\n\nHope this helps,\n\nMauricio\n", "attachments": [], "created_by_name": "Mauricio Aguilar Cardenas", "created_at": "May 10, 2016 at 4:26am", "created_by": "MauricioAguilarCardenas135", "replies": [{"body": "\nThank you very much Mauricio for your helpful explanation.\n\nHowever I think for a solid material radiative and convective transfer would affect insignificantly,dont they? I guess the main reason of the huge difference between results was due to Hc parameter(w/m.k)which I have no idea of defining it. It is thermal conductivity of thin air film near boundaries. Is it related to the material specifications like reflectivity, emissivity and absorptance? or it is just defined by weather conditions like wind velocity, humidity,...?\n\nthanks.\n", "attachments": [], "created_by_name": "Farnaz", "created_at": "May 15, 2016 at 12:38am", "created_by": "Farnaz609", "replies": []}]}, {"body": "\nHi Farnaz, \n\n\n\nCan you post a screenshot explaining your question - It's some time since I've used Therm but the principles of heat flow and thermal bridging are the same no matter which programme you use, so I'm happy to take a look. \n\n\n\nNick\n\n\n\n\n", "attachments": [], "created_by_name": "Nick Devlin", "created_at": "May 10, 2016 at 8:37am", "created_by": "NickDevlin", "replies": [{"body": "\nFarnaz, Mauricio, and Nick,\n\n\n\nThanks for the great discussion here.  Mauricio, your beautiful and comprehensive answer is correct.  The current implementation of THERM in GH accounts for the surface resistance of radiative and convective heat transfer through the _filmCoefficient input on the \"Create Therm Boundaries\" component.  This filmCoefficient in W/m2K represents the \"U-Value\" of the air film between the edge of the THERM materials and the surrounding environment that is at the specified _temperature.  The extra resistance from this air film is why the full construction U-Value that you are getting out of THERM is a lower than just the (conductivity of material) / (depth of the material).  Accounting for air films is particularly important when you get constructions that have a high overall conductivity (like a single pane window), since almost all of the resistance of such a construction is due to the air films.\n\n\n\nTo elaborate further, you might have noticed that, in the example files on [hydra](https://hydrashare.github.io/hydra/index.html?keywords=LBNL), I set this filmCoefficient to be either \"indoor\" or \"outdoor\", which basically uses some code that I wrote to autocalculate the film coefficient for you.  I take into account both the emissivity of the material at the boundary (which gives you more air film resistance for lower emissivities) as well as the orientation of the boundary in the 3D space of the Rhino model.  The code I wrote will take these parameters and match them to those published in ASHRAE Fundementals, which you can see in table 1 of the first page of this PDF:\n\n[http://edge.rit.edu/content/C09008/public/2009%20ASHRAE%20Handbook](http://edge.rit.edu/content/C09008/public/2009%20ASHRAE%20Handbook)\n\nI interpolate between these values in the event that your emissivity is not 0.05, 0.2, 0.9 or the orientation of your boundary is not any one of the 5 that they give.\n\n\n\nI know that THERM also has the capability to actually run the radiative and convective formulas that you posted, Mauricio, as opposed to just using a single film coefficient to account for all of this resistance.  The running of these formulas is particularly useful is the radiant temperature at the boundary is different than the air temperature.  However, as long as you are ok with this assumption that the air and radiant temperatures are the same (which is the case for all of the situations that I have encountered), the film coefficient is perfectly sufficient.  If anyone ever has need for this capability of running boundary conditions that have different radiant and air temperatures, please post here and I can think of a way to implement it.  I rather like the simplicity of the current interface, though, and I think that I will keep it this way until we understand the purposes for why someone would need separate radiant and air temperatures.\n\n\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "May 14, 2016 at 11:26pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nChris, thanks!\n", "attachments": [], "created_by_name": "Farnaz", "created_at": "May 15, 2016 at 1:50am", "created_by": "Farnaz609", "replies": []}, {"body": "\nHi Chris,\n\n\n\nI posted my [question](http://www.grasshopper3d.com/group/ladybug/forum/topics/therm-control-over-bc-radiation-model?xg_source=activity) before coming across this thread.\n\n\n\nIt is not quite the same discussion but there is some crossover, I would appreciate your input.\n\n\n\nThanks\n\nJonny\n", "attachments": [], "created_by_name": "Jonathan Story", "created_at": "May 26, 2017 at 8:32am", "created_by": "JonathanStory", "replies": []}, {"body": "\nHi Nick,I am working with Therm too. <br/> As Mauricio corrected me, I had missed convection and radiation transfer in my calculation, regarding conduction as the main transfer way for a solid. Still for a simple box of Aluminum, I expect an almost similar U-value and lambda, (not equal due to radiation and convection transfer) if the box is 1 m length. But the amounts are very very different. While Al- lambda is 237 W/m.k , Therm calculates the U of the assumed box 4.59 W/m^2.k . I guess this is because of my mistake in assumption of Hc factor, which I don't know how it should be defined.\n\nthe assumed Boundary condition for therm calculation was: <br/> (interior boundary Hc = 4.65 W/m.k and temp=21 centigrade<br/>\nexterior boundary Hc = 10 W/m.k and temp= -18 centigrade)\n\nIf I put 237 for Hc of both exterior and interior boundaries, the U-value would be 79.47 W/m^2.k.\n", "attachments": [], "created_by_name": "Farnaz", "created_at": "May 15, 2016 at 1:26am", "created_by": "Farnaz609", "replies": []}]}]}