{"body": "\nHi All!\n\n\n\nI have a complete energy model ready and running. However, there is a need to assign separate EP glazing construction on one facade and keep as it is on others. Now, since I have the complete model ready, I do not want to start everything from scratch (surface-by-surface). Is there a way to assign separate EP construction to separate surfaces after energy model creation?\n\n\n\nThanks in advance,\n\nRam\n", "attachments": [], "created_by_name": "Ram Joshi", "created_at": "May 19, 2016 at 3:36am", "created_by": "RamJoshi", "topic": "Modifying EP construction after zone creation", "replies": [{"body": "\nIt's hard to say without seeing your model but generally speaking. There are two solutions that you can try:\n\n1. You can use decompose zone to find the particular surfaces and change the construction.\n\n2. If your zones only have windows on one face you can use \"separate zones by orientation\" component to separate zones and change glass construction for the specific orientation.\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "May 19, 2016 at 1:26pm", "created_by": "MostaphaSadeghipour", "replies": [{"body": "\nHi Mostapha!\n\n\n\nThanks for your reply. I tried exploring the options you suggested. However, ended up messing up with the model. So, I thought the best idea would be to manually edit the IDF file in idfeditor. However, when I am importing the same idf file (modelled in HB, edited in idf editor), it doesn't seem to work. I am attaching the idf, GH file and .epw file for your reference. Could you please look in to it and let me know if there is a problem with the file?\n\n\n\nThanks in advance,\n\nRam\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1533582", "name": "AllSGUNorthDGU.idf"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1533583", "name": "IDFreader.gh"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1533584", "name": "ZWE_Harare.677750_IWEC.epw"}], "created_by_name": "Ram Joshi", "created_at": "May 19, 2016 at 10:53pm", "created_by": "RamJoshi", "replies": []}, {"body": "\nThere are some errors, but the severe one says:\n\n10. The simulation has not run correctly because of this severe error:    ** Severe  ** ScheduleTypeLimits Name, duplicate name=HVACTEMPLATE ANY NUMBER\n\n\n\nIt means the idf has twice the same item (in this case a schedule type limit), which is not allowed.\n\nBesides that you have 2 open zones after importing the idf.\n\nStill think that following Mostapha's suggestion will yield to a better solution.\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "May 20, 2016 at 5:57am", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nHi Mostapha,\n\n\n\nI tried building up the model again in surface-by-surface manner. I found it not very time consuming and gives much better control. I have attached my GH defn. Could you please review it and let me know if there is a better way to do the task. I goal is to have control on surface properties at every stage of analysis.\n\n\n\nRegards,\n\nRam\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1536894", "name": "Church rd_MASF_V1.gh"}], "created_by_name": "Ram Joshi", "created_at": "May 26, 2016 at 5:04am", "created_by": "RamJoshi", "replies": []}]}], "id": "1533263"}