{"body": "\nHey there!\n\nHow can I generate windows that are set back inside the wall?\n\nWould it be possible to add a function to the \"addHBGlz\" Component for specifying the depth of the outside reveal? (the inside reveal and inside sill depth have to be entered manually anyway via the frame and divider object but that's not the case for the outside reveal).\n\nThe ExtrudeWindows component is only for the geometric representation of those as I understand it... or am I missing something here?\n\nThanks!\n\n\n", "attachments": [], "created_by_name": "Albert Pressler", "created_at": "May 25, 2016 at 12:46pm", "created_by": "AlbertPressler", "topic": "Window setback / outside reveal", "replies": [{"body": "\nHi Albert!\n\n\n\nI think you should be able to do this by creating horizontal and vertical blinds using Honeybee_EnergyPlus Window Shade Generator under tab 9. I hope this helps.\n\n\n\nBest luck,\n\nR.\n", "attachments": [], "created_by_name": "Ram Joshi", "created_at": "May 26, 2016 at 3:12am", "created_by": "RamJoshi", "replies": []}, {"body": "\nAlbert,The HB_extrudeWindows is your option here. True it will create a geometry and not the definitions you want in E+. You need to add them as context.\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "May 26, 2016 at 4:55am", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nGuys,\n\nwouldn't it be possible to make a component for the \"FraneAndDivider\" object?\n\nIn Openstudio and Designbuilder they've even added a field for \"outside reveal\" so that the window setback will be calculated as opposed to the original e+ object that gets the outside reveal from the geometry itself...\n", "attachments": [], "created_by_name": "Albert Pressler", "created_at": "August 10, 2016 at 12:49pm", "created_by": "AlbertPressler", "replies": [{"body": "\nAlbert, This is possible. Can you provide me a simple example (in an idf file)? I want to know the level of details that you're trying to achieve.\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "August 11, 2016 at 8:09am", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nHi Mostapha,\n\nmy main wish is being able to specify the outside reveal, which is not an input in the eplus object itself. In other applications though, like OpenStudio, you can specify the outside reveal which then offsets the actual window geometry from the outside wall by that distance. That way you won't have to create shading surfaces...\n\nFor the visualization in Honeybee the ExtrudeWindows component could then also get these values from the windows and show the reveal (like in the screenshot from my model, where I first moved the windows manually and the set the distance in the ExtrudeWindows component for correct visualisation).\n\nI've attached an idf file where I've put the main information in the FrameAndDivider object, for the other fields you could provide some default values.\n\nThe FrameAndDivider component could then be connected to the glazing related HB-components as an optional input, just like a EPConstruction or RADMaterial.\n\nHope this makes sense...\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1580275", "name": "FrameAndDivider.idf"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1580276", "name": "screenshot.jpg"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1580277", "name": "eplusReveal.png"}], "created_by_name": "Albert Pressler", "created_at": "August 11, 2016 at 9:23am", "created_by": "AlbertPressler", "replies": []}]}]}