{"body": "\nmay i ask if there is any update on the development of the butterfly component to connect GH to **OpenFOAM** for CFD simulation?\n\n\n\nBTW, any recommendation on OpenFORM learning materials?\n\n<br/>Much obliged!\n\n\n\n\n", "attachments": [], "created_by_name": "Grasshope", "created_at": "May 26, 2016 at 6:10am", "created_by": "Grasshope", "topic": "any update on the Butterfly?", "replies": [{"body": "\nHello Grasshope,\n\n\n\nAs far as I know, the development of the actual Butterfly component and its code is currently underway and I know Mostapha will have much more actual news to share on this as he is the one developing it. I believe it is becoming a priority along with cleaning up LB/HB API.\n\n\n\nMe and Chris have also worked for some time in a workflow that links CFD results (coming from OpenFoam) to LB/HB and specifically his micro-climate components. Initial results have been very encouraging and we are just currently looking for a bit of free time to run a few more studies and comparisons in order to assess the accuracy of the method.\n\n\n\nSince Chris is the one developing the code and tools within the work flow I will leave it up to him to decide when he thinks they are stable enough to share. We are also looking forward to that since we understand how important an active community like LB/HB's will be in developing this further.\n\n\n\nAs for learning materials I would recommend you download and install OpenFoam in either platform you prefer, and then going over the amazing User Guide provided. It will work you through a couple of the (many) tutorials that are available within the installation of the software.\n\nAfter that, almost every question that you will have has been asked and answered here:\n\n\n\n[www.cfd-online.com](http://www.cfd-online.com)\n\n\n\nIt is quite a steep curve but after a bit of head smashing on the keyboard it gets much much easier.\n\n\n\nFeel free to ask anything here, either in PM or in this thread maybe and I'll gladly help if I can.\n\n\n\nGood luck!\n\n\n\nKind regards,\n\nTheodore.\n\n\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "May 26, 2016 at 9:08pm", "created_by": "TheodorosGalanos", "replies": [{"body": "\nThank you very much, Theodore, for your detailed update!\n\n\n\nI can get OpenFORM installed on Mac OS X and run it correctly. However, I'm still struggling installing OpenFOAM in Windows 7 system, especially the last common error as shown on the OpenFOAM windows installation intro page: [http://www.openfoam.com/download/install-windows.php](http://www.openfoam.com/download/install-windows.php)\n\n\n\nSomehow, reinstallation doesn't solve the problem as suggested on the webpage ...\n\n\n\nI'll check the CFD forum as you suggested for advice.\n\n\n\nThank you, again!\n", "attachments": [], "created_by_name": "Grasshope", "created_at": "May 27, 2016 at 1:12am", "created_by": "Grasshope", "replies": []}, {"body": "\nHi Grasshope,\n\n\n\nIt's no problem, haven't done anything yet :)\n\n\n\nUnfortunately I can't be much help with that error. I've never installed in Windows (also not using the docker version of OpenFOAM) and it seems that error is not an OpenFOAM related error but a docker/VM error. \n\n<br/>I'm sure something will be found in cfd-online. If not let me know if you have Linux and we can install OpenFOAM with a couple commands :)\n\n\n\nKind regards,\n\nTheodore.\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "May 27, 2016 at 11:01pm", "created_by": "TheodorosGalanos", "replies": []}, {"body": "\nGrasshope,\n\n\n\nWith continuous support from Theodore finally we have a working prototype of butterfly for outdoor studies. It works but it's not robust. Let me know if you're willing to test and give us feedback. Cheers.\n\n\n\n[<img class=\"align-full\" src=\"http://api.ning.com/files/vhACU8JlJgTOendpAdVYTGTmkfD9yAcYNCEnzdLQMt*leFUAxzqEVy21P1aRV9RwRKoaOZCVi6Eff8yQlZaRHa5N4bkSkpuA/butterfly.jpg\"/>](http://api.ning.com/files/vhACU8JlJgTOendpAdVYTGTmkfD9yAcYNCEnzdLQMt*leFUAxzqEVy21P1aRV9RwRKoaOZCVi6Eff8yQlZaRHa5N4bkSkpuA/butterfly.jpg)\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "July 5, 2016 at 4:32pm", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\n[<br/>](http://api.ning.com:80/files/tELt8V-QL1BOJS5is*qYDPP29g-vF0mGysUmEePWhPRawq6*zQyAxh*zCi7vrJ4hyqzmTkmw971kyPNRjLfymf0yzIv5MrVc/case.JPG)Hi, I know its late to reply now but I have tested this case and got pressure and velocity results. It seems there is no error with velocity results however pressure values are too low (4 pa max). I have seen that you have added some correction to result values, e.g. for pressure values,its -273,15 pascal(can be seen in the image). But with that correction, you just see negative pressures in all of the domain. Because the values you get at first are too low. So whats the reason that you need to correct the values coming from OF?  I assumed that the values from OF should be multiplied with 10(power of 5) then atmospheric pressure (101325 for 15 C degree) should be subtracted from these values. I tried that but the latest values were not reasonable.\n\n\n\nSecondly, I couldnt find output files which can be opened in Paraview, did you get the file from butterfly run?\n\n\n\n[<img class=\"align-center\" src=\"http://api.ning.com/files/tELt8V-QL1BOJS5is*qYDPP29g-vF0mGysUmEePWhPRawq6*zQyAxh*zCi7vrJ4hyqzmTkmw971kyPNRjLfymf0yzIv5MrVc/case.JPG?width=561\" width=\"561\"/>](http://api.ning.com/files/tELt8V-QL1BOJS5is*qYDPP29g-vF0mGysUmEePWhPRawq6*zQyAxh*zCi7vrJ4hyqzmTkmw971kyPNRjLfymf0yzIv5MrVc/case.JPG)\n\n\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1659340", "name": "case.JPG"}], "created_by_name": "anarchitect", "created_at": "December 17, 2016 at 9:09am", "created_by": "mimarilker", "replies": []}, {"body": "\nThe -273.15 should not be there. That's a mistake. It was there from another file for converting K degrees to C.\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "December 18, 2016 at 6:35pm", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nThanks for the reply, I want to be in the testing team if its possible, btw I can provide logartimic expressions(.c file) as to wind profile. \n\n\n\nAfter some comprehensive research I have seen that OpenFoam divides the pressure values to air density for the output results. However in CFD simulations we wait for relative pressure loads as its. So do you have a plan to corect these values coming from OF?\n", "attachments": [], "created_by_name": "anarchitect", "created_at": "December 19, 2016 at 2:52am", "created_by": "mimarilker", "replies": []}, {"body": "\nHi Mostapha~\n\nI'm very interested in Beta testing Butterfly as well as Dragonfly if they are now available. Our office is working on some interesting research initiatives that would benefit greatly from Butterfly specifically.\n\nCheers,<br/>Mark\n", "attachments": [], "created_by_name": "Mark Cichy", "created_at": "January 5, 2017 at 1:38pm", "created_by": "MarkCichy395", "replies": []}, {"body": "\nHi Mark, Check [this link](https://github.com/mostaphaRoudsari/Butterfly/wiki/Getting-Started-with-butterfly#0-introduction) for Butterfly!\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "January 5, 2017 at 2:07pm", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nAlso what's exactly your issue with installation? I managed to install OpenFOAM v3.0+ on Windows 8 successfully and it's running with no problems.\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "July 5, 2016 at 4:33pm", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nHi Mostapha\n\nI have openfoam installed on win7 (after trying without success to work on win10 - maybe because you use openfoam v3.1 and not the latest v1606?)\n\nAfter trying to play with the butterfly \"beta\" - I think I got most of your script working, except the visualization.\n\nI think the problem is that i have about 78K points and only about 1500 vectors. \n\nthanks\n", "attachments": [], "created_by_name": "Hagit", "created_at": "July 6, 2016 at 1:07pm", "created_by": "HT739", "replies": []}, {"body": "\nHi Hagit,\n\n\n\nMay I ask how you installed the Butterfly components in GH? They seem to be python files, rather than ghuser files that can be dragged and dropped to GH to install.\n\n\n\nThanks!\n", "attachments": [], "created_by_name": "Grasshope", "created_at": "July 10, 2016 at 11:10pm", "created_by": "Grasshope", "replies": []}]}], "id": "1536958"}