{"body": "\nDear Mostapha and Chris,\n\n\n\nThank you and your colleagues for the amazing LB+HB tools, tutorials and example files.\n\n<br/> Although I'm new in using the tools, I have to make a complex model. Attached you can find my initial files, reports and errors (Running E+ simulation on the initial setup took hours and ended up with numerous errors) \n\n<br/> I got a number of questions and would appreciate if you could answer them:\n\n\n\n1- I have duplicated zones using \"Honeybee Move\". Is this the correct way to duplicate zones and if yes, should I rename all surfaces afterwards? I have renamed zones but not surfaces (The tower has 40 floors = 10 x typical group of 4 floors) \n\n\n\n2- Should I convert all curvilinear objects to faceted geometry (or only windows and window-walls should be flat)?\n\n\n\n3- In the next stage, I will add a second skin as the outer facade. Spiral structural elements (insulated thermal mass) are between interior and exterior areas, partly exposed to the sun. Should I split both interior and exterior zones to subtract these elements, and then solve the adjacencies?\n\n\n\n4- To simplify the procedure and make it faster, I may simulate only 4 floors. Is it possible to force-hide the top roof and the lowest floor from the sun and other environmental factors? If yes, how? and do you know how much accuracy in the results would be lost in this case? <br/> <br/> 5- The outer skin would be all in glass, therefore in reality, the direct sun will affect the inner skin and the structural elements. I read somewhere that in HB+E+ simulations, direct sun turns to diffuse after passing the first layer of glass. Is that true? If yes, how can I make the inner skin exposed to direct sun in the simulation? <br/> <br/> Thank you very much for your time.\n\n\n\nBest,\n\nAryan\n\n \n\n\n\n\n\n\n\n<br/>  \n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1542131", "name": "HB Test aryan008.gh"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1542132", "name": "ary_AbuDhabi_Alt6_003_HB test 008.rar"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1542133", "name": "HB AbuDhabi 01.rar"}], "created_by_name": "Aryan Shahabian", "created_at": "June 4, 2016 at 3:07pm", "created_by": "AryanShahabian", "topic": "Energy modeling of a cylindrical tall building with diagrid structural thermal mass", "replies": [{"body": "\nHi again! \n\n<br/>No one has replied to my questions. I guess that might be because the files are too heavy and time taking to run. <br/>You could also answer my questions regardless of the attached files. Please consider them as independent questions and reply as much as possible. \n\n<br/>Thanks\n", "attachments": [], "created_by_name": "Aryan Shahabian", "created_at": "June 6, 2016 at 1:55pm", "created_by": "AryanShahabian", "replies": [{"body": "\nAryan,\n\nSorry for the late reply.  It's been a busy month.  Your answers:\n\n1 - Just duplicating the zones with the 'Move' component should work (no need to duplicate surfaces).  Keep in mind that this is a WIP component and there may still be bugs in it.  Copying the zone geometry first and then creating the zones may be a safer option.\n\n2 - YES!  Honeybee can handle the curved surfaces as you can see but you will cut down your simulation time 100-fold by planarizing your geometry in an intelligent manner.\n\n3 - If you were only building a single test box model, making the interior and exterior two separate zones would probably be the most accurate and would allow you to asses many different surface temperatures and heat flows.  However, if you are trying to model a full building like this, you are better off simplifying the whole facade down into a single construction or else you can end up with really long calculation times.\n\n4 - If I were you, I would only simulate one floor at most.  In this case, you want to make the boundary condition of the ceiling and floors adiabatic.  The simplest way to do this is to pass the zones through the \"Make Aidabatic by Type\" component and check the boundary conditions with the \"Decompose Based on Boundary Condition\" component.\n\n5 - You are mostly correct except that direct sunlight turns to diffuse light after passing through the SECOND WINDOW that it hits (not the first and not a pane of glass but a full window).  This allows you to accurately model things like double skin facades as separate zones.  \n\nHope this helps,\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "June 26, 2016 at 5:44pm", "created_by": "ChrisMackey", "replies": []}]}], "id": "1542134"}