{"body": "\nHi, \n\n\n\nI have an observation, followed by a question/ \n\n\n\nI've been using the Sunlight Hours Analysis component on a large model. The model context is nearly 16,000 surfaces, and there are c. 350 surfaces for the sunlight hours analysis. \n\n\n\nI'm producing BRE Annual Probable Sunlight Hours calculations and so to match the BRE approach, I'm using 100 sun vectors, each representing 1% of probable sunlight hours. I could use the Sunpath and Analysis Period components to produce sun positions for the whole year, but this gives results that do not fully reflect the BRE methodology - which is important here. I'm detailing this just to clarify that this isn't a full annual calc of 8760 hours for 350 surfaces. \n\n\n\nAnyway, when I run the calc, it takes about an hour to run, but the Sunlight Hours Component itself reports a calculation time of 3 seconds! Does this mean that the rest of the time is all about prepping the brep geometry? If so, is there a reason why this is much slower than when using a view of sky recipe and exporting to radiance. For the same project, I completed a view of sky calculations and based on the number of test points and -ad setting, this was completing about 5.25 billions rays so I understand why that took an hour. \n\n\n\nAny thoughts as to why the sunlight hours calc seems to take so long? \n\n\n\nthanks\n\n\n\nNick\n\n\n\n\n", "attachments": [], "created_by_name": "Nick Devlin", "created_at": "June 5, 2016 at 1:12pm", "created_by": "NickDevlin", "topic": "Sunlight Hours Analysis - Long Calculation Time, sort of...", "replies": [{"body": "\nNick,\n\nIt will help to attach your file.\n\nIf you see that the sunlightHours takes 3 seconds then you can see also where it happens that the other hour occurs.\n\nHard to say without understanding what is going on.\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "June 5, 2016 at 9:16pm", "created_by": "AbrahamYezioro", "replies": [{"body": "\nGood point Abraham about the timings. I'll look into it. I can't share the file yet as the project is not public yet. \n\n\n\n\n", "attachments": [], "created_by_name": "Nick Devlin", "created_at": "June 6, 2016 at 3:22am", "created_by": "NickDevlin", "replies": []}, {"body": "\nAs Abraham mentioned, did you try to pin point the component that takes the most of the time for calculation? You need to turn on the Profiler in case you don't see the time at the bottom of each component.\n\n\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/4yN4f2JwhY2ae7jcIbGmkXSe6qhWHaqK7b8BccprVKBIM9FV1xzVUts4jnrB*N46WqbLLYC3aXUG9cY0DrrZyZNy4DjIMVbJ/profiling.jpg\" width=\"430\"/>](http://api.ning.com:80/files/4yN4f2JwhY2ae7jcIbGmkXSe6qhWHaqK7b8BccprVKBIM9FV1xzVUts4jnrB*N46WqbLLYC3aXUG9cY0DrrZyZNy4DjIMVbJ/profiling.jpg)\n\n\n\nSunlighthour is using Grasshopper's intersections while SVF component is using Radiance's ray-tracing for calculation. If you can share the model with me over email I will be happy to test it against the new under development method that uses Radiance for calculating sunlight hours.\n\n\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "June 9, 2016 at 10:31am", "created_by": "MostaphaSadeghipour", "replies": []}]}], "id": "1542522"}