{"body": "\nHello everybody!\n\n\n\nI was recently testing some components, focusing on a thermal comfort.\n\n\n\nI have found out, that for instance - OutdoorComfortCalculator - which considers temperatures of 9-26 and other factors, gives the % of comfortable time outdoor for instance in Kenya in Africa (high temperatures and humidity) 55%, whereas within the same .epw data and some additional factors added to the Thermal Indices component, the \"humidex\" or \"Discomfort index\" give a result drastically lower, I think it was even 1-5% comfortable.\n\n\n\nHow is that?\n\n\n\nAlso, OutdoorComfortCalculator shows the comfortable time %. But it considers both day and night. Isn't that day is much more important than night, as people do many activities and really \"use\" the architecture or public space, so this % is a bit misleading? Somebody might think, that 50% comfortable is quite good, but if its only during the night time, than it seems not so... \"practical\"? Perhaps it would be better to find a % of a comfort during the day time specifically.\n\n\n\nAnybody had the same thoughts or problems about that? Is my way of thinking correct?\n\n\n\nRegards!\n\n\n\nJacek\n", "attachments": [], "created_by_name": "Jacek Urbanowicz", "created_at": "June 20, 2016 at 8:46pm", "created_by": "JacekUrbanowicz", "topic": "Difference between \"OutdoorComfortCalculator\" component and \"ThermalComfortIndices\" component", "replies": [{"body": "\nHi Jacek,[<br/>](http://www.grasshopper3d.com/profile/JacekUrbanowicz)\n\nI can't answer your first question but regarding your second question, you can use an analysis period component.\n", "attachments": [], "created_by_name": "Pin", "created_at": "June 21, 2016 at 1:12am", "created_by": "Pin", "replies": []}, {"body": "\nHi Jacek,\n\n\n\n... \"humidex\" or \"Discomfort index\" give a result drastically lower, I think it was even 1-5% comfortable.\n\n<br/>Some of the thermal comfort indices you see in the \"Thermal Comfort Indices\" component are experiential or location specific. For example: [humidex](http://ec.gc.ca/meteo-weather/default.asp?lang=En&amp;n=6C5D4990-1#humidex) has been derived and widely used in Canada.<br/>Also both humidex and discomfort index should be used in in-shade conditions.<br/>For universal applications and locations, you should concentrate on either PET or [UTCI](http://www.utci.org/) (this is what \"Outdoor Comfort Calculator\" component is based on).\n\n\n\n<br/>I have found out, that for instance - OutdoorComfortCalculator - which considers temperatures of 9-26 and other factors, gives the % of comfortable time outdoor for instance in Kenya in Africa (high temperatures and humidity) 55%, whereas within the same .epw data and some additional factors added to the Thermal Indices component, the \"humidex\" or \"Discomfort index\" give a result drastically lower, I think it was even 1-5% comfortable.<br/>How is that?\n\n<br/>Yes, this is one of the issues that I have with UTCI index: the authors wanted to make it as an index applicable in any type of climate. To create the UTCI comfort categories a number of data has been collected from different locations (for hot humid climate, it was the data from Madagascar. I may be wrong on this). This resulted in universal comfortable range of 9 to 26 C which you mentioned. How would the people in Madagascar perceive the feel like temperature of 9 degrees as comfortable is beyond my understanding.<br/>Thermophysiology of a human in Madagascar, and in Poland is the same. However their acclimatization is quite different, which raises the issue with the upper universal comfortable range. In general people who live in hotter climates have a bit higher tolerance to high temperature than those living in continental climates. And vice-versa: their tolerance to lower temperatures is lower than the tolerance of the people from the continental climates. Here is a comparison of the UTCI - PET stress categories:\n\n\n\n**UTCI**\n\nall climates        stress category\n\nabove +46        extreme heat stress<br/>+38 to +46        very strong heat stress<br/>+32 to +38        strong heat stress<br/>+26 to +32        moderate heat stress<br/>**+9 to +26        no thermal stress**<br/>+9 to 0        slight cold stress<br/>0 to -13        moderate cold stress<br/>-13 to -27        strong cold stress<br/>-27 to -40        very strong cold stress<br/>below -40        extreme cold stress<br/><br/><br/>\n\n**PET**\n\n(sub)tropical humid climate   temperate climate       stress category<br/><br/>above +42                         above +41                 extreme heat stress<br/>+38 to +42                        +35 to +41                strong heat stress<br/>+34 to +38                        +29 to +35                moderate heat stress<br/>+30 to +34                        +23 to +29                slight heat stress<br/>***+26 to +30                            +18 to +23                  no thermal stress***<br/>+22 to +26                        +13 to +18                slight cold stress<br/>+18 to +22                        +8 to +13                  moderate cold stress<br/>+14 to +18                        +4 to +8                   strong cold stress<br/>below +14                          below +4                  extreme cold stress\n\n<br/><br/>I attached below an example of PET humid climate comparison with UTCI, for in-shade and out-shade conditions.<br/>As it can be seen UTCI shows the percent of time comfortable: two times higher than PET.<br/><br/>\n\n<br/>Thank you Pin, for the useful comment, on usage of \"Analysis period\" component.\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1551925", "name": "pet_vs_utci_humid_tropical_climate.gh"}], "created_by_name": "djordje", "created_at": "June 21, 2016 at 6:06am", "created_by": "djordje", "replies": [{"body": "\nThank you @Pin . I know what you mean - using the analysis period we can manipulate the final result the way we want. For instance - using that just for the \"comfortable\" periods we can show its a good climate and showing it for the \"hostile\" - contrary... Therefore it would seem best to compare the climate by the whole year time range, but that just could be misleading or difficult in many ways...\n\n... and that's where @djordje clarified a few things for me - really awesome, thank you for that!! Do you have some book or website to recommend? I would like to get a deeper background knowledge and be able to recognize these subtle differences...\n", "attachments": [], "created_by_name": "Jacek Urbanowicz", "created_at": "June 23, 2016 at 7:10am", "created_by": "JacekUrbanowicz", "replies": []}, {"body": "\nHi Jacek,\n\n\n\nI am not aware of a specific book or website which deals with these issues.\n\n\n\nOn UTCI, you can [google and find](http://www.utci.org/isb/documents/windsor_vers04.pdf) a lot of publications. UTCI [official website](http://www.utci.org/utci_doku.php) also contains valuable information.\n\n\n\nOn PET, you can check [these publications](https://www.dropbox.com/s/ztfsqzqm223tpj2/PETpublications.zip?dl=0).\n\n<br/>On all other indices from the Thermal Comfort Indices component, you will have to run each one them, and then check the explanations of their outputs (you hover with your mouse pointer on any of the outputs). For example, you hover over the THI (Temperature Humidity Index, _comfortIndex = 17) and you see that it is currently used in Taiwan as their official feel like temperature. You can also see its limitations (thi.jpg attached below).\n\nThe other way is to double click on the Thermal Comfort Indices icon, and scroll down to the line 429. From there you can find some details about each index, the publication, its author and so (phs.jpg attached below).\n\nNot all indices will contain the exact name of the publication from which they have been derived. Some will contain only the author name and a year. You can try to google the author name along with the name of the index.\n\n<br/>Chris Mackey is the author of the Outdoor Comfort Calculator component so he can also provide valuable information.\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1554448", "name": "thi.jpg"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1554449", "name": "phs.jpg"}], "created_by_name": "djordje", "created_at": "June 23, 2016 at 8:01am", "created_by": "djordje", "replies": []}, {"body": "\nHi again, djordje. That's great! Many thanks for sharing with me your thoughts on that subject. Hopefully others will benefit from that short conversation as well. Cheers!\n", "attachments": [], "created_by_name": "Jacek Urbanowicz", "created_at": "June 24, 2016 at 6:44am", "created_by": "JacekUrbanowicz", "replies": []}]}], "id": "1551290"}