{"body": "\n**EDIT:** Both **Terrain shading mask** and **Horizon angles** components are now part of [Gismo plugin](http://www.grasshopper3d.com/groups/gismo). For future suggestions, issues, bugs, post a question in [Gismo' plugin group](http://www.grasshopper3d.com/groups/gismo).\n\n<br/><br/>Hello,\n\n\n\nI would just like to make a modest notice about the two new Ladybug components, one of which creates a 3d terrain shading mask and another one which visualizes and exports horizon angles.<br/> <br/> A terrain shading mask is essentially a diagram which maps the silhouette of the surrounding terrain (hills, valleys, mountains, tree tops...) around the chosen location, and account for the shading losses from the terrain.<br/> It can be used as a context_ input in mountainous or higher latitude regions for any kind of sun related analysis: sunlight hours analysis, solar radiation analysis, view analysis, photovoltaics/solar water heating sunpath shading...\n\n<br/> My home town is an example of the shading caused by the terrain. Here is how it looks from the [tallest building in the town](https://www.google.com/maps/place/42%C2%B041'25.6%22N+22%C2%B010'17.1%22E/@42.6904405,22.1708855,135m/data=!3m1!1e3!4m5!3m4!1s0x0:0x0!8m2!3d42.690457!4d22.171431):\n\n\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/w-Qoov2ENCyf8Oly2NrUe2SGwZRhjlVCeDQDOasKl9E3a899**VDPuXK69XrjECP7ms4t193TLrCnQO8sjIsU4AK1b*KiRdE/panorama.jpg?width=750\" width=\"750\"/>](http://api.ning.com:80/files/w-Qoov2ENCyf8Oly2NrUe2SGwZRhjlVCeDQDOasKl9E3a899**VDPuXK69XrjECP7ms4t193TLrCnQO8sjIsU4AK1b*KiRdE/panorama.jpg)\n\n\n\nAnd the created terrain shading mask:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/hbjtvQvq-mFg3g-rPi5SoF4yhJ2O7B4TSQL0Eaa9VP2yhIgRNkpwLUR2vMR93FdysGtDpmHHG3CfdXDPmkeH8ijgy-DYk2kU/terrain_shading_mask_surdulica.jpg?width=250\" width=\"250\"/>](http://api.ning.com:80/files/hbjtvQvq-mFg3g-rPi5SoF4yhJ2O7B4TSQL0Eaa9VP2yhIgRNkpwLUR2vMR93FdysGtDpmHHG3CfdXDPmkeH8ijgy-DYk2kU/terrain_shading_mask_surdulica.jpg)\n\n\n\nA mask for any land location up to 60 degrees North can be created:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/w-Qoov2ENCzQRg6lRoBzUQK52EScXu296*ta5F11vq-cExASG85CmDN5Kn72VorG8LlpGSVOztahbuyI9JQj-kvl0cJH9KqY/srtm_cover_map.jpg?width=300\" width=\"300\"/>](http://api.ning.com:80/files/w-Qoov2ENCzQRg6lRoBzUQK52EScXu296*ta5F11vq-cExASG85CmDN5Kn72VorG8LlpGSVOztahbuyI9JQj-kvl0cJH9KqY/srtm_cover_map.jpg)\n\n<br/> There will also be a support for a few major cities above this limit.\n\n<br/> Both **Terrain shading mask** and **Horizon angles** components can be downloaded from [here](https://github.com/stgeorges/gismo#installation).<br/> An [example .gh file can be found in here](https://github.com/stgeorges/gismo/blob/master/examples/terrain_shading_mask_and_horizon_angles.gh).\n\n<br/> Component will prompt the user to download and copy certain files in order to be able to run.\n\nIt was created with assistance from Dr. Bojan Savric.<br/> Support on various issues was further given by:<br/> Dr. Graham Dawson, Dr. Alec Bennett, Dr. Ulrich Deuschle, Andrew T. Young, LiMinlu, Jonathan de Ferranti, Michal Migurski, Christopher Crosby, Even Rouault, Tamas Szekeres, Izabela Spasic, Mostapha Sadeghipour Roudsari, Dragan Milenkovic, Chen Weiqing, Menno Deij-van Rijswijk and gis.stackexchange.com community.\n\n<br/> <br/> I hope somebody might find the components useful.\n", "attachments": [], "created_by_name": "djordje", "created_at": "June 28, 2016 at 6:52pm", "created_by": "djordje", "topic": "Terrain shading mask component released", "replies": [{"body": "\nVery nice Djordje. Thanks!!\n\nA question (or maybe suggestion). The sunpath and terrain resulting from the calculation are (for your example, for instance) too far away. Usually, for representation purposes you want to show the sunpath much closer to your site. So now i take the resulting projection and scale it together with the sunpath.\n\nThe question is: is there a way to control this more user friendly? I have to say that maybe i'm lazy with trying the min/maxVisibilityRadius_ inputs, but this because the computation takes a while :-)\n\n\n\nAlso, it is not clear for me from the explanations: when i already calculated the shading mask how can i save time for the next time. I see that some tif and obj files were downloaded to the ladybug/terrain directory. SO if you don't mind, a further explanation will be appreciated.\n\n\n\nThanks again!!\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "June 29, 2016 at 12:14am", "created_by": "AbrahamYezioro", "replies": [{"body": "\nVery awesome component, Djordje!  This will be useful in a lot of cases.\n\n\n\nI have one fatal error and one comment.  I am unable to run your component on my machine because of a PINVOKE error (similar to what had halted our work on OpenStudio at one point):\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/XAMh5eqrnNQ*Un-IaO8MsbojgoHIGbJk1ugMI*XfQbLFR4lL03Ezat*WbWdPRmewOHkjm0PzTTeHXMeBCJeaD-*oL8uDHt8R/GDALERROR.JPG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/XAMh5eqrnNQ*Un-IaO8MsbojgoHIGbJk1ugMI*XfQbLFR4lL03Ezat*WbWdPRmewOHkjm0PzTTeHXMeBCJeaD-*oL8uDHt8R/GDALERROR.JPG)\n\nUnfortunately, we never found to root cause of this error with OpenStudio as [this long github issue](https://github.com/mostaphaRoudsari/Honeybee/issues/214) suggests.  The error just magically disappeared in the later OpenStudio releases. Mostapha, have you discovered anything related to this issue since the discussion?\n\n\n\nMy comment is that we really need to find some easier way to install this if we would like a large number of people to use it.  Since the whole application is only 26 MB, I would suggest having an automatic download and extraction the first time that somone runs the component.  You can sense whether the files are there the next time that the component is run.  This is similar to what is done with genDayMtx.exe:\n\n[https://github.com/mostaphaRoudsari/ladybug/blob/master/src/ladybug...](https://github.com/mostaphaRoudsari/ladybug/blob/master/src/ladybug_ladybug.py#L746-L783)\n\n... or to the epw files from the URL:\n\n[https://github.com/mostaphaRoudsari/ladybug/blob/master/src/Ladybug...](https://github.com/mostaphaRoudsari/ladybug/blob/master/src/Ladybug_Open%20EPW%20And%20STAT%20Weather%20Files.py#L136-L178)\n\n\n\nI also second Abraham's request for a _scale_ input on the component.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "June 29, 2016 at 5:39pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nHi Abraham,<br/><br/>Thank you for the valuable suggestions!<br/><br/>You can remove any kind of geometry supplied to the **context_** input. This will make the radius of the terrain shading mask equal to that of the Ladybug Sunpath component. This is what I essentially did in the upper photo of [my hometown's mask](http://api.ning.com/files/w-Qoov2ENCwKUsvKkltv1ThJq6kU0Mzo33fX8Iegd2j3J*gbZRgsfy*epnrCIZEbZVYwyHSV2mpgiGMJEjMeVi4zlfogf5T4/surdulica_panorama2.jpg).<br/>For now this is working only for metric units. I will make sure that for the next release at least feets are supported as well.<br/><br/>As for the saving of the time: try increasing the **maxVisibilityRadius_** to say 300. <br/>Depending on your PC configuration and internet speed it may take as long as 15 minutes for the component to run. The topography file will first be downloaded from opentopography.org. That's the .tif file you noticed. Once the mask is created it will be saved to an .obj file. The next time you run it the mask will be imported from the .obj file, skipping the previous 15 minutes:<br/><br/>\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/E636THrB2V1rQgJIRDFT7mGXNRJqK2-mfiEyrxZruX2kkzheyP2s7uO*atV6OWM3kFM3NC1EBpjTxs9dJ6ut4clsy2Cwcbq1/import_mask.jpg?width=300\" width=\"300\"/>](http://api.ning.com:80/files/E636THrB2V1rQgJIRDFT7mGXNRJqK2-mfiEyrxZruX2kkzheyP2s7uO*atV6OWM3kFM3NC1EBpjTxs9dJ6ut4clsy2Cwcbq1/import_mask.jpg)\n\nIt still may take a a couple of minutes (depending on your PC configuration) for the component to complete loading of the mask. The reason why is: the mask needs to be scaled and centered according to the context_ input.<br/><br/>Also the next time a user decides to change the **maskStyle_** input or **context_** input, the topography data will not be downloaded from the opentopography.org website, but rather created from the .tif file.<br/>For default **maximalVisibility_** of 100, these .tif files are mostly a couple of megabytes, which is not that much of a burden on user's hard drive space. On the other hand keeping these .tif files on user's hard drive helps saving the opentopography bandwidth cap.<br/>Let me know if I can answer any further detail or if this one hasn't been clear.<br/><br/><br/><br/>Hi Chris,\n\nThank you too.<br/><br/>Please provide the following data:\n\n1) Zip the \"terrain shading mask libraries 32-bit\" folder in \"c:\\ladybug\" in case you have x86 version of Rhino 5, or \"terrain shading mask libraries 64-bit\" folder in case you have the 64 bit version of Rhino 5. Upload the zipped folder, and post the link in here, please.<br/>Zip the whole folder, not its content only.\n\n<br/>2) What is the full name of the GDAL libraries .zip file that you downloaded? What is your Windows version and Rhino 5 version?\n\n\n\nOn genDayMtx.exe and install of the GDAL libraries: I am reluctant to avoid manual install due to blocking issue. Copying two folders manually is quite a small price to pay in comparison with finding the blocked library among tens of them.\n", "attachments": [], "created_by_name": "djordje", "created_at": "June 30, 2016 at 9:01am", "created_by": "djordje", "replies": []}, {"body": "\nDjordje,\n\n\n\nSorry it took so long to reply.  You can find the zipped folder attached.\n\nThe version of the GDAL libraries that I downloaded is release-1800-x64-gdal-1-11-4-mapserver-6-4-3.\n\n\n\nI am sure that there is some way around the blocking issue although you may be right that an automatic download in the background might not be the best way to do it.  I'll talk to Mostapha about it at some point if it doen't come up on this discussion.\n\n\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "July 2, 2016 at 11:57am", "created_by": "ChrisMackey", "replies": []}, {"body": "\nHi Chris,<br/><br/>Grasshopper forum supports only 5mb attachments. Upload the zipped folder to some file sharing website.\n\nWhat is your Windows version and Rhino 5 x64 version?\n\n<br/>I think it depends on windows version, (maybe even antivirus software, although I may be wrong on antivirus) whether the downloaded .zip file would be blocked or not.<br/>One thing is certain: if a user unblocks a .zip file file and then extracts its content, none of the extracted files will never be blocked.<br/>In my opinion the number of topics that we regularly receive on genDayMtx.exe would be much less if users would have to install the genDayMtx.exe manually (where installation would include a step with unblocking).\n", "attachments": [], "created_by_name": "djordje", "created_at": "July 2, 2016 at 12:08pm", "created_by": "djordje", "replies": []}, {"body": "\nThanks Djordje for the response.\n\nDidn't test yet.\n\nBut just want to remind that Marios Tsiliakos developed a component for unblocking the LB_HB components and libraries (Unblock All and Unblock).\n\nMaybe these can bring some use here?\n\nBTW i installed the release-1800-x64-gdal-2-1-0-mapserver-7-0-1.zip without issues (just unblocking).\n\n-A.\n\n\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "July 2, 2016 at 9:40pm", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nDjordje,\n\nSorry for not realizing that it failed to upload.  Here's a dropbox link:\n\n[https://www.dropbox.com/s/0mdx1y3s32p41rg/terrain%20shading%20mask%...](https://www.dropbox.com/s/0mdx1y3s32p41rg/terrain%20shading%20mask%20libraries%2064-bit.zip?dl=0)\n\n\n\nMy version of Windows is 8.1 and I will try it out on Windows 7 and Windows 10 when I get the chance at work.  All of these Windows versions will be 64-bit.\n\n\n\nMy Rhino is Rhino 5 SR12 64-bit.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "July 3, 2016 at 7:48pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nHi Chris,<br/><br/>Thank you for the upload. You do not have to check on other Windows versions. The upper error [you posted](http://www.grasshopper3d.com/xn/detail/2985220:Comment:1557854) was caused by not following the **step 3** of the installation: You should have copied the content from the **\"bin\"** folder to the **\"c:\\ladybug\\terrain shading mask libraries 64-bit\"** folder:\n\n\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/ys89Oj1AWQ*2TTTaXHwQcflhS9Cleq7Tl-VZuJjCTcLmIVRQEBT5ogV0wEm25iMsLTdwg10aua0LnjPNQRFOZidO13E3kTBw/Chris_terrainShadingMask_step3.jpg?width=700\" width=\"700\"/>](http://api.ning.com:80/files/ys89Oj1AWQ*2TTTaXHwQcflhS9Cleq7Tl-VZuJjCTcLmIVRQEBT5ogV0wEm25iMsLTdwg10aua0LnjPNQRFOZidO13E3kTBw/Chris_terrainShadingMask_step3.jpg)\n\nSo not the very **bin** folder, but its content.<br/>Just do this and the component will work.<br/><br/><br/>\n\n<br/>Hi Abraham,\n\n\n\nBut just want to remind that Marios Tsiliakos developed a component for unblocking the LB_HB components and libraries (Unblock All and Unblock).\n\nThank you for the suggestion. I am aware of that component. I shared [an article about it](https://digitalsubstance.wordpress.com/2015/08/17/unblocking-gh-add-ons-more-a-k-a-why-the-add-on-is-not-installed) on my facebook account last year, at the time when it was released. It's a great component!<br/>There are still two issues with it: It edits the windows registry.<br/>I order for it to edit the windows registry it requires an account with administrator's rights.<br/>To unblock the file manually you do not need to have an account with administrator's rights.\n\n<br/>BTW i installed the release-1800-x64-gdal-2-1-0-mapserver-7-0-1.zip without issues (just unblocking).\n\nYes, the **GDAL 2.x.x and MapServer 7.x.x**  versions will also work. But I can not install them on my PC, therefor I can not provide support for them. **The GDAL 1.x.x and MapServer 6.x.x** are sufficient for what the component does.<br/>If you intend to seek support for any future issues, please install the latest **GDAL 1.x.x and MapServer 6.x.x** version as said by the component installation instructions.\n", "attachments": [], "created_by_name": "djordje", "created_at": "July 4, 2016 at 6:30am", "created_by": "djordje", "replies": []}, {"body": "\nDjordje,\n\n\n\nI got it to run.  Steps 3 and 4 were so similar that I missed one of them.  If we can't find another way because of admin privileges, I think most users will still tolerate a short manual install of downloading and unzipping.\n\n\n\nHowever, why is it that the user needs to take all of the content out of the bin and CSharp folders and dump them in the main folder?  If the user has installed the tool by downloading, unblocking, and unzipping the tool, can't we just be sure that the required files are in the bin and CSharp folders as opposed to the main folder?  So we search for them there as opposed to the main folder?\n\n\n\nIf we could get rid of steps 3 and 4, I think that it would go a long way to lowering the barrier to using the tool and would prevent dumb posts like the one that I have done here. \n\n\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "July 4, 2016 at 11:25am", "created_by": "ChrisMackey", "replies": []}, {"body": "\nHi Chris,<br/><br/>With all due respect, I am actually surprised that you have been confused by these two simple steps:\n\n3) Extract the downloaded .zip file content anywhere. Then copy the content from its \"bin\" folder to the \"c:\\ladybug\\terrain shading mask libraries 64-bit\" folder.<br/> <br/>4) Copy the content from its \"bin\\gdal\\csharp\" folder to the same \"c:\\ladybug\\terrain shading mask libraries 64-bit\" folder.<br/>That's it!\n\n<br/>Nevertheless, I have just introduced an article with installation photos to the [newest version of the component](https://github.com/mostaphaRoudsari/ladybug/blob/master/userObjects/Ladybug_Terrain%20Shading%20Mask.ghuser).<br/><br/>To answer the second part of your question:\n\nThis would mean that the developer of the GDAL libraries would have to come up with a separate .zip file used by Terrain_Shading_Mask component only, for both x86 and x64 versions of Rhino5. He is not willing to do that.<br/>Not hosting the libraries on developers website (gisinternals.com) but rather on ladybug github account or separate server may raise an issue with licensing, for which I do not wish to be accounted for.\n", "attachments": [], "created_by_name": "djordje", "created_at": "July 4, 2016 at 4:44pm", "created_by": "djordje", "replies": []}]}, {"body": "\nHere are two [question](http://www.grasshopper3d.com/xn/detail/2985220:Comment:1573716) from the \"daylight simulation using complex surfaces\" topic by Giacomo Luddeni. I posted the answers to them in here as it will be beneficial to keep them in component's release topic:\n\n<br/>I'm wondering how does it decide where to place the mask (given that I put no input data as context_ in the TerrainShadingMask element).\n\n<br/>As Abraham explained in [your initial topic](http://www.grasshopper3d.com/xn/detail/2985220:Topic:1572573?xg_source=activity), if you do not supply anything to the context_ input it will create a mask with the same radius as the sunpath diagram from Sunpath component. This serves for visualization purposes.<br/>So [the photo](http://api.ning.com/files/hbjtvQvq-mFg3g-rPi5SoF4yhJ2O7B4TSQL0Eaa9VP2yhIgRNkpwLUR2vMR93FdysGtDpmHHG3CfdXDPmkeH8ijgy-DYk2kU/terrain_shading_mask_surdulica.jpg) you see in the starting post of this topic has been generated in that way.<br/>However in order for the mask to be used as a shading context for any solar radiation analysis, it needs to be scaled. The component scales the mask until the difference between the [sky exposure factors](http://www.grasshopper3d.com/xn/detail/2985220:Comment:1463066) of four points of the context_'s bouding box is less than 0.01.<br/>Then it should have done the same for the [sunpath shading](http://api.ning.com/files/Z3BWMoplk5SKli5hVB7-9WdIvC1qAnTs4LdiOxOoi5lYNsNMY6Pziuk0mXUcOCMa*Ledz0Sb4XY6n3BjseCTWQTz60LAe0UZ/photovoltaics_shading.jpg).<br/>As I did not succeed in moving the whole \"Sunpath shading\" component to the \"Ladybug Ladybug\" component and calling it from there, this step is omitted. After checking for sky exposure factor differences, the radius will be scaled 3 times, and if lesser than 10000 meters, it will be set to 10000 meters. In most cases this kind of distant radius may not even be needed.\n\n<br/>Is it actually placed in such a way to give the same shading effect as the real terrain geometry?\n\nYes.\n", "attachments": [], "created_by_name": "djordje", "created_at": "August 5, 2016 at 2:47pm", "created_by": "djordje", "replies": [{"body": "\nHi Djordje,\n\nI'm afraid that i get lost with your explanation. It is clear now that the mask should be scaled. What is not clear for me is the procedure in order to guarantee the right use of the mask as a context.\n\nAn example will be appreciated.\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "August 6, 2016 at 10:58pm", "created_by": "AbrahamYezioro", "replies": []}]}], "id": "1557177"}