{"body": "\nHallo everyone,\n\n\n\nI am quite new to this forum!\n\nI followed ALL Chris' video tutorials about thermal simulations with honeybee (thanks a lot by the way!).\n\nI am experiencing this problem: the attached grasshopper file seem to work but the results are not sensible at all to changes in loads and materials (i tried to put a 1m-thick concrete wall or 50 people instead of 2 and nothing changes inside!). On the contrary if I change the maximum indoor or outdoor temperature for natural ventilation, it ends up changing a lot.\n\n\n\nCan anyone take a look and help me? :)\n\n\n\nThank you,\n\nIrene\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1558484", "name": "Simulazione Città della Pace_OK.gh"}], "created_by_name": "Irene Giglio", "created_at": "July 1, 2016 at 3:46am", "created_by": "IreneGiglio", "topic": "Problem with materials and loads in Thermal Simulations", "replies": [{"body": "\nBy \"nothing changes\", you mean what result outputs, exactly?\n\nI see you are using a nat vent component, have you incrementally tested your definition to make sure it first works without nat vent, then add it, compare, rinse, repeat?\n\nBest,\n\nMax\n", "attachments": [], "created_by_name": "Max D", "created_at": "July 1, 2016 at 10:19am", "created_by": "ButWhyprecisely", "replies": [{"body": "\nHi Max!\n\n\n\nYes, I mean the Operative Temperature inside the shoebox.\n\nI have tried with and without it and I don't understand what is wrong. Can you see any major mistake?\n\n\n\nThank you very much,\n\nIrene\n", "attachments": [], "created_by_name": "Irene Giglio", "created_at": "July 10, 2016 at 5:09pm", "created_by": "IreneGiglio", "replies": []}, {"body": "\nFor debugging issues like this you need to first check the output that will be affected directly. Does internal gains changes between the two simulation? What is the percentage of internal gain over the overall gain in the zone? and so on...\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "July 11, 2016 at 11:22am", "created_by": "MostaphaSadeghipour", "replies": []}]}]}