{"body": "\nHello everyone,\n\n\n\nI'm having some issues with the Add HbGlz component after my update to the latest version for both HB and LB. Was just wondering if anyone else is having similar problems or it's something I am missing at the moment.\n\nI've tried the simplest of cases, manual as well as scale1d windows, and I can't seem to make it work. The windows don't appear in the surface preview (which sometimes happens I know), nor in the zone preview or the decompose by type preview component, which shows empty in the window type surfaces.\n\nDon't have a case file to share really as I've been trying in a simple box with 1 window. Anyone else facing this?\n\n\n\nEdit: Using the older Add HbGlz component (Jan 26 2016) seems to work, that is the glazing surfaces are now created and being displayed. However, I am now getting an error in the EnergyPlus component (\"Solution exception: need more than 7 values to unpack.\"). Tried using old and new glazing component, using one simple zone, changing my weather file, the error seems to be persistent.\n\n\n\nEdit2: Using the old E+ component seems to work.\n\n\n\nKind regards,\n\nTheodore.\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "July 3, 2016 at 10:30pm", "created_by": "TheodorosGalanos", "topic": "Issues with Add HbGlz Component after the update", "replies": [{"body": "\nUnits are in metres, in your file, and tolerance is not higher than 0.001?\n\nDid you build the window through a solid intersection? So you can be sure they actually touch.\n\nAre all surfaces planar? Sometimes it can appear they are, but aren't..\n\nm\n", "attachments": [], "created_by_name": "Max D", "created_at": "July 4, 2016 at 1:10am", "created_by": "ButWhyprecisely", "replies": [{"body": "\nHi Max,\n\n\n\nYes everything in the file seems to be in order. The surfaces are planar, since the old component is managing to create valid surfaces/zones out of them.\n\n\n\nI have to wonder if the update messed smth up in my installation.\n\n\n\nKind regards,\n\nTheodore.\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "July 4, 2016 at 1:15am", "created_by": "TheodorosGalanos", "replies": []}, {"body": "\nYea, I had the same issue the other day when auto-updating components after having pulled a first complete set from GitHub. It forced me to walk through the entuire defition step by step and replace the components manually that did not work anymore after the update. Auto-updating the components messed up quite a lot- but glad to see replacing fixed it for you, too!\n\nBest,\n\nMax\n", "attachments": [], "created_by_name": "Max D", "created_at": "July 4, 2016 at 6:55am", "created_by": "ButWhyprecisely", "replies": []}]}]}