{"body": "\nHi everyone,\n\nI want to optimize the space with Galapagos. I progress to the simulation stage, but I had a problem about the fitness Galapagos and I don't know what function should be connected to it to optimize the light according to dimension of window, angle,depth and number of shade.\n\nIf you guide me, I will be grateful.\n\nthanks.\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1559205", "name": "Energy_Shade.gh"}], "created_by_name": "parisa", "created_at": "July 2, 2016 at 4:48pm", "created_by": "parisa486", "topic": "problem with galapagos in daylight simulation", "replies": [{"body": "\nHi Parisa,\n\n\n\nIt really depends on what you are optimizing. The way you have developed your definition I would say that either shade helpfulness (maximize) or shade harmfulness (minimize) can be linked into Galapagos. It will then go through iterations to find out which assembly maximizes or minimizes the fitness.\n\n\n\nI would have to note however, that in single parameter optimization you tend to get expected results. A more useful analysis should include a combination of conflicting criteria, e.g. daylight availability and energy consumption.\n\n\n\nKind regards,\n\nTheodore.\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "July 4, 2016 at 9:50pm", "created_by": "TheodorosGalanos", "replies": [{"body": "\nHi Theodore,\n\nThank you for your answer. I want to desirable the level of daylight enter into the space without eye suffering according to dimension of window and specification of shade.\n\nI don't know what component should be connected to the fitness that will be minimized or maximized.\n\nwould you mind checking the attached file and do this?\n\nthanks,\n\n\n", "attachments": [], "created_by_name": "parisa", "created_at": "July 6, 2016 at 3:17am", "created_by": "parisa486", "replies": []}, {"body": "\n1. Did you try to run a couple of cases and make sure that the model works fine (e.g. the results change as expected.)\n\n2. If your question is in specific about the algorithm type to use you should send  this question to Galapagos group.\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "July 11, 2016 at 11:24am", "created_by": "MostaphaSadeghipour", "replies": []}]}]}