{"body": "\nHi everyone I'm having a strange problem with my daylighting simulations where the black screen disappears quickly and simulation fails although I have no errors in my components. Any ideas what could be wrong?\n\n\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/BbpUbJLkNV3MxCSqx6Kl5So7OpO2uJ5IsZ1YW8MZViHqkQrHocqQOiNHYvURn49-UwCnx7O6X4A7*GjLa45t73ZMOCVbLHwK/Canvasat124232.png?width=750\" width=\"750\"/>](http://api.ning.com:80/files/BbpUbJLkNV3MxCSqx6Kl5So7OpO2uJ5IsZ1YW8MZViHqkQrHocqQOiNHYvURn49-UwCnx7O6X4A7*GjLa45t73ZMOCVbLHwK/Canvasat124232.png)\n\n\n\n\n", "attachments": [], "created_by_name": "Ninja", "created_at": "July 1, 2016 at 11:42am", "created_by": "RaniaLabib", "topic": "Daylighting black Dos screen disappears quickly and simulations fails", "replies": [{"body": "\nUpdate: Image based simulation is running fine. I have the same problem with DIVA where image based simulations are running with no problems but annual simulations are not running. I started to think it has something to do with Daysim or Rhino installation? any ideas?\n", "attachments": [], "created_by_name": "Ninja", "created_at": "July 1, 2016 at 9:22pm", "created_by": "RaniaLabib", "replies": [{"body": "\nComing from a DIVA perspective here where I run most of my daylight, but I assume HBEE does it pretty much the same way - navigate to your project folder, find the batch file that launches the annual Daysim simulations, open it and add \"@pause\" to the batch file, last line. Save and run it again (by double clicking it straight in the folder, not through HBEE) - it will now not disappear once it fails, and you can read the error message. Then let us know what it says?\n\nBest,\n\nMax\n", "attachments": [], "created_by_name": "Max D", "created_at": "July 3, 2016 at 8:49am", "created_by": "ButWhyprecisely", "replies": []}, {"body": "\nHi Max,\n\nI uninstalled Daysim 4 and installed Daysim 3. This fixed the problem! Thanks for your help though!\n", "attachments": [], "created_by_name": "Ninja", "created_at": "July 3, 2016 at 6:45pm", "created_by": "RaniaLabib", "replies": []}, {"body": "\nOk, sounds to me then like that PATH variable was not set correctly, and the reinstall fixed that. In theory, I don't think DS 3 vs 4 should make a difference.\n\nBest,\n\nMax\n", "attachments": [], "created_by_name": "Max D", "created_at": "July 4, 2016 at 6:53am", "created_by": "ButWhyprecisely", "replies": []}]}]}