{"body": "\nHello everybody, I am quite new to energyplus and I decided to try it with for a study I am doing for a pedestrian bridge.\n\nI prepared the results and in first pace they made sense to me but looking at the air flows per area I realised there is something wrong, It look like energy plus has trouble with air wall as external wall as showed in the picture.\n\nI am not too sure how to set  natural ventilation as the windows in this example are closed and the air is coming only from the \"holes\" where the stairs are.\n\nDoes anybody has any idea? I attach the file for reference.\n\nThanks\n\nAmedeo\n\n\n\n\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1570869", "name": "elevetated pedestrian passage.gh"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1570870", "name": "Picture13.png"}], "created_by_name": "amedeo scofone", "created_at": "July 25, 2016 at 10:01am", "created_by": "amedeoscofone", "topic": "Natural ventilation of an open structure", "replies": [{"body": "\nHello everybody\n\nMaybe I can make I can make an easier question, how can I open few windows in different zones and not all of them to test natural ventilation?\n\nThanks\n", "attachments": [], "created_by_name": "amedeo scofone", "created_at": "July 26, 2016 at 3:29am", "created_by": "amedeoscofone", "replies": [{"body": "\nAmedeo,\n\n\n\nI apologize that you are getting such a late response.  Your observation that air walls are only intended for interior walls is correct.  Auto-calculating the airflow rates that you would get with exterior air walls is far too complex a task that is potentially fraught with dangerous assumptions.  However, if you have a sense of how that air will flow across the air wall and there will not be much inter-zone buoyancy driven flow, you can model the airflow with the custom ventilation option in the \"Set EP Airflow\" component that you see in this example:\n\n[http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;for...](http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;fork=hydra_2&amp;id=Natural_Ventilation&amp;slide=0&amp;scale=1&amp;offset=0,0)\n\n\n\nAssuming that there will be no wind-driven cross ventilation and that all ventilation is single-sided buoyancy-driven flow, you should set the wind discharge coefficient to 0 and the stack discharge coefficient to \"0.25 - For bouyancy with ONE window with NO insect screen.\"\n\nThe height input is the height of the opening and the effective area is the area of the opening.  Since some of you openings are triangular, you may want to decrease the height slightly from the total height to better account for the fact that you do not have equal areas on top and bottom of the opening.\n\n\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "August 2, 2016 at 9:08pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nThanks Chris,\n\nReally appreciated!\n\nAmedeo\n\n\n", "attachments": [], "created_by_name": "amedeo scofone", "created_at": "August 4, 2016 at 2:59am", "created_by": "amedeoscofone", "replies": []}]}]}