{"body": "\nHappy Monday! I would like to create custom bldgPrograms I can attach to models using Honeybee_bldgPrograms. Tips on how to build out a library of custom programs with custom schedules and intensities? Many thanks.\n", "attachments": [], "created_by_name": "Arpan Bakshi", "created_at": "August 1, 2016 at 8:45am", "created_by": "ArpanBakshi", "topic": "Custom bldgPrograms", "replies": [{"body": "\nHi Arpan,\n\n\n\nI apologize for the late response.  To be honest, we coded the present version of Honeybee in a manner that is not too friendly to the insertion of new building programs and this is something that we intend to make better in the [revision of honeybee that is currently happening and the new Honeyb...](https://github.com/ladybug-analysis-tools/honeybee/issues/75).  This is not to say that you could not add new building programs in the present Honeybee.  Just that it would be difficult and you might have better progress with an alternative method until the new API is ready.\n\n\n\nAs such, it is probably most helpful for me to explain how to create/assign a new building program with as few components as possible.  All building programs are essentially defined only by schedules and loads.  Therefore, you can effectively change the program of any HBzone with just 2 Honeybee components: \"Honeybee_Set EnergyPlus Zone Loads\" and \"Honeybee_Set EnergyPlus Zone Schedules\".\n\n\n\nThe loads are straightforward to set if you know them and it is usually the definition of schedules which is more difficult.  This said, you will get a lot of help with generating new schedules thanks to the \"Honeybee_Annual Schedule\" component and the \"Honeybee_Daily Schedule\" that Antonello recently added to Honeybee.  Notably, these components output schedIDFText, which you can either internalize in a GH component and connect to the \"Honeybee_Add to EnergyPlus Library\" in any GH definition and you will have those schedules available without the need for the schedule generating component.  Alternatively, you can copy/paste the schedIDFText into the userCustomEPLibrar.idf to have it automatically available whenever you load up Honeybee.  In this way, all that you have to do is plug the name of the schedule into the \"Honeybee_Set EnergyPlus Zone Schedules\" component without a ton of schedule-generating components in everyone's definitions.\n\n\n\nAntonello has an [example file](http://hydrashare.github.io/hydra/viewer?owner=AntonelloDN&amp;fork=hydra&amp;id=Honeybee_Schedules_Creation&amp;slide=0&amp;scale=1&amp;offset=0,0) up for his components but it is a bit old at this point.\n\nI will post an example file tomorrow about how to use the schedIDFText since this has become a critical part of how I am defining new building programs in my office.\n\n\n\nHope this is enough to get you started.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "August 2, 2016 at 9:39pm", "created_by": "ChrisMackey", "replies": [{"body": "\nArpan,\n\nHere is the example file that I said I would post.  It shows how to make new schedules and package them for use in other GH files:\n\n[http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;for...](http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;fork=hydra_2&amp;id=Creating_Custom_Schedules&amp;slide=0&amp;scale=1&amp;offset=0,0)\n\nBy packaging the schedules as such, you can use this to build up new Building Program schedule templates.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "August 10, 2016 at 9:53pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nHi Arpan and Chris,\n\n\n\nI have updated the example file.\n\n[http://hydrashare.github.io/hydra/viewer?owner=AntonelloDN&amp;fork...](http://hydrashare.github.io/hydra/viewer?owner=AntonelloDN&amp;fork=hydra&amp;id=Honeybee_Schedules_Creation&amp;slide=0&amp;scale=1&amp;offset=0,0)\n\n\n\nArpan,\n\nIn this example file you can understand how to use the inputs of the schedule components. \n\nBasically, the first step is to create a daily schedule by using:\n\na)  HB daily schedule: this component let you transform a 'Grasshopper Gene Pool' into a list of 24 value (thus a daily schedule). This way is very fast especially with occupancy schedules.\n\nOR\n\nb) Native components of GH: for example 'duplicate data' component or by writing a list of 24 values manually.\n\n\n\nThe second step is to connect daily schedules to HB annual schedule.\n\nYou can choose if you want to include holidays in your schedule:\n\na) you can use the internal library of the component by using EPW file input, this option considers just national holidays (regional and local holidays are not considered)\n\nb) you can create your own holidays with the overwriteHolidays input\n\n\n\nI strongly suggest you take a look at Chris' examples where the schedule components are used\n\n\n\nBest\n\nAntonello\n\n\n", "attachments": [], "created_by_name": "Antonello Di Nunzio", "created_at": "August 11, 2016 at 2:57am", "created_by": "AntonelloDiNunzio", "replies": []}]}]}