{"body": "\nI ran a daylight simulation, created lightingSchedules from annualProfiles and passed the new HBZones to exportToOpenStudio. Error. This workflow works okay with the alternate runEP. GH attached. Looks like \"currently OpenStudio component cannot use .csv file as a schedule\". Looking into if anyone else has had this problem.\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1575868", "name": "EnergyModel.gh"}], "created_by_name": "Arpan Bakshi", "created_at": "August 3, 2016 at 10:23am", "created_by": "ArpanBakshi", "topic": "Daylight schedules in OpenStudio error", "replies": [{"body": "\nArpan,\n\n\n\nThe current OpenStudio component can take csv schedules and they are being taken into account in the simulation.  The old OpenStudio component from the last stable release could not do this and would give you that message.\n\n\n\nThe current OpenStudio component will give a printed message when you have CSV schedules in the simulation.  This message says:\n\n\"The schedule will be written into the EnergyPlus IDF File after it has been written by decompressing the OS file.\"\n\nThis is because the OpenStudio interface currently does not support CSV schedules even though Honeybee does.  So, if you open your OSM file in OpenStudio and simulate your file within the OpenStudio interface, the CSVs will not be taken into account.  However, simulating by hitting the runSimulation_ Boolean on the OpenStudio component will make sure they are accounted for.\n\n\n\nIf this does not describe what you are expereincing, please upload a smaller GH file and csv file that shows just the error.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "August 3, 2016 at 12:18pm", "created_by": "ChrisMackey", "replies": [{"body": "\nI have worked around this before by scripting a schedule component into the User Library (UL) IDF: the component was of the schedule:file type. In the same GH script,  I:\n\n1) injected the e+ schedule:file component into the UL IDF\n\n2) used honeybee to call the schedule from the honeybee library (which includes whatever is in that UL IDF).\n\n3) called the runOS HB component\n\n\n\nThe IDF that was generated (and run) by OpenStudio studio referred to my external CSV file (which was generated elsewhere). By George it worked.\n\nI haven't yet been successful with the standard HB CSV schedule functionality, even with the current version of the OS component (with the aforementioned OS/E+/IDF do si do...clever trick). Although I'm very possibly wrong, I think it didn't work because of the component type I was driving with the schedule (blinds).\n", "attachments": [], "created_by_name": "Nick Novelli", "created_at": "August 3, 2016 at 12:30pm", "created_by": "NickNovelli", "replies": []}, {"body": "\nArpan and Nick,\n\n\n\nAfter realizing that this could be an issue for many of us, I checked the lengthy GH file and found a bug in my \"Do Si Do\" method.  I got distracted by the quote \"currently OpenStudio component cannot use .csv file as a schedule\" thinking that an older version of the component was being used since this warning does not exist in the current version.  The bug only affected cases where you had many CSV schedules all with the same Type Limits.\n\n\n\nI have fixed it as you can see here:\n\n[https://github.com/mostaphaRoudsari/Honeybee/commit/9c229b2969da6e0...](https://github.com/mostaphaRoudsari/Honeybee/commit/9c229b2969da6e0ede04befc2c2f846303c99e17)\n\n\n\nThe attached file runs without issues.  Thanks for reporting this, Arpan, and let me know, Nick, if you get the chance to try out the new Do Si Do method.  Your UL method is probably the most clever application of the UL library I have yet seen!\n\n\n\n-Chris\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1575901", "name": "EnergyModel_FIXED.gh"}], "created_by_name": "Chris Mackey", "created_at": "August 3, 2016 at 1:29pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nThank you Nick and Chris. (I will attached a smaller GH file next time!) I know I'm asking many questions this week .. when you fix something on github, and users use the Honeybee_Update Honeybee component, the fixed component auto-updates in GH?\n", "attachments": [], "created_by_name": "Arpan Bakshi", "created_at": "August 4, 2016 at 2:17am", "created_by": "ArpanBakshi", "replies": []}, {"body": "\nArpan,\n\nThey are good questions.\n\nYes, the \"Update Honyebee\" or \"Update Ladybug\" components automatically sync your components with the fixed versions on the github if you are connected to the internet.\n\nIf you use the _updateAllUObjects option on the \"Update Honyebee\" or \"Update Ladybug\" components, this updates all components in your Ladybug/Honeybee toolbar and when you drag/drop the new component on the canvass.\n\nIf you use the updateThisFile_ option on the \"Update Honyebee\" or \"Update Ladybug\" components, you can update your whole GH file to the same version at once but be warned that it does not work for all components.  In the case that we have changed the names of the inputs/outputs or added inputs/outputs, you will have to replace the component manually (dragging them onto the canvass as it sounds like you did here).\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "August 4, 2016 at 7:27am", "created_by": "ChrisMackey", "replies": []}]}], "id": "1575869"}