{"body": "\nHello everyone,\n\n\n\nI'm going to calculate annual glare for 100 Rhino views. I would like to create 100 batch file so I can run them parallel on a server that has 128 CPUs. I have two questions:\n\n\n\n1- What is the best way to create 100 batch files, one for each view?\n\nThe only thing I can think of is to create a list of the names of my views and connect it to \"list item component\" then animate the item index slider. However, each time the slider moves simulation starts then I close the Dos window to get a batch file, this means I have to close 100 windows (one at a time). Is there any way Honeybee can write batch files without running simulations.\n\n\n\n2- I read somewhere that Radiance uses 1 processor, Does this means that I can run all 100 batch files simultaneously on a server that has at least 100 CPUs and get results in a speedy manner? \n\n\n\nThanks\n\nRania\n\n\n", "attachments": [], "created_by_name": "Ninja", "created_at": "August 3, 2016 at 8:55pm", "created_by": "RaniaLabib", "topic": "Create multiple batch files so I can run them parallel on a 128-processor server", "replies": [{"body": "\nRaina,\n\n\n\nYou ask this question at a good time as Mostapha and I are in the process of making the components more amenable to applications such as this.  Whatever the final workflow we end up suggesting, I am confident that it will involve setting up sliders to run through design spaces for cases like yours.  So setting up the slider and a list of views should be relevant to your situation no matter what.\n\nAnimation of sliders works but you can also use the \"Fly\" component to run through all of the combinations of multiple sliders.\n\nI think we will add in an option soon to run energy / daylight simulation components all of the way to generate all files (possibly including batch files) but just not execute them.  This way, you don't have to close out of the window each time.\n\nWe will also write something to execute all of the files for you but this part may vary depending on the parallel processing platform used.  In any case, your logic about 100 batch files on a 100 CPU computer makes sense as long as the operating system of this computer knows to run each batch file on a separate thread (which I imagine it does but I haven't worked too much with supercomputers yet).\n\n\n\nStay tuned and I will let you know when we add in the option to generate all files from the simulation components.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "August 4, 2016 at 7:21am", "created_by": "ChrisMackey", "replies": [{"body": "\nNot sure if this is an idea but the mpi platform has commands like bind-to-core and by-socket, which bind processes to specific cores. I know it's used in CFD studies, could be used here as well(?)\n\n\n\nKind regards,\n\nTheodore.\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "August 5, 2016 at 6:51am", "created_by": "TheodorosGalanos", "replies": []}, {"body": "\nTheodoros,\n\nI never used supercomputers before, this is my first time! I'll look into these commands, I think these commands will be extremely helpful in my situation.\n\nThanks for the help. \n\nBest,\n\nRania\n", "attachments": [], "created_by_name": "Ninja", "created_at": "August 5, 2016 at 12:18pm", "created_by": "RaniaLabib", "replies": []}, {"body": "\nChris,\n\nThis is great, parallel processing is crucial when you need to perform hundreds of simulations. I'll stay stunned! \n\nFor the time being, I'll just close 100 pop-up windows manually. \n\n\n\nBest,\n\nRania\n\n\n", "attachments": [], "created_by_name": "Ninja", "created_at": "August 5, 2016 at 12:14pm", "created_by": "RaniaLabib", "replies": []}, {"body": "\nJust a note about Theodore's parallel processing suggestion: because the parallel processing of the daylight studies is so simple (it's literally just one core per simulation), I don't think that you should have to use those commands.  These commands seem very relevant to CFD parallel processing, however, since you often need the cores to talk to one another when running parallel CFD studies.  As such, overriding the default tendency to run everything on one or a few cores for the CFD seems to be necessary.\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "August 6, 2016 at 11:10am", "created_by": "ChrisMackey", "replies": []}, {"body": "\nChris, thanks for the note. I'm still trying different  things and preparing the batch files before I start working on the server. I'll definitely keep you updated. \n\nJust a quick question, Are the batch file created right after the DOS window appear ok to use? in another word are the contents of the batch files created in the beginning of simulations stay the same after simulations are done?. I'm planning to close the pop-up dos windows as soon as they appear and I'm not sure if the batch files being written are valid to run later.\n", "attachments": [], "created_by_name": "Ninja", "created_at": "August 7, 2016 at 11:00am", "created_by": "RaniaLabib", "replies": []}, {"body": "\nRania,\n\nBatch files are the same both before and after the simulation.  Closing the window will not change the batch file.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "August 7, 2016 at 12:21pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nHi Chris,\n\n\n\nHow does this discussion relate to the up and coming connection with parallel works?\n", "attachments": [], "created_by_name": "Anton Szilasi", "created_at": "August 8, 2016 at 9:38am", "created_by": "AntonSzilasi", "replies": []}, {"body": "\nAwsome! thanks.\n", "attachments": [], "created_by_name": "Ninja", "created_at": "August 10, 2016 at 8:16pm", "created_by": "RaniaLabib", "replies": []}]}, {"body": "\nI just wanted to share my experience performing 400 annual glare analysis on a monster 128-CPU server. So here it goes\n\n1- The server is based on Amazon's EC2 service. The server has 128 V-CPUs and 1.9 TB of RAM.  I think I'm going to start a GoFundMe campaign to buy one for myself :)\n\n2- The server's cost is about $13 an hour. I get free access to supercomputer through my university and xsede.org because I earned an NSF Honorable mention last March, however, the supercomputers available through both resources are a little complicated for me to use, as opposed to the one available from amazon that has Microsoft server 2012 already installed.\n\n3- I wanted to run 400 annual glare simulations for 400 different views. \n\n4- I tried a to perform annual glare simulation for one view on my Dell XPS that has Intel Core i7-6700HQ processor and 16GB of system memory. The simulation took 2 hours to complete. Radiance parameter ab was set to 6. \n\n5- I wanted to obtain the batch file for each view so I can run them on the server. So I used the fly component to run all 400 simulations and closed the cmd windows, that wasn't bad ( for me at least) because I asked my son to this job for me, he was just glad to help me :)\n\n6- I created one batch file using this cmd command:\n\ndir /s /b *.bat &gt; runall.bat\n\nThis created a file with the path to each .bat file. I edited this file in Notepad++ to include the word \"start\" at the beginning of each line. This was done using the \"find and replace\" dialogue box.\n\n 7- I split my newly created batch file into 3 batch files, each one has about 130 file names and \" start\" before the file names.\n\n8- installed radiance on my server\n\n9- Ran the first batch file on the server, this started 130 cmd windows performing my simulations, CPU usage was anywhere between 90% to 100%  and about 105 GB of RAMs were used.\n\n10. It took about 5 hours to complete all 130 simulations, I expected to run all in 2 hours but can't complain because this would've taken about 260 hours to run on my laptop. After the simulations done I ran the second and then the third batch files ( total of about 15 hours). \n\n11. I got 400 valid dgb files. Couldn't be happier! \n\n\n\n\n\n\n\n\n\n\n\n \n", "attachments": [], "created_by_name": "Ninja", "created_at": "August 10, 2016 at 8:54pm", "created_by": "RaniaLabib", "replies": [{"body": "\nHi Rania, Congrats! Thank you for sharing your experience. Made me smile! At the same time, it confirms that we really need to cloud-enable Honeybee to let users such as you explore computationally intense stuff without having to close 400 batch files manually. Good luck with your research.\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "August 11, 2016 at 8:07am", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nWoohoo!  Very exciting, Rania!  Thank you so much for sharing. We will definitely start putting in some capabilities to make it easier for running cloud simulations like this.\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "August 11, 2016 at 11:10am", "created_by": "ChrisMackey", "replies": []}]}], "id": "1576412"}