{"body": "\nHi,\n\nJust wonder whether some components were faded out or just missing in the last github packages:\n\nHoneybee_FileExplorer\n\nLadybug_Wh2kWh\n\nLadybug_Pedestrian Wind Comfort\n\nUsually i drop the package in the UserObjects directory, so i noticed the change.\n\nI particularly find the FileExplorer useful, so, if possible please restore it.\n\nI use less the other 2 (if at all), but maybe other users do.\n\nThanks,\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "August 7, 2016 at 12:49am", "created_by": "AbrahamYezioro", "topic": "Faded out or missing components?", "replies": [{"body": "", "attachments": [], "created_by_name": "Sarith Subramaniam", "created_at": "August 7, 2016 at 1:07am", "created_by": "sarith", "replies": [{"body": "\nThanks Sarith!!\n\nMy bad not to look better.\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "August 7, 2016 at 3:20am", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nAbraham,\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "August 7, 2016 at 8:08am", "created_by": "ChrisMackey", "replies": []}, {"body": "\nAh, gosh.  Sorry.  Everyone is watching the Olympics now and this is making the internet move very slowly.  The GH site just lost my whole reply to you because of the bad connection.  I'll try to reproduce it below. Here are the main points:\n\n\n\n1) A number of components have moved out of WIP now so, if you don't see them initially, look for them by searching.\n\n\n\n2) I took out the Wh2kWh because it literally doesn't do anything except multiply data by 1000, which is something that users can do themselves with the native GH multiplication component or they can do in their heads.  We have a lot of unit conversion components now and I would rather use the available space for truly useful conversions (like those between SI and IP).\n\n\n\n3) Djordje never sent a pull request for the pedestrian wind comfort component because we got lost in a debate about whether we could include it in Butterfly.  I realized eventually that it should be in LB for the time being and I sent him a reminder here:\n\n[https://github.com/mostaphaRoudsari/ladybug/issues/266](https://github.com/mostaphaRoudsari/ladybug/issues/266)\n\nHopefully, he should send a pull request in the next couple of days.\n\n\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "August 7, 2016 at 8:20am", "created_by": "ChrisMackey", "replies": []}, {"body": "\nThanks Chris. This is annoying when it happens ... (loosing the reply). When the response is long i usually copy it , just in case ... :-)\n\nAs i said i normally download the github package and drop all of it in the UserLibrary. Then i see what items were changed and what wasn't. In this way i noticed the ones i mentioned.\n\nThe last 2 i've not used before, so no particular interest for me. The first one, i do use. I didn't check that the name changed. So sorry for calling this alarm.\n\nThanks again,\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "August 7, 2016 at 8:44am", "created_by": "AbrahamYezioro", "replies": []}]}]}