{"body": "\nUsually the 3D chart is plotted for an output variable by thermal zone or surface.\n\n\n\nMay I ask if there is a way to merge the hourly data across all zones to create just one single 3D chart for the entire building for variable such as cooling or heating?\n\n\n\nThanks!\n", "attachments": [], "created_by_name": "Grasshope", "created_at": "August 12, 2016 at 11:58am", "created_by": "Grasshope", "topic": "how to create a 3D chart for an output variable for the entire building rather than by zone?", "replies": [{"body": "\nGrasshope,\n\nThis is effectively what the new floor normalization components were meant to help with:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/S0N-*JsmWMlnwwpXgisLiraoo6S*jaJ2eHus737282*a1rdEH2naCfy8CT2pw8ryuljC00Tjc*IBxsU2p7TS-lS8nn0uIumD/HourlyCharts.JPG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/S0N-*JsmWMlnwwpXgisLiraoo6S*jaJ2eHus737282*a1rdEH2naCfy8CT2pw8ryuljC00Tjc*IBxsU2p7TS-lS8nn0uIumD/HourlyCharts.JPG)\n\nSee example file attached!\n\n-Chris\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1580962", "name": "Hourly EnergyUse.gh"}], "created_by_name": "Chris Mackey", "created_at": "August 12, 2016 at 9:52pm", "created_by": "ChrisMackey", "replies": [{"body": "\nThank you, Chris!\n\n\n\nGood to know that the normaliztion component can help to plot **hourly EUI** for the entire building or all individual zones for each of the energy related output variables!\n\n\n\nMay I ask if there is a way to plot **hourly EUI** for the entire building or individual zones by merging all energy consumption related output variables or a few selected ones? i.e. not one chart for one variable.\n\n\n\nI also noticed that in your demo file, the VAV HVAC system is selected, and the outputs don't include totalThermalLoads and thermalLoadBalance, which are included if Ideal Loads Air System is specified. May I ask why there is such a difference? \n\n\n\nThank you!\n\n\n\nOutput variables when VAV HVAC is specified:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/S0N-*JsmWMlNMQJbBvT99ImNjmBA15tzHBkswKZFYIitKH8OLicR0-czgaxWUA3CaLzn5Q9P1rjMV*RDdPnhgK6fpXahDEQO/Image3.png?width=721\" width=\"721\"/>](http://api.ning.com:80/files/S0N-*JsmWMlNMQJbBvT99ImNjmBA15tzHBkswKZFYIitKH8OLicR0-czgaxWUA3CaLzn5Q9P1rjMV*RDdPnhgK6fpXahDEQO/Image3.png)\n\nOutput variables when Ideal loads air system is specified:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/S0N-*JsmWMnkC4IEy8BnhJizw5Fu24kNioZAynq3xUg0U*Dc4sKBcLK*eZiXpeDP9iSRfkp7A07DpVcNW2-dJLfWQJlEPgKs/Image1.png?width=721\" width=\"721\"/>](http://api.ning.com:80/files/S0N-*JsmWMnkC4IEy8BnhJizw5Fu24kNioZAynq3xUg0U*Dc4sKBcLK*eZiXpeDP9iSRfkp7A07DpVcNW2-dJLfWQJlEPgKs/Image1.png)\n\n\n", "attachments": [], "created_by_name": "Grasshope", "created_at": "August 12, 2016 at 11:33pm", "created_by": "Grasshope", "replies": []}, {"body": "\nGrasshope,\n\n\n\nYou can get hourly EUI values buy simply adding in two more Native GH components:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/KDXu4vtJnMnV41lhOcEi2vAWAhWgIhVqCB6PrAOm05HUMraIND0eHo14QrIU8ut2vkJ76Hr9IwFpyNqH0UtVynLhbxSZw-*a/HourlySiteEUI.JPG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/KDXu4vtJnMnV41lhOcEi2vAWAhWgIhVqCB6PrAOm05HUMraIND0eHo14QrIU8ut2vkJ76Hr9IwFpyNqH0UtVynLhbxSZw-*a/HourlySiteEUI.JPG)\n\n\n\nHowever, I just want to be clear that I have not built in automated capabilities to get EUI numbers because I don't agree with the practice of using site EUI as a metric to evaluate the thermodynamic performance, environmental impact, or monetary value of a building.  I disagree with this practice for the same reason that there are no \"totalThermalLoad\" and \"thermalLoadBalance\" for simulations run with full HVAC.  I can summarize these reasons in the following way:\n\n\n\nWhen we run a simulation with ideal air loads, the heating/cooling values we get are THERMAL ENERGY that is directly added to or removed from the zone.  In this way, we can draw a rough parallel between these two types of energy since they are are generally of a similar type and quality.  As such, I am ok with adding them together to get total thermal load or subtracting them to get a sense of thermal load balance.\n\n\n\nHowever, when we run a simulation will full HVAC, the heating/cooling values that we get are usually HEATING FUEL ENERGY and ELECTRICITY respectively.  Fuel energy and electricity are fundamentally two different types and qualities of energy.  To cite the second law of thermodynamics, the exergy (or the capacity to do work) of electricity is much greater than that of fuel.  This is evident in the fact that, to produce a given unit of electricity, I often have to burn at least 3 units of fuel energy (though this can be much more for inefficient plants).  With each step in a power plant - making steam, turning a turbine, turning a generator - there are significant energy losses.  This difference in exergy is also evident in the fact that there are so many more things that I can do directly with a unit of electricity than I can do with the same unit of fuel energy.  I can use electricity to directly refrigerate, produce light energy or power a motor just as easily as I can use to to cook, produce hot water, or heat a space.  While I can cook, make hot water, or heat a space directly with fuel energy, refrigeration and lighting are much more difficult.  For this reason, I do not feel comfortable adding electricity and fuel together either in the totalThermalLoad output or in a site EUI metric.\n\n\n\nStill, the use of site EUI has become so ingrained in the industry that I have to acknowledge it and at least show users how it's calculated.  In my view, it's an ad-hoc metric that was invented to deal with previously limited amount of information on energy sources.\n\n\n\nInstead of using site EUI, I would recommend using the following metrics depending on what you are trying to evaluate:\n\n**Utility Cost / Square Meter** - to measure the monetary value of a building to an owner or user\n\n**Kg CO2 / Square Meter** - to measure the environmental and climatic impact of a building\n\n**Emergy / Square Meter** - to measure the overall thermodynamic performance of a building\n\n\n\nThe first two are actually fairly easy to calculate these days just by researching your site's utility rates or grid energy mixture and multiplying the building electricity or fuel by their respective rates.  I will add in some capabilities to Honeybee soon to make it even easier for you to get these values from your EPW file and databases of utility rates/grid mixture.  Emergy is much harder to calculate as you have to trace all your energy sources all of the way back to the sun but there are a number of experts at work to make this calculation possible (probably in the next few years, we may have much easier ways to calculate it).\n\n\n\nHope this helps explain the current setup.\n\n-Chris\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1581318", "name": "Hourly EUI.gh"}], "created_by_name": "Chris Mackey", "created_at": "August 13, 2016 at 3:01pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nDear Chris,\n\n\n\nThank you very much for the detailed clarification!\n\n\n\nI agree that Ideal Loads Air System is useful in estimating cooling and heating loads, and help to identify problematic areas in the design that may need to be improved. When comes to estimating energy consumption, the COP of the HVAC system needs to be taken into account. And with the implementation of a realistic full HVAC, definitely the source energy may also need to be analyzed that considers the various types of energy used to generate the site energy.\n\n\n\nThe three building level performance metrics you suggested to evaluate the impact of building design are surely very important.\n\n\n\nAlso thanks for sharing the hourly EUI workflow!\n\n\n\nOne more question is how to aggregate zone level of data. Eg. how to get total electricity for lights and equipment for each zone, monthly or yearly?\n\n\n\nI tried the following workflow using your hourly EUI demo file, but the color legend doesn't seem to recognize the name of zone, probably due to the use of the create LB header component.\n\n\n\nWould you suggest other way to aggregate multiple variables for each zone?\n\n<br/>Thanks!\n\n\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/2KO5TIlF0st2OUSxnrGMKZHWwsq6StJwWcFBksVLUC5p2oKMg1Bz-YSHmoFHa1Ita1du3TB9cih9hoXasgYQoXa3lUwf2fPU/Image10.png?width=721\" width=\"721\"/>](http://api.ning.com:80/files/2KO5TIlF0st2OUSxnrGMKZHWwsq6StJwWcFBksVLUC5p2oKMg1Bz-YSHmoFHa1Ita1du3TB9cih9hoXasgYQoXa3lUwf2fPU/Image10.png)[<img class=\"align-full\" src=\"http://api.ning.com:80/files/2KO5TIlF0ss98mZ6okSM*6qV2iU8DZprUblc-IZGO-VhziP5g40K6EEgDQU4UTftnKtGgl8iB3UVbpA4Ta-mwxLxbNLMCs-u/Image9.png?width=721\" width=\"721\"/>](http://api.ning.com:80/files/2KO5TIlF0ss98mZ6okSM*6qV2iU8DZprUblc-IZGO-VhziP5g40K6EEgDQU4UTftnKtGgl8iB3UVbpA4Ta-mwxLxbNLMCs-u/Image9.png)\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1581280", "name": "HourlyEUI _ZJ.gh"}], "created_by_name": "Grasshope", "created_at": "August 14, 2016 at 4:19am", "created_by": "Grasshope", "replies": []}, {"body": "\n... OK, maybe the following workflow seems to be able to produce zone level aggregated value for multiple variables. The get HB zone name component is used to compile the dataType str for the header:\n\n\n\nAppreciate if you can share alternative method to do this!\n\n\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/2KO5TIlF0strglT6SaPGe-qpLXZlRrbSppMfgaSiHFTdm6MT1o5uvxCLVe-jlwDhbugTVkCnONd3u5Xe7JP8S5C4kNCTqPuc/Image11.png?width=721\" width=\"721\"/>](http://api.ning.com:80/files/2KO5TIlF0strglT6SaPGe-qpLXZlRrbSppMfgaSiHFTdm6MT1o5uvxCLVe-jlwDhbugTVkCnONd3u5Xe7JP8S5C4kNCTqPuc/Image11.png)[<img class=\"align-full\" src=\"http://api.ning.com:80/files/2KO5TIlF0stAF2bbBTwSmB7i0hA8MGeOxQL1SkKzBbM0zcRLnEYjLDT1858In5wQmFsKW4lWAQ8zYfiUfD5-VNG-CB7vCPbT/Image12.png?width=721\" width=\"721\"/>](http://api.ning.com:80/files/2KO5TIlF0stAF2bbBTwSmB7i0hA8MGeOxQL1SkKzBbM0zcRLnEYjLDT1858In5wQmFsKW4lWAQ8zYfiUfD5-VNG-CB7vCPbT/Image12.png)\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1581377", "name": "HourlyEUI _ZJ2.gh"}], "created_by_name": "Grasshope", "created_at": "August 14, 2016 at 4:32am", "created_by": "Grasshope", "replies": []}, {"body": "", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "August 16, 2016 at 11:18am", "created_by": "ChrisMackey", "replies": []}]}], "id": "1580605"}