{"body": "\nHi all,\n\nI am trying to run an outdoor comfort simulation using LB/HB. I would like to assess the effect on thermal comfort of different pavement materials in a public square. I know that the material would affect the Mean Radiant Temperature but I do not know how to calculate the MRT in this case. <br/>My questions are:\n\n- How to estimate the hourly radiant temperature of each part of the square and the surrounding buildings? Can this be done using the Energy+ and Honeybee?\n\n- What temperature should I consider for the sky?\n\nThanks in advance,\n\nAlejandro\n", "attachments": [], "created_by_name": "Alejandro Pacheco Diéguez", "created_at": "August 18, 2016 at 9:22am", "created_by": "3ahr35r8m5dl1", "topic": "How to calculate outdoor Mean Radiant Temperature using Ladybug/Honeybee", "replies": [{"body": "\nAlejandro,\n\nHoneybee can estimate the effects of the pavement but it can only be done with the comfort maps and Honeybee EnergyPlus simulation right now (unless you already know what surface temperature that your pavement produces).  This shows you a simple example of the comfort maps in the outdoors:\n\n[http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;for...](http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;fork=hydra_2&amp;id=Trees_in_Outdoor_Thermal_Comfort&amp;slide=0&amp;scale=1&amp;offset=0,0)\n\nYou want to edit the soilType on the ground zone component or make a custom HBZone with your paving material as a roof.\n\nHere is a more advanced file with buildings:\n\n[http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;for...](http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;fork=hydra_2&amp;id=Outdoor_Microclimate_Map&amp;slide=0&amp;scale=1&amp;offset=0,0)\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "August 18, 2016 at 10:28am", "created_by": "ChrisMackey", "replies": [{"body": "\nThank you so much Chris! It's just what I needed.\n", "attachments": [], "created_by_name": "Alejandro Pacheco Diéguez", "created_at": "August 19, 2016 at 5:35am", "created_by": "3ahr35r8m5dl1", "replies": []}, {"body": "\nHi again,\n\nI am working with the example scripts sent above to produce a microclimate map and I have some questions:\n\n1- Is the effect of direct sun considered to calculate the surface temperature of the terrain and the surrounding buildings?\n\n2- It seems like the surface temperature of the terrain is only one for the whole top surface, that is, it does not differentiate between areas that are shaded and areas that are exposed to sun. Is this so? I guess that is is quite different being next to a ground that has been exposed to hours of sunlight or next to one that has been shaded, right?\n\nThanks in advance,\n\nAlejandro\n", "attachments": [], "created_by_name": "Alejandro Pacheco Diéguez", "created_at": "November 2, 2016 at 9:56am", "created_by": "3ahr35r8m5dl1", "replies": []}, {"body": "\nAlejandro,\n\n\n\nSorry for the late response. To answer your questions:\n\n\n\n1. Yes, the two examples that I posted here consider the effect of sun/shade on the outdoor surface temperaturess through the EnergyPlus/ OpenStudio simulation. EnergyPlus computes the percentage of each surface that sees the sun at the different hours of the day and factors this into a dynamic energy balance calculation. Any context or zone geometry will block the sun to surfaces in the EnergyPlus calculation. However, you should note that surface temperatures will only be computed for zone geometries.\n\n\n\n2. If you break up the roof of the ground zone into multiple surfaces, you will get separate temperature results for each surface. This allows you to account for the thermal diversity of different areas in sun/shade. The more surfaces that you break up the roof into, the more accurate your simulation and the longer your calculation time.  You will see that both examples that I have posted involve breaking up the roof of the ground zone into multiple surfaces.\n\n\n\nFinally, I see that you asked about sky temperature in your original question and you should know that this will automatically be computed in the comfort maps using the shortwave and longwave radiation in the EPW file.\n\n\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "November 5, 2016 at 5:21am", "created_by": "ChrisMackey", "replies": []}, {"body": "\nThank you Chris, \n\nYet another question. I would like to add other two factors to the microclimate simulation: local wind speed and evapotranspiration from plants. Is it possible?\n\n1- Local wind speed: I heard that you are working on the integration of Butterfly with HB/LB to include the effect of local wind speed to evaluate microclimate. Have you already produced any examples on this? If so, it would be very useful. \n\nThe way I am working with this right now is exporting the wind simulation results from another software (Autodesk CFD) and importing them into Grasshopper. I run simulation for 8 wind directions (every 45 degrees) and extrapolating the local wind speed for each point hourly considering the hourly weather data (wind speed and wind direction). \n\n2- Evapotranspiration effect from trees and other plants. Is it possible at all to evaluate this with HB? I have not found any reference to evapotranspiration in the forum. \n\nThanks in advance!\n\nAlejandro \n\n\n", "attachments": [], "created_by_name": "Alejandro Pacheco Diéguez", "created_at": "December 9, 2016 at 6:57am", "created_by": "3ahr35r8m5dl1", "replies": []}, {"body": "\nHi Alejandro and Chris,\n\n\n\nAny updates on this? On my side I am facing a similar problem.\n\nI have been analyzing Outdoor comfort on a rather big area surrounded by retail and commercial buildings (I have around 12000 test points). I am working with Butterfly to calculate the wind speed and EnergyPlus for the Outdoor Temperatures of the surfaces.\n\n\n\nI am working with the workflow developed by Chris here:<br/><br/>[http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;for...](http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;fork=hydra_2&amp;id=Outdoor_Microclimate_Map&amp;slide=0&amp;scale=6.964404506368996&amp;offset=-5003.050603651463,-950.7324557501929)\n\n\n\nand adding the CFD results.\n\n\n\nAfter computing a single CFD simulation, I am now trying to input the list of values with the wind speed results(12000 wind speed values for the same 12000 test points) to the _windspeed input of the UTCI Comfort Recipe component. However, the component expects an annual list of data per point (12.000 branches, each of them with 8760 values). As you can imagine, such a vast list of data crashes Rhino and Grasshopper.\n\n\n\nIs there any workaround this, to make the component accept only 1 value per point? My idea is to use the result from the CFD simulation for whatever the analysis period is required later in the Microclimate analysis component.\n\n\n\nThanks in advance,\n\n\n\nRafael\n", "attachments": [], "created_by_name": "Rafael A.", "created_at": "March 13, 2017 at 1:04pm", "created_by": "RafaelA", "replies": []}, {"body": "\nHi Chris,\n\nI was just wondering, does this method account for the effect of direct sunlight on the person? I guess it does but I did not read anything in the description of the component that confirms it.\n\nThanks in advance\n\nAlejandro\n", "attachments": [], "created_by_name": "Alejandro Pacheco Diéguez", "created_at": "February 23, 2017 at 9:58am", "created_by": "3ahr35r8m5dl1", "replies": []}, {"body": "\nHi Everyone,\n\n\n\nSorry for such a late response but I can answer much more meaningfully now that Butterfly has metamorphosed and is flying!\n\nI definitely realize that 8760 wind speed values for 1000+ test points is a large quantity of data that usually causes Grasshopper to crash.  This is why, if you read the input description of the windSpeed_ it says the following:\n\n\n\n**A value in m/s to set the wind speed of the comfort calculation. Use this input to account for objects like ceiling fans that might increase the interior wind speed or input custom wind speed values from a CFD simulation.**<br/> **_**<br/> **This input can also be a list of 8760 additional wind speed values that represent the hours of the year.**<br/> **Alternatively, this input can be a data tree of values with branches that are each 8760 values long and correspond to the branches of the input viewFactorMesh_.**<br/> **This can also be a data tree of values with one branch for each point in the input viewFactorMesh_.**<br/> ****Finally, this input can be the file path to a .csv file that is organized with 8760 values in each column and a number of columns that correspond to the number of test points. This last option is recommended if trying to synchronize CFD results with the microclimate maps.****\n\n\n\nThis last bolded option is what I would recommend for such a large quantity of data and this is what I have used in my own outdoor comfort maps that have incorporated CFD results.  Over the next few months, I'll roll out some components to make it easier to generate this type of CSV from butterfly's results but, for the time being, you will have to clean your CFD results yourself.\n\n\n\nI'll also say that, if you are only interested in the results at a single hour, you can always take the radiant temperature and air temperature maps from the mircolimate analysis and plug them into the Outdoor Comfort Calculator component along with your CFD values for wind speed.  This will give you comfort values at each point for the hour in question.\n\n\n\nAs for evapotraspiration, you can account for this by running the starting EPW file through the Urban Weather Generator (UWG) using the Dragonfly Beta.  The UWG allows you to warp EPWs to account for urban heat island effect along with the presence/absence of trees/plants. This example file shows you how to do it:\n\n[http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;for...](http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;fork=hydra_2&amp;id=Urban_Weather_Generator_Workflow)\n\n\n\nSome of the other LB developers and I have a paper that is in the final stages of review that outlines the complete methodology for accounting for all aspects of outdoor comfort using the Ladybug Tools suite.  I'll put the link to it here once it's past review.\n\n\n\nFinally, yes, direct sun shining on people is incorporated into the maps using the [solarCal method](http://escholarship.org/uc/item/89m1h2dg) and an [additional term to account for longwave radiant loss to the sky](http://www.grasshopper3d.com/group/ladybug/forum/topics/difference-between-mrt-calculation-methods).\n\n\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "March 14, 2017 at 9:11pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nHi Chris,\n\n\n\nThank you for your clarifications and your time on this.<br/><br/>\n\nThe .csv option also seemed a good idea for me, but the file is quite heavy (1GB roughly), which Grasshopper was not capable of handling either. At least not with reasonable computing times.\n\n\n\nI had not thought of the following option you suggest, which is a clever solution for the problem. This is definitely what I was looking for!\n\n**I'll also say that, if you are only interested in the results at a single hour, you can always take the radiant temperature and air temperature maps from the mircolimate analysis and plug them into the Outdoor Comfort Calculator component along with your CFD values for wind speed.  This will give you comfort values at each point for the hour in question.**\n\n\n\nCongratulations for Butterfly!\n\n\n\nRafael\n", "attachments": [], "created_by_name": "Rafael A.", "created_at": "March 17, 2017 at 4:15am", "created_by": "RafaelA", "replies": []}, {"body": "\nRafael,\n\nGlad that the Outdoor Comfort Calculator solves your issue.  I should also add that, for the csv's that I've used in my own studies, I usually try to keep the file size down by rounding off each windspeed t ~3 decimal places (you don't need more than this for comfort studies).  I will say that, for my studies with a couple thousand points, it usually takes 30 seconds for Grasshopper to load up the CSV into the comfort recipe component.  So, for 12,000 points, it might take around 3 minutes (assuming that your data is formatted with 3 decimal places).\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "March 17, 2017 at 2:37pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nHi Chris,\n\n\n\nAgain, you are spot on, big thanks for your tips!\n\nIt is true that so many decimals create an unnecessarily big .csv, something that hadn´t cross my mind. With those computing times, it is definitely something more feasible, nothing to do with my previous trials.\n\nLooking forward to the good news announced earlier today!\n\n\n\nRafael\n", "attachments": [], "created_by_name": "Rafael A.", "created_at": "March 20, 2017 at 9:42am", "created_by": "RafaelA", "replies": []}, {"body": "\nI just wanted to say that the paper that I mentioned earlier in this post is now past peer review and you can check it out here:\n\n[https://drive.google.com/file/d/0Bz2PwDvkjovJQ25IZmtadXczakU/view?u...](https://drive.google.com/file/d/0Bz2PwDvkjovJQ25IZmtadXczakU/view?usp=sharing)\n\nIt outlines a full method for detailed outdoor microclimate analysis with Ladybug Tools and it will hopefully help everyone discern what variables should be included in such an analysis.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "May 6, 2017 at 5:15am", "created_by": "ChrisMackey", "replies": []}]}]}