{"body": "\nHello everyone,\n\n\n\nIn anticipation of the first public release of Butterfly I would like to share a small definition that can hopefully get people started and allow some experimentation with Butterfly.\n\n\n\nThis definition is designed for an outdoor study (an indoor example will follow shortly). It also includes a hopefully more user friendly UI that allows the user to set all the necessary inputs for the simulation and run the case without using the actual GH definition.\n\nTo use this example to its full extent, along with Butterfly (details on installations can be found here [https://github.com/mostaphaRoudsari/Butterfly/wiki/Getting-Started-...](https://github.com/mostaphaRoudsari/Butterfly/wiki/Getting-Started-with-butterfly)) you will also need the HumanUI tools ([http://www.food4rhino.com/project/human-ui?ufh](http://www.food4rhino.com/project/human-ui?ufh)). However, HUI isn't necessary if you are only interested in the BF part of the definition which will still run.\n\n\n\nButterfly, and the example itself, is still a work in progress. I hope it can inspire people to get involved, test things out, and help it improve!\n\n\n\nKind regards,\n\nTheodore.\n\n\n\nP.S.: Add the path of the attached butterfly logo's location in your computer in the definition for a more buggy feeling :)\n\n\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1583601", "name": "160818_Butterfly&HumanUI_OutdoorCFD.gh"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1583602", "name": "butterfly_100px.png"}], "created_by_name": "Theodoros Galanos", "created_at": "August 18, 2016 at 4:45am", "created_by": "TheodorosGalanos", "topic": "Butterfly and HumanUI: an outdoor CFD example", "replies": [{"body": "\nHi Theodore. Very nice! Thanks for sharing. I copy your screen capture from twitter here to make it visual.\n\n\n\n[<img class=\"align-full\" src=\"https://pbs.twimg.com/media/CqI8xY3VIAIGmB5.jpg:large\"/>](https://pbs.twimg.com/media/CqI8xY3VIAIGmB5.jpg:large)\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "August 18, 2016 at 9:20am", "created_by": "MostaphaSadeghipour", "replies": [{"body": "\nHi Theodoros and thank you for the example.\n\nI've found a problem when changing the wind direction. I corrected this in the attached (the rotation of the vector wasn't right).\n\nAlso i have a question on this. In the HumanUI window it says that the wind direction go: 0 North, 90 East, 180 south, 270 West. If this is right the example should be fixed too in order to give the right data. Right now giving 0 means that the wind is blowing from the south.\n\n-A.\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1587585", "name": "160818_ButterflyHumanUI_OutdoorCFD_AY.gh"}], "created_by_name": "Abraham Yezioro", "created_at": "August 24, 2016 at 7:02am", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nHi Abraham,\n\n\n\nThanks for testing man! Also, much appreciated for fixing that vector thing, I thing I wasn't actually testing that part of the definition and forgot to check.\n\nAnd yes you are right 0 means South wind for BF since as in all Ladybug tools Y is North. I believe that's why I left it simply as a number in the UI window.\n\n\n\nI should also add that the little crude way of creating a location in mesh that is inside the wind tunnel but outside the building (as it should) is not really working properly for multiple geometry inputs.\n\n\n\nKind regards,\n\nTheodore.\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "August 24, 2016 at 8:12am", "created_by": "TheodorosGalanos", "replies": []}, {"body": "\nHi Abraham,\n\n\n\nI just realized that the wind direction input in the definition was completely wrong. I was actually rotating the wind tunnel which does nothing since the wind is always considered in relation to the input geometry.\n\n\n\nThe following definition should do the job. I also updated the tool-tip to represent the change and logic of wind direction in a wind tunnel. Finally, the location in mesh should be ok now and will work for any Brep input.\n\n\n\nKind regars,\n\nTheodore.\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1588360", "name": "160825_ButterflyHumanUI_OutdoorCFD_AY_TG.gh"}], "created_by_name": "Theodoros Galanos", "created_at": "August 25, 2016 at 4:01am", "created_by": "TheodorosGalanos", "replies": []}, {"body": "\nHi Theodore,\n\n\n\nThank you very much for all this.\n\n\n\nI have run your grasshopper definition. \n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/vtm5j-VOdSneUZGIDNA4qInwKaT3QpW1JGPaBmKH56VvwpVHeQE6vrv3yE2GrBiYrG6P-*YeXFSsPMxhcp35Q1avXlE12OBo/ScreenShot20160909at13.42.57.png?width=500\" width=\"500\"/>](http://api.ning.com:80/files/vtm5j-VOdSneUZGIDNA4qInwKaT3QpW1JGPaBmKH56VvwpVHeQE6vrv3yE2GrBiYrG6P-*YeXFSsPMxhcp35Q1avXlE12OBo/ScreenShot20160909at13.42.57.png)This was the first error I encountered. I then bypassed the humanUI by using boolean toggles into the 'runit' inputs of the rest of the components.\n\n\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/vtm5j-VOdSlUQw87hldN1P0bpsQglV2onJH*Y0*IXe7s23gTbVFKnwYrR3wAOgIFCTIgNaL4t4gVjNQJiMVRVTLBSUlC2hgF/ScreenShot20160909at13.43.29.png?width=500\" width=\"500\"/>](http://api.ning.com:80/files/vtm5j-VOdSlUQw87hldN1P0bpsQglV2onJH*Y0*IXe7s23gTbVFKnwYrR3wAOgIFCTIgNaL4t4gVjNQJiMVRVTLBSUlC2hgF/ScreenShot20160909at13.43.29.png)\n\n\n\nthese  failed to collect data.\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/vtm5j-VOdSl0hPYKzFZUmJvpXahjNtnf9XRkQs0avtvYgYlOEcDRFzfdRHAgHp62pvzUNB5-CjyB11uoDjH7O0GpfltjIdH3/ScreenShot20160909at13.47.35.png?width=500\" width=\"500\"/>](http://api.ning.com:80/files/vtm5j-VOdSl0hPYKzFZUmJvpXahjNtnf9XRkQs0avtvYgYlOEcDRFzfdRHAgHp62pvzUNB5-CjyB11uoDjH7O0GpfltjIdH3/ScreenShot20160909at13.47.35.png)\n\n\n\nAll ran well up to Time 1000. However after trying to read the results in different ways it seems that the meshes return one value only. Perhaps it is due to the compression? there isnt any postprocessing subfolder as there used to be in the case folder. There are zipped files in 0,100,200..1000 folders\n\nWould you know How can I solve this?\n\n\n\nThings are getting closer. So excited.\n\nKind Regards,<br/>Olivier\n\n\n\n\n\n\n", "attachments": [], "created_by_name": "Olivier Dambron", "created_at": "September 9, 2016 at 7:26am", "created_by": "OlivierDambron", "replies": []}, {"body": "\nHi Olivier,\n\nThere is a boolean that indicates if you want the results to be compressed. Make sure you have _writeCompression_ in controlDict component set to False.\n\n[<img class=\"align-center\" src=\"http://api.ning.com:80/files/kb2cz-EWmHuWF9eFfG36PKsIyLN9RI47crADbECQeLpsPYpduI5k7ejIZAi-jtd6Oh-CwunCil7OMzSABMSynSmdqoU-UDNy/compressResults.png\" width=\"316\"/>](http://api.ning.com:80/files/kb2cz-EWmHuWF9eFfG36PKsIyLN9RI47crADbECQeLpsPYpduI5k7ejIZAi-jtd6Oh-CwunCil7OMzSABMSynSmdqoU-UDNy/compressResults.png)\n\n<br/>Mostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "September 11, 2016 at 9:20am", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nHi Mostapha,<br/><br/>thank you.<br/><br/>I have clustered my geometry entirely defined in GH and will try to run it.<br/>I have attached the file here, could you have a quick look at the settings? <br/><br/>It seems there are 2 rectangles within the wind tunnel.<br/><br/>Olivier\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1597522", "name": "1109_butterflytest.gh"}], "created_by_name": "Olivier Dambron", "created_at": "September 11, 2016 at 10:48am", "created_by": "OlivierDambron", "replies": []}, {"body": "\nThe Input geometry had 4 values whereas the BFsurface component output 3.<br/>I flattened and it solved the issue.<br/><br/>[<img class=\"align-full\" src=\"http://api.ning.com:80/files/sBKqczAM5hJ05jyvalLYeAjNTTjHx*9RdbLT6AFDA5V-IYI5Uj*A*a55rc0rHoHlVtuO3OBeKl2gUiEKojdIFfchQ13WrXZm/ScreenShot20160911at23.31.19.png?width=721\" width=\"721\"/>](http://api.ning.com:80/files/sBKqczAM5hJ05jyvalLYeAjNTTjHx*9RdbLT6AFDA5V-IYI5Uj*A*a55rc0rHoHlVtuO3OBeKl2gUiEKojdIFfchQ13WrXZm/ScreenShot20160911at23.31.19.png)I am running it now... crossing fingers. Will update here.<br/><br/>Olivier\n", "attachments": [], "created_by_name": "Olivier Dambron", "created_at": "September 11, 2016 at 4:32pm", "created_by": "OlivierDambron", "replies": []}, {"body": "\nHi Olivier, Thanks for posting an image. I think for your case you need to refine the mesh around the object (which we haven't implemented in Butterfly yet) or create a very dense mesh overall to get all the edges correctly. Keep me posted and I can apply the mesh refinement boundaries.\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "September 11, 2016 at 4:52pm", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/in24Yk3jlJ*zShsYp*rd9m0fj6RaWe2XfjsK9eso0yNWzLkYSQfeN1j-6L7wCDYRzDpya0i5j-asBo5yzbhub4HMYFqLGzeI/1309mesh02_refined5_grid0.5.jpg?width=721\" width=\"721\"/>](http://api.ning.com:80/files/in24Yk3jlJ*zShsYp*rd9m0fj6RaWe2XfjsK9eso0yNWzLkYSQfeN1j-6L7wCDYRzDpya0i5j-asBo5yzbhub4HMYFqLGzeI/1309mesh02_refined5_grid0.5.jpg)Hi Mostapha,<br/><br/>Here is the result capture of these settings:\n\nWind speed  1m/s\n\nRefinement level 5\n\nGrid size  0.5m\n\nResolving time steps 500<br/><br/>I understand the simulation is running with k and epsilon at default values 0.001, how were those values determined if I may ask? Are these results accurate?<br/><br/>Kind Regards,<br/>Olivier\n\n\n", "attachments": [], "created_by_name": "Olivier Dambron", "created_at": "September 13, 2016 at 4:43pm", "created_by": "OlivierDambron", "replies": []}, {"body": "\nHi Olivier,\n\n\n\nThanks for trying out BF! And I am sorry for responding so late, I have been quite busy at home lately. \n\n\n\nFirst of all thanks for finding out kinks in the HumanUI file. That one is just intended for an easier application of BF and not really for learning how to use BF, hope it was helpful. Not sure what this error is though as I can't reproduce it in my computer. Are you sure you have the latest Human components? I'll try and look it up when I can for you.\n\n\n\nConcerning your results, they do look as expected. A heavy wake area behind the building has been created as you can see, with a quite clear pattern of wind deceleration and a recirculating vortex. This is a standard pattern in outdoor wind and something that generally we try to either minimize or plan activities around since these areas tend to have lower wind velocities and less recirculation, thus leading to debris/dust deposition and potentially higher pollutant concentration.\n\n\n\nThere are a lot of nice examples of urban wind patterns online you can check, it makes easier for you to help validate the results you get.\n\n\n\nFinally, the k and epsilon values for outdoor studies are currently being calculated with (pretty) standard equations for the k-e family of turbulence models. I believe you can find these in the BF source code. Unfortunately I don't have access right now to check where exactly but I would look before the blockMesh component, since the case folder with all the values is created at that point.\n\n\n\nGood luck in your CFD journey! Please keep posting results and issues!\n\n\n\nP.S.: Btw if you are interested on the effect of your building geometry at a section parallel to the wind direction you could also try a 2D simulation. You can do that either by manually editing your blockMeshDict and setting 1 cell width on the direction perpendicular to your wind or by simply assigning a 1m wide windTunnel (centered at your geometry). This will allow you to refine your model much more than possible in a 3D case with lower run times as well. Ofc it's not as accurate as a 2D case but it's nice for experimentation.\n\n\n\nKind regards,\n\nTheodore.\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "September 13, 2016 at 6:23pm", "created_by": "TheodorosGalanos", "replies": []}, {"body": "\nHi Theodore,<br/><br/>Thank you for your previous reply. Please forgive me the silence as it took me a while before pursuing back my CFD journey.<br/><br/>I have been using the outdoor example file to run airflow through an atrium with windward windows opened. I believe the results are coherent, the area of stagnant air on the 2nd floor is a result of pressure differences on a multistorey building.<br/>[<img class=\"align-left\" src=\"http://api.ning.com:80/files/21oynV1A7zKA7A2TO7Eo7Ld-GpxZRmWgA0yK50rFMVJGXSKNEH*RoNp9vtoH*ZU3Kn*kTbRag5kQ3Fxi4NWdAUbbf0bOaD8k/Butterfly_atrium.jpg?width=400\" width=\"400\"/>](http://api.ning.com:80/files/21oynV1A7zKA7A2TO7Eo7Ld-GpxZRmWgA0yK50rFMVJGXSKNEH*RoNp9vtoH*ZU3Kn*kTbRag5kQ3Fxi4NWdAUbbf0bOaD8k/Butterfly_atrium.jpg)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMy future intention is to optimise the outlet's geometry to benefit best from wind driven effects, I will set to an evolutionary solver to lower the average pressure in the leeward side of the outlet.<br/>For this reason I will have to proceed with lower accuracy to reduce run times and finally set it to the maximum for reliability of the final solution and result visualisation.\n\nThe way I have been trying to increase accuracy is by lowering down the testgrid size to 0.1 and using snappyhexmeshdict.<br/>I am not so confident in varying the different refinement levels and cell sizes of the refinement region and windtunnel.<br/>Would you be able to provide me with a a brief explanation on how to handle these parameters for higher or lower accuracy?<br/><br/><br/>Does Butterfly/OpenFoam processes stratification of heat (stack effect) accounting for internal heat gain?<br/>I was thinking of allocating a mannequin somewhere in the rooms and assign its surface temperature to human body temperature, and perhaps add some boxes for any electrical devices.<br/><br/>Thank you for making all of this possible.<br/><br/>Kind Regards,<br/>Olivier\n", "attachments": [], "created_by_name": "Olivier Dambron", "created_at": "November 22, 2016 at 6:38am", "created_by": "OlivierDambron", "replies": []}]}], "id": "1583603"}