{"body": "\nHello All,\n\n\n\nI was following Mostapha's sunshades tutorial on youtube. The shades designers seems to work if the sun shades are horizontal but when I toggle to vertical sun shades the sunshades move away from the surface and project far from the project. I have attached an images of both the results I get from rhino and a png of the grasshopper script. \n\nI am not sure why it is doing this but if someone has any insight I would greatly appreciate it!\n\n\n\nThank you!!\n\n\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1587728", "name": "Capture.JPG"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1587729", "name": "Grasshopper_Sunshades.png"}], "created_by_name": "Melissa Jimenez", "created_at": "August 24, 2016 at 9:07am", "created_by": "MelissaJimenez", "topic": "Ladybug Sunshades", "replies": [{"body": "\nHi Melissa, This is usually the result of having low angle sun positions which are perpendicular to the window. The component tries to block them anyways and that's why you see shading surfaces far from the base surface.\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "August 26, 2016 at 8:21am", "created_by": "MostaphaSadeghipour", "replies": [{"body": "\nDear Mostapha, I also have a doubt about shading: in Honeybee, I need to obtain values of DA in a room based in variations of position, dimensions and solar reflectance of the outdoor surrounding buildings. Is Honeybee capable of consider this kind of urban influence in indoor daylight outputs, which is generated by the inter-reflection of solar beam within an urban canyon? Any recommendations? Thank you in advance for your answer!\n", "attachments": [], "created_by_name": "Iara Santos", "created_at": "August 29, 2016 at 12:16pm", "created_by": "IaraSantos", "replies": []}, {"body": "\nHi Iara. Yes. You can find several examples for setting up a daylight analysis with honeybee on Hydra.\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "August 29, 2016 at 12:23pm", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nHi Mostapha,\n\n\n\nThank you for your quick reply. Does this mean I should select a different sun positions to better my result? \n\n\n", "attachments": [], "created_by_name": "Melissa Jimenez", "created_at": "August 29, 2016 at 12:19pm", "created_by": "MelissaJimenez", "replies": []}, {"body": "\nyes but that's not what you want to do. You need to select a different solution to shade the opening. Also you can use the component in a different way. For instance you can use optionalShdSrf or optionalPlanes inputs to project your shadings onto specific geometries or planes. If you search the forum you should be able to find enough examples to get you started.\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "August 29, 2016 at 12:25pm", "created_by": "MostaphaSadeghipour", "replies": []}]}]}