{"body": "\nHi everybody,\n\n\n\nI'm working on the design of a passiv mobile shading device for a hospital in Nantes, France.\n\nThe main idea is to replace mechanical louvers by a more architectural shading screen, whose shading factor to be correlated to the irradiation. The track we are following is using bimetal elements, like the work of **[Doris Sungs](https://www.youtube.com/watch?v=V17Lp1X0_ao)**\n\nWe have already established the physical behaviour of the bimetal element, in function of the temperature and determined the best size and shape for tiles to sustain wind pressure. The shapes we have kept are triangle, rectangle, and trapeze. So we are able to make a grasshopper component that gives the shape as an output of a temperature input.\n\n\n\nNext problem is to determine the temperature of the bimetal tile exposed to sun, air temperature and speed. As a first step, I will suppose air is calm, so I believe the main factor for temperature raise is sun exposure.\n\n\n\nDo you have any idea to start that work ?\n\n\n\nThanks to you all.\n\nRegards\n", "attachments": [], "created_by_name": "Frehel Denis", "created_at": "August 24, 2016 at 10:13am", "created_by": "FrehelDenis", "topic": "Bimetal shading", "replies": [{"body": "\nWhat about starting from creating a simple energy model to calculate the hourly temperature of the surfaces?\n\n\n\nYou can also calculate hourly radiation on the surface (using radiance or daysim) and use that to calculate the surface temperature based on your material properties if you have your own formulas to calculate the temperature.\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "August 26, 2016 at 8:27am", "created_by": "MostaphaSadeghipour", "replies": [{"body": "\nFrehel,\n\nThis is an interesting question.  Air temperature and wind speed you get from the EPW file.  To get surface temperatures, the best suggestion that I have is what Mostapha mentioned: you create a HBZone that is covered in your material and look at the hourly surface temperatures that you get out of the simulation.\n\nEventually, there may be a simpler workflow as I am currently working on a couple of components to help estimate surface temperatures given steady state assumptions.  I have not yet put in the ability to account for direct sun yet, though, and I don't know if the movement of the sun across the sky means that such a steady state estimate would be too inaccurate.  In the meantime, the transient E+ simulation is your best bet.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "August 27, 2016 at 1:40pm", "created_by": "ChrisMackey", "replies": []}]}]}