{"body": "\nHi guys,\n\nThe Read EP Result component has been failing for me whenever my output files include a central HVAC system. At least in my most recent file, the Fan Electric Energy and Pump Electric Energy columns in the CSV file are causing issues. I think part of it is that my column names don't include the strings the code searches for (e.g. 'FAN CONSTANT VOLUME'), but even when I change the column name to include those, I still get an error from the checkCentralSys() function that's being called in the code. I'm just commenting out those sections for now, but any ideas on how to fix it? \n\n\n\nI'm attaching an example file you can test with. Thanks,\n\n\n\nJulia\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1591115", "name": "v9_HVAC.csv"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1591116", "name": "v9_HVAC.eio"}], "created_by_name": "Julia S", "created_at": "August 30, 2016 at 8:45am", "created_by": "JuliaS", "topic": "Having trouble with Honeybee_Read EP Result", "replies": [{"body": "\nJulia,\n\nThanks so much for finding the bug.  This is going to be much easier to fix than the last one that you reported.  It also seems to be the same bug that another user reported to me here:\n\n[http://www.grasshopper3d.com/group/ladybug/forum/topics/read-ep-res...](http://www.grasshopper3d.com/group/ladybug/forum/topics/read-ep-result-formatting-issue?xg_source=activity)\n\n\n\nI will take a look at your files shortly.  In the meantime, if you could also upload the GH file that created the error, that would be helpful.  It is ok of the file is large as I mostly know what I am looking for.\n\n\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "August 30, 2016 at 6:28pm", "created_by": "ChrisMackey", "replies": [{"body": "\nJulia,\n\n\n\nI got the chance to look more deeply at your file and I realized what was going on: it seems that you are building a custom HVAC system and you have added custom names for things like the \"DOAS Supply Fan.\"  This was causing the functions in the result reader component that try to match outputs to zones to get a bit confused.  I also understand now why you were not able to upload a GH definition as it seems your getting into some deeper editing with either the OpenStudio interface or the IDF editor.\n\n\n\nIn any case, I have added in an extra function into the result reader component that will catch any custom names for fans, pumps, heating equipment, or cooling equipment and make sure that they all come in.  Everything seems to be coming in fine for your file:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/pn1gkRGKtSZr2XHZBXQKNP4v8l-YcBgHl2V4wYfeBfVDI-j-VaIT4v9e6VaZ8Zw9Q2wTSh5ugWmCos3R2KKcCmvi*Pw9cjQ*/ImprovedResultImporter.JPG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/pn1gkRGKtSZr2XHZBXQKNP4v8l-YcBgHl2V4wYfeBfVDI-j-VaIT4v9e6VaZ8Zw9Q2wTSh5ugWmCos3R2KKcCmvi*Pw9cjQ*/ImprovedResultImporter.JPG)\n\n\n\nYou can find the updated component attached and you can get it in your Honeybee toolbar by syncing with the github.\n\n\n\nThanks for reporting!\n\n-Chris\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1592962", "name": "MoreRobustResultImporter.gh"}], "created_by_name": "Chris Mackey", "created_at": "September 3, 2016 at 12:07pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nAh, that's great, thanks for the updated component! Yeah, I figured it had something to do with the custom names. \n", "attachments": [], "created_by_name": "Julia S", "created_at": "September 6, 2016 at 3:11pm", "created_by": "JuliaS", "replies": []}]}]}