{"body": "\nOn the ****Honeybee Set EP Air Flow**** component the min and max values for both the indoor and outdoor temperature can be specified to determine if natural ventilation through windows (ventilationType=1) will happen.\n\n\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/bghkZFo2d31ycCcUr8vkQqHtGJYWxBabyOg8os8Y*qDfrCqVcSF9HABPiw3UZvKQe*FcdES2z2MvEOKwFU9wqJXgYxHO7-Eh/Image1.png\" width=\"542\"/>](http://api.ning.com:80/files/bghkZFo2d31ycCcUr8vkQqHtGJYWxBabyOg8os8Y*qDfrCqVcSF9HABPiw3UZvKQe*FcdES2z2MvEOKwFU9wqJXgYxHO7-Eh/Image1.png)\n\n\n\nMay I ask whether the natural ventilation will only be activated when both conditions are met or either one of them is met?\n\n\n\nE.g, suppose we set the natural ventilation temperature range for both indoor and outdoor as the following, and for a given hour the indoor temperature of a thermal zone is outside the range whereas the outdoor temperature is within the range, will natural ventilation be activated for that zone?\n\n\n\nWill natural ventilation be activated only when both indoor and outdoor temperatures are within respective NV temperature ranges?\n\n\n\nThanks!\n\n\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/bghkZFo2d31yGJalZqvsnckCxOeMcWXUfAjTrQTNO3Pjgz6G9R-BvQOIFob5WVpiDKXHs6F4bjNFFr7OrVuCjy5TAFRirIGN/Picture2.png?width=750\" width=\"750\"/>](http://api.ning.com:80/files/bghkZFo2d31yGJalZqvsnckCxOeMcWXUfAjTrQTNO3Pjgz6G9R-BvQOIFob5WVpiDKXHs6F4bjNFFr7OrVuCjy5TAFRirIGN/Picture2.png)\n", "attachments": [], "created_by_name": "Grasshope", "created_at": "August 31, 2016 at 10:27am", "created_by": "Grasshope", "topic": "[clarified] How is natural ventilation determined based on min and max values for both indoor and outdoor temperature?", "replies": [{"body": "\nGrasshope,\n\n\n\nSorry for the late reply and this is a good question (it took me a while to figure it out myself).  The conditional statement that you are constructing between these 4 variables all have AND operators between them (there are no OR operators).  Expressed mathematically, this statement would look something like this:\n\n\n\nI will only naturally ventilate when:\n\nindoorTemp &gt; minIndoorTempForNatVent_\n\nAND\n\nindoorTemp &lt; maxIndoorTempForNatVent_\n\nAND\n\noutdoorTemp &gt; minOutdoorTempForNatVent_\n\nAND\n\noutdoorTemp &lt; maxOutdoorTempForNatVent_\n\n\n\nSo to answer your specific question, natural ventilation only be activated when both indoor and outdoor temperatures are within respective NV temperature ranges.\n\n\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "September 3, 2016 at 7:57pm", "created_by": "ChrisMackey", "replies": [{"body": "\nDear Chris, Thanks for the clarification! Sorry for the late reply as I as away last week.\n\n\n\n- Ji\n", "attachments": [], "created_by_name": "Grasshope", "created_at": "September 10, 2016 at 11:36am", "created_by": "Grasshope", "replies": []}, {"body": "\nDear Chris,\n\n\n\nAccording to your explanation, the thermal zone connected to the ****Honeybee Set EP Air Flow**** component will have natural ventilation only for hours when both the indoor and outdoor air temperature are within their respective min-max range as specified.\n\n\n\nFor the hours that don't fit this criteria, can this thermal zone use an **Ideal Loads Air System** to cool down or heat up the space? If it can, shall this zone be specified as **True** for **isConditioned_** on the **mass2zone** component?\n", "attachments": [], "created_by_name": "Grasshope", "created_at": "September 11, 2016 at 4:26am", "created_by": "Grasshope", "replies": []}, {"body": "\nJi,\n\nFor hours that are outside the indoor temperature range, you can make sure that the HVAC turns on by ensuring that the zone isConditioned and setting the thermostat Setpoints on the \"Honeybee_Set EnergyPlus Zone Thresholds\" to be larger than the maxIndoorTempForNatVent_ (for cooling Setpoints) and smaller than the minIndoorTempForNatVent_ (for heating Setpoint).  It's usually a good idea to leave at least 1 degree C buffer in between the maxIndoorTempForNatVent_ and the cooling setpoint.  Otherwise, you get a rapidly cycling phenomena where the windows shut because it's too hot, AC turns on, zone temperature drops, windows open, and zone temperature goes up.  This whole ordeal wastes a lot of cooling energy.\n\nAlternatively, you can get creative with the nat vent schedule and HVAC Availability schedule to ensure that you never have nat vent and AC periods overlapping but I would recommend getting the hang of the method above before trying  this.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "September 11, 2016 at 4:09pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nThank you very much, Chris!\n\n\n\nI've revised the diagram as shown below. Please kindly advise if it is correct and reasonable.\n\n\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/RBh5pTSdbmsozDHhBDdid8ZudGArUI2L33UGS3KlVLS*X3axQxqLJm5I9clF3pPLULL3pRPFwzWdhg*Z78SooZYIPcm3bYwQ/Image14.png?width=721\" width=\"721\"/>](http://api.ning.com:80/files/RBh5pTSdbmsozDHhBDdid8ZudGArUI2L33UGS3KlVLS*X3axQxqLJm5I9clF3pPLULL3pRPFwzWdhg*Z78SooZYIPcm3bYwQ/Image14.png)\n", "attachments": [], "created_by_name": "Grasshope", "created_at": "September 18, 2016 at 12:55pm", "created_by": "Grasshope", "replies": []}, {"body": "\nGrasshope,\n\nI like the diagram and the information about temperature buffers is good.  However, if your cooling setpoint is at 25C, you will never want to open the windows if the outdoor temperature is above 25C (otherwise the outdoor air will be heating up your space instead of cooling it down).  So your upper outdoor temperature limit should be the same as your cooling setpoint.  I would also recommend using a cooling setpoint around 28C since natural ventilation enables you to use the adaptive comfort model that makes these warmer indoor temperatures much more desirable.\n\nFinally, I would set the lower limit of outdoor air temperature to be 12C instead of 19C.  Our air conditioning systems deliver cold air that is at 12C and so people will usually be fine with having the windows open up until this point.  You usually, you want the indoor temperature to dirve when it's too cold for natural ventilation and not the outdoor temperature.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "September 18, 2016 at 5:49pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nThank you for your advice, Chris! The updated diagram is shown below.\n\n\n\nMay I confirm with you that, if indoor temperature is within either one of the two 1degree buffer ranges, the thermal zone will be in a **No-NV (windows closed)** and **No-AC (AC off)** status?\n\n\n\n(I think I asked you this in another post) Can I also confirm with you that if we want the AC to switch on for non-NV conditions, we need to specify True for the isConditioned_ option on the Mass2Zone component? Otherwise, the for the hours with non-NV conditions, the windows will be closed and AC will be off?\n\n\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/RBh5pTSdbmtCKJmne4YNdWX2ao72p49Bu58wFvlNrNcUqDbZhQ36NtsdXQWFZhlQg7YZTDcw8nlyVXbAH0Td438moH0-GLTO/Picture1.png?width=721\" width=\"721\"/>](http://api.ning.com:80/files/RBh5pTSdbmtCKJmne4YNdWX2ao72p49Bu58wFvlNrNcUqDbZhQ36NtsdXQWFZhlQg7YZTDcw8nlyVXbAH0Td438moH0-GLTO/Picture1.png)\n", "attachments": [], "created_by_name": "Grasshope", "created_at": "September 19, 2016 at 12:20am", "created_by": "Grasshope", "replies": []}, {"body": "\nJi,\n\n\n\nAs I said at the top of this post, natural ventilation is only active when both indoor AND outdoor criteria are met.  NOT indoor criteria OR outdoor criteria.  I also said this but will write it again more clearely:\n\nFor hours that are outside the indoor temperature range, you can make sure that the HVAC turns on by ensuring that the zone input for isConditioned is set to True.\n\n\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "September 21, 2016 at 5:46am", "created_by": "ChrisMackey", "replies": []}]}, {"body": "\nThis is a cool discussion Chris and Ji.\n\n\n\nThe diagrams will also help people that are dealing with the component and concept within E+ for the first time. Thanks!\n\n\n\nRegards,\n\nTheodore.\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "September 21, 2016 at 9:30pm", "created_by": "TheodorosGalanos", "replies": []}, {"body": "\nThank you for the clear explaination. Another question, is that still possible to use setback for cooling and heating?\n", "attachments": [], "created_by_name": "Yi Lü 吕谊", "created_at": "December 4, 2016 at 6:52pm", "created_by": "funature", "replies": [{"body": "\nYi,\n\nYes, of course.  For a setback case, you may want to use two natural ventilation components in tandem and synchronize the openingAreaFractionalSched_ with the periods of setpoint/setback.  This way, you can have two different types of natural ventilation controls for the setpoint and setback conditions.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "December 5, 2016 at 9:25pm", "created_by": "ChrisMackey", "replies": []}]}], "id": "1591301"}