{"body": "\nhello,<br/><br/>I am trying to optimise the geometry of an open structure in the tropics by assessing DA,UDI, Glare on the first floor and natural ventilation (with Autodesk flow design, looking forward to butterfly) .<br/>[<img class=\"align-center\" src=\"http://api.ning.com:80/files/H5BhlPfjXdJZXc7IYgjoICqrGdWfFcd0hrLg*hjnUzXLG8CHTWzgXsNvEiMjQakp*qheowAaKL*YPQZxSt1QuXoZyKE*BGuW/ScreenShot20160902at03.36.02.png?width=750\" width=\"750\"/>](http://api.ning.com:80/files/H5BhlPfjXdJZXc7IYgjoICqrGdWfFcd0hrLg*hjnUzXLG8CHTWzgXsNvEiMjQakp*qheowAaKL*YPQZxSt1QuXoZyKE*BGuW/ScreenShot20160902at03.36.02.png)In order to assess the glare probability as a fitness to minimise in galapagos or assess in octopus I have been testing different methods:<br/>1) Using the readannualresult II component and setting 300 lux- 3000 lux as thresholds at table height (0.85) with 2 bounces as ground reflected illuminance is significant.<br/><br/>Also, I have not managed to calculate the average DA value of the area above 3000, the component returns \"Solution exception:GH_String cannot be cast to System.Double\". <br/>[<img class=\"align-center\" src=\"http://api.ning.com:80/files/H5BhlPfjXdLWiIpN37NU-xzxT3DdNvFtqDL7i9dQivDAm7kFr-2p-ZVPV-XwhFaHUrQI90nS7kJr8Ky24FWsg8LzfIk3oFES/ScreenShot20160902at04.05.36.png?width=750\" width=\"750\"/>](http://api.ning.com:80/files/H5BhlPfjXdLWiIpN37NU-xzxT3DdNvFtqDL7i9dQivDAm7kFr-2p-ZVPV-XwhFaHUrQI90nS7kJr8Ky24FWsg8LzfIk3oFES/ScreenShot20160902at04.05.36.png)<br/><br/>2) Using the Vertical Sky Component [0.5] at eye sight when seated (1.20m) with all material set with 0 reflectance,  hoping it highlights the area exposed to portions of the sky. Considering the high humidity levels in the tropics, the diffuse illuminance can be very disturbing. Does VSC set with 1 bounce inform what I am looking for?<br/>[<img class=\"align-full\" src=\"http://api.ning.com:80/files/H5BhlPfjXdJ2taQYQ0BCzaRRQrQfjGVN1XVvpLBO3nPijtX8-nIhxKD4RaRMhO02aXrPyGpvByFyaVdXQkN9zN*0i4k5JOwU/ScreenShot20160902at03.41.59.png?width=750\" width=\"750\"/>](http://api.ning.com:80/files/H5BhlPfjXdJ2taQYQ0BCzaRRQrQfjGVN1XVvpLBO3nPijtX8-nIhxKD4RaRMhO02aXrPyGpvByFyaVdXQkN9zN*0i4k5JOwU/ScreenShot20160902at03.41.59.png)<br/><br/>Would someone be able to clarify which of these methods should I consider to be the fitness to assess the geometry ? <br/>Perhaps a combination of DA[3000] , VSC and DGP? <br/>Should the VSC inform the radius at which a DGP should be run pointing at the direction indicated by the highest DA?<br/><br/>Please let me know if you have any tips to share.<br/>Kind Regards,<br/>Olivier\n", "attachments": [], "created_by_name": "Olivier Dambron", "created_at": "September 1, 2016 at 9:18pm", "created_by": "OlivierDambron", "topic": "Tropical Glare", "replies": [{"body": "\nHi Olivier,\n\n\n\nLooks like an interesting project. What material is your structure made up of? Is it translucent? It's hard for me to tell from your figure, but do you have toplighting as well? The best way in Radiance to ensure that you are only considering direct solar radiation is to do a zero reflectance, zero bounce simulation. [(At least that is how it is in the 5 Phase method)](https://www.radiance-online.org/learning/tutorials/fivephasetutorialfiles/Tutorial-FivePhaseMethod_v2.pdf).\n\n\n\nAs far as your errors on HB are concerned, it might be easier to figure out what went wrong if you can share your gh file as well.\n\n\n\nSarith\n", "attachments": [], "created_by_name": "Sarith Subramaniam", "created_at": "September 2, 2016 at 8:22am", "created_by": "sarith", "replies": [{"body": "\nHi Sarith,<br/><br/>Thank you for your attention, I don't feel comfortable sharing the file right now as it is still very messy. I will tidy up and upload it asap.<br/><br/>1) The structure is made of bamboo of which the reflectance is nearly 0.35. I have considered it null for the VSC run. All opaque.<br/><br/>2) The top is closed for these iterations.<br/><br/>I will try with zero bounce.<br/><br/>Thanks again<br/>Olivier<br/><br/><br/><br/>\n", "attachments": [], "created_by_name": "Olivier Dambron", "created_at": "September 2, 2016 at 8:36am", "created_by": "OlivierDambron", "replies": []}, {"body": "\nHi Olivier,\n\n\n\nHow close to equator is your project? You are unlikely to get a lot of direct glare from the sun (due to low profile angles in the winter, as is the case for higher latitudes). Assuming your structure is open from all sides, you might have to treat your east and west facades differently from the north and south.\n\nA slightly unconventional way to discern the amount of direct glare would be to just look at the direct solar radiation incident on your facade. A few months ago, Chris Mackey and I had discussed a couple of hacks/solutions to do this [here](http://www.grasshopper3d.com/group/ladybug/forum/topics/list-of-hoy-for-solar-analysis?xg_source=activity). Assuming your structure is close to the equator, you are only likely to run into direct glare in the mornings and evenings (edit: and also right next to the windows facing south/north if you have furniture there!). So, the idea is to do a radiation study for those hours alone. You could use the radiation study to identify the aspect of the facade most susceptible to solar insolation and then run daylighting simulations to optimize the structure from thereon.\n\n\n\nSarith\n", "attachments": [], "created_by_name": "Sarith Subramaniam", "created_at": "September 2, 2016 at 9:29am", "created_by": "sarith", "replies": []}, {"body": "\nSarith,<br/><br/>The project is in Indonesia so yes near the equator.<br/><br/>The geometry is constrained for the tip of roof's overhang to be cut by a 45 degree inclinated plane starting from the groundfloor's contour. <br/>This is an arbitrary angle that I have inputed to protect the building elements from weathering effects (prolonged hour of solar exposure and wind-driven rain).<br/><br/>As this condition constrains the geometry very much, I am trying to define the threshold at which the size of the overhang is to be considered and still have good daylight on the first floor.<br/>Which I narrow down to glare issues. After doing fieldwork in such a building in Indonesia, I have noticed that glare was caused by the slightest view of the sky due to the high humidity, regardless of the orientation; or due to direct sun radiation on the east and west early morning or late afternoon.<br/><br/>this is the reason why I was thinking of assessing with the Vertical Sky Component. <br/>I am now running DA with a 3000 lux threshold, with 0 bounce, thanks to you. The area above should indicate the fitness of my optimisation.<br/><br/>Would you have read a discussion on weathering effects with LB/HB? Is there a way to input the wind driven rain intrusion somehow?<br/><br/>Kind Regards,<br/>Olivier<br/><br/><br/>\n", "attachments": [], "created_by_name": "Olivier Dambron", "created_at": "September 2, 2016 at 10:27am", "created_by": "OlivierDambron", "replies": []}, {"body": "\nHi Olivier,\n\n\n\nSince Daysim (the annual daylighting simulation engine used by HB) employs data extracted from tmy epw files for daylighting calculations, I think it is safe to assume that the sky conditions are probably reflective of the prevailing humidity conditions (I just had a chat about this with my [advisor](http://www.engr.psu.edu/ae/faculty/mistrick/), who incidentally also happens to be on the committee for L[M-83](https://www.ies.org/store/product/approved-method-ies-spatial-daylight-autonomy-sda-and-annual-sunlight-exposure-ase-1287.cfm)).\n\n\n\nThe Tregenza sky patches considered in daylighting calculations don't do a good job of incorporating the correct size of the sun into calculations. In the figure below, the sun on the right is the one considered for calculations in Daysim. You can get a more accurate answer by considering a more discretized sky, however, I am not aware if that is possible with Daysim (and therefore HB) right now. Therefore, your direct sun calculations are likely to be off somewhat depending on how much of it there is(I'd say overestimated).\n\n\n\n[<img class=\"align-left\" src=\"http://api.ning.com:80/files/9ydERlsdPuGHkUiAkbBx19KJuKp-iZy8vam6SY-gEfA3ruUTw5eROVVEiQqzJgJV5GQax-so8fkhWFgWKUlqeLz*pdViQ45s/Untitled.png\" width=\"306\"/>](http://api.ning.com:80/files/9ydERlsdPuGHkUiAkbBx19KJuKp-iZy8vam6SY-gEfA3ruUTw5eROVVEiQqzJgJV5GQax-so8fkhWFgWKUlqeLz*pdViQ45s/Untitled.png)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThe calculations with humid sky, which are on account of the sky itself (and not the sun alone) are likely to be more relevant. \n\n\n\nRegarding your questions about studying weathering effects with LB/HB, I have no idea as that is something that I haven't looked into before. I am sure someone else on this list has a more informed opinion on this issue than I do.\n\n\n\nYour project, and your approach to it, seems really interesting and I am glad to be having this discussion :).\n\n\n\nSarith\n\n\n\n\n", "attachments": [], "created_by_name": "Sarith Subramaniam", "created_at": "September 2, 2016 at 11:35am", "created_by": "sarith", "replies": []}, {"body": "\nOlivier,\n\nIn cases such as yours you can use a combination of simple analysis. If the sky is mostly cloudy, then daylight factor analysis should give you a good idea of potential enough daylight inside the space. For analyzing the glare probability you can use [sunlight hours analysis](http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;fork=hydra_2&amp;id=Estimate_Glare_Potential_Over_a_Year&amp;slide=1&amp;scale=1&amp;offset=0,0) and also [figuring out the times that sun is visible](http://hydrashare.github.io/hydra/viewer?owner=mostaphaRoudsari&amp;fork=hydra_1&amp;id=Find_when_sun_is_visible_to_a_point&amp;slide=2&amp;scale=1&amp;offset=0,0) and then use more advanced analysis such as glare analysis for further studies.\n\nMostapha \n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "September 11, 2016 at 9:57am", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nSpot on! Thank you I'll make use of these straight away.<br/><br/>All the best.<br/>Olivier\n", "attachments": [], "created_by_name": "Olivier Dambron", "created_at": "September 11, 2016 at 11:14am", "created_by": "OlivierDambron", "replies": []}]}], "id": "1592168"}