{"body": "\nI truly appreciate and admire the work that Chris has done on the outdoor microclimate map. It shows great potential in it's flexibility and accuracy - especially when combined with Butterfly.\n\nWhat I see as this method's greatest weakness is the complexity of calculating surface temperatures. Have any quicker methods been considered for calculating (especially facade) surface temperatures? I am guessing that reasonable estimations for surface temperatures could be produced without doing energy modeling for the interior spaces, by simply assuming a constant temperature for the interior faces of walls.\n\nWith a quicker surface temperature calculation this tool could easily be used for larger urban contexts.\n\nApologies if this topic has already been covered someplace else. Thanks for all the great work, development team!\n\n\n\n \n", "attachments": [], "created_by_name": "Ernst Bay", "created_at": "September 1, 2016 at 11:02am", "created_by": "ErnstBay", "topic": "Quicker estimate for surface temperatures for outdoor microclimate map", "replies": [{"body": "\nErnst,\n\n\n\nThis is a very good question and it's one that I have been thinking about a lot recently.  You are right that, when we are only interested in outdoor surface temperatures, we do not need to run an entire EnergyPlus model and we can get pretty close with some simpler assumptions.  At the moment, there is actually a Ladybug component that I have put in WIP that calculates steady-state indoor surface temperatures given assumptions of U-Value, indoor temperature and outdoor temperature.  I am currently thinking of extending this to give outdoor surface temperatures but the critical thing that I need to account for is the effect of direct sun shining on the outdoor surfaces.  Because the sun moves across the sky so quickly, I am actually not sure if the steady-state assumption will hold in this case or what the minimum considerations of transient calculation would be in order to get something decently accurate.  I plan to do some comparisons between steady state assumptions and transient E+ runs soon and I'll keep your comments in mind when I do so.\n\n\n\nI should also say that, if you are ok with the assumption that surface temperatures are the same as the air temperature, you can build a comfort map using just the presence/absence of the sun as I do here:\n\n[http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;for...](http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;fork=hydra_2&amp;id=Urban_Microclimate_-_Simple_Spatial_UTCI)\n\n\n\nIt is probably in this type of Ladybug workflow that you will see a faster/simpler type of comfort map emerging in the next few months if I find that it is accurate/possible.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "September 3, 2016 at 2:39pm", "created_by": "ChrisMackey", "replies": [{"body": "\nThank you, Chris. I will make sure to test the workflow above. I look forward to seeing future iterations of the tool!\n", "attachments": [], "created_by_name": "Ernst Bay", "created_at": "September 6, 2016 at 12:13pm", "created_by": "ErnstBay", "replies": []}]}]}