{"body": "\nHi,\n\nI'm dealing with some issues with plotting results in the AdaptiveChart component.\n\nAt first i noticed a strange pattern where the plotted results show that the 24 daily temperatures are aligned between them (see next image):\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/pn1gkRGKtSaQeot64cQGcPAAwJBmKS8ZYpoOS4oxHZ1xyJO9zVGGViX0W0dqH8KuhGWA8YaRg5WcsZfBQ2QKZAJA*JhQ*HH7/Capture1.JPG\" width=\"696\"/>](http://api.ning.com:80/files/pn1gkRGKtSaQeot64cQGcPAAwJBmKS8ZYpoOS4oxHZ1xyJO9zVGGViX0W0dqH8KuhGWA8YaRg5WcsZfBQ2QKZAJA*JhQ*HH7/Capture1.JPG)Then i compared the plotted results at CBE website with those of this component (see image). Clearly they don't agree with each other.\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/pn1gkRGKtSZHH2gUbrO2ZX2ORzB60icKJqIOD7vT7atV*LdlQTaz-YDeGIeRBVn-jHfWX2RTo0ylAb1IB0z0owzzNgzNdrsm/Capture.JPG?width=750\" width=\"750\"/>](http://api.ning.com:80/files/pn1gkRGKtSZHH2gUbrO2ZX2ORzB60icKJqIOD7vT7atV*LdlQTaz-YDeGIeRBVn-jHfWX2RTo0ylAb1IB0z0owzzNgzNdrsm/Capture.JPG)So, is there something i'm missing or there is a real issue here?\n\n\n\nFor the same component i have another question: it is not clear for me the output degreesFromTarget. Can you explain what is the target (the band or a specific value)?\n\n\n\nBTW, i used for this discussion the hydra example AdaaptiveComfortChart.\n\n\n\nThanks,\n\n-A.\n\n\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "September 3, 2016 at 12:44pm", "created_by": "AbrahamYezioro", "topic": "LB_AdaptiveChart plotting issues", "replies": [{"body": "\nAbraham,\n\n\n\nI'm having a very tough time understanding what you are inputting into the Adaptive Chart component from your images.  I at least know that your prevailing outdoor temperatures are for Boston, which may not be the site that you are trying to evaluate.  If you upload a GH file or an image of the adaptive chart component, I could be of more assistance.\n\n\n\nThe degreesFromTarget is the number of degrees Celsius that your input conditions are from the centerline of the adaptive comfort polygon.  I added this output because I wanted to have something similar to PMV but for the adaptive model.  So, just like PMV, when the degreesFromTarget is 0, you are at the most comfortable temperature possible, positive numbers are warmer than this, and negative numbers are cooler than this.\n\n\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "September 3, 2016 at 1:26pm", "created_by": "ChrisMackey", "replies": [{"body": "\nHi Chris,\n\nAttached the file i'm using. I'm plotting any of the periods from the importSTAT component. There is a chance i'm doing it wrong?\n\nFor comparing with the CBE i defined an analysisPeriod of 2 hours just to get the AirTemp, MRT, and OutdoorTemp, which i attached in the discussion.\n\nThanks,\n\n-A.\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1593159", "name": "Adaptive_Comfort_Chart.gh"}], "created_by_name": "Abraham Yezioro", "created_at": "September 3, 2016 at 1:33pm", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nAbraham,\n\n\n\nI understand perfectly now.  You are using the adaptive component correctly but, in your CBE example, you are taking the outdoor temperature AT THAT HOUR.  The outdoor temperature at a single hour is not what determines occupant comfort according to the adaptive model but rather the PREVAILING outdoor temperature.  The prevailing outdoor temperature represents the average temperature for that time of year and is either a monthly average temperature (according to ASHRAE) or a running mean outdoor temperature (according to the ISO).  I realize that it might not have been perfectly clear that the adaptive chart component is actually calculating this prevailing outdoor temperature for you from the outdoor dry bulb so I added it as in output on the adaptive chart component here:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/S5D7YsYlDekdOTpYpt01ak*ASOemTNvTZ7y8e1*RhIy0fYlQTgWU4AVc7mkcdM5jCuRudR9Gs61YXDLZOK78oiKynBqygpmp/PrevailingTemp.JPG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/S5D7YsYlDekdOTpYpt01ak*ASOemTNvTZ7y8e1*RhIy0fYlQTgWU4AVc7mkcdM5jCuRudR9Gs61YXDLZOK78oiKynBqygpmp/PrevailingTemp.JPG)\n\n... and in the attached file.\n\n\n\nHere you can see that, even though the outdoor temperature for your specific hour is at 27.8C, the running mean temperature for that time of year is much lower around 16.7 and it is this lower temperature that drives the comfort model.\n\n\n\nLet me know if that's clear.\n\n-Chris\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1592896", "name": "Adaptive_Comfort_Chart_CWM.gh"}], "created_by_name": "Chris Mackey", "created_at": "September 3, 2016 at 2:20pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nThanks Chris,\n\nThis is clear now. I think the input name _prevailingOutdoorTemp is a bit misleading in the sense that the hint recommends to plug the DryBulb from the EPW. I believe there is no other possible input here, right (the prevOutTemp is not provided elsewhere).\n\nCan you point me where in the component's code you calculate this average/mean?\n\nthank you again!!\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "September 3, 2016 at 3:01pm", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nOne more thing,\n\nAfter your change the comfort polygons are not showing as default of the component.\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "September 3, 2016 at 3:46pm", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nAbraham,\n\nI struggled with the input name when I made the component because I originally thought that people would plug in an actual calculated prevailing outdoor temperature (which the component accepts if it doesn't find the \"Dry Bulb Temperature\" in the header of the data).  It was only afterwards that I realized that (practically every time) you want to just plug in outdoor air temperature and have the component figure things out for you.  Would just plain old \"outdoorTemperature\" be a better name or does the vagueness of it make it worse?\n\n\n\nHere is the part of the code where I calculate the prevailing outdoor temperature:\n\n[https://github.com/mostaphaRoudsari/ladybug/blob/master/src/Ladybug...](https://github.com/mostaphaRoudsari/ladybug/blob/master/src/Ladybug_Adaptive%20Comfort%20Chart.py#L239-L266)\n\nAs you see, there are different formulas used for average monthly and the running mean.  If you are curious about how this prevailing outdoor standard evolved, I would recommend this book:\n\n[https://books.google.com/books?id=lOZzCgAAQBAJ&amp;printsec=frontco...](https://books.google.com/books?id=lOZzCgAAQBAJ&amp;printsec=frontcover&amp;dq=adaptive+thermal+comfort&amp;hl=en&amp;sa=X&amp;ved=0ahUKEwj42qO_ufTOAhXG9h4KHSukAV8Q6AEIIzAB)\n\n\n\nFinally, I fixed the issue with the polygon not displaying:\n\n[https://github.com/mostaphaRoudsari/ladybug/commit/71cc4200608b5d67...](https://github.com/mostaphaRoudsari/ladybug/commit/71cc4200608b5d677fcecfc33a16fdc0520b8d2b)\n\nThanks for reporting that.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "September 3, 2016 at 6:27pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nHi Chris,\n\nI think the outdoorTemperature name fits better. In the hint of it you (can) explain the possible inputs. i would add in the hint, for such cases where the user has the prevailingTemp, what should be in the header, so it won't calculate the averages/mean.\n\n\n\nThanks!!\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "September 3, 2016 at 10:33pm", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nHi again,\n\nSorry to bother on this again. For some reason the polygon is still not showing after the update. I added this line:\n\nghenv.Component.Params.Output[13].Hidden = False<br/>and it works.\n\nI see the changes you made in the code when i update the file, (Output[15] and [17]), so i know i'm synced with the latest.\n\nI closed and opened GH and Rhino, but still ...\n\nWeird ...\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "September 3, 2016 at 11:07pm", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nAbraham,\n\n\n\nI will change the name of the input around the next stable release as I have been trying to keep the need to drag/drop the components to a minimum since the last stable release was only a month ago.  I set a reminder for myself on the github:\n\n[https://github.com/mostaphaRoudsari/ladybug/issues/291](https://github.com/mostaphaRoudsari/ladybug/issues/291)\n\n\n\nThe change that you made in the code is not needed for everyone since, once you start up Grasshopper with the correct updated code, it will hide the right outputs (no need to unhide the old outputs).\n\n\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "September 4, 2016 at 12:37pm", "created_by": "ChrisMackey", "replies": []}]}]}