{"body": "\nHi Ladybug+Honeybee team\n\nFirstly I would like to express my gratitude for providing such amazing climatic design tools to the community. Keep up the great work!\n\nIn the last days I have been experimenting with the shade benefit evaluator tool, trying to determine the general shape of horizontal outdoor shades in various places of a waterfront.\n\nI have noticed that although the tool seems to suggest correct shading forms, the numerical results (degree-days per sq.m.) are not easily comparable between different cases and this may cause misinterpretations. I did a few experiments using the Hydra example and examined only the shade helpfulness to make things less complicated.\n\nWhile keeping all grasshopper parameters the same (including grid size = 1m) I changed the geometry of the potential shade and the area to be shaded. It can be observed that as the examined area becomes larger, the relative contribution of each shading patch becomes less significant. This is expected since the method calculates the percentage of the sun blocked as the component description states. Yet, the comparison of the calculated metric (degree-days/sq m) can easily lead to the assumption that the larger shade is less efficient than the smaller in terms of thermal comfort (1 degree-day/sq m vs 12 degree days/sq m), which is not true.\n\n\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/F0w1ASrn6MreWPVQq388i-cn1HOxdtXJjQbA2ynu539Vx27Oc5YloPegyeSOQfSNrhXLUBh1n41nhcuN1A0*BTCc4ZXS7AQc/shade1.JPG?width=300\" width=\"300\"/>](http://api.ning.com:80/files/F0w1ASrn6Mpl36LEe75lrfIjlZho2xIQucEJtArpICFJtkFT70nCdN4Sh*zwJlB-Ib1KOF-Ixl*cgNo799Er4Y4yfbza8QtU/shade3.JPG)[<img class=\"align-left\" src=\"http://api.ning.com:80/files/F0w1ASrn6Mp2CUx7b9mMGOvSBWTDAgUTBrY6hJxUCauITfEiNtQSk*FmjeOXLtUxskhjUfW6ZI5wqdLPOFUPqAurbYDFFIq7/shade3.JPG?width=300\" width=\"300\"/>](http://api.ning.com:80/files/F0w1ASrn6Mp2CUx7b9mMGOvSBWTDAgUTBrY6hJxUCauITfEiNtQSk*FmjeOXLtUxskhjUfW6ZI5wqdLPOFUPqAurbYDFFIq7/shade3.JPG)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThe same problem can also be observed when changing the resolution of the analysis to finer levels (e.g. 0.5m or 0.25m) while keeping geometry the same, although according to the component description, normalisation should take care of that (see fig. below).\n\n\n\n[<img class=\"align-left\" src=\"http://api.ning.com:80/files/F0w1ASrn6MqPqy3Qj9sa1lU1vsuaGD0f1B8PaV-JmtpWRyxThXv8suUdu4QJINmvZ-UFAzlil*5vI5ylr52S203W-*D3FjnE/shade2.JPG?width=300\" width=\"300\"/>](http://api.ning.com:80/files/F0w1ASrn6MqPqy3Qj9sa1lU1vsuaGD0f1B8PaV-JmtpWRyxThXv8suUdu4QJINmvZ-UFAzlil*5vI5ylr52S203W-*D3FjnE/shade2.JPG)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nIs this normal? Is there a work-around to this issue (e.g. a different metric or post-process procedure)? I would appreciate hearing your thoughts on this.\n\nBest Regards\n\nAris\n", "attachments": [], "created_by_name": "Aris V", "created_at": "September 22, 2016 at 12:05am", "created_by": "ArisVartholomaios", "topic": "Inconsistencies in Shadebenefit evaluator", "replies": [{"body": "\nAris,\n\n\n\nThanks for posting and your questions are good ones.  The way in which I made the shade benefit method relevant to thermal comfort has involved the creation of a fairly abstract metric of degree-days/square meter, which sometimes takes a while to understand.  To explain what is going on in the cases that you posted, I can tell you that the second one where you are just increasing the grid size is showing you that that there is actually greater variation in shade benefit when you zoom in and perform a calculation with more sun vectors.  This is why the legend increases (because there are some small spots that matter more when they are not averaged together with some less important spots).  If you multiply by the area of the individual cells in each case and add up all of the results for each of these two cases, you should get something similar as the absolute value provided by shading all of the beneficial regions.\n\n\n\nThe first case is a bit more difficult to explain but I am fairly certain that it is happening because each shade benefit simulation has a finite number of degree-days that it is trying to improve.  When you increase the size of the testRegion as you do in the first example, you are spreading those degree-days across a larger surface, resulting in overall smaller numbers of degree-days/m2.  One way that you might try to get a more constant metric (or more of an absolute value provided by the whole shade) is that you can multiply the results by the number of people that are seated in the testRegion (or perhaps just multiply by the area of the testRegion).  This way, you are accounting for the fact that the larger shade will make more people comfortable (it's not just one person or set of degree-days that you are improving).  In your specific case here, I think that we are also seeing a number of areas where the benefit of the shade is in conflict with the desire to not have shade in the winter, resulting in some smaller values.\n\n\n\nLet me know if you end up testing out the multiplication by the testRegion area and, if you get results that indicate a more \"absolute value\" of the shade that is more consistent between the cases, I might consider revising the metric that is output from the component.  The important thing to realize across all of this is that the RELATIVE shade desirability across you testShade will always be the same (even if the way that we define absolute shade benefit changes).  So, if you have a finite amount of shade material, it is always in your interest to provide more of it in the areas with more shade desirability.\n\n\n\nIf you have more questions about how the component works, I can point you to this paper on it:\n\n[https://www.dropbox.com/s/cgrod252iopmci2/SIMAUD_Paper12.pdf?dl=0](https://www.dropbox.com/s/cgrod252iopmci2/SIMAUD_Paper12.pdf?dl=0)\n\n\n\nAlso, the original shade benefit method that this component is based on can be found here:\n\n[http://web.mit.edu/tito_/www/Publications/BS2011_Shaderade.pdf](http://web.mit.edu/tito_/www/Publications/BS2011_Shaderade.pdf)\n\n\n\nThanks again,\n\n-Chris\n\n\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "September 24, 2016 at 3:35pm", "created_by": "ChrisMackey", "replies": [{"body": "\nHi Chris\n\nI followed your suggestions and did some more experiments. Multiplying the shadeneteffect values by the testregion area, as you have suggested, seems to yield more comparable results. I have attached the relevant gh definition to this post. You can see the result below:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/hAXKVxAmtpLZabVLGmPgcEvhRW4b21cZTYnnpcjEPE0VFOsKqkDeIufBEtQeloyfeuc0R0-Ahh0NPNxKo0ocpnCVelCV9XX3/comparison.jpg?width=300\" width=\"300\"/>](http://api.ning.com:80/files/hAXKVxAmtpLZabVLGmPgcEvhRW4b21cZTYnnpcjEPE0VFOsKqkDeIufBEtQeloyfeuc0R0-Ahh0NPNxKo0ocpnCVelCV9XX3/comparison.jpg)\n\nAssuming that each person occupies a fixed amount of space, a multiplication by the number of people should generate similar results. However, the metric would get even more complex (DegreeDays*no. of people/m2 of shade). On the contrary, the multiplication by the test region area creates an even simpler metric (DegreeDays) which might be used to compare “levels of shading service (or disservice)” between different shaded areas.\n\nAs you already mention, the existing metric is not “wrong” and has its own uses, so you could either clarify this in the component description or add the new metric as an output.\n\nBelow you can see a comparison of two cases from the study site I am currently investigating. The site is a waterfront located in Crete with mostly northern, western and northwestern orientations, so the yearly shade harm is insignificant. The multiplication of shadebenefit by site area seems to provide a better interpretation of the shadow effect.\n\n\n\n[<img class=\"align-left\" src=\"http://api.ning.com:80/files/hAXKVxAmtpLWB7VBANUN*n5VG7vFK0eWp4z3Y-ExV3syEkXa1k8gg4jPmSf5iq2i-DUOE95K1mxPHzvrmglAe5KJfyHyWzDe/existing_metric.JPG?width=300\" width=\"300\"/>](http://api.ning.com:80/files/hAXKVxAmtpLWB7VBANUN*n5VG7vFK0eWp4z3Y-ExV3syEkXa1k8gg4jPmSf5iq2i-DUOE95K1mxPHzvrmglAe5KJfyHyWzDe/existing_metric.JPG)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/hAXKVxAmtpLn8sD00rzC1p8ANM158BsJPnzBnbSflmYBIEyznV57M9TmrGeIoUIsW-NMKKoLpeUUKhxjeyUUQDAH8Y317NeE/mulitpliedbytestregion.JPG?width=300\" width=\"300\"/>](http://api.ning.com:80/files/hAXKVxAmtpLn8sD00rzC1p8ANM158BsJPnzBnbSflmYBIEyznV57M9TmrGeIoUIsW-NMKKoLpeUUKhxjeyUUQDAH8Y317NeE/mulitpliedbytestregion.JPG)You can also observe that in the case of a west-facing site (case on the right) a horizontal shade has a smaller impact on thermal comfort (slightly lighter blue color) than southern/northern cases.\n\n\n\nBest Regards\n\nAris\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1605671", "name": "Outdoor_Comfort_Shade_Benefit_2.gh"}], "created_by_name": "Aris V", "created_at": "September 26, 2016 at 3:53am", "created_by": "ArisVartholomaios", "replies": []}, {"body": "", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "September 26, 2016 at 9:58am", "created_by": "ChrisMackey", "replies": []}]}], "id": "1603846"}