{"body": "\nHi,\n\n\n\nFirst of all, thanks for the great work on HB! It is proving very fun and useful.\n\n\n\nI am trying to do some optimization study on the cooling and heating load of a generic building by using Honeybee and Galapagos. There are two identical floors with 6 zones at the bottom floor and top floor separated by an adiabatic component in the middle. I have sliders affecting the thermal properties of the envelope, the WWR, and the shading depths.\n\n\n\nI left my Galapagos running overnight and it ran out of RAM (have a 16GB RAM on Comp, Rhino was maxing out at 14.x GB).\n\n\n\nAt first I thought it was Galapagos causing this problem, but then I tried to manually adjust the sliders myself and found that each adjustment of slider would increase RAM, and very rarely it may decrease RAM. This was with the EPlus simulation component turned off, so I was basically just changing the parameters.\n\n\n\nWith about 17 changes in parameter sliders I was able to increase my RAM usage from 1.3GB to 4.6GB. This was with all previews off.\n\n\n\nI tried the following:\n\nUndoClear in Rhino - No effect\n\nSolution -&gt; Clear + Recompute - Adds to RAM usage\n\n\n\nIs this something to do with Rhino? GH? HB? It seems that it is continuously remembering all previous states? Or would it have something to do with how I built the flow of GH (I'm quite new to it, so maybe it is something I am doing).\n\n\n\nGreatly appreciate any help, would really want to be able to do some nice optimization runs. Thanks!\n", "attachments": [], "created_by_name": "Timothy L", "created_at": "September 22, 2016 at 9:31pm", "created_by": "TimothyL", "topic": "Each Iteration adds to RAM Usage - Honeybee", "replies": [{"body": "\nHi Timothy,\n\nI can help you more if you can share your file. There are ways to optimize the ram usage for repetitive analysis.\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "September 22, 2016 at 10:28pm", "created_by": "MostaphaSadeghipour", "replies": [{"body": "\nTimothy,\n\nI knew it was only a matter of time before someone brought this up.  The heart of the issue is that, each time a Honeybee component runs that alters HBZones, there is an entirely new copy of the zone object being made.  So, if you have a large model, with many components that alter the zones, and try to run several iterations of it, you can find yourself writing a lot of copies of zones to your memory quickly, which will max out your memory in the way you describe.\n\nBecause of this, I have actually gotten a lot of mileage out of upgrading my computer from 16 GB to 32 GB.  Still, as Mostapha suggests, there are a number of intelligent ways of laying out the GH script to minimize the copies of zones that get written to memory and will buy you more iterations before max-out.  If you upload the GH file, we can understand the memory pressure points.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "September 22, 2016 at 10:48pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nHi Mostapha and Chris,\n\n\n\nThanks for the quick replies. I am guessing, unfortunately, there is no way to clear the copies of \"old zones\"?\n\n\n\nI have uploaded my GH script, and would welcome any suggestions and comments.\n\n\n\nThanks both of you for taking the time to have a quick look.\n\n\n\nTim\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1604462", "name": "office_hb_v2.gh"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1604463", "name": "office_rhino.3dm"}], "created_by_name": "Timothy L", "created_at": "September 23, 2016 at 1:15am", "created_by": "TimothyL", "replies": []}, {"body": "\nThere are ways to clear the copies which is why I needed your file. I'll check your file later today.\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "September 23, 2016 at 7:49am", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nThanks for the help.\n\n\n\nI updated the GH file a bit, as I found out that leaving some fields not defined made the whole component (EPWindowMat and EPConstruction) undefined during the simulation.\n\n\n\nTim\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1605720", "name": "office_hb_v3.gh"}], "created_by_name": "Timothy L", "created_at": "September 25, 2016 at 9:54pm", "created_by": "TimothyL", "replies": []}, {"body": "\nHi Timothy, I started looking into the file. I added a new method to remove older Honeybee zones but that doesn't really make a huge difference. I made a change in update EPConstruction component that is making the biggest difference on my system. Can you test the attached file and report back if the changes have made any improvements.\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1606639", "name": "office_hb_v4.gh"}], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "September 27, 2016 at 9:15am", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nHi Mostapha, thanks for the work.\n\n\n\nMy two observations:\n\n\n\nThe new component seems to slightly slow down the RAM usage increase, and it seems like there is a slightly higher probability that some RAM clears a bit after changing the parameters.\n\n\n\nThe script also solves faster after a change in parameter at the envelope thermal properties. However, there seems to be no output from the new EPConstruction component?\n\n\n\nTim\n", "attachments": [], "created_by_name": "Timothy L", "created_at": "September 28, 2016 at 12:36am", "created_by": "TimothyL", "replies": []}, {"body": "\nThank you for testing. I wanted to make sure that I'm in the right direction. The output issue is a typo. I have a couple of other ideas that should help. Will get back to you soon.\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "September 28, 2016 at 7:40am", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nHi Timothy, Finally had a chance to re-visit this issue. Check the attached file and let me know how it works. I re-wrote how honeybee handles honeybee objects between the zones. This is as good as it can get in Rhino 5. In Rhino 6 we can make it even better!\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1633618", "name": "office_hb_v4.gh"}], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "November 4, 2016 at 10:55pm", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "November 5, 2016 at 6:37am", "created_by": "ChrisMackey", "replies": []}, {"body": "\nHi Chris, Sounds good to me. Following Grasshopper's conventions is always a good idea.\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "November 5, 2016 at 7:28am", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nHi Mostapha, <br/><br/>I am facing the same type of issue with a recursive voxel aggregation. Within a loop of Anemone I use honeybee to test recursive geometries. with the 40 000 points, and therefore voxels to be tested, my memory runs out quick and rhino crashes.<br/><br/>I have attached the gh file.\n\n\n\nSo far I have been trying to pause the loop save the gh file, close rhino and reopen and start the loop again. However as soon as the ram is busy, pausing the loop is not possible.<br/><br/>Is there a way to clear the cache at each iteration or a way around this?<br/><br/>Olivier\n", "attachments": [], "created_by_name": "Olivier Dambron", "created_at": "November 11, 2016 at 3:52am", "created_by": "OlivierDambron", "replies": []}]}]}