{"body": "\nHello everyone,\n\n\n\nI was testing the parametric daylight analysis example file from GitHUB that uses the Ladybug_fly component to generate multiple results files, and i want to know if there is some way to bring all those results at once to grasshopper. In the example file there are only 20 results and it is possible to copy each result file path manualy to grasshopper, but with more results it becomes impraticable.\n\n\n\nThank you all\n\nAllyson Santos.\n\n\n", "attachments": [], "created_by_name": "Allyson Carvalho Silva Santos", "created_at": "September 26, 2016 at 8:56am", "created_by": "AllysonCarvalhoSilvaSantos", "topic": "How to read multiple results from Ladybug_fly ?", "replies": [{"body": "\nThere is a way, but it can be a bit tricky. If you have the plug-in called Human (get it at [food4rhino](http://www.food4rhino.com/project/human?etx)), there is a component (Directory Contents) where you can see all files/folders within a folder. You can use that to look in your \"mother-folder\", where all your daylight analysis files are. Plug the complete list of contents from the \"mother-folder\" into the HB \"Lookup Daylight Folder\" component, and you should be able to get the results.\n\nI, however, have had some issues with connecting multible paths into the daylight lookup component. Therefore it could be an idea to generate the file paths directly, with concatenate and using \"read file\" to get the data.\n\nHope it helps a little\n\n/Christian\n", "attachments": [], "created_by_name": "Christian Kongsgaard", "created_at": "September 26, 2016 at 9:29am", "created_by": "ChristianKongsgaard", "replies": [{"body": "\nI will try using the DataRecorder component.\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "September 26, 2016 at 10:49am", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nThanks for your answers guys, i tried the Directory Contents component and the DataRecorder component, they both worked really well. I will try later use the human component with concatenate.\n\n\n\nThanks for your help,\n\nAllyson Santos.\n", "attachments": [], "created_by_name": "Allyson Carvalho Silva Santos", "created_at": "September 27, 2016 at 6:26am", "created_by": "AllysonCarvalhoSilvaSantos", "replies": []}]}], "id": "1605873"}