{"body": "\nHi,\n\n\n\nI have a request that many others may enjoy in HoneyBee.\n\n\n\nI've been trying to create a module to calculate LEEDv4 ASE without luck.\n\nIt was very inspired by the readAnnualResultsI block.\n\n\n\nI want it to look at results from an annualDaylightSimulation made with 0 bounces on several rooms.\n\n\n\nCurrently I can use the readAnnualResultsI with a DAIllumThreshold value of &gt;1000 lux but output is in integer percentage-number instead of absolute yearly hours (i can multiply with 8760/100, but then rounding has been done).\n\n\n\nAlso it does not give me a shading schedule which should be activated/deactivated for hours with more or less than 2% of the points with &gt;1000lux.\n\n\n\nIt should output the amount annual hours above 1000 lux for each point in the same tree structure as the input points. (i have a tree with one list per simulated room)\n\n\n\nIdeally it would also output a list of 8760 (or length of whatever input schedule is used) true/false for values, each hour, or freshly generated schedule files (one for each list of inputted points).\n\n\n\nCurrently i do this statistics with regular GH components on every hourly values, but with, lets say, 1000 analysis points, and 8760 hours (8,760,000 float values), grasshopper starts stalling.\n\nI was hoping it was possible through scripting, as this way (like the readAnnualResultsI) it does not slow down the GH UI once finished running.\n\n\n\n-\n\n\n\nMy method is currently to use these freshly generated schedules do extract values from two different daylightAutonomies in order to create a sDA, which is needed for the LEEDv4 simulation. Currently my workflow works, but only on around 200-500 points, while some of our floor plans require more than 5000.\n\n\n\nHope my request makes sense - and let me know if you need any inputs. Hopefully we can make a fast way of implementing new LEED required simulations.\n\n\n\nBest,\n\nMathias Sønderskov\n\nMsc.Eng.Arch\n", "attachments": [], "created_by_name": "Mathias s n", "created_at": "September 25, 2016 at 2:50pm", "created_by": "Mathiassn", "topic": "Calculating LEED ASE", "replies": [{"body": "\nHi Mathias,\n\n\n\nWe have been working on adding this functionality to Honeybee for a while. You can read about it [here](https://github.com/mostaphaRoudsari/Honeybee/issues/477) , [here](https://github.com/ladybug-analysis-tools/honeybee/issues/51), [here](https://unmethours.com/question/16941/radiance-options-for-direct-sunlight-calculation/) and if you are familiar with rcontrib in Radiance, [here](https://unmethours.com/question/17201/rcontrib-misses-one-of-the-modifiers-if-number-of-modifiers-between-240-420/?comment=17658#post-id-17658).\n\n\n\nThere are essentially two aspects to implementing ASE:\n\n1. First, as you pointed out has to do with performance and being able to analyze larger number of illuminance grid points than currently possible.\n\n2. Second, which is probably more critical and the main bottleneck as far as implementation goes, has to do with the accuracy of Daysim. Just making the current Daysim engine work with ASE will result in erroneous simulations as Daysim overestimates the size of the sun (as compared to reality) by several orders of magnitude. \n\n\n\nThe implementation of ASE that we are working on currently will address both of the above issues. It should hopefully be available in this library: [https://github.com/ladybug-analysis-tools/honeybee](https://github.com/ladybug-analysis-tools/honeybee) sometime next month and will get ported over to Honeybee inside grasshopper after that.\n\n\n\nSarith\n\n\n\n\n", "attachments": [], "created_by_name": "Sarith Subramaniam", "created_at": "September 25, 2016 at 9:02pm", "created_by": "sarith", "replies": [{"body": "\nHello\n\n\n\nMay I ask if LEED v.4 report is now available for Honeybee now? \n\n\n\nThanks\n\nLadan \n", "attachments": [], "created_by_name": "Ladan GD", "created_at": "December 1, 2016 at 12:59pm", "created_by": "LillyGD", "replies": []}, {"body": "\nHello\n\n\n\nDoes anyone have any updates about this? I appreciate any inputs :) \n\n\n\nthanks\n\nLadan\n", "attachments": [], "created_by_name": "Ladan GD", "created_at": "December 5, 2016 at 10:15am", "created_by": "LillyGD", "replies": []}, {"body": "\nHi Ladan,\n\n\n\nAs you are probably aware, the element of LEED v.4 daylight calculations that has been missing in Honeybee is the possibility to calculate ASE. I had mentioned a couple of months ago that we were working on implementing that script. Most of the development has already been [finished](https://github.com/ladybug-analysis-tools/honeybee/blob/master/honeybee/radiance/recipe/sunlighthours.py) and we are currently testing the scripts inside Grasshopper. We will probably have an official announcement from Mostapha and Chris sometime early next year.\n\n\n\nThis development has been so long in the making because we had to [rewrite](https://www.radiance-online.org/community/workshops/2016-padua/presentations/213-SadeghipourSubramaniam-AutomatingWorkflows.pdf) a significant part of the back-end code.\n", "attachments": [], "created_by_name": "Sarith Subramaniam", "created_at": "December 5, 2016 at 11:02am", "created_by": "sarith", "replies": []}, {"body": "\nSarith\n\n\n\nThat is great news! thanks for the update, I am looking forward to this new feature in HB.\n\n\n\nLadan\n", "attachments": [], "created_by_name": "Ladan GD", "created_at": "December 6, 2016 at 1:56pm", "created_by": "LillyGD", "replies": []}]}], "id": "1605466"}