{"body": "\nHello everyone, \n\n\n\nAs most of you probably know, E+ v8.6.0 is out and it brings a few interesting improvements over previous versions. One that caught my eye and would like to start a discussion on how it can be implemented in Honeybee (if not already there with additionalParams). I would love the feedback of the more experienced users here.\n\n\n\nThe change refers to the the Daylighting:Controls object ([https://github.com/NREL/EnergyPlus/pull/5725](https://github.com/NREL/EnergyPlus/pull/5725)). As most of you know until now this allowed for 'only' 2 reference points per zone, something that led most of us to manually split zones when we wanted a more detailed design of daylight zones and assessment of the impact of daylight control strategies. This is now changing with two new objects replacing the previous one:\n\n\n\n- Daylighting:DELight:Controls\n\n- Daylighting:DeLight:ReferencePoint\n\n\n\nThe extension of the single object to two now allows for as many reference points as the user wants! I was wondering if this will work out of the box with Honeybee. Does it make any sense to now include this capability in an input of a component, for example using the output of the HB grid points component to quickly define control points on a surface/zone?  \n\n\n\nThanks in advance.\n\n\n\nKind regards,\n\nTheodore.\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "October 1, 2016 at 3:57pm", "created_by": "TheodorosGalanos", "topic": "EnergyPlus v8.6.0 - Daylighting Control", "replies": [{"body": "\nTheodore,\n\nI am glad to hear about this new change.  I have implemented a basic version of E+ daylighting control objects on the \"Honeybee_Set Zone Thresholds\" component but this is even more basic than the 2-sensor model in that it just takes one sensor point and illuminance threshold per zone:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/VvUMGQ4qJez4p0P0wHZBQeh6V4*SgvMCXBz5ReI5PpxM5QKdTuZtwG9d*8KIXQ32PmVjdD09eHoGSTpk8DCky8sOE5Vr-*q-/NewZoneThresholds.JPG\" width=\"430\"/>](http://api.ning.com:80/files/VvUMGQ4qJez4p0P0wHZBQeh6V4*SgvMCXBz5ReI5PpxM5QKdTuZtwG9d*8KIXQ32PmVjdD09eHoGSTpk8DCky8sOE5Vr-*q-/NewZoneThresholds.JPG)\n\n\n\nIt will take a bit of time for me to update this component to the new capabilities but, if you go with the additionalStrings route, it should work right out of the box with HB.\n\n\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "October 1, 2016 at 5:19pm", "created_by": "ChrisMackey", "replies": [{"body": "\nHi Chris,\n\n\n\nThanks for the reply. It's good to know this will be usefull and implemented (:)) There's no rush ofc, I can start testing this out with the additional parameters. It's good to know where to look for this.\n\n\n\nDo you think this might also change something on the downstream, i.e. visualization/result assessment components or is it not that big of an impact? I am thinking something like visualizing scenarios of different daylight zones and energy consumption. I am guessing all this can be done with the re-color mesh just wondering if this merits some special treatment.\n\n\n\nKind regards,\n\nTheodore.\n\n\n\n\n\n\n\n\n\n\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "October 1, 2016 at 8:25pm", "created_by": "TheodorosGalanos", "replies": []}, {"body": "\nTheodore,\n\nAs far as I can tell, the lighting energy use results still come out on a thermal zone-by-zone basis.  This was at least the case for the two sensor daylighting control.  If you find that the results with these new objects come out differently, we can consider some other ways of visualizing them.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "October 2, 2016 at 9:14am", "created_by": "ChrisMackey", "replies": []}]}, {"body": "\nHi Theodore and Chris, This is very good potential and much faster for early prediction daylight analysis like for large buildings during in design. I'm trying to test this method in honeybee with addstrings but i've problem to run. Is it possible to share an example for this method in honeybee to help me?\n\nThanks in advance.\n\nbest,\n\nM\n", "attachments": [], "created_by_name": "OH_Dimore", "created_at": "October 7, 2016 at 11:44am", "created_by": "MohammadR", "replies": [{"body": "\nHi Mohammad,\n\n\n\nUnfortunately I am currently tied up to completely different studies.\n\n\n\nI will hopefully be going over E+ again this week, revamping base on Chris's new components. I'll let you know when I try this out.\n\n\n\nKind regards,\n\nTheodore.\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "October 9, 2016 at 5:27pm", "created_by": "TheodorosGalanos", "replies": []}, {"body": "\nMany thanks for the prompt reply Theodoros,\n\nVery nice!!\n\nI am looking forward to your good news :)\n\nBest Regards,\n\nM\n", "attachments": [], "created_by_name": "OH_Dimore", "created_at": "October 21, 2016 at 5:58am", "created_by": "MohammadR", "replies": []}]}]}