{"body": "\nThis component is opened as a reply to Aymeric Delmas's questions [posted in here](http://www.grasshopper3d.com/group/ladybug/forum/topics/lb-terrain-generator?commentId=2985220%3AComment%3A1612825&amp;xg_source=msg_com_gr_forum).\n\n\n\nHowever, following the install instructions and checking for the opentopography.org availability, the component does not seem to manage to download the data... (see picture attached).Djordje, do you have any idea about what I can I do or check to fix this?\n\nI just tried to run the component for a couple of locations and it successfully downloaded the data from opentopography.org:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/9Dz4T2phCGGv*F0vVOw2gHAblx22sVfUlA2UahGQu9gyjgwSUPJhOqooaYbVxA*FDNok9Ii9bI7dPeHg-vmlkB*-EXz6FVU0/saintDenisReunion.jpg?width=300\" width=\"300\"/>](http://api.ning.com:80/files/9Dz4T2phCGGv*F0vVOw2gHAblx22sVfUlA2UahGQu9gyjgwSUPJhOqooaYbVxA*FDNok9Ii9bI7dPeHg-vmlkB*-EXz6FVU0/saintDenisReunion.jpg)\n\nWhen did you try to run the component? An hour ago?<br/>Can you try again?\n\n\n\n\n\nOther question, just to be sure, regarding the \"origin_\", is it the central point that you to get out of the output mesh/surface? And does it need to be the point at the actual point elevation or does it need to be the point projected on the ground floor (as I do in my definition)?\n\nYes, you are correct about both things: it's the central point and it will lie on the actual terrain (it will be projected to the terrain).<br/>The latitude and longitude information from the _location input will be taken to find the origin_ point. Elevation will always be ignored, as elevation is calculated from the elevation of the point laying on the terrain at those particular latitude-longitude coordinates.<br/><br/>Please let me know if I did not precisely gave the answer to your questions. Or if I misunderstood your question.<br/>We are here to help with any issue.\n", "attachments": [], "created_by_name": "djordje", "created_at": "October 7, 2016 at 4:25am", "created_by": "djordje", "topic": "Few questions about \"Terrain Generator 2\" component", "replies": [{"body": "\nThank you very much for your quick and complete answer Djordje!\n\n\n\n\n\nAbout the \"origin_\", thank you for your answer, that was what I was wondering.\n\n\n\n\n\nAbout the component, I tried reinstalling the libraries (checking that they were unlocked) and running the component again a few minutes ago with the same result... \n\nIt does not manage to download the data but seems to run though (it takes a while and then gives the error message).\n", "attachments": [], "created_by_name": "Aymeric Delmas", "created_at": "October 7, 2016 at 5:21am", "created_by": "AymericDelmas", "replies": [{"body": "\nHi Aymeric,<br/><br/>Let's see what may be causing the issue:<br/><br/>If this second time you got the same message as in the [photo you attached](http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1612827), then your GDAL libraries are installed correctly. If they weren't you would have been informed about it.<br/><br/>So something is wrong with download of the raster data from the opentopography.org to your PC.\n\n<br/>Let's try a couple of things:<br/><br/>1) Paste this link into your internet browser's address box (Firefox, Chrome ...) and hit Enter:<br/><br/>[http://opentopo.sdsc.edu/otr/getdem?demtype=SRTMGL3&amp;west=-120.1...](http://opentopo.sdsc.edu/otr/getdem?demtype=SRTMGL3&amp;west=-120.168457&amp;south=36.738884&amp;east=-118.465576&amp;north=38.091337&amp;outputFormat=GTiff)<br/><br/>Does that result in download of a file .tif?<br/>If it does, then what is the size of that .tif file?\n", "attachments": [], "created_by_name": "djordje", "created_at": "October 7, 2016 at 5:39am", "created_by": "djordje", "replies": []}, {"body": "\nThis indeed the issue, pasting the given link (using Chrome), the site can't be reached.<br/><br/><br/><br/>\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1612678", "name": "Screenshot 2016-10-07 15.39.22.png"}], "created_by_name": "Aymeric Delmas", "created_at": "October 7, 2016 at 5:44am", "created_by": "AymericDelmas", "replies": []}, {"body": "\nWhat you have just tried, is what the component does under the hood.<br/>The fact that you can not manually download a raster file, means that the issue is not with the \"Terran Generator 2\" component.<br/>For some reason your PC can not access the opentopography.org SRTM service.<br/><br/>Can you access the very website ([http://opentopography.org](http://opentopography.org)) through your Chrome browser?\n", "attachments": [], "created_by_name": "djordje", "created_at": "October 7, 2016 at 5:51am", "created_by": "djordje", "replies": []}, {"body": "\nOK I see. This is weird, because this is the webpage that I usually use ([http://opentopo.sdsc.edu/raster?opentopoID=OTSRTM.082015.4326.1](http://opentopo.sdsc.edu/raster?opentopoID=OTSRTM.082015.4326.1)).\n\nI can access it and download the data manually as usual . \n", "attachments": [], "created_by_name": "Aymeric Delmas", "created_at": "October 7, 2016 at 5:55am", "created_by": "AymericDelmas", "replies": []}, {"body": "\n[http://opentopography.org](http://opentopography.org) switches to that [http://opentopo.sdsc.edu/](http://opentopo.sdsc.edu/)... link when a user accesses the \"Data\" section of the site. So this means you can access the [http://opentopography.org](http://opentopography.org) website.<br/><br/>We can do this the other way around: I can try to download the raster file for you, and then you will copy it to certain folder from which your \"Terrain Generator 2\" component will create the 3d terrain.<br/><br/>Can you please attach your .gh file containing the \"Terrain Generator 2\" component? I basically want to know the latitude/longitude of your location and your radius_.<br/><br/>You want a 3d terrain of the whole Réunion island? Where would the origin_ point be? The center point of the island or Saint-Denis in the north part of it?\n", "attachments": [], "created_by_name": "djordje", "created_at": "October 7, 2016 at 6:09am", "created_by": "djordje", "replies": []}, {"body": "\nThanks Djordje, <br/><br/>It actually works with my laptop (don't know why or what is the difference). <br/>Anyway. Actually, I already have the .tif file for the whole Island that I used to generate a mesh with the DTM component (actually used it in .asc format). I use it to place various points based on their locations on it. \n\n<br/>What I would like to do, that I have not managed so far and that your component could help me to do, is to generate a Surface patch based on a radius_ and the _location of a specific place of the Island ( as your component do! ;)<br/><br/>At the end, it is basically using your component as a split component of the whole island .tif, instead of downloading each time the data.<br/><br/>Does this makes sense to you?\n\nI have started to look at your script I can see the parts that I am interested in but my hard coding skills are quiet poor ^^<br/><br/>\n\nTif file and metadata :[https://we.tl/y0lg3usqb9](https://we.tl/y0lg3usqb9)\n", "attachments": [], "created_by_name": "Aymeric Delmas", "created_at": "October 7, 2016 at 11:41am", "created_by": "AymericDelmas", "replies": []}, {"body": "\nHi Aymeric,<br/><br/>I didn't understand you.\n\nYou would like to have a terrain of the parts of Réunion island, and not of the whole Réunion island?<br/>You would like that terrain to be a surface instead of a mesh?<br/>Sorry If I misunderstood you.\n", "attachments": [], "created_by_name": "djordje", "created_at": "October 7, 2016 at 11:53am", "created_by": "djordje", "replies": []}, {"body": "\nHi Djordje, <br/><br/>no worries at all, sorry for my explanations that were not very clear.\n\nI want to generate both the whole island (that I will bake) and parts of the island based on their location. Both things are possible with your component.\n\nI was only wondering if it would be possible not to download the .tif data for the different parts of the island I want to generate each time. But instead, use the .tif of the whole island (since already downloaded) and use your component like a \"split\" component.<br/><br/><br/>\n", "attachments": [], "created_by_name": "Aymeric Delmas", "created_at": "October 7, 2016 at 12:04pm", "created_by": "AymericDelmas", "replies": []}, {"body": "\nI understand you now. Sorry for not being able initially.<br/><br/>It is definitely possible.<br/>But it would require rewriting the code of the component, which I am not really keen to do.<br/><br/>If you are forced to use your PC instead of the laptop, maybe you could try to:<br/>Add the [http://opentopography.org](http://opentopography.org) and [http://opentopo.sdsc.edu](http://opentopo.sdsc.edu) links to your Windows Firewall exception list.\n\nIf that does not help, maybe you can turn off your Windows Firewall entirely. If that does not help, try turning off your antivirus entirely.<br/>Maybe some of these applications is blocking you from downloading the .tif file.\n", "attachments": [], "created_by_name": "djordje", "created_at": "October 7, 2016 at 12:17pm", "created_by": "djordje", "replies": []}]}, {"body": "\nI will try that on Monday and will let you know.<br/><br/>Of course, I can imagine that this will represent extra and not needed work. Thank you again for your work and your prompt and complete answers.<br/><br/>I will probably use it as it is and if I find another way to do it I will let you know ;)<br/><br/>Cheers, have a good week-end\n", "attachments": [], "created_by_name": "Aymeric Delmas", "created_at": "October 7, 2016 at 12:22pm", "created_by": "AymericDelmas", "replies": [{"body": "\nThanks. I am eager to hear what will happen.<br/><br/>Sorry if I wasn't of much help to you.<br/><br/>In the end, if you are forced to use your PC and not laptop, you can always use the \"Terrain Generator\" component instead of \"Terrain Generator 2\" component. It will extract the elevation data from Google earth instead of Opentopography. The elevation data is different though, as they use different [sources](http://www.grasshopper3d.com/xn/detail/2985220:Comment:1588204).<br/><br/>By the way: I am already in love with the Karya project!!! It seems like a very interesting topic, and a perfect example of how environmental and computational aspects of design should be merged!<br/>I will definitely check the blog to read the new information about it, once in a while\n", "attachments": [], "created_by_name": "djordje", "created_at": "October 7, 2016 at 1:31pm", "created_by": "djordje", "replies": []}]}]}