{"body": "\nDear all,\n\nThere are 3 typical infiltration rates suggested in the Set EnergyPlus Zone Loads Component of Honeybee for tight, average and leaky buildings (see image). This is something I have always looked for but never found a simple answer, which in my opinion is very useful for most cases. \n\nI have checked ASHRAE Handbook of Fundamentals, 90.1, 62.1, and some other papers and publications with no luck.\n\nCould anybody give me more information about these values?\n\nThanks,\n\nJorge\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1612011", "name": "TypicalInfiltrationValues.png"}], "created_by_name": "Jorge Conejo", "created_at": "October 5, 2016 at 4:44pm", "created_by": "JorgeConejo", "topic": "Recommended Infiltration Rate", "replies": [{"body": "\nJorge, \n\nInfiltration rates are a tricky subject because most institutions have chosen a different method for measuring this. \n\nHave a look at this thread I started a while ago :\n\n[http://www.grasshopper3d.com/group/ladybug/forum/topics/infiltratio...](http://www.grasshopper3d.com/group/ladybug/forum/topics/infiltration-values?xg_source=activity)\n\n\n\nHope that helps. Alternatively you can browse through the energyplus documentation; they have a lot of useful info. \n\n\n\nbest, \n\n\n\nMauricio\n", "attachments": [], "created_by_name": "Mauricio Aguilar Cardenas", "created_at": "October 6, 2016 at 4:24am", "created_by": "MauricioAguilarCardenas135", "replies": [{"body": "\nJorge,\n\n\n\nAdmittedly, I wrote those recommendations in the description without being certain which ASHRAE publication that they came from.  There's a chance that it might come from the analysis of CBECS data but I am not entirely sure.\n\n\n\nTo show that those numbers are not totally unfounded, here are the results of a real study of 65 buildings that have had their infiltration measured using a blower door test:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/99aVnO*4LGeGg4VWNuciH8WjuUYt66cNHbDEleLYIOsG5ELGE9rvgODdpT6JJ9lxNesgdeRqUja3S9o3WvFP*RWSSjqt3qWc/Infiltration.JPG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/99aVnO*4LGeGg4VWNuciH8WjuUYt66cNHbDEleLYIOsG5ELGE9rvgODdpT6JJ9lxNesgdeRqUja3S9o3WvFP*RWSSjqt3qWc/Infiltration.JPG)\n\n\n\nTo help convert from the crazy IP/SI hybrid numbers here:\n\n0.75 cfm/ft2 at 75Pa corresponds to 0.0006 m3/s-m2 at 4Pa (Leaky Building)\n\n0.5 cfm/ft2 at 75Pa corresponds to 0.0003 m3/s-m2 at 4Pa (Average Building)\n\n0.25 cfm/ft2 at 75Pa corresponds to 0.0001 m3/s-m2 at 4Pa (Tight Building)\n\n\n\nAs you can see, the range of real results generally correspond to the three recommended classes but there are 7 buildings that are so leaky that they are in their own category and there are number of buildings by the army core of engineers (ACE) that are consistently below the tight building class (although it's usually not too far below).\n\n\n\nI hope this helps give a better sense of the possible range of infiltration.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "October 7, 2016 at 3:49pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nMauricio,\n\nI had already checked that post out. There is indeed great information there, but my concern was getting more info on the specific values that were suggested in Honeybee. I agree that infiltration is a tricky subject, but when there is no measured data available these notions of approximate rates are great to have.\n\n\n\nChris,\n\nExcellent. This is exactly what I was looking for. I would love to see a greater sample, classified by climate zone, but I guess that is too much to ask. If you or somebody else knows where to find something that gets closer to it, it would be great.\n\n\n\nThank you to both of you!\n\nJorge\n\n\n", "attachments": [], "created_by_name": "Jorge Conejo", "created_at": "October 7, 2016 at 11:19pm", "created_by": "JorgeConejo", "replies": []}]}], "id": "1612012"}