{"body": "\nHi everybody, I'm analyzing the illuminance level of a simple rectangular space covered with horizontal louvered panels. The panels can be rotated for 90 degrees in order to adjust the amount of interior light during the day. I tried to optimize the amount of interior Lux (specifically between 50 to 300 lux, in my case) by finding the optimum angle of the panels. At the end of optimization I draw the graph of the results in excel but the outcome was very strange.\n\nThe graph shows the illuminance level inside the building for the entire day (the panels are constant). If you have a look at it, the result changes suddenly at 2pm which is not logical for me at all.\n\nI would be so pleased if anyone could possibly help me with this issue??  \n\n \n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1621832", "name": "00.PNG"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1621833", "name": "000.PNG"}], "created_by_name": "maysam foolady", "created_at": "October 19, 2016 at 3:52pm", "created_by": "04jnf69xjtuch", "topic": "problem in the result of illuminance level", "replies": [{"body": "\n1. What type of sky are you using to run the analysis and for which time of the year?\n\n2. Did you try to read the results back for each hour and see how the results are so different at 2pm?\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "October 20, 2016 at 7:53am", "created_by": "MostaphaSadeghipour", "replies": [{"body": "\nOh, thank you very much. I was not considering the sky type. I was using \"Climate Based sky\", that's why I had a sharp changes at 2pm. I just replaced it by \"Standard CIE sky\" and everything is working well now. \n\nThank you very much for the support,\n\nmaysam\n", "attachments": [], "created_by_name": "maysam foolady", "created_at": "October 20, 2016 at 3:05pm", "created_by": "04jnf69xjtuch", "replies": []}]}, {"body": "\nSo why is a climate based sky analysis responsible for a drastic change at 2pm? \n", "attachments": [], "created_by_name": "Saeran Vasanthakumar", "created_at": "October 21, 2016 at 3:35pm", "created_by": "SaeranVasanthakumar", "replies": [{"body": "\nSorry for the late reply Saern, \n\nI Think the reason is that Climate based sky obtain similar climatic condition of an specific geographical environment (I did analysis for Amsterdam). However, in CIE sky you can choose whether they sky to be sunny, cloudy or etc. while you are analyzing your design.  So I think in my case, the sky might be sunny whole day except for 2pm which is cloudy.\n", "attachments": [], "created_by_name": "maysam foolady", "created_at": "October 29, 2016 at 5:17am", "created_by": "04jnf69xjtuch", "replies": []}, {"body": "\nAh, makes sense, thanks.\n", "attachments": [], "created_by_name": "Saeran Vasanthakumar", "created_at": "October 29, 2016 at 11:53am", "created_by": "SaeranVasanthakumar", "replies": []}]}], "id": "1621834"}