{"body": "\nHi all,\n\n\n\nI'm having a bit of an issue with one of my thermal models. I am trying to model a building with double height spaces and internal balconies (thus ariwall adjacencies galore) using the solve adjacencies component in HB.\n\n\n\nI am having the following issue: I am solving adjacencies a few times, first solving for the entire model without air walls, then only connecting those with air walls as adjacencies etc... however, every time I I have to remove current adjacencies in order to create new air walls or adiabiatic walls which removes any other adjacencies I had before (internal floors etc...).\n\n\n\nMy question therefore is, what is the best approach to create holes/airwalls on certain surfaces only? I am considering working on a hybrid script that creates air walls in the same way the Honeybee_addHBGlz component works but maybe there's no need to go through that effort.\n\nThanks in advance!<br/><br/>Antoine\n\n\n\nPS: GH file attached with 3 different types of geometry I am trying to get into HB (thermal zones, empty zones from double height spaces, adiabiatic adjacencies).\n\n\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1624115", "name": "Adjacency Issues.gh"}], "created_by_name": "Antoine Dao", "created_at": "October 24, 2016 at 2:01am", "created_by": "AntoineDao", "topic": "Modelling Double Height spaces + Holes/Airwalls", "replies": [{"body": "\nCan you create the zones surface by surface and set the airwalls in the surface level?\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "October 29, 2016 at 9:25pm", "created_by": "MostaphaSadeghipour", "replies": [{"body": "\nI probably could yes. I'm just thinking in terms of scalability and parametric design: if I want to change the size of those holes or location of double height spaces managing those surfaces etc... seems like it will be quite complex. Or is there some neat workflow that does not require some complex data tree management system?<br/><br/>PS: I've been working on this hole making tool. Think the script it right but it seems like it can't pull HBObject information from the hive. any tips?\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1629469", "name": "Hole creation Test.gh"}], "created_by_name": "Antoine Dao", "created_at": "October 31, 2016 at 8:55am", "created_by": "AntoineDao", "replies": []}]}, {"body": "\nBump for help!\n", "attachments": [], "created_by_name": "Antoine Dao", "created_at": "November 11, 2016 at 7:31am", "created_by": "AntoineDao", "replies": [{"body": "\nAh! I totally dropped the ball on this one. Let me check this during the weekend and get back to you. Thank you for the note.\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "November 11, 2016 at 8:27am", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nAmazing thank you!\n", "attachments": [], "created_by_name": "Antoine Dao", "created_at": "November 11, 2016 at 9:05am", "created_by": "AntoineDao", "replies": []}, {"body": "\nHi Antoine, Sorry for the delay.\n\n1. You couldn't get the Honeybee objects since the TypeHint for GHPython component wasn't set to GeometryBase. I started debugging your component but didn't finish it.\n\n2. I'm attaching another file that shows how you can change the two surfaces to AIR WALL and then solve the adjacencies for the rest of the model. I put them in a new file since I'm using a newer version of Honeybee which will break your old definitions. You can recreate it with the older version and it should work.\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1639860", "name": "HolecreationTest_msr.gh"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1639861", "name": "airwall_adjacencies_msr.gh"}], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "November 15, 2016 at 8:42am", "created_by": "MostaphaSadeghipour", "replies": []}]}], "id": "1624116"}