{"body": "\nHi!\n\n\n\nI´m trying to model a horizontal shading slate that is offset above the start of the window and/or extends beyond the side edges of the window. I seems that E+ only allows me to stay within the window boundaries. Im just about to give up on using the E+ [WindowMaterial:Shade](http://bigladdersoftware.com/epx/docs/8-3/input-output-reference/group-surface-construction-elements.html#windowmaterialshade) components for this task but then I got some confusing hope by the E+ manual when I saw the \"OtherShadingType\", and some other ways that I might be able to input what I wanted.<br/><br/>Does anyone have any insight into the limitations and workarounds of E+ on this? \n\nNote: I´d prefer not to use a context geometry because I want the thermal properties like radiation balance and so on to be calculated.\n", "attachments": [], "created_by_name": "Ludvig Haav", "created_at": "October 27, 2016 at 3:06am", "created_by": "LudvigNyman", "topic": "E+ Shade generator geometry limitations", "replies": [{"body": "\nHi Ludvig,\n\nas you said there are some limitations for thermal analysis using outdoor shading in E+;\n\nactually, the \"OtherShadingType\" allows you to \"describe\" your custom and complex geometry as you prefer...you should type you own IDF file  and adding to ADDITIONAL STRING into the E+ calculator component, here some examples of the IDF file:\n\n[http://bigladdersoftware.com/epx/docs/8-3/input-output-reference/gr...](http://bigladdersoftware.com/epx/docs/8-3/input-output-reference/group-surface-construction-elements.html#windowmaterialcomplexshade)\n\nIt could be helpful if you could share some image or file of your shading..anyway please have a look at this discussion:\n\n[http://www.grasshopper3d.com/group/ladybug/forum/topics/hb-shading-...](http://www.grasshopper3d.com/group/ladybug/forum/topics/hb-shading-context-transmaterial-fails?commentId=2985220%3AComment%3A1471159&amp;xg_source=msg_com_gr_forum)\n\nI hope that this helps\n\nErnesto\n", "attachments": [], "created_by_name": "Ernesto Cesario", "created_at": "October 27, 2016 at 3:34am", "created_by": "ErnestoCesario", "replies": [{"body": "\nThanks for the reply. After reading this I reckon it wont be worth the trouble. <br/><br/>\"While this may seem like the best of all worlds, it is usually VERY time-consuming to pull off as you have to parameterize the geometry into a matirx of values for the amount of sun that is permitted for every sun angle.\"<br/><br/>I will try to quantify the difference in zone energy needs that only using context geometry imposes and live with the shortcomming.\n", "attachments": [], "created_by_name": "Ludvig Haav", "created_at": "October 27, 2016 at 4:42am", "created_by": "LudvigNyman", "replies": []}]}], "id": "1626306"}