{"body": "\nHi,\n\nIs there any simple solution to set surface boundary conditions to have a constant temperature?\n\nI have my zone in question (an atrium) in-between two apartment zones that are assumed to have a constant temperature of say 21°C. Hence, I would prefer modelling only the atrium with BC's as a constant temperature rather than adiabatic.\n\nIf there is a way to give a whole zone a constant temperature, this would also be fine; I would then just model up these apartments on the side.\n\n\n\nTIA\n\n- Lasse\n", "attachments": [], "created_by_name": "Lasse Hamborg", "created_at": "October 27, 2016 at 7:29am", "created_by": "LasseHamborg", "topic": "surface BC: constant temperature", "replies": [{"body": "\nHave you searched the forum? There should be a similar discussion. You can overwrite boundary condition for surfaces and then use additionalString input to add additional data if needed. There is currently no component to do that.\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "October 29, 2016 at 9:23pm", "created_by": "MostaphaSadeghipour", "replies": [{"body": "\nLasse,\n\nI'm having some trouble understanding you case here but it may be helpful to know that the default \"ground\" boundary condition assumes that there is a constant temperature of 18 C on the exterior side of the surface.  You can change this temperature with the \"Honeybe_EP Sim Par\" component.  Just set 12 values that are all the same for each month of the year.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "October 30, 2016 at 10:59pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nThat would probably be exactly what i would be looking for. Thanks!\n\nI can be quite hard as a rookie to know what and how to do. I also have trouble getting the right results out of my simulation...\n\nI hope you can be ready with a user start guide of some sort at some point. :-)<br/>Trial and faliure with Youtube is not very effective for me. hehe.\n\nBut thanks.\n\n- Lasse\n", "attachments": [], "created_by_name": "Lasse Hamborg", "created_at": "October 31, 2016 at 8:50am", "created_by": "LasseHamborg", "replies": []}, {"body": "\nHi,\n\nI've tried as you say, but this overwrites all of the ground temperatures throughout the model. That's not a favourable solution IMO.\n\nI'd like to simulate one single zone. 1 of the surfaces is connected to the ground; 2 of the surfaces should be set to a constant temperature of 21 deg (as these are apartments which I assume to have a constant temperature as these are not in focus).\n\nSo I'm looking for a fourth option to the EPBC_ input in 'createHBSrfs' that says 'constant temp.' or something similarly instead of just adiabatic, outdoors or ground; it's neither of those.\n\n- Lasse\n", "attachments": [], "created_by_name": "Lasse Hamborg", "created_at": "November 4, 2016 at 3:50am", "created_by": "LasseHamborg", "replies": []}]}]}