{"body": "\nI am having trouble finding a way to turn off Mechanical Ventilation as an output that factors into the peak cooling load. I am trying to compare my results to a coworkers results in another Energy modeler (Trace) so we're trying to get out models to be as similar as possible. His model does not account for Mechanical Ventilation in his cooling load as we're going to be using a slightly more complex ventilation system. I attached high point may.png because the red value on may 8th seems to be offsetting the cooling results. \n\n\n\nI've set ventilation per area and per person to zero so there must be something else that I am missing. \n\n\n\nOn a slightly different note the cooling load graph generated through the energy balance component is inverted in colors and sign. It's not to big of a deal because it's easy to notice and work around but if I create a 3d chart from just the readEPresults for cooling, the output is opposite colors and  has a positive sign compared to the Energy Balance graph. \n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1627901", "name": "SouthWest Corner Room_Flat Windows.gh"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1628081", "name": "high point may.PNG"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1628082", "name": "high point may scale.PNG"}], "created_by_name": "Zack", "created_at": "October 28, 2016 at 7:56am", "created_by": "ZackSickman", "topic": "Mechanical Ventilation", "replies": [{"body": "\nHi Zack,\n\nThere were a number of things in your file that were not so good.  The first is that you were solving adjacencies of a zone with itself, which technically does not cause E+ to fail but it gives you erroneous results.  The second issue was that your model had no thermal mass in it, which can make the simulation unstable.\n\n\n\nThe mechanical ventilation energy that you are getting is because you still have an economizer in the ideal air system, which is mixing in cool outdoor air whenever the zone needs cooling and the outdoor air is cool.  If you would rather use the cooling coil of the ideal air system to cool the zone instead, you can remove the economizer with the air details component as you see in the attached file. Now, you end up with an energy balance with no mechanical ventilation:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/7AOoV0m95HlAt-F1rU-GBApKP6*kHG9nOCuiNyOqlSVpzzl8yvTL8nu7uFfMisFQ**iZN8r69YbHKQAZByeRXPs9qdiZgACr/NoMechVent.JPG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/7AOoV0m95HlAt-F1rU-GBApKP6*kHG9nOCuiNyOqlSVpzzl8yvTL8nu7uFfMisFQ**iZN8r69YbHKQAZByeRXPs9qdiZgACr/NoMechVent.JPG)\n\n\n\nAlso, if you are trying to compare HVAC system sizes and peak loads, you should really be using the OpenStudio component and eio parser as mentioned in this discussion:\n\n[http://www.grasshopper3d.com/group/ladybug/forum/topics/heating-and...](http://www.grasshopper3d.com/group/ladybug/forum/topics/heating-and-cooling-loads)\n\n\n\n-Chris\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1628773", "name": "SouthWestCornerRoom_FlatWindows_CWM.gh"}], "created_by_name": "Chris Mackey", "created_at": "October 29, 2016 at 3:26pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nChris thank you so much for following up with me.\n\nI'm going to quickly throw this out there and say that you and the whole HB/LB community are pretty amazing for putting all this together. I study industrial design but am interning at an MEP engineering firm this semester. On the first day they asked me, \"you know rhino right?\" and I say yes and they're response was okay learn HB and LB for us because none of us know rhino. I've almost got them on board with our grant program to cover the cost of the web series you guys release through performance network. \n\n\n\nI'm going to work through your response with the engineer assigned to the project and if anything else arises I'll reach out again. Thanks again for your help. \n\n\n\n\n", "attachments": [], "created_by_name": "Zack", "created_at": "October 31, 2016 at 10:42am", "created_by": "ZackSickman", "replies": []}, {"body": "\nThe challenging part of this project is that we're working on a building in Senegal where the bricks that are going to be used for this building are being made on site, by hand, out of local mud and concrete. Controlled testing hasn't been done on these bricks but apparently they're wide spread use in Senegal. \n", "attachments": [], "created_by_name": "Zack", "created_at": "October 31, 2016 at 11:14am", "created_by": "ZackSickman", "replies": []}], "id": "1627899"}