{"body": "\nHi Mostapha, Chris and team.\n\n\n\nI was wondering if it was possible to add a raw UTCI calculator to the toolbox.\n\n\n\nI'd like to input, lets say, 4 equally long lists of dryBulpTemp, MRT, Vwind10 and RelHum.\n\nAnd then I dont want the extra analysisPeriod parts and statistics in it.\n\n\n\nThe reason I'm asking, is because we are currently working on a spatial mapping of these inputs and would like the combined output to be UTCI for urban plans.\n\n\n\nI currently have 9000 values in each list and when I graft all inputs, it seems to work, but it's slow and I'm pretty that this way the script runs everything including all python-headers and so on, 9000 times.\n\n\n\nAnd also, is it possible to do a \"simple\" calculation like this in threaded mode?\n\n\n\nAnyways, thanks as always for a great suite.\n\n\n\nPS Chris: thanks for the tutorials on performance.network, it is really beneficial - but you should wish for a new microphone for christmas! ;-)\n\n\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1627292", "name": "Capture.PNG"}], "created_by_name": "Mathias s n", "created_at": "October 27, 2016 at 8:42am", "created_by": "Mathiassn", "topic": "A raw UTCI calculation in Ladybug", "replies": [{"body": "\nHi Mathias,\n\n\n\nSorry for the late response.  I am not sure what you are asking here.  If you plug in lists of equal value without any LB Headers, the UTCI component should do exactly what you are talking about.  There's no need to graft unless you are trying to run lists of lists (instead of just one list).\n\n\n\nBecause the calculation of UTCI is so fast (it's just a polynomial equation), it isn't worth it to run individual calculations of UTCI in parallel.  In other words, it takes more computational power to figure out how to divide the task between threads than to compute a single UTCI value.  However, if you have a whole spatial set of UTCI points and you want to run them for several hours of the year, it can often make sense to run each hour on it's own core.  This is effectively with the UTCI microclimate maps do here:\n\n[http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;for...](http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;fork=hydra_2&amp;id=Trees_in_Outdoor_Thermal_Comfort&amp;slide=0&amp;scale=1.319507910772895&amp;offset=-297.3990467297342,-101.89461237074937)\n\n\n\nGlad to hear that you like the PerformanceNetwork talks and, yes, I was not too electronic-savy when I picked out my current headset.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "October 29, 2016 at 9:03pm", "created_by": "ChrisMackey", "replies": []}]}