{"body": "\nHey guys,\n\n\n\nI have a problem with ladybug capture view component. I cannot figure out the problem. I am trying to get a point in time daylight simulation for 9 different times of the year and I have set it to automatically capture view in my drive C after each simulation, but I am not getting any result. The captured views in my file does not show recolormesh visualization. It is just the plan. I don't know what it is that I am doing wrong. I have checked many times and nothing seems wrong.\n\nWhen I do this simulation one by one I get the result on my rhino interface and I can capture and print that myself. But the capture view component does not work for me. And the problem is I am not getting any error so I can realize my problem. It is just not captured properly with recolormesh component. I have attached related images so you can better understand my problem. I will appreciate your help if you can tell what might be the problem. Looking forward for your response. \n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1628381", "name": "my rhino interface plan.JPG"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1628382", "name": "the captured file.png"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1628383", "name": "my grasshopper image capture part.JPG"}], "created_by_name": "Mitra Sajjadi", "created_at": "October 28, 2016 at 9:27pm", "created_by": "MitraSajjadi", "topic": "problem with ladybug capture view component", "replies": [{"body": "\nTry 'Top' instead of 'top'. View names are case sensitive. Right now it's capturing the Perspective view.\n\nAnother solution is to change your active view to the top view.\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "October 28, 2016 at 9:37pm", "created_by": "MostaphaSadeghipour", "replies": [{"body": "\nDear Mostapha,\n\n\n\nThank you for your response. I have tried both of them. The problem is that this component does not capture the recolormesh result. It just captures the plan without any simulation results when I set it to automatically save 9 images. So I have to do it one by one and it will be so time consuming. If you can help me find the problem with my file it will be awesome and I will really appreciate that. Thank you so much.\n\n\n\nLooking forward for your response.\n\n\n", "attachments": [], "created_by_name": "Mitra Sajjadi", "created_at": "October 28, 2016 at 10:01pm", "created_by": "MitraSajjadi", "replies": []}, {"body": "\nIt happens because of the order of the execution in Grasshopper. You have inserted recolorMesh after capture view so it captures the view first and then recolors the mesh. Select capture view component and press Ctrl+F. This will bring the component forward so it will execute last.\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "October 29, 2016 at 6:39am", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nGreat yes that was the problem. It solved. Thank you so much for your help.\n", "attachments": [], "created_by_name": "Mitra Sajjadi", "created_at": "October 29, 2016 at 8:31pm", "created_by": "MitraSajjadi", "replies": []}]}]}