{"body": "\nHi Mostapha, Chris and group members,\n\n\n\n1. What's the difference between pv calculation functions in the renewable table of Ladybug and the generator system in Honeybee?\n\n\n\n2. I tend to make a parametric roof model with pv, to make a optimal choice of pv arrangement by the best renewable energy production optimization. How to make the shading and array tilt, density and orientation of the pv panels into consideration? As photovoltaics surface component can make the output of tilt angle , azimuth angle and AC energy per year, how to visualize the performance difference on the form?\n\n\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/Vl6FuIcyK*tmW9TIWCL*BfC5uTmBVI1THsBJmoOiYev73QCZXyNO4jLTjYUb*I8gXqtIUFQ4or20iyT8Ftm0JoRKKDGSXYoA/Capturet.png?width=750\" width=\"750\"/>](http://api.ning.com:80/files/Vl6FuIcyK*tmW9TIWCL*BfC5uTmBVI1THsBJmoOiYev73QCZXyNO4jLTjYUb*I8gXqtIUFQ4or20iyT8Ftm0JoRKKDGSXYoA/Capturet.png)\n\n\n", "attachments": [], "created_by_name": "Bi Xiaojian", "created_at": "October 31, 2016 at 11:29pm", "created_by": "BiXiaojian415", "topic": "Renewable Energy Production Issue", "replies": [{"body": "\nHi Bi,<br/><br/>1. Check [this topic](www.grasshopper3d.com/xn/detail/2985220:Comment:1579727) for some explanations on your first question.<br/>Also Ladybug Photovoltaics can calculate shading impact on the final energy output.<br/><br/>2. There are two ways to calculate optimal tilt and azimuth angles:<br/>a) more precise, and slower one: by using Galapagos solver, and by iterating through tilt and azimuth angle sliders, until the optimal tilt and azimuth if found. Here is an [example video](http://www.grasshopper3d.com/video/annual-optimal-tilt-and-azimuth-angle-of-an-unshaded-pv-array), with [example definition](https://www.dropbox.com/s/p1bg0ved74sk983/optimal_tilt_azimuth_openRack.gh?dl=0).<br/><br/>b) less precise and quicker one: by using \"Tilt and Orientation Factor (TOF)\" component:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/Vl6FuIcyK*vPCGivX**UEG0Yg-8Giap6*Y3DeJtzDDw3Up5exSeV3WbbakcikGH2vyiLJ6bYobGMxDRczFPBFtQFttmLYuXP/2b.jpg?width=300\" width=\"300\"/>](http://api.ning.com:80/files/Vl6FuIcyK*vPCGivX**UEG0Yg-8Giap6*Y3DeJtzDDw3Up5exSeV3WbbakcikGH2vyiLJ6bYobGMxDRczFPBFtQFttmLYuXP/2b.jpg)\n\nHave in mind that the differences between 2)a) and 2)b) may mostly be less than 1 degree.\n\n<br/>To calculate the minimal distance between PV rows (the \"density you mentioned\"), which will eliminate the [self shading](http://www.greenrhinoenergy.com/solar/performance/shading.php) from front PV rows, use the \"PV SWH system size\" component.\n\n<br/>I attached an example definition for 2)b) option below along with minimal distance calculation.<br/><br/>Let us know if you have any other issue or question!\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1629701", "name": "optimalPV_tilt_azimuth_minDistance.gh"}], "created_by_name": "djordje", "created_at": "November 1, 2016 at 8:23am", "created_by": "djordje", "replies": [{"body": "\nThe first link is incorrect. Sorry about that.<br/>This is the right one:<br/>[http://www.grasshopper3d.com/group/ladybug/forum/topics/photovoltai...](http://www.grasshopper3d.com/group/ladybug/forum/topics/photovoltaic-tools)\n", "attachments": [], "created_by_name": "djordje", "created_at": "November 1, 2016 at 10:14am", "created_by": "djordje", "replies": []}, {"body": "\nHi djordje,<br/>\n\n\n\nGreat thanks to your immediate and detailed reply. I am working on it based on your advice above, please forgive me for my late reply.\n\n\n\nI have searched for some issues as same as mine. And I tend to do the similar thing as Amaraa's([http://www.grasshopper3d.com/group/ladybug/forum/topics/finding-an-...](http://www.grasshopper3d.com/group/ladybug/forum/topics/finding-an-optimal-size-of-pv-panel-in-given-array)), to explore an optimal pv array with the most AC energy production.\n\n\n\nI plan to set three parameters (orientation, tilt angle and distance of pv), and use Galapagos to make a best horizontal pv grid of most AC energy. So the most important is to avoid the dark core-shadows from shelf shading. If so, I wonder whether the gh document you uploaded in the discussion named \"Finding an optimal size of PV panel in given array\" will be helpful to me. And should I use the Sun Path component to calculate the self shading?\n\n\n\nThank you. \n\n[ ](http://www.grasshopper3d.com/profile/Amartuvshin)\n", "attachments": [], "created_by_name": "Bi Xiaojian", "created_at": "November 2, 2016 at 9:56am", "created_by": "BiXiaojian415", "replies": []}, {"body": "\nHi Bi,\n\nIt's not a late reply, it took you one day to reply.<br/>Unless you plan to post your next reply in 2017, everything is ok :)<br/><br/>\n\nI have searched for some issues as same as mine. And I tend to do the similar thing as Amaraa's ([http://www.grasshopper3d.com/group/ladybug/forum/topics/finding-an-](http://www.grasshopper3d.com/group/ladybug/forum/topics/finding-an-)...), to explore an optimal pv array with the most AC energy production.\n\nHave in mind, that [Amaraa's topic](http://www.grasshopper3d.com/group/ladybug/forum/topics/finding-an-optimal-size-of-pv-panel-in-given-array) dealt with PV system integrated into a facade. And as far as I understood you would like to put your PV modules on a roof. So it may be that some of my replies from that topic, may not apply to your roof PV system.\n\n<br/>Also, Amaraa's topic did not deal with optimal PV system size (DC rating in kW). You would like to calculate that one as well?\n\n\n\nI plan to set three parameters (orientation, tilt angle and distance of pv), and use Galapagos to make a best horizontal pv grid of most AC energy. So the most important is to avoid the dark core-shadows from shelf shading. If so, I wonder whether the gh document you uploaded in the discussion named \"Finding an optimal size of PV panel in given array\" will be helpful to me. And should I use the Sun Path component to calculate the self shading?\n\nOk, so you decided to go with the upper 2)a) solution?\n\nDid I understand that correctly?<br/><br/>Btw. sorry if you receive three emails for this reply. For some reason I had to delete it, and post it again. Grasshopper forum is working strange in the last couple of weeks.\n", "attachments": [], "created_by_name": "djordje", "created_at": "November 2, 2016 at 1:27pm", "created_by": "djordje", "replies": []}, {"body": "\nHi djordje,\n\n\n\nSo sorry for not make my issue clear. \n\n\n\nAfter the study of relevant posts and operation of your uploaded gh files, I got some knowledge about your component:\n\n1. parametric surface--**Sunpath Shading**--**DC to AC derate Factor**--**Photovoltaics Module**, can calculate the ACenergy of different pv arrays by Galapagos. The process can evaluate the self shading from the input **analysisGeometry** and surrounding shading from the input **context**.\n\n2. **PV SWH Systemsize**, can also do that, but there would be no second type of self shading for the chosen **minimalSpacingPeriod_** criteria.\n\n3. **TOF** outputs optimal angle and azimuth.\n\n\n\nSo my question is, if I choose to make a curved roof to form a best pv array with best ACenergy, whether should I only choose the first above, the second PV SWH Systemsize can only deal with the angled or flat surface, not the curved? What's the relationship between **TOF** and **PV SWH Systemsize**?\n\n\n\nAlso, I'll do my best to make a parametric model as soon as possible and upload it to you, so we can make the discussion more detailed. \n\nBest regards.\n", "attachments": [], "created_by_name": "Bi Xiaojian", "created_at": "November 3, 2016 at 3:10am", "created_by": "BiXiaojian415", "replies": []}, {"body": "\nHi Bi,\n\n<br/>The process can evaluate the self shading from the input analysisGeometry and surrounding shading from the input context.\n\nYes, you are correct. That is what the Sunpath shading component will do.\n\n<br/>2. PV SWH Systemsize, can also do that, but there would be no second type of self shading for the chosen minimalSpacingPeriod_ criteria.\n\nPV SWH System Size will not account for the context shading (underlaying roof trees, buildings...)\n\nThere will be no second type of self-shading (the shading from the PV rows in front) **only** for the chosen solar window. Sorry if I haven't explained this clearly in Amaraa's topic. You control this by minimalSpacingPeriod_ input.<br/>You can also let the PV SWH System Size component pick the PV minimalSpacingPeriod_ input automatically (if you do not input anything to it).<br/>Out of that solar window, the second type of self shading will appear. But this is mostly insignificant time of the year (like earlier than 9am or later than 3pm on winter solstice).<br/>The larger the solar window the more annual AC energy you will produce. So for example: you can set the solar window to be from the sun rise to to sunset on winter solstice. This will result in maximal possible AC energy generated. And it may generate a 1% or 2% more AC energy than if you set your solar window from 9am to 3pm on winter solstice. But in the first case, the minimalSpacing (distance) between the rows would be tens of times longer than in the second case. Such large distances are uneconomical. So by producing more AC energy, does not necessarily mean that your PV system is optimal.<br/>I hope I did not explain this in some confusing way. If I did, please let me know, I will try to make it more clear.<br/><br/>\n\nPV SWH Systemsize can only deal with the angled or flat surface, not the curved?\n\nYes, you are correct. The baseSurface_ input is based on a planar surface (horizontal or vertical or angled).\n\n\n\n<br/>So my question is, if I choose to make a curved roof to form a best pv array with best ACenergy, whether should I only choose the first above...\n\nHm, yes, it looks like you would have to go with the upper mentioned 2)a) option.\n\n<br/><br/>What's the relationship between TOF and PV SWH Systemsize?\n\nTOF component can find the optimal tilt and optimal azimuth angles for PV SWH System Size component (its arrayTiltAngle_ and arrayAzimuthAngle_ angles).<br/>If you do not use TOF component, then you need to use Photovoltaics Surface component along with Galapagos to find the optimal tilt and azimuth angles.\n\n\n\n<br/>Also, I'll do my best to make a parametric model as soon as possible and upload it to you, so we can make the discussion more detailed.\n\n<br/>For start it would be enough, if you would attach the roof on which the Photovoltaic modules will be laid. And just point where would you like the PV modules to be.<br/><br/>Regards,<br/>djordje\n", "attachments": [], "created_by_name": "djordje", "created_at": "November 3, 2016 at 3:42pm", "created_by": "djordje", "replies": []}]}], "id": "1629877"}