{"body": "\nHey guys,\n\nA thick wall passes through a wall of a zone (please see the image below).\n\n[<img class=\"align-left\" src=\"http://api.ning.com:80/files/YOoFu1FozwHTdSfrT*7ny72Lwxe0VlwEwsEmNILINmufI*xnO9uyG4S4u7fKvVpbJ6vD5FmNsNzkRslV7QJBf7VYLIOK6nkr/photo_20161102_232642.jpg?width=750\" width=\"750\"/>](http://api.ning.com:80/files/YOoFu1FozwHTdSfrT*7ny72Lwxe0VlwEwsEmNILINmufI*xnO9uyG4S4u7fKvVpbJ6vD5FmNsNzkRslV7QJBf7VYLIOK6nkr/photo_20161102_232642.jpg) <br/> Is it possible to define it in HB, taking into account its shading effect as well as its thermal interaction with the zone ? (You know it is not an exterior shading device with thermal break. It is a continuous wall with significant heat transmittance)\n\n\n\nThe only way I could imagine to define the thick wall, is to divide it into two parts (interior and exterior), and then define each part as a zone! So 2 new zones would represent the wall. But these zones won't have any cavity or air inside; because the wall is solid. then the question would be:\n\nWhat is the minimum size of a zone? Could a zone be as thick as a wall (e.g. 50 cm width)? \n\nWhat is the maximum thickness of a wall/floor/ceiling/etc. in a zone? Could they occupy the whole space of the zone? i.e. Could a wall have a width equivalent to half of the whole zone's width? \n\n\n\nThank you\n\nAryan\n", "attachments": [], "created_by_name": "Aryan Shahabian", "created_at": "November 3, 2016 at 4:40am", "created_by": "AryanShahabian", "topic": "Thick wall partly penetrating a zone", "replies": [{"body": "\nAryan,\n\nIndeed you need to divide this mass in two. The external part should be defined as a shading element (context). The internal can be a thermal mass (see the HB_addInternalMass component for that matter).\n\nYou should NOT define this as thermal zones!!\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "November 3, 2016 at 7:20am", "created_by": "AbrahamYezioro", "replies": [{"body": "\nHi Abraham,\n\nThank you for your reply. \n\nImagine the mass is a concrete wall and there are large windows on the walls of the room. Then if I divide the mass into an InternalMass and a ContextSrf there would be 2 problems:\n\n\n\n1- It's not possible to assign an E+ construction material to the outer part of the mass (ContextSrf). Therefore its surface temperature would remain the same as the weather around.\n\n2- The internal mass won't be affected by the sun. It also won't thermally interact with the outer part of the mass. Take into account that in reality there is no thermal break between the interior and the exterior parts of the mass. It is a single continuous concrete wall.\n\n\n\nBest,\n\nAry\n\n\n\n\n", "attachments": [], "created_by_name": "Aryan Shahabian", "created_at": "November 3, 2016 at 7:59am", "created_by": "AryanShahabian", "replies": []}, {"body": "\n[http://www.grasshopper3d.com/group/ladybug/forum/topics/hb-shading-...](http://www.grasshopper3d.com/group/ladybug/forum/topics/hb-shading-context-transmaterial-fails?commentId=2985220%3AComment%3A1208270&amp;groupId=2985220%3AGroup%3A658987)\n\n\n\nBTW I found this link relevant to the topic but couldn't find a solution for the problem I'm facing..\n", "attachments": [], "created_by_name": "Aryan Shahabian", "created_at": "November 3, 2016 at 8:03am", "created_by": "AryanShahabian", "replies": []}, {"body": "\nI suggest sending the question to unmethours forum.\n\nAs far as i know, the external shading elements don't consider thermal properties and right now i'm lazy to search :-)\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "November 3, 2016 at 8:31am", "created_by": "AbrahamYezioro", "replies": []}]}], "id": "1632292"}