{"body": "\nHi Mostapha, Chris and group members,\n\n\n\nI made a model with variable shape and window rate. I would like to use Galapagos to optimize the  shape and window rate for lowest energy consumption.\n\nHere is three questions：\n\n1. As the optimization goes, more and more errors of zones appeared, and the line of Galapagos seemed confusing.\n\n2. When I checked the result again with the push of bottom \"Reinstate\", the previous  total energy calculation turned \"undefined\".\n\n3. The error is all about \"All of your HBSrfs must make a closed volume\". \n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/xE1-ufgwx-9jHr07dHUuhR-OtJ4PScN0W1ebvGeQd6RoYfcf4su*oLHKQM3WCtQh*7Ae78xviuLygD3BysBRl9XWdTtaLE*Y/QQ20161117010135.png?width=750\" width=\"750\"/>](http://api.ning.com:80/files/xE1-ufgwx-9jHr07dHUuhR-OtJ4PScN0W1ebvGeQd6RoYfcf4su*oLHKQM3WCtQh*7Ae78xviuLygD3BysBRl9XWdTtaLE*Y/QQ20161117010135.png)\n\nI attached the gh file. I'll appreciate it if you give me a hand. \n\n\n\nThanks in advance.\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1640504", "name": "Stage02_Optimization_3.gh"}], "created_by_name": "Bi Xiaojian", "created_at": "November 16, 2016 at 10:18am", "created_by": "BiXiaojian415", "topic": "Honeybee_Energy Optimization with Galapagos_Erro", "replies": [{"body": "\nHi [Bi Xiaojian](http://www.grasshopper3d.com/profile/BiXiaojian415),\n\n\n\nI am running your model right now. There seems to be no error. It is running fine.  I have one question though. In Galapagos, you have kept the threshold to maximize. Are you sure you want to do that?\n\n\n\nDevang\n", "attachments": [], "created_by_name": "Devang Chauhan", "created_at": "November 16, 2016 at 10:37am", "created_by": "devang", "replies": [{"body": "\nHi Devang,\n\nThanks for your immediate reply.\n\nI remembered to set the threshold to minimize, maybe my bad.\n\nThe error will appear after about 30 generations. Don't know if it's only my problem.\n", "attachments": [], "created_by_name": "Bi Xiaojian", "created_at": "November 16, 2016 at 10:43am", "created_by": "BiXiaojian415", "replies": []}, {"body": "\nHi Bi Xiaojian,\n\nHow much time approximately did it take for you to reach the that many generations?\n\n\n", "attachments": [], "created_by_name": "Devang Chauhan", "created_at": "November 16, 2016 at 11:53am", "created_by": "devang", "replies": []}, {"body": "\nHi Devang,\n\n\n\nSorry for my late reply.\n\nIt will take approximately one hour to reach that generation.\n\nSo do you encounter the same problems?\n\n\n\nXiaojian\n", "attachments": [], "created_by_name": "Bi Xiaojian", "created_at": "November 16, 2016 at 6:38pm", "created_by": "BiXiaojian415", "replies": []}]}, {"body": "\nHi Mostapha, Chris, Devang and other group members,\n\n\n\nI checked some issues about Galapagos and Honeybee. Mostapha gave a suggestion to add a delay component before the calculation, so is it right to set the data delay component before the Galapagos fittness and after the Honeybee calculation?\n\n\n\nI'm also wondering whether my model setting went wrong because of zone errors about not a closed brep.\n\n\n\nXiaojian\n\n\n\n\n", "attachments": [], "created_by_name": "Bi Xiaojian", "created_at": "November 16, 2016 at 8:21pm", "created_by": "BiXiaojian415", "replies": [{"body": "\nHi Xiaojian,\n\n\n\nThe model runs fine at my end. The fitness numbers is reducing as it should. I checked the output of your HBZones. They output closed breps so that's fine too.\n\n\n\nDevang\n", "attachments": [], "created_by_name": "Devang Chauhan", "created_at": "November 16, 2016 at 10:08pm", "created_by": "devang", "replies": []}, {"body": "\nHi Devang,\n\n\n\nGreat thanks for your work and immediate reply, and so thankful for your patience to run my gh file completely. The result sounds excellent and exciting.\n\n\n\nSo, you mean my gh file runs well with no problem that I mentioned above. Hmm, interesting. Maybe I should change another device to run again.\n\n\n\nLast but not the least, I'll appreciate it if it's possible to post a capture of result for me. If not, everything is fine, still give my best thanks to you. \n\n\n\nXiaojian\n", "attachments": [], "created_by_name": "Bi Xiaojian", "created_at": "November 17, 2016 at 12:02am", "created_by": "BiXiaojian415", "replies": []}, {"body": "\nHi Xiaojian,\n\n\n\nI did not record the result last time. I am re-running the model right now. It's been running since last 2.5 hours and has reached generation 7. I am also eager to find out how this goes. I will share results.\n\nDevang\n\n\n\n\n", "attachments": [], "created_by_name": "Devang Chauhan", "created_at": "November 17, 2016 at 2:05am", "created_by": "devang", "replies": []}, {"body": "\nHi Devang,\n\n\n\nGreat thanks for your immediate reply. Wow, that sounds cool, thank you very much for your patient work. Hope to see the result soon.\n\n\n\nI re-run the gh file and met the same problem above. I stopped the calculation and checked the error step with parameters setting which caused to crash of zones. Interestingly, the model acted well after I double-clicked the boolean toggle to create zone again. That really confused me. \n\n\n\nSo hope to hear from you Devang with good news, and hope some guys help me to find out the problems.\n\n\n\nXiaojian\n", "attachments": [], "created_by_name": "Bi Xiaojian", "created_at": "November 17, 2016 at 2:25am", "created_by": "BiXiaojian415", "replies": []}, {"body": "\nI see the same error now. It has got something to do with the Glazing ratios. That is where the error originates. I am looking more into it.\n", "attachments": [], "created_by_name": "Devang Chauhan", "created_at": "November 17, 2016 at 4:00am", "created_by": "devang", "replies": []}, {"body": "\nHi Bi and Devang,\n\nI haven't checked the model but generally speaking using intersection and split in optimization studies can make Grasshopper to crash. Intersection can change based on the tolerance values. If you can set up a higher tolerance that works with your model that should help avoiding the crash. If your model is simple enough then I suggest to develop your own code to create the geometry and use Honeybee to create the zones and run the analysis.\n\nAlso in some cases it has been an issue with the memory. I have recently made major modification to Honeybee to address the memory issue. If you update to the version available on GitHub you can test it with the new version.\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "November 17, 2016 at 6:19am", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nDear Mostapha,\n\nSure. I did use the latest version.\n\nThanks,\n\nDevang\n\n\n", "attachments": [], "created_by_name": "Devang Chauhan", "created_at": "November 17, 2016 at 1:06pm", "created_by": "devang", "replies": []}]}], "id": "1640505"}