{"body": "\nIs it possible to quantify a gain in kWh for a solar PV array that is in fixed position over an array that is on a retractable armature? I am looking to see if there is any significant benefit to investing into a system that would track Sun throughout the year, vs just doing a fixed panel system. <br/><br/>I think the rule of thumb is that a fixed system gets roughly 70% of available sun vs. a system that can track sun would allow to collect 100%. I am not sure how that translates to actual dollar amounts so I would like to do a study to prove/disapprove this rule. \n\nAny suggestions would be welcome. Cheers! \n", "attachments": [], "created_by_name": "konrad k sobon", "created_at": "November 21, 2016 at 3:09pm", "created_by": "konradksobon", "topic": "Retractable (operable) PV panel study", "replies": [{"body": "\nKonrad,\n\n\n\nIf you assume that your moving PV panel is always in the optimal location to receive the sun, you actually do not even need to run a radiation study.  The EPW file contains this data in the directNormalRadiation output.  This is the solar energy that is directly normal to the sun angle.  The 70% statistic does not seem to be right for Boston.  I'm getting something closer to 94% between a dynamic panel tracking the sun and a flat panel oriented horizontally on the ground (globalHorizontalRadiation):\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/21oynV1A7zLX7W8g2LysTQMCfc*lKxDrDbtYLJ0cbz0NQqkJTwGxdZWY8c9x7gmDB1ZxZMvkJsep-2R*IBqrAOZeGR5sL-X4/DirectNormRad.JPG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/21oynV1A7zLX7W8g2LysTQMCfc*lKxDrDbtYLJ0cbz0NQqkJTwGxdZWY8c9x7gmDB1ZxZMvkJsep-2R*IBqrAOZeGR5sL-X4/DirectNormRad.JPG)\n\nThen again, Boston is really cloudy and I could see the 70% statistic holding in some places like a desert climate\n\n\n\nNote that, if the movable panel is not always at the ideal sun angle, you can still model it with Ladybug.  You are just going to have to pass a grafted list of 8760 hours into the selectedSkyMtx component and run 8760 radiation simulations using the output data tree.\n\n-Chris\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1643600", "name": "DirectNormalRadiation.gh"}], "created_by_name": "Chris Mackey", "created_at": "November 21, 2016 at 7:48pm", "created_by": "ChrisMackey", "replies": [{"body": "\nUnfortunately my panel will not always be in the optimal position since I am investigating different scenarios: \n\n- always in an optimal position, full scope of movement on an actuator.\n\n- only allowed to rotate along its vertical axis\n\n- only allowed to rotate along its horizontal axis\n\nWe are looking at price/feasibility of an actuated system like that as compared to actual yield or improvement in yield in kWh per year to see if its justified to invest into it. <br/>Yes, my location is in Dubai so pretty much a desert climate. \n\nHere's my approach to do a brute force study like you suggested. Thoughts? <br/><br/><br/>\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1644233", "name": "sunTracking_01.gh"}], "created_by_name": "konrad k sobon", "created_at": "November 22, 2016 at 9:57am", "created_by": "konradksobon", "replies": []}]}, {"body": "\nHi Kondrad,<br/><br/>You can do this with Ladybug Photovoltaics components with tilt/azimuth angles combinations.<br/>Check the attached file below.<br/><br/>To switch between single and dual axis tracker types use the drop list on the very left.<br/>The values grouped in blue color on the very left are the ones that you need to change. The larger they are, the more precise your calculation will be. They do not need to be larger than 90 and 180 respectively.<br/><br/>To run the definition, check the elements grouped in red.<br/><br/>In the attached definition Abu Dhabi is used as a location. You can download the .epw file for Dubai [from here](https://groups.yahoo.com/neo/groups/EnergyPlus_Support/files/Meteonorm_Weather_Files/Asia/United%20Arab%20Emirates%20%28ARE%29/).\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1644301", "name": "fixed_vs_tracker_PV.gh"}], "created_by_name": "djordje", "created_at": "November 22, 2016 at 7:27pm", "created_by": "djordje", "replies": [{"body": "\nHi @djordje\n\n\n\nThanks for the reply. I have some questions about the set up: \n\n1. When creating the \"PV SystemSize\", how much does the Base Surface matter? What I am seeing is that the output is not dependent on the input surface and it always produces the same PV Surface. Wouldn't I be able to squeeze more PVs on a larger surface and wouldn't that affect the total kWh output? How can I model that? Do I use Number of Rows for that? \n\n2. In the \"Photovoltaics Surface\" component. Is DCtoACderateFactor important? Like I mentioned I am looking at desert climate and I think that my default soiling factor will be more in range of 5.5-5.8 rather than standard 2. \n\n3. Should I plug North vector into all components? Is that value propagated, or contained in each component? \n", "attachments": [], "created_by_name": "konrad k sobon", "created_at": "November 23, 2016 at 9:39am", "created_by": "konradksobon", "replies": []}, {"body": "\nHi Kondrad\n\n1) There are two types of surfaces that Ladybug Photovoltaics use:<br/>**_PVsurface** - this is basically what you've mentioned: a surface which will be populated with PV modules. The larger the surface, the larger the number of modules and system size, there for the higher annual energy generation.<br/>**baseSurface_** - this input exists only for \"PV SWH system size\" component. It's purpose is to represent a mounting plane on which the PV modules will be put onto. The dark blue colored roof in the photo below is that mounting surface in this case:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/I3qJw2-zaOEVsGx8tn8yPA7ichtUvbVTHv1zy3T8Cke0iDKXEzU6rJt0pvopLIkYXS*x8XYRXvTtWubkHnkRLDkNB8e1rFvi/baseSurface_.jpg?width=300\" width=\"300\"/>](http://api.ning.com:80/files/I3qJw2-zaOEVsGx8tn8yPA7ichtUvbVTHv1zy3T8Cke0iDKXEzU6rJt0pvopLIkYXS*x8XYRXvTtWubkHnkRLDkNB8e1rFvi/baseSurface_.jpg)\n\nSo the size of area of the baseSurface_ is not important but its plane.\n\n<br/>2) It is important. It basically sets the initial losses of the system.\n\nIf that is the soiling value you have, then yes, you need to add it to the DC to AC derate factor component, and then plug its output to \"DCtoACderateFactor_\" input. I did that in the attached definition below.\n\n3) The north vector/numeric value is not propagated due to possible independent usage of components.<br/>I plugged the 0 value to all three component's which have \"north_\" input. You can change it to what ever value you need.\n\n\n\nPlease let me know if I didn't answer completely to your questions, or if you have more of them.\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1644891", "name": "fixed_vs_tracker_PV2.gh"}], "created_by_name": "djordje", "created_at": "November 23, 2016 at 11:23am", "created_by": "djordje", "replies": []}, {"body": "\nI guess what I am asking with the surface is this: \n\nInput into the TOF component has a surface that has area of 372\n\n\n\n\n\n[<img class=\"align-center\" src=\"http://api.ning.com:80/files/I3qJw2-zaOG3sRKlwBVYAGe9UXwZFrLkouhvxm2zj5zhzlvdFUC9ET4rLJWrxUvw-BKTraVB8jOor50c0PELiKNrDvyu3w1P/Capture.PNG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/I3qJw2-zaOG3sRKlwBVYAGe9UXwZFrLkouhvxm2zj5zhzlvdFUC9ET4rLJWrxUvw-BKTraVB8jOor50c0PELiKNrDvyu3w1P/Capture.PNG)\n\n\n\nThen what comes out of the SystemSize component is a surface that has area of 29\n\n\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/I3qJw2-zaOErZwXdLbBNbE*Q05XVyG2EjuO97EUjwqsIZd0zT3TeevRRjCutGc36QE85Dyg4kOgdrxjD4QAGs82DHIWjMP-s/Capture1.PNG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/I3qJw2-zaOErZwXdLbBNbE*Q05XVyG2EjuO97EUjwqsIZd0zT3TeevRRjCutGc36QE85Dyg4kOgdrxjD4QAGs82DHIWjMP-s/Capture1.PNG)\n\n\n\nThese small surfaces are what goes into the _PVSurface input and I think they are being analyzed here...right? If that's the case then we are not getting the right kWh output...\n\n\n\nUnless I am getting something wrong here. Sorry for all these questions. \n", "attachments": [], "created_by_name": "konrad k sobon", "created_at": "November 23, 2016 at 1:47pm", "created_by": "konradksobon", "replies": []}, {"body": "\nThere seem to be some changes in your version of the **fixed_vs_tracker_PV2.gh** file.\n\nCan you attach it please (with internalized geometry)?\n\n\n\nWe are here to help. Ask as much as you want.\n", "attachments": [], "created_by_name": "djordje", "created_at": "November 23, 2016 at 3:08pm", "created_by": "djordje", "replies": []}, {"body": "\nYes, my bad. Please see attached. \n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1644988", "name": "fixed_vs_tracker_PV_ks.gh"}], "created_by_name": "konrad k sobon", "created_at": "November 23, 2016 at 3:15pm", "created_by": "konradksobon", "replies": []}, {"body": "\nThank you.\n\nLadybug Photovoltaics components sometimes can have a couple of purposes, depending on the situation. This is one of those situation.<br/>\"TOF\" component in general should be used to calculate the TOF and TSRF indices. They show, how \"distant\" is your **_PV_SWHsurface** from the optimal **_PV_SWHsurface** surface in terms of tilt and azimuth angles.<br/>However, in your case we are not interested in TOF and TSRF indices. We would just like to know what are the **_PV_SWHsurface** optimal tilt and azimuth angles, regardless of the supplied **_PV_SWHsurface**.\n\nSo the circular surface supplied to the \"TOF\" component's **_PV_SWHsurface** input is irrelevant. It can be of any area, and any tilt/azimuth angle.<br/><br/>The **PV_SWHsurfacesArea** output of the \"PV SWH system size\" component depends on a couple of factors:<br/>**moduleActiveAreaPercent_** (leave it at 90%).\n\n**moduleEfficiency_**,\n\n**systemSize_**.<br/><br/>Calculation of **systemSize_** depends on your electricity demand, cost of the PV system, type of the object, country, local regulations etc. This is something that an engineer needs to determine.<br/>For example, in USA for a residential house in the Sunbelt, depending on finances, a household would try to cover 100% of its annual electricity needs with their PV system. Which means that the **systemSize_ **you chose needs to cover the annual electricity consumption. You can perform EnergyPlus simulation or use any other way to get the annual electricity consumption.\n\nLadybug \"Photovoltaics Performance\" component can calculate the optimal **systemSize_** by given the annual electricity consumption.<br/>However the component is made to address fixed tilt and azimuth PV systems only.<br/>An approximate way to overcome this is to calculate the optimal **systemSize_** for fixed tilt and azimuth PV system, and then multiply it with the \"difference in %s\" panel at the very right of the **fixed_vs_tracker_PV2.gh** file. Again, this is not what Ladybug \"Photovoltaics Performance\" component is made to do, but it will probably get you in a ball park.<br/><br/>\n\nInputted 32 degrees for north_ direction is actually 328 degrees.<br/>This is due to Ladybug Photovoltaics being based on NREL model which uses clockwise angles convention. This convention is also most commonly used in solar radiation analysis.\n\n<br/>Dubai weather data files are uploaded in [here](https://www.dropbox.com/s/fcep5p3i2594wxn/ARE_Dubai.Intl.AP_MN6.zip?dl=0).\n\n\n", "attachments": [], "created_by_name": "djordje", "created_at": "November 23, 2016 at 5:29pm", "created_by": "djordje", "replies": []}, {"body": "\nOK, so if I understand this correctly I need to first figure out what my demand is, then it will size the PV array (square meters) to accommodate that demand.<br/><br/>If I was interested in calculating a certain system output (kWh) based on surface square footage that is available to me, then i would need to give it a \"fake\" demand. This would be a sort of backwards way of finding out what is the possible max output of a system of certain square footage coverage...and later I can compare that against my actual demand when that becomes known to me. Of course I understand that this is ass backwards and not the intended use for your components, but unfortunately at the moment I don't know what the demand is. I will find out sooner or later. :-) <br/><br/>Thanks for all the help. I think I am getting closer to figuring out what is what in these components. I would hate to perform any sort of analysis without having at least some basic understanding of what's happening and you have sure helped me here. <br/><br/>Cheers! \n", "attachments": [], "created_by_name": "konrad k sobon", "created_at": "November 23, 2016 at 7:19pm", "created_by": "konradksobon", "replies": []}, {"body": "\nYes, you are correct: you can use both methods: from systemSize to energy output, or the other way around: find how much energy will the system output for the given area.<br/><br/>Are your PV modules going to put on a flat roof, ground or angled roof? Can you attach the geometry of one of these three (that's basically the baseSurface_ input)?\n", "attachments": [], "created_by_name": "djordje", "created_at": "November 24, 2016 at 1:42am", "created_by": "djordje", "replies": []}, {"body": "\nYou can find the sample surface that I am working with attached. Thanks for looking into this. \n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1646148", "name": "20161121_PhotovoltaicsStudy.zip"}], "created_by_name": "konrad k sobon", "created_at": "November 25, 2016 at 12:04pm", "created_by": "konradksobon", "replies": []}]}]}