{"body": "\nHi guys,\n\n\n\nI am trying to run a view-privacy analysis on two \"buildings\" the tall one is an office building and the smaller one a residential building. \n\n\n\nMy desired output is a colored analysis mesh over the facade panels of the residential building showing how private or not private is the overall shape. All the views will come from the office tower to the residential tower\n\n\n\nMy inputs on the view analysis component are 10 points for each of the office floors/facade perimeter (50 floors) for a total of 500 points.   An aproximate panelization of the residential building facade (2220 panels) to perform the analysis on. And the center points of each residential building facade panel\n\n\n\nThe problem that I am having right know is that when I start the calculation the computer stops responding, but I dont know what I am doing wrong. Also I dont know the criteria in how to set a proper \"_gridSize_\" and _disFromBase for the scale of my analysis and my rhino units which are in milimeters in correspondence with the logic of how the view analysis component was made. \n\n\n\nAttached is the grasshopper file, with data internalised. \n\n\n\nThank you in advance!!\n\n\n\nNicholas\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1645140", "name": "privacy analysis.gh"}], "created_by_name": "Nicholas Rawitscher", "created_at": "November 23, 2016 at 2:13pm", "created_by": "NicolasRawitscher", "topic": "View Analysis component - Privacy between 2 buildings", "replies": [{"body": "\nHi Nicholas,\n\n\n\nI can't check your file, some Input geometries are not internalized. Could you share your file again?\n\n_gridSize_ is the dimension of the analysis grid, if you set 1 it means 1 Rhino unit of your current model. For example if you have a facade 20x20 meters and you choose 1 as gridSize, you will have 20x20 analysis cells for that facade.\n\n\n\nIn the meantime, you can take a look at this example file.\n\n\n\nAntonello\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1645150", "name": "privacyanalysis_example.gh"}], "created_by_name": "Antonello Di Nunzio", "created_at": "November 23, 2016 at 4:07pm", "created_by": "AntonelloDiNunzio", "replies": [{"body": "", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "November 27, 2016 at 6:57pm", "created_by": "ChrisMackey", "replies": []}]}], "id": "1645141"}