{"body": "\nHello All, I am trying to plot data generated outside of Grasshopper onto a Ladybug psych chart, but I cannot figure out how to do this. I'm still quite new to Grasshopper and Ladybug.\n\nI have gone through Chris Mackey's excellent youtube tutorials on the psych chart, I have scanned the forums and googled my best, but am still stuck so any assistance would be greatly appreciated!\n\nMy assumption was that I could copy DBT and RH data into panels and then plug those into the psych chart. This isn't working but I'm not sure how else to approach this.\n\nI have tried a few things and have come across the following errors:\n\n1) The psych chart does not work if I plug in more than 2 data points for dry bulb &amp; RH (unless I'm plugging in EPW data, of course). I get the following error: \"1. Solution exception:index out of range: 0\"\n\n2) I can't paste in all 8760 lines of data into a panel. Sometimes I get around 4700 lines in, other times, it's around 5600. I thought it was an issue with not being able to store that much data while copying, but when I hit a return after the last line of data, it doesn't let me add another line.\n\n3) (perhaps related?) I noticed that if I plug EPW data into panels and then into the psych chart component I get the error: \"1. Solution exception:unsupported operand type(s) for -: 'str' and 'int'\" I assume this is why just copying data into a panel to plug into the psych chart component doesn't work?\n\nI have attached examples replicating the above issues.  Thanks in advance for your help!\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1647925", "name": "psychChartProblems.gh"}], "created_by_name": "Priya Gandhi", "created_at": "November 28, 2016 at 4:24pm", "created_by": "PriyaGandhi", "topic": "How to import non-EPW data for use with the Ladybug psych chart?", "replies": [{"body": "\nHi Priya,\n\n\n\n1) The values being provided are string type (letters), I converted them to numbers. It works now.\n\n2) I am not sure why this happens, but I am assuming you are trying to do this in order to create a custom list using your data. For that, you can use native grasshopper \"Replace Items\" component. I have used the same in the attached file. Please note how the value of drybulb temperature at index 8757 is replaced. You could use the similar logic to make a custom list. I also supplied the output of this process to psychchart component, it works.\n\n3) There are special functions embedded in Ladybug / Honeybee components to accept and parse output of EPW data. Therefore, if you intend to use EPW data, you should directly connect the outputs of import EPW data to the component where you wish to use them.\n\nI have turned the preview off from some of the psychcharts. To turn them, hover over their icon, right-click and click preview.\n\n\n\n-Devang\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1647808", "name": "psychChartProblems.gh"}], "created_by_name": "Devang Chauhan", "created_at": "November 28, 2016 at 10:50pm", "created_by": "devang", "replies": [{"body": "\nThank you, Devang!  Yes, I am trying to create a custom list with my own data so the replace items component is very helpful.  I'm now able to plot my data on the psych chart as I was originally intending.  I really appreciate you taking the time to help me with this!\n", "attachments": [], "created_by_name": "Priya Gandhi", "created_at": "November 30, 2016 at 5:05pm", "created_by": "PriyaGandhi", "replies": []}]}]}