{"body": "\nHi everyone\n\n thank you for helping and responses \n\nI'm trying to do some simple energy plus stimulation with honeybee. but when I run the component, I face with this error :\n\n1. The simulation has not run correctly because of this severe error: <br/> ** Severe ** GetSurfaceData: Potential \"OtherZoneSurface\" is not matched correctly:\n\n1. The simulation has failed because of this fatal error: <br/> ** Fatal ** GetSurfaceData: Errors discovered, program terminates.\n\nI check the idf file, and I believe, I assign every thing right. I cant realize why this happening. would you plz take a look at the file bellow and let me konw what the problem is..  \n\nI really appreciate all the help.\n\nThank you,\n\n\n\nMehrnaz\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1649847", "name": "first simulaton.gh"}], "created_by_name": "mehrnaz", "created_at": "December 1, 2016 at 4:16am", "created_by": "mehrnaz", "topic": "run e+ simulation error", "replies": [{"body": "\nHi Mehrnaz,\n\nI took a look at your model. I have following observations that I would suggest you look into.\n\n1. Your air wall surfaces are partly inside the zone and partly outside the zone. I would recommend you assign them EP construction as per exposure.\n\n2. Your surfaces for Roof and Floor overlap.\n\n3. Surface Type \"Roof\" is assigned to many floors\n\nI have not looked further than checking how you prepare your geometry. So the root of error may not be the way you have assigned surfaces. However, to follow a good modeling practice I would suggest you address these issues.\n\n-Devang\n", "attachments": [], "created_by_name": "Devang Chauhan", "created_at": "December 1, 2016 at 5:21am", "created_by": "devang", "replies": [{"body": "\nHI\n\nthank Devang for your helping...\n\nyou're right , but when I use solve adjacency component all this individual  roof surface redefined again to the floor and the air walls located inside the model.. after i use the solve adjacency component,i check this issue with honeybee label zone component and all the surface type assign correctly \n", "attachments": [], "created_by_name": "mehrnaz", "created_at": "December 1, 2016 at 7:27am", "created_by": "mehrnaz", "replies": []}]}]}