{"body": "\n<font face=\"Calibri\" size=\"3\">Hi everyone,</font>\n\n<font face=\"Calibri\" size=\"3\">As a bit of background, I am currently working on a research project using Honeybee and Ladybug. We are trying to understand how easy it is to use the plugins for architectural performance sketching if given a Revit model to work off. This research is a continuation of a Building Science Thesis by Elzine Braasch who has also been a part of the LB+HB discussions. If you would like more information about the research please let us know and we can send you her thesis.</font>\n\n<font face=\"Calibri\" size=\"3\">I have two questions. Firstly, I have been having some trouble creating zones on multiple levels using the “bldgsFlr2FloorHeights” input in the SplitMass component. I have made simple square design, 20x20x9m, and split the zones by inputting in the perimeter zone depth but not the “bldgsFlr2FloorHeights” and it works fine. However when I input something into “bldgsFlr2FloorHeights” I get an error that says: “Failed to generate the perimeter zones for one floor as the floor’s geometry is not accommodated by the script.”</font>\n\n<font face=\"Calibri\" size=\"3\">With only the preview for the split mass component on, it seems like there is a double up of surfaces. I am a newbie to GH+LB+HB so does anyone know what is happening? And how do I create perimeter zones for the upper floors?</font>\n\n<font face=\"Calibri\" size=\"3\"><img class=\"align-center\" height=\"615\" src=\"http://api.ning.com:80/files/jPkKNYv*PqSmNa0v676yq5tvRfDThT8LGntNVaa5P5ea0e5eQZP34cGldBnrC9r4qMaT-h2yHNHsKWcNU5Ik38ae3iCCIeoi/bldgsFlr2FloorHeights.PNG?width=600\" style=\"width: 325px; height: 333px;\" width=\"600\"/></font><font face=\"Calibri\" size=\"3\">My second question is more general, we would like to know what the known limitations on geometry are when using the split mass component. We thought instead of trying all these different shapes and forms we would ask other users what forms everyone has found to have an issue.</font><font face=\"Calibri\" size=\"3\">The reason for this is we want to be able to take geometry from architects who design in Revit and easily split masses to create zones for an initial performance sketch.</font>\n\nThanks guys!\n\nSandi\n", "attachments": [], "created_by_name": "Sandi Sirikhanchai", "created_at": "December 1, 2016 at 7:55pm", "created_by": "SandiSirikhanchai", "topic": "Split mass component bldgsFlr2FloorHeights issue and geometry limitations", "replies": [], "id": "1650178"}