{"body": "\nHello everybody,\n\n\n\nI hope Mostapha or any of you can help me.\n\n\n\nI'm running some tests about cross ventilation to see if it is worthy to use Airflow network.\n\nI am comparing the results of AFN with simple openings with the simple calculation of room air and IES.\n\n\n\nI am testing a shoebox of 15x5m, 3m height, 2 windows of 1sqm, only 1 person of internal gains, no heating, no cooling, basically nothing.\n\n\n\nThe tests were running fine with the \"Wind pressure coefficient type\" as Input on the AFN simulation control. But, as the number of ach that I was obtaining was tiny (approx. 1/6 of the ach of room air) I thought that the problem could be the Input and my wind pressure coefficient calculations. Therefore, I changed the WPCoefficient type to \"Average surface calculation\" and I deleted all the wind pressure elements.\n\n\n\nAs soon as I change this (and only this) the simulation crashes because of the error \"DualSetPointWithDeadBand: Unanticipated combination of heating and cooling loads - report to EnergyPlus Development Team\"  And also, my heating set point changes from -100 degrees to 12\n\n\n\n[<img class=\"align-center\" src=\"http://api.ning.com:80/files/ycvwLIslca50t53GIhDYtDC5rU844j4Pjvm0JzIfcMNe6jDvTpr89UjjttS54MBPgN-f5l-rSv4QbVjYnYkDGEbCOYR9BVbB/dualsetpointwithdeadband.PNG?width=750\" width=\"750\"/>](http://api.ning.com:80/files/ycvwLIslca50t53GIhDYtDC5rU844j4Pjvm0JzIfcMNe6jDvTpr89UjjttS54MBPgN-f5l-rSv4QbVjYnYkDGEbCOYR9BVbB/dualsetpointwithdeadband.PNG)\n\n\n\nI've look for this in the bigladder manual for energy plus and looks like if I had set a thermostatic zone control on dual set point with dead band, what I haven't, because, to be honest, I didn't even know it existed.\n\n\n\nI hope any of you can help me, because I've been trying hard, but I don't find which is the problem.\n\n\n\nI have to say that all the AFN data is internalised (beside the run simulation) and will be a bit difficult to read. I'm sorry for this but, as they are about 20 user objects, I thought it was too much to upload.\n\n\n\nThanks a lot\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1660322", "name": "Deadband error.gh"}], "created_by_name": "Julia T", "created_at": "December 20, 2016 at 3:10am", "created_by": "JuliaT", "topic": "Airflow Network_error \"Dual Set Point with dead band: unanticipated combination.", "replies": [{"body": "\nJulia,\n\nThank you for doing this validation and comparison of natural ventilation cases.  I have to admit that you are well beyond territory that I have tread in EnergyPlus.  If you are getting an error that is telling you to contact E+ team, you will probably get more help from them by posting on unmethours:\n\n[https://unmethours.com/questions/](https://unmethours.com/questions/)\n\nor to the EnergyPlus github as an issue (searching current issues is also a good idea):\n\n[https://github.com/NREL/EnergyPlus/issues](https://github.com/NREL/EnergyPlus/issues)\n\nI tried to run your file but it seems that you forgot to internalize one of the glazing geometry surfaces.  Also, I don't have any of your CSV schedules on my system and, as a result, I was not able to recreate your error.  If you upload a GH file with these things fixed, I can have a look at recreating the issue.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "December 20, 2016 at 6:53pm", "created_by": "ChrisMackey", "replies": [{"body": "\nThanks for your help Chris, I'll look in those pages.\n\n\n\nI'm sorry for the mistakes in the model, I thought everything was properly internalised, probably I did it too fast while cleaning the file. I hope this time it will be fine.\n\n\n\nJulia\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1660794", "name": "Deadband error.gh"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1660795", "name": "CSVs.7z"}], "created_by_name": "Julia T", "created_at": "December 21, 2016 at 2:36am", "created_by": "JuliaT", "replies": []}]}]}