{"body": "\nHello Everyone,\n\nI am doing basic LB radiation and sunlight hours analysis on a project for multiple days (21 - march, june, sept, dec). The model is quite big and takes about 3 hrs to run the radiation esp. at the desired grid density.\n\nMy question is that is there a way I can save the results for future editing purposes. In simple terms I want to use Legend Parameters to change the display (gradient, low high bounds, etc.) when required. I have been searching on the forum but could not find anything.\n\nWhat I tried is to bake the mesh and re-select it in gh, copied the sunlight hours results for that mesh in excel and pasted them back in a fresh panel... plugged the mesh and the results panel in custom preview with a gradient.... but the preview doesn't seem to match the original results mesh (test sample attached).\n\n\n\nSo is there any way I can save my analysis results and use it in future to process as required. I don't want to re run the analysis every time.\n\n\n\nThanks!!\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1662633", "name": "sample comparision.JPG"}], "created_by_name": "Saket Sarupria", "created_at": "December 25, 2016 at 10:49am", "created_by": "SaketSarupria", "topic": "Save LB Radiation Results for future manipulation", "replies": [{"body": "\nHi Saket,\n\nDid you try using native grasshopper Data component? You can provide your results / mesh to a Data component and then internalize the data for future use. You can internalize data by right clicking. You can save results for every iteration this way.\n\n-Devang\n", "attachments": [], "created_by_name": "Devang Chauhan", "created_at": "December 25, 2016 at 10:58am", "created_by": "devang", "replies": [{"body": "\nYes I did. I don't know if I am doing something wrong but the default gradient doesn't seem to go away. I attached a sample image where I have a greyscale gradient but custom preview still shows the original colours.\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1662506", "name": "Internalised Data.JPG"}], "created_by_name": "Saket Sarupria", "created_at": "December 25, 2016 at 11:10am", "created_by": "SaketSarupria", "replies": []}, {"body": "\nI believe what you're looking for is Ladybug_Recolor Mesh component. I have attached an example. Hope it helps.\n\n-Devang\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1662400", "name": "RadiationAnalysis.gh"}], "created_by_name": "Devang Chauhan", "created_at": "December 25, 2016 at 11:48am", "created_by": "devang", "replies": []}, {"body": "\nWhat Devang said does the job. A slightly more advanced approach is to add data as UserDictionary or UserData to mesh so you can read it back from Rhino and then use recolor mesh to change the coloring. We have an open issue for this but haven't had the chance to implement it yet: [https://github.com/mostaphaRoudsari/ladybug/issues/53](https://github.com/mostaphaRoudsari/ladybug/issues/53)\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "December 25, 2016 at 3:55pm", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nThanks a lot Mostapha and Devang. Recolour mesh was what I was looking for.\n\nMany Thanks!!\n", "attachments": [], "created_by_name": "Saket Sarupria", "created_at": "December 25, 2016 at 11:13pm", "created_by": "SaketSarupria", "replies": []}, {"body": "\nHi Saket,\n\nWill it be possible for you to share your GH file? I can take a look.\n\n-Devang\n", "attachments": [], "created_by_name": "Devang Chauhan", "created_at": "December 26, 2016 at 1:53am", "created_by": "devang", "replies": []}, {"body": "\nHi Devang,<br/>The gh is pretty straight forward. I cannot share the model since its a company project but I have made something similar and internalized in a gh file.\n\nI copied the floors 10 times and ran the analysis. It woks in this model I made from scratch. But somehow if I select say 15 floors in the original model, it just doesn't work.\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1662662", "name": "to share.gh"}], "created_by_name": "Saket Sarupria", "created_at": "December 26, 2016 at 2:52am", "created_by": "SaketSarupria", "replies": []}, {"body": "\nHi Saket,\n\nI could not re-create the error in this file. It works as you said. Can you not simplify your analysis geometry? Say one continuous envelope (mesh or surface) per floor height of 4 meters? I believe that should help.\n\n-Devang\n", "attachments": [], "created_by_name": "Devang Chauhan", "created_at": "December 26, 2016 at 4:02am", "created_by": "devang", "replies": []}, {"body": "\nCan be a memory issue.\n\nCheck with the task manager the performance memory and cpu.\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "December 26, 2016 at 4:10am", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nDevang,\n\n\n\nWhat's troubling me is that when I select 9 floors and run, it doesn't work but when I select 3 of them pair by pair and run, it works.\n\nRight now I am managing that way only. Saving the results bit by bit.\n\nThe total number of data points for the tower are around 150,000. I guess its too much for gh/lb to handle at once. \n\n\n\nHi Abraham,\n\nThere were memory issues a couple of times but in those cases rhino pops up a dialogue box saying out of memory and it will close after that. The machine is pretty tough (intel Xenon, 500SSD, 32GB RAM, 4GB nvidia quadro).\n\nRight now the cpu usage during the heavy overall analysis goes up to 95% sometimes but memory usage stays between 8-9 GB. CPU usage does crank up to max I guess. How to solve it? Any ideas?\n", "attachments": [], "created_by_name": "Saket Sarupria", "created_at": "December 26, 2016 at 4:24am", "created_by": "SaketSarupria", "replies": []}, {"body": "\nI increased the grid size to 2000 and tried the whole tower, still doesn't work but if I leave out a couple of floors it works. I guess its a quantitative issue. \n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1662672", "name": "2000 grid size.PNG"}], "created_by_name": "Saket Sarupria", "created_at": "December 26, 2016 at 5:03am", "created_by": "SaketSarupria", "replies": []}, {"body": "\nSaket,\n\nI developed an extruded surface from intersection. It gives better analysis geometry, and test point distribution. Works faster too.\n\n-Devang\n", "attachments": [], "created_by_name": "Devang Chauhan", "created_at": "December 26, 2016 at 5:36am", "created_by": "devang", "replies": []}]}]}