{"body": "\nHi there,\n\n\n\nI've developed a little nifty way of calculating ASE hour per hour according to LEEDv4, however with just 350 points, it results in 350*8760 = ~3 million values.\n\n\n\nI have to branch these in the right way and then check whether they are larger than, lets say, 1000 lux.\n\n\n\nIn GH this process is a rather heavy calculation and I feel the program responding slowly when the calculation has been done, as its remembering the \"in between\" calculations, rather than only the end result.\n\n\n\nIs there any way through scripting, these statistics can be made without using much ram and causing GH to lag? Also, can statistics like this be enhanced through parallel processing?\n\n\n\nThese are the results of a fairly small simulation.\n\n\n\nOn a side note; I am aware that the current sky for ASE calculation tends to cause too high values in the results as the sky patches are rather rough instead of precise sun position. But I've heard that you guys might still be working on that?<br/><br/>\n\nAll the best, Mathias.\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1667722", "name": "thresholds.PNG"}], "created_by_name": "Mathias s n", "created_at": "January 6, 2017 at 2:49am", "created_by": "Mathiassn", "topic": "ASE statistics with as little computer power as possible", "replies": [{"body": "", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "January 8, 2017 at 11:04am", "created_by": "ChrisMackey", "replies": [{"body": "\nChris,\n\n\n\nThis is awesome! I changed the mass addition divided by length to an average component, usually runs slightly faster on large datas.\n\n\n\nI'm curious if I can add points+vectors as input instead of brep+grid size. As we're using custom points.\n", "attachments": [], "created_by_name": "Mathias s n", "created_at": "January 11, 2017 at 9:00am", "created_by": "Mathiassn", "replies": []}, {"body": "\nMathias,\n\nGlad that you find it useful and that's a good idea with the average component.\n\nThere really should be an option to plug points into the sunlight hours component but it does not exist at the moment (I know that it will exist in the next revision of Ladybug).  How are you generating your custom points right now? (or are you manually creating them?)  I have a workaround that can generate surfaces from the points if all else fails.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "January 11, 2017 at 6:56pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nTHanks for the reply,\n\n\n\nFor now, we use ladybugs own points for the ASE and then \"our\" generated points for the colored sDA map. The reason we use our own, is that then we have a mesh following it and because we're doing smooth isocurves in the final result, i need the points to be at corners of the mesh and not in the middle of the mesh faces (as ladybug does now).\n\nWe also added different features such as automatic naming per floor (and a RH script to group everything per floor in the end). I've attached a part of the script generating points. I will make a post about the entire script as soon as it's finished.\n\n\n\n\n\nNote that in the image, half of the numbers are displayed (too small and looks like points now), however they are in a regular grid.[<img class=\"align-full\" src=\"http://api.ning.com:80/files/GZs8qdvnOuE4jLR840gfo-YFzn-J-cBC*K0PCP7xrTg9-U2b7KVnKU8t8wC7yc7h29VlShETC*wN4kx3raIP5bmuVouayefs/screenshot_RH.PNG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/GZs8qdvnOuE4jLR840gfo-YFzn-J-cBC*K0PCP7xrTg9-U2b7KVnKU8t8wC7yc7h29VlShETC*wN4kx3raIP5bmuVouayefs/screenshot_RH.PNG)\n\n\n\n\n\nIt would be super nice for the possibility to import just point + vector (+ a mesh if needed). For instance use the LB_grid.\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1678732", "name": "HLA_Points_Generation_2017.3dm"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1678733", "name": "HLA_Points_Generation_2017.gh"}], "created_by_name": "Mathias s n", "created_at": "January 26, 2017 at 1:23am", "created_by": "Mathiassn", "replies": []}]}]}