{"body": "\nHi all,\n\n\n\nI'm running a daylight analysis which includes Solatubes and SunCentral systems in the building. To represent the daylight harnessed by these systems most accurately in the daylight analysis, I have the IES files from the manufacturers. I am able to get the IES files to load and run in Honeybee. However the light levels being produced are low and very localized to the light source. I am trying to determine if it’s some scaling, etc that needs to be modified. Within Honeybee there is a “CandelaMultiplier” which allows me to increase the values, but I don’t want to do it arbitrarily nor am I sure this is truly solving my problem.\n\n\n\nIf anyone has any insight as to importing IES files into Honeybee and things that need to be factored and considered that would be appreciated. I'm experiencing the situation with other IES files as well.\n\n\n\nThank you!\n\n \n\nScreenshots: 1 candela multiplier, 5 candela multiplier, 5 candela multiplier 2 lum web, legend and screenshot of grasshopper interface:\n\n\n\nFiles attached: SunCentral IES file, Rhino, and Grasshopper\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/todt*mSF2sAxgOPCkA0S1m6*nyMihe-*OLgcMxIAN0GeT*zTHvuRsf*p-8IgjcMsteTOTb63WoPW2WCQxw7MHYbsurkCNZc*/1CandleMulti1LumWeb.jpg?width=750\" width=\"750\"/>](http://api.ning.com:80/files/todt*mSF2sAxgOPCkA0S1m6*nyMihe-*OLgcMxIAN0GeT*zTHvuRsf*p-8IgjcMsteTOTb63WoPW2WCQxw7MHYbsurkCNZc*/1CandleMulti1LumWeb.jpg)\n\n[](http://api.ning.com:80/files/todt*mSF2sDsNdOC8MDqaOCCiEMVTU-r2fgmkz2LGBSOmXqGtDE*upYdoixeuHGzaQrmKTGPaUsfd81tjHlM4pkmO-Qeg36o/1CandleMulti1LumWeb.jpg)\n\n[](http://api.ning.com:80/files/todt*mSF2sDsNdOC8MDqaOCCiEMVTU-r2fgmkz2LGBSOmXqGtDE*upYdoixeuHGzaQrmKTGPaUsfd81tjHlM4pkmO-Qeg36o/1CandleMulti1LumWeb.jpg)\n\n[](http://api.ning.com:80/files/todt*mSF2sDsNdOC8MDqaOCCiEMVTU-r2fgmkz2LGBSOmXqGtDE*upYdoixeuHGzaQrmKTGPaUsfd81tjHlM4pkmO-Qeg36o/1CandleMulti1LumWeb.jpg)\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/todt*mSF2sCfOltuhb16r8oWHf6ww*vbzW84lYr9bBAREf*x924H242ynIUU3FjhvW13DhhAheF8uB**EpJWFLbLy8LzR4t8/5CandleMulti1LumWeb.jpg?width=750\" width=\"750\"/>](http://api.ning.com:80/files/todt*mSF2sDsNdOC8MDqaOCCiEMVTU-r2fgmkz2LGBSOmXqGtDE*upYdoixeuHGzaQrmKTGPaUsfd81tjHlM4pkmO-Qeg36o/1CandleMulti1LumWeb.jpg)\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/todt*mSF2sDLG*miXl4URSS6jTP9d1qDu8mqJH35xAtY1N3EmIiXhK4adgT6SVX28rRr6owN38Z5-ZVSHYNCvglW*SFNLKor/5CandleMulti12LumWeb.jpg?width=750\" width=\"750\"/>](http://api.ning.com:80/files/todt*mSF2sDLG*miXl4URSS6jTP9d1qDu8mqJH35xAtY1N3EmIiXhK4adgT6SVX28rRr6owN38Z5-ZVSHYNCvglW*SFNLKor/5CandleMulti12LumWeb.jpg)\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/todt*mSF2sBRubsaxOSfgE07yMKViYNgGi3hYy8o6NTHviPgGh7k4spoXAXGd1sGqAg6zGMjeHQjEo0YCdDzbcK4VZEs14FD/topview.jpg?width=750\" width=\"750\"/>](http://api.ning.com:80/files/todt*mSF2sBRubsaxOSfgE07yMKViYNgGi3hYy8o6NTHviPgGh7k4spoXAXGd1sGqAg6zGMjeHQjEo0YCdDzbcK4VZEs14FD/topview.jpg)\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/todt*mSF2sBl4-5TvKSOrAhC*PwVfdRAdKgm5KzTHVibAUeKzJKWwaLOHO-7pf-mi9GtFrvjO2eVLDu3Hw4kWjvERt3uUaGb/honeybeeinterface.JPG?width=750\" width=\"750\"/>](http://api.ning.com:80/files/todt*mSF2sBl4-5TvKSOrAhC*PwVfdRAdKgm5KzTHVibAUeKzJKWwaLOHO-7pf-mi9GtFrvjO2eVLDu3Hw4kWjvERt3uUaGb/honeybeeinterface.JPG)\n\n\n\n\n\n\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1670544", "name": "SunLuminaire (Electric) - March 2014.IES"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1670545", "name": "DaylightIEStesting.3dm"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1670546", "name": "DaylightIEStesting.gh"}], "created_by_name": "Charlene Mendez", "created_at": "January 11, 2017 at 7:55pm", "created_by": "CharleneMendez", "topic": "Low light levels produced from IES files Honeybee", "replies": [{"body": "\nCharlene,\n\nThis is an interesting issue here.  Taking a look at the IES file, the fixture has an absolute luminosity of 2909, lumens, which is about the equivalent of two 100-W incandescent light bubs.  I would say that your results seem to reflect that and it may be worth positioning the fixture closer to the ground, which is what I would do if  had only two light bulbs.\n\nAlso, from a quick search, these sun tubes don't seem to bring in that much light (juding very anecdotally here from the few images):\n\n[http://www.treehugger.com/sustainable-product-design/sunportal-pipe...](http://www.treehugger.com/sustainable-product-design/sunportal-pipes-sunlight-where-sun-dont-shine.html)\n\nIt seems that a lot might be getting lost in the light bounces through the tube.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "January 11, 2017 at 8:33pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nHi Charlene,\n\n\n\nFirst up, regardless of what manufacturers might state, approximating tubular daylighting devices with IES files is not a physically realistic solution.  The wide variation in Daylight on account of the position of the sun and weather cannot be expressed in terms of a single set of luminous intensity values (which is what IES files do).\n\nWith regards to your example files, I agree with Chris. The primary reason for the low illuminance levels is that the light bounces are getting lost in the tube. **Have you checked with the manufacturer/distributor if the location of the IES file should be inside the tube and not flush with the ceiling?** Physically modelling such tubes in lighting software like Radiance (which is what HB uses) or AGI32 is a fairly expensive proposition. This is one of the reasons why manufacturers provide photometric data for such devices (however simplistic that data might be).\n\nThe candelamultiplier increases or decreases the luminous intensity values. So it will have a direct impact on the calculation.  The primary reason for having that input was to enable users to do some testing with different lamp types and environmental factors such as dirt depreciation. You need not change them for your simulation. Assuming that the IES file is inside the tube, in order to make this calculation work inside HB you'd have to crank up the calculation settings to a very high level (start with -ab 10 -ad 4096).\n\n\n\nFinally, due to shortcomings in the annual simulation software (Daysim), IES files will not work directly work with annual calculations. However, there is a fairly easy workaround for that issue. In case you are planning to run annual calculations with IES files, please let us know here.\n\n\n\nSarith\n", "attachments": [], "created_by_name": "Sarith Subramaniam", "created_at": "January 12, 2017 at 10:07am", "created_by": "sarith", "replies": [{"body": "\nHi Charlene and Sarith!\n\nI just yesterday arrived at the same problem. I would like to run an annual simulation with both windows and IES-files and would love it if you could share your workaround for this. I try, and the IES-files works fine at a single point in time, but there seems to be some problem when Daysim is included.\n\n\n\nIt would be preferable for me if the IES files could be controlled like shading as discussed here: [http://www.grasshopper3d.com/group/ladybug/forum/topics/ldt-file-an...](http://www.grasshopper3d.com/group/ladybug/forum/topics/ldt-file-and-ies-file-interior-light-contribute-in-annual) , but if not I will run multiple simulations and slice the data afterwards!\n", "attachments": [], "created_by_name": "Anna Larsson", "created_at": "January 19, 2017 at 8:48am", "created_by": "AnnaLarsson", "replies": []}, {"body": "\nHi Anna,\n\n\n\nIlluminance is an additive quantity. Although the spectral composition of illuminance from daylight and electric will vary, we usually ignore that for normal lighting calculations. So, simulating electric lighting and daylighting together essentially involves adding constant electric lighting illuminance values to time-variant daylight illuminance values.\n\n\n\nWithin the context of Honeybee,this will involve running an annual simulation with daysim and then running a separate grid-based calculation with electric lighting and then doing a summation of those values per hour. See the attached gh file.\n\nThis is more or less how DaysimPS and SPOT work.\n\n\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1675174", "name": "Honeybee_Grid-based_Daylight_Simulation_Example2.gh"}], "created_by_name": "Sarith Subramaniam", "created_at": "January 19, 2017 at 2:59pm", "created_by": "sarith", "replies": []}, {"body": "\nHi Anna,\n\n\n\nWe ended up only conducting a point in time illluminance and not an annual simulation.\n\n\n\nEven though these daylight systems do not produce a lot of daylight as Chris identified, the IES file was running low relative to what it should be producing. This was verified after plugging the IES file into AGi32, the light levels were higher (see attached). The IES file itself had to be adjusted (the manufacturer of a different IES file for another daylight harvesting system said other modelers also have had to alter their files for Radiance to read properly). Once I plugged in the new IES file, it ran great with comparable levels to AGi32. I will try to find out more about how the IES file was manipulated.\n\n\n\nIf you are not having trouble with your IES file that's good, but I would check with the manufacturer to make sure the light levels you are receiving are accurate. Sorry I can't be of more help for the annual simulation at this time.\n\n\n\nChris &amp; Sarith,\n\nThank you both for your responses! Once I find out more about the changes made to the IES file I will post more.  I do know that PhotometricToolbox was utilized to make them.\n\n\n\nBest,\n\nCharlene\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1675388", "name": "Sunluminaire.pdf"}], "created_by_name": "Charlene Mendez", "created_at": "January 20, 2017 at 10:38am", "created_by": "CharleneMendez", "replies": []}, {"body": "\nHi Sarith and Charlene,\n\n\n\nThanks a lot for your responses!\n\n\n\nI ended up writing a bit of python to overlay annual simulations to have both sun and output from an IES-file (scaled depending of illuminance levels outside). It worked fine, I attatched results from a simple example.\n\n\n\nCharlene, I also had trouble with faulty converted IES-files that made me believe the calculation was failing. I was not the one responsible for them, but in the future I will take great care that the photometric files that I'm supplied with are correct.\n\n\n\nAnna\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1692765", "name": "Dagsljusautonomi endast sol.JPG"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1692766", "name": "Dagsljusautonomi sol och parans.JPG"}], "created_by_name": "Anna Larsson", "created_at": "February 16, 2017 at 5:15am", "created_by": "AnnaLarsson", "replies": []}]}], "id": "1670547"}