{"body": "\nHello Ladybug\n\n\n\nI would like to evaluate behavior of roof surface in the matter of heat reflection. The goal is pro provide relevant data that show the difference between classic PVC rooftop (production hall) and vegetation roof - how much heat is being absorbed and reflected back to the air. It has a significant impact on how the building surrounding behave. Is there also a chance to simulate wind influence? Imagine that there's a building surface that heats up the air and wind spreads that heated air around, which is bad for the soil, plants and even people living in the neighbourhood. \n\n\n\nThis research is at its beginning, so I am still gathering some relevant informations about this topic. \n\n\n\nThanks! \n\n\n\nPetr\n", "attachments": [], "created_by_name": "Petr Vacek", "created_at": "January 13, 2017 at 7:14am", "created_by": "PetrVacek", "topic": "Roof heat reflection", "replies": [{"body": "\nI'm not an expert in this topic and I assume there should be some research to calculate formulas for modeling such behavior, but if you want to create your own workflow then you can model such an effect by creating an energy model (to calculate the surface temperature), or use radiance (to calculate the radiation on the surface) and then use them as boundary condition for a CFD analysis where you can also model the airflow. Such a workflow won't work for an annual analysis though.\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "January 15, 2017 at 4:05pm", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nTo add to what Mostapha has said, there are many Solar Reflectance Calculators available online. You should look into them as well. They may help you in defining the boundary condition for a CFD simulation.\n\n-Devang\n", "attachments": [], "created_by_name": "Devang Chauhan", "created_at": "January 15, 2017 at 11:16pm", "created_by": "devang", "replies": []}], "id": "1671369"}