{"body": "\nHi,\n\n\n\nI am quite new to HB and have an issue to model ventilation that is demand controlled.\n\nIn the HBSetSchedule component is written for the ventilation schedule :\n\n**\"Note that this schedule overrides the typical ventilation that occurs based on the occupancy shcedule and the \"ventilationPerPerson.\"**\n\nSo I guessed if we didn't put a schedule there and specify a minimum airlow/m2 and minimum airflow/occupant, EP would calculate the volume flow rate at each timestep based on the schedule, but it doesn't seem to work.<br/> <br/> Indeed, on the results, I only have a constant airflow that correspond to the maximum of vol/m2 and vol/occ. So I wonder how to use these components to have demand controlled ventilation.\n\nWhat I really want is have a minimum airflow when the room is not occupied and a bigger one based on the number of occupants when the room is occupied.<br/> <br/> I currently have :\n\noutdoorAirRequirement input = 1 (maximum) in SetEPZoneThreshold\n\nventilation per area = 0.00035\n\nventilation per occ = 0.01 in set EPZoneLoads\n\nNo ventilation schedules input in SetEPZoneSchedules\n\n\n\nHope you can help,\n\n\n\nBest regards,\n\n\n\nAurelien\n", "attachments": [], "created_by_name": "Aurelien Keller", "created_at": "January 20, 2017 at 6:50am", "created_by": "AurelienKeller", "topic": "Demand-controlled ventilation issue", "replies": [{"body": "\nHi Aurelien,\n\n\n\nI would customize the occupancy schedule.\n\nCreate a new schedule with the values of the occupancy file with a function that substitute the values=0 (when there is no occupancy) for the amount that you need. You can always calculate this value by inputting a fraction of the ventilation per area or per person, as suits you.\n\n[<img class=\"align-center\" src=\"http://api.ning.com:80/files/3oOh0daNY6Nib5L6TXS0Br0A6Bc-qQoY1G-R-ziRzfRxoDoKw8jzpHhsFt7rhr9ZLbhkpuzxi3LwR0yglG2D4OM9c704i7VZ/schedule.PNG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/3oOh0daNY6Nib5L6TXS0Br0A6Bc-qQoY1G-R-ziRzfRxoDoKw8jzpHhsFt7rhr9ZLbhkpuzxi3LwR0yglG2D4OM9c704i7VZ/schedule.PNG)\n\nHope it helps\n\n\n\nJulia\n\n\n\nEdit: keep in mind that the simulation will calculate the ventilation per area/person multiplied by the number of the new schedule (approx to explain it in a simple way, hope Mostapha doesn't kill me for saying that), so be very careful with the numbers that you put there\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1675579", "name": "customized schedule.gh"}], "created_by_name": "Julia T", "created_at": "January 20, 2017 at 9:23am", "created_by": "JuliaT", "replies": [{"body": "\nHi Julia,\n\n\n\nThank you for your input !\n\nThis is approximately the way I am doing it right now but it requires quite a few unit conversions before having the right input and therefore higher risk of making a mistake..\n\nIn was therefore wondering if there was a nicer way to do it using the inputs already existing in the different components :)\n\n\n\nPS : This workflow is quite useful to modify a schedule ! Thanks !\n\n<br/>Aurelien\n", "attachments": [], "created_by_name": "Aurelien Keller", "created_at": "January 20, 2017 at 10:44am", "created_by": "AurelienKeller", "replies": []}, {"body": "\nHi Aurelien,\n\n\n\nUnfortunately not that I know/ remember in this moment. Maybe someone else can help you better.\n\nI know the possibilities of mistaking are high. What I do in these cases usually is I check thousands of times with other colleagues and run tests on small boxes to check its fine, and when I'm happy I cluster it, so I don't change it by accident.\n\n\n\nBut I'm afraid I cannot help you more, sorry.\n\n\n\nJulia\n", "attachments": [], "created_by_name": "Julia T", "created_at": "January 23, 2017 at 2:48am", "created_by": "JuliaT", "replies": []}]}], "id": "1675648"}