{"body": "\nI am trying to visualise the zone cooling loads for a structure, 5 floors at a time (since for some reason, Rhino would crash if i create additional floors and assign windows).\n\n\n\nAnyways, **the Colour Zones by EP result component would not output anything once i connect cooling load from the read EP result component**. \n\nI have attached my GH file.\n\nP.S: you need to toggle True for many components. Also, materials assigned need to be updated every time the file is opened the file by double-clicking on the corresponding text boxes to the material creating components (again, not sure why, but i think that's unimportant)\n\n\n\nEDIT:\n\nHere is a screenshot of outputs from Write EPW and Write OSM files (with same inputs). As you can see the output from the two components vary. the OSM component seems to only give out the last result in the case of Cooling loads. [<img class=\"align-full\" src=\"http://api.ning.com:80/files/KIUhBV3mdZ-XKaNn1Cc5O0Z9e2UALBsf8Kk48a4m2ZHZ44PBMKwpiHKivLrTCZbpBmnRAzH3mUlZFKrMG71YRbLQcBUGSgKY/OSM_error.jpg?width=750\" width=\"750\"/>](http://api.ning.com:80/files/KIUhBV3mdZ-XKaNn1Cc5O0Z9e2UALBsf8Kk48a4m2ZHZ44PBMKwpiHKivLrTCZbpBmnRAzH3mUlZFKrMG71YRbLQcBUGSgKY/OSM_error.jpg)[<br/>](http://api.ning.com:80/files/KIUhBV3mdZ9t2GW8Ho6PUsxlU9N2bEWoD6gvo4OTjlQOsEyivVQtDBEZGwSr68iuRUdLJgXICUDcE02K*GEPSV-Bo4D9naVp/OSM_error.jpg)\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1686219", "name": "20170206_OSM_v2.gh"}], "created_by_name": "nishant pandav", "created_at": "February 6, 2017 at 12:07pm", "created_by": "nishantpandav", "topic": "Unable to visualise Cooling load Zone data from Open Source", "replies": [{"body": "\nHello Nishant,\n\nYou assigned detailed HVAC system to OpenStudio.\n\nThen, From HB Read EP Result component outputs tool-tip:\n\n**Cooling**: The cooling energy needed in kWh. For Ideal Air loads, this output is the sum of sensible and latent heat that must be removed from each zone.For **detailed HVAC systems** (other than ideal air), this output will be electric energy needed to power each chiller/cooling coil.\n\n**Heating**: The heating energy needed in kWh. For Ideal Air loads, this is the heat that must be added to each zone. For **detailed HVAC systems** (other than ideal air), this will be fuel energy or electric energy needed for each boiler/heating element.\n\n-m\n", "attachments": [], "created_by_name": "OH_Dimore", "created_at": "February 6, 2017 at 4:50pm", "created_by": "MohammadR", "replies": [{"body": "", "attachments": [], "created_by_name": "nishant pandav", "created_at": "February 6, 2017 at 8:43pm", "created_by": "nishantpandav", "replies": []}, {"body": "\nNishant,\n\nI tried running you model. It crashed my Rhino eventually, but I could read the error message. Your model has non-convex surfaces. They'll have to be split into parts.\n\n\n", "attachments": [], "created_by_name": "Devang Chauhan", "created_at": "February 7, 2017 at 7:01am", "created_by": "devang", "replies": []}, {"body": "", "attachments": [], "created_by_name": "nishant pandav", "created_at": "February 7, 2017 at 10:32am", "created_by": "nishantpandav", "replies": []}, {"body": "\nHi Nishant and Devang,\n\nDidn't look at the example but if i understood the IDF was created and the crash happens when the simulation runs. I suggest to upload the idf file and/or running it manually. Then look at the ERR file from the simulation to see what is the complain.\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "February 7, 2017 at 10:23pm", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nThanks Abraham for joining the discussion. I think the answer lies in the image Nishant shared. Due to some reason, the output from Export to OpenStudio component does not have correct number of branches. The zoneData input on Honeybee_Color Zones By EP results has TreeAccess. If you could find why this branching is not right, that would solve the problem I believe.\n", "attachments": [], "created_by_name": "Devang Chauhan", "created_at": "February 8, 2017 at 12:06am", "created_by": "devang", "replies": []}, {"body": "\nOk . So if you remove the context surfaces then the non-Convex error should go away. The other problem that I see from your attached image is that the cooling output from read Ep result is not a tree for Export to Open Studio component. That's the reason why you're not able to visualize the results. You'll need to make it output 45 branches like you have from EnergyPlus Component. I am myself wondering why this did not happen automatically.\n", "attachments": [], "created_by_name": "Devang Chauhan", "created_at": "February 8, 2017 at 12:01am", "created_by": "devang", "replies": []}, {"body": "\nNishant,\n\nThere something very important to note here. The HVAC system that you're applying is Chilled Beams + DOAS. This is a central system so electricity is consumed at the chiller plant level and therefore, you're not receiving zonewise cooling energy. I believe that's the real reason why you're not able to visualize results for zones.\n", "attachments": [], "created_by_name": "Devang Chauhan", "created_at": "February 8, 2017 at 1:07am", "created_by": "devang", "replies": []}, {"body": "\nhi Devang and Abraham,\n\nThank you for your replies (and sorry for the late reply). I shall try out the suggestions and follow up soon. Been busy lately and haven't been able to look into the problem.\n", "attachments": [], "created_by_name": "nishant pandav", "created_at": "February 13, 2017 at 12:20am", "created_by": "nishantpandav", "replies": []}]}], "id": "1686220"}