{"body": "\nHello,\n\n\n\nI'm blaming myself a lot for not having considered this before, and it may be saying something really obvious, but I needed to check and I'm not finding the answer.\n\n\n\nIs ladybug considering the apparent solar time (sun-hour) or the mean solar time (clock-time)? As far as I understand it is the apparent solar time. So, could anybody confirm that my guessing is right saying:\n\nBeing less than 1degree longitude from the centre of my time zone (less than 1km from Greenwich):\n\n12:00 ladybug winter time = 12:00 clock\n\n12:00 ladybug summer time = 13:00 clock\n\n\n\nAm I right?\n\n\n\nThanks\n\nJulia\n", "attachments": [], "created_by_name": "Julia T", "created_at": "February 9, 2017 at 3:07am", "created_by": "JuliaT", "topic": "ladybug analysis period: sun-dial or clock-time", "replies": [{"body": "\nJulia,\n\nNot so obvious.\n\nOn my view it depends what tools are you using in order to get an answer to your questions (Mostapha, correct me if i'm wrong. I know you will).\n\nUsing the sunPath you can pick the type of time you want (Solar or civil) with the boolean _solarOrStandardTime_ input. Though it doesn't give you winter/summer time. I believe next version of LB_Tools will allow that *but not completely sure).\n\nIf you use other tools like radiationAnalysis or HB with radiance, it takes solar time, since it is depending on sky definitions.\n\nHope this makes sense.\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "February 9, 2017 at 3:51am", "created_by": "AbrahamYezioro", "replies": [{"body": "\nAbraham,\n\n\n\nIt is what I was guessing.\n\nI'm using the outdoor microclimate map and comparing it with the shadow mask and solar radiation as I am trying to optimise a terrace heavily obstructed by skyscrapers for outdoor comfort during the lunchtime.\n\nI don't really mind if the component uses one time or the other, but, as my time period is so tight, I need to know which one are they using to adjust properly the analysis period and that all of them use the same one to have an accurate guessing of the main targets.\n\n\n\nI guess Ill have to analyse 12-14 during winter time and 11-13 during summer.\n\n\n\nThanks for your help,\n\nJulia\n", "attachments": [], "created_by_name": "Julia T", "created_at": "February 9, 2017 at 4:03am", "created_by": "JuliaT", "replies": []}]}], "id": "1688225"}