{"body": "\nHi,\n\n\n\nI am trying to calculate how much solar radiation falls on my model and would also like to include the reflected radiations from the ground. Is there anyway I can do it. I guess not, having had a look at another post which asks the user to instead go with honeybee to achieve that.\n\nPerhaps there is another component which can achieve that?\n\n\n\nBut I do not want to do daylight analysis at the moment, but would just wan an overall picture to understand what portions of different radiations fall on my model.\n\n\n\nBest regards,\n\n\n\nAnurag\n", "attachments": [], "created_by_name": "Anurag Verma", "created_at": "February 9, 2017 at 9:10am", "created_by": "AnuragVerma", "topic": "Ground reflection using Ladybug", "replies": [{"body": "", "attachments": [], "created_by_name": "Christian Kongsgaard", "created_at": "February 9, 2017 at 9:32am", "created_by": "ChristianKongsgaard", "replies": [{"body": "\nHi, sorry, I was in the previous conversation with Anurag.\n\n\n\nI don't agree about the context reflections being always a minor component , as I had to work with cases that a mirrored building raised the temperatures of the north façade from the building I was working with to meet the southern ones.\n\n\n\nHowever I completely agree with the advice of honey bee and the ray tracing.\n\nAnyway, do you know how to get the solar radiation in terms of Wh/m2 from honeybee without going to the idf?\n", "attachments": [], "created_by_name": "Julia T", "created_at": "February 9, 2017 at 9:48am", "created_by": "JuliaT", "replies": []}, {"body": "\nJulia,\n\nYou can get the radiation using the HB_gridBasedSimulation and setting the _simulationType_ input to 1 (radiation). Pretty straightforward.\n\nThis [example](http://hydrashare.github.io/hydra/viewer?owner=mostaphaRoudsari&amp;fork=hydra_1&amp;id=Honeybee_Grid-based_Daylight_Simulation_Example_I&amp;slide=0&amp;scale=1&amp;offset=0,0) can serve as a starting point. Is for daylight but just need to change the simulation type and probably the sky type.\n\nIf more help needed let me know, but i have the feeling you'll manage.\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "February 9, 2017 at 10:22am", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nOmg you are right, I completely forgot about that. So sorry\n", "attachments": [], "created_by_name": "Julia T", "created_at": "February 9, 2017 at 10:24am", "created_by": "JuliaT", "replies": []}]}]}