{"body": "\nHi All!\n\n\n\nI know this is long in the running, and I keep forgetting to make a post (so I apologise!) but I thought I would take this time to post about my Master's of Building Science thesis published last year in May 2016 around the feasibility of implementing a program such as Honeybee into the building industry, using New Zealand as a case. Below is a short abstract of the study:\n\n\n\nI also attach a much shorter summary of my thesis in the form of a conference paper that I presented at the Architectural Science Association Conference in Adelaide, Australia last year. The paper was awarded the best student paper on building performance simulation.\n\n\n\nI would like to thank Mostapha, Chris, and the team in their help during my time learning the program! You guys have done an excellent job, and the program 'wow'ed all of the professionals that I showed the tool to.\n\n\n\nAs for what I have moved on to - I have since graduated with distinction and have been employed as a graduate at AECOM ltd. I am currently using the program on projects to enable architects to make more informed decisions that they don't normally have at the early stages of design. The program still has its challenges though, so you will see me on the forums a lot in the future !\n\n\n\nIf anyone has any questions or would like to know more, don't be afraid to ask. Find me on linkedn or contact me via here.\n\n\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1688500", "name": "ASAElzineBraasch2016.pdf"}], "created_by_name": "Elzine Braasch", "created_at": "February 9, 2017 at 5:59pm", "created_by": "ElzineBraasch", "topic": "A Master's Thesis: The Feasibility of Honeybee within New Zealand", "replies": [{"body": "\nElzine,\n\n\n\nWonderful paper. Your work provides a concise overview of the barriers we all face in trying to implement these new workflows within the industry. I'll be sharing this with others!\n", "attachments": [], "created_by_name": "Leland Curtis", "created_at": "February 10, 2017 at 8:50am", "created_by": "LelandCurtis", "replies": []}, {"body": "\nHi,\n\nThanks a lot for sharing this ! :)\n\nI am myself trying to push my company to use HB/LB more and more to provide information in very early design so your paper seem very interesting !\n\nAurelien\n", "attachments": [], "created_by_name": "Aurelien Keller", "created_at": "February 10, 2017 at 11:55am", "created_by": "AurelienKeller", "replies": []}, {"body": "\nElzine,\n\nExcellent research!\n\nBest wishes for your continued success.\n\n\n\nKind regards,\n\nOmid.\n", "attachments": [], "created_by_name": "Omid Rashidi", "created_at": "February 10, 2017 at 3:07pm", "created_by": "OmidmRashidi", "replies": []}, {"body": "\nElzine,\n\n\n\nThis is awesome to hear I'm glad that there is someone Honeybeeing down under! Vizz!\n", "attachments": [], "created_by_name": "Anton Szilasi", "created_at": "February 10, 2017 at 10:48pm", "created_by": "AntonSzilasi", "replies": []}, {"body": "\nHi Elzine,\n\n\n\nThank you for sharing this with us. Enjoyed reading the paper. It very well echoes the current sentiment in the industry. The paper made me recollect something a professor once shared. He said, \"If you're an architect and you think you need a Sustainable design consultant then there's something wrong.\" I believe in what he said. It is an architect's responsibility.\n\n\n\nI like the way engineers work. They always back their designs with analysis &amp; calculations. I often think architects could do the same with right education. When I discuss this with other architects, the common response is, \"But it may hinder the creative design process.\" However, I am not in agreement with that.\n\n\n\nA great read indeed. Thanks a lot!\n\n-Devang\n", "attachments": [], "created_by_name": "Devang Chauhan", "created_at": "February 11, 2017 at 4:59am", "created_by": "devang", "replies": []}]}