{"body": "\nHi Everybody,\n\n\n\nI am studying LB and HB, I tried to create a simple room, but I do not know how to add door with  leaves to wall.\n\n\n\nI hope I can get help from someone, thanks advance.\n\n\n\nSolon.\n", "attachments": [], "created_by_name": "Solon", "created_at": "February 12, 2017 at 4:37am", "created_by": "w9002", "topic": "How to add door with  leaves to wall.", "replies": [{"body": "\nWe didn't implement door type but you can create them as a separate surface. The main question is why are you trying to put them in your model?\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "February 12, 2017 at 6:15am", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nHi Mostapha,\n\n\n\nThank you for your reply.\n\n\n\nI can create a surface for door, but I do not know how to add it on the wall. could you please help me.\n\n\n\nThe U value of wall can be low or very low if we increase the thickness of the wall, but it is difficult to get door with low U value, or the price of door is expensive.\n\n\n\nif we only install a door with greater U value on the wall, we have to calculate the heating loss in the winter.\n\n\n\nSolon.\n", "attachments": [], "created_by_name": "Solon", "created_at": "February 12, 2017 at 7:30am", "created_by": "w9002", "replies": [{"body": "\nHi,\n\n\n\nOne solution to account for this is to change the properties of your wall in order to account for doors, and other thermal bridges. You can for instance lower the insulation thickness in order to lower the overall U-value of the wall.\n\n\n\nIf you really want to model a door, then I think a good way would be\n\n1- Create your geometry (including the door)\n\n2- Create HB surfaces with their properties\n\n3- Create your zone\n\n\n\nI am not sure this is possible, but maybe you can also add a opaque window to the wall ? <br/><br/>Aurelien\n", "attachments": [], "created_by_name": "Aurelien Keller", "created_at": "February 12, 2017 at 12:19pm", "created_by": "AurelienKeller", "replies": []}, {"body": "\nHi Aurelien Keller,\n\n\n\nThank you very much, i will try to create module according to your solution. \n\n\n\nSolon.\n", "attachments": [], "created_by_name": "Solon", "created_at": "February 12, 2017 at 5:21pm", "created_by": "w9002", "replies": []}]}, {"body": "\nHi Aurelien Keller,\n\n\n\nI tried to create window and door on a wall(surface), but I do not get successful.\n\n\n\nCould you please help me, I would appreciate it if you send a sample to me.\n\n\n\nP.S.: Please use commend of Grasshopper only. Because I do not understand Rhinoceros.\n\n\n\nSolon.\n", "attachments": [], "created_by_name": "Solon", "created_at": "February 16, 2017 at 10:44pm", "created_by": "w9002", "replies": [{"body": "\nHi Solon, \n\n\n\nHere is a quick example of what I had in mind. You just need to specify the material properties for the door in order to finish it :)\n\nHope it is what you were asking.<br/><br/>Aurelien\n\n\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1693604", "name": "DoorTest.gh"}], "created_by_name": "Aurelien Keller", "created_at": "February 17, 2017 at 10:49am", "created_by": "AurelienKeller", "replies": []}, {"body": "\nHi Aurelien Keller,\n\n\n\nThank you very much, I will research your sample. and I try to add window on wall then calculate it. \n\n\n\nSolon. \n", "attachments": [], "created_by_name": "Solon", "created_at": "February 17, 2017 at 6:55pm", "created_by": "w9002", "replies": []}]}, {"body": "\nI'm bringing this thread up to ask why common energy model logic says not to model the doors?\n\n\n\nThey seem to be important as they add leakage and lower R surfaces.\n\n\n\nSchool me?\n", "attachments": [], "created_by_name": "daviduburke", "created_at": "June 23, 2017 at 8:58am", "created_by": "daviduburke", "replies": [{"body": "\nHi Daviduburke,\n\n\n\nI guess doors are often not modeled in order to stay with a reasonable amount of details concerning the energy model. \"Modeling\" is basically simplifying reality to make calculations possible, and my guess would be that you want to simplify as much as possible. However, I feel like it would be great to know the uncertainties associated with every simplification in an energy model, including this one.\n\nHowever, there are a lot of different ways to take their effect into account.\n\nTo account for leakages, you can for instance add inter-zone mixing flow rates in E+ that would account for mixing air between adjacent zones and zones to outdoor.\n\nIf you need a greater level of detail, you should integrate an aeraulic model and a thermal model using CONTAM or COMIS for instance. (I know there are some ways to make them work with E+, but never used them this way)\n\n\n\nAurelien\n", "attachments": [], "created_by_name": "Aurelien Keller", "created_at": "June 26, 2017 at 2:01am", "created_by": "AurelienKeller", "replies": []}, {"body": "\nJust seeing this, Thank you for your thoughts. I think that the way things are going we will be modeling towards realistic very quickly. I'm working with people that have used PassivHaus models are asking me for similar resolutions. It seems like I can get windows to that resolution with Therm but I haven't dove in yet.\n", "attachments": [], "created_by_name": "daviduburke", "created_at": "July 4, 2017 at 7:47am", "created_by": "daviduburke", "replies": []}]}], "id": "1689952"}