{"body": "\nHi all!\n\n\n\nI have come across an error related to a **regular situation **for outdoor comfort. I have not found any information in the forums, hopefully someone can throw some light on it.\n\n\n\nI am working on an outdoor microclimate analysis for a public square. I am using the create EP ground component with different soil types  (Asphalt, Water, Concrete, Grass..) to calculate variations on radiant temperatures with EnergyPlus. \n\n\n\nSo far, the easiest way I found to get the grass material was through the Material:roofvegetation energy plus object, as defined by Chris on \n\n**[http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;for...](http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;fork=hydra_2&amp;id=Green_Roof_In_Energy_Model&amp;slide=0&amp;scale=1&amp;offset=0,0)**\n\n** **\n\n**[<img class=\"align-full\" src=\"http://api.ning.com:80/files/C*P8XcSSeqc2BhXA6ZGHyp6UZUiVd0t07*i4v1t24L0vtvi3bi0Y*OaMpTuy-azOlGsUiH*HeRj0lcZRAjGH4ShMSfKrpA64/GrassMaterial.JPG?width=750\" width=\"750\"/>](http://api.ning.com:80/files/C*P8XcSSeqc2BhXA6ZGHyp6UZUiVd0t07*i4v1t24L0vtvi3bi0Y*OaMpTuy-azOlGsUiH*HeRj0lcZRAjGH4ShMSfKrpA64/GrassMaterial.JPG)**\n\n**<br/>**1. Do you think this is the best way to specify grass for certain areas of the square in this type of analysis?\n\n\n\nThe problem comes later down the process, with the Indoor View Factor Calculator, as it does not recognize the roughness of the grass material. I tried changing it to Rough or Smooth, but the error persists.\n\n\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/C*P8XcSSeqfzFJ35FzLx6UdFAthfovpGe23jRvlV*1lPfitJ8cP6uZ-ni6rZLfZz7KE*NJoCZJ45g-BK-IMTP1vg4HWOlWOv/ViewFactorMesh_Error.JPG?width=750\" width=\"750\"/>](http://api.ning.com:80/files/C*P8XcSSeqfzFJ35FzLx6UdFAthfovpGe23jRvlV*1lPfitJ8cP6uZ-ni6rZLfZz7KE*NJoCZJ45g-BK-IMTP1vg4HWOlWOv/ViewFactorMesh_Error.JPG)\n\n\n\n\n\n2. Does someone know a way around this problem?\n\n\n\nPerhaps there is a better method to define the grass so that the error is avoided, or maybe it has to be implemented in the code. I have had a look at it, but my python skills are quite limited and didn't see any way of fixing the issue.\n\n\n\nI also attach the .gh definition,\n\nBig thanks in advance!\n\n\n\nRafael \n\n\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1690883", "name": "SquareMicroclimate.gh"}], "created_by_name": "Rafael A.", "created_at": "February 13, 2017 at 7:11pm", "created_by": "RafaelA", "topic": "Indoor View Factor Calculator - Problem with Grass (Material: RoofVegetation) Roughness", "replies": [{"body": "\nHey Rafa,\n\n\n\nAs soon as you replicate the material from scratch and you add it to the library it works.\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/C*P8XcSSeqfpV9EXfoh9MV2W07sG0pcJTliPGsW1hregYEAr3-OTsTJobOi9wdbZZoIbkC0DAlHI8sS2yhkUqRFmT5Lzsw9x/material.PNG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/C*P8XcSSeqfpV9EXfoh9MV2W07sG0pcJTliPGsW1hregYEAr3-OTsTJobOi9wdbZZoIbkC0DAlHI8sS2yhkUqRFmT5Lzsw9x/material.PNG)\n\nI tried adding your material and I don't really know why it was creating same error.\n\n\n\nHope it helps,\n\nJulia\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1691166", "name": "SquareMicroclimate_v2.gh"}], "created_by_name": "Julia T", "created_at": "February 14, 2017 at 4:09am", "created_by": "JuliaT", "replies": [{"body": "\nHi Julia! :)\n\n\n\nThanks for your suggestions and taking the time on this.\n\n\n\n\n\nI see that you are using an opaque material definition with the soil layer, disregarding the grass. By specifying a simple opaque material, I think that EnergyPlus would not take into account the\n\n\n\n\n\n**long wave and short wave radiative exchange within the plant canopy**\n\n**plant canopy effects on convective heat transfer**\n\n**and evapotranspiration from the soil and plants**\n\n**(engineering reference of EnergyPlus)**\n\n\n\nwhich I guess are some of the benefits of this assembly. Since for this case we are mainly looking at the resultant radiant temperature,\n\n\n\nWouldn't this be an oversimplification of the problem? \n\n\n\nRafael\n\n\n", "attachments": [], "created_by_name": "Rafael A.", "created_at": "February 14, 2017 at 4:56am", "created_by": "RafaelA", "replies": []}, {"body": "\nI believe that the customized opaque material will replicate a grass on every aspect but the evapotranspiration. As I understood you were more concern about radiant temperatures and not about comfort I considered it as a good option.\n\n\n\nIn the case that you are more interested on the comfort, hence on the evapotranspiration effect, you may find easier just to put in the \"_soilTypeOrMat\" of the ground zone the option 2 (Moits soil). This may simplify your workflow. However, if you are more interested on a comparison of different types of grass this wont work (as you had the default green roof material I didn't think that was your case, but no idea)\n\n\n\nI have to confess that I tried to introduce the material on \"HB Surfaces\" and then plug it to the ground zone with the option 2 that I mentioned, but I didn't work for me in the first attempt. Maybe doing something similar to that you have an option\n", "attachments": [], "created_by_name": "Julia T", "created_at": "February 14, 2017 at 5:21am", "created_by": "JuliaT", "replies": []}, {"body": "\nTo be honest, I am still unsure of the best way to get around this, I'll keep testing and update around here.\n\n\n\nIn my opinion, there should be a way to fix it on the Indoor View Factor Calculator, I'll try to have a deeper look inside it. Maybe, testing some other ways to assign the material to the surface will make it work, so that the RoofVegetation object for energy plus can be maintained.\n\n\n\nPerhaps someone around the forum has run into a similar problem,\n\n\n\nRafael\n\n\n", "attachments": [], "created_by_name": "Rafael A.", "created_at": "February 14, 2017 at 10:26am", "created_by": "RafaelA", "replies": []}]}], "id": "1690884"}