{"body": "\nHi I am sure some people had to deal with the same problem.\n\nA project is on a site that is not near any epw data set shown on the map.\n\n[http://www.ladybug.tools/epwmap/](http://www.ladybug.tools/epwmap/)\n\nFrom what I read you are supposed to work with a data set that is no farther apart than 30-50 kilometers.\n\nI looked into this matter a bit and found that the weather data collected by korean goverment agency does not really work for TMY2 format because it is not based on 30 years and the weather records (in csv format) often does not include any of the three radiation data sets.(attached in the pdf)\n\nIn south korea it seems like softwares like ecotect and eco2 are used for environmental analysis and energy modelling, and I am thinking one of the reason is that there is lack of TMY2 data sets to work with.\n\nThere are some white papers comparing simulation results of ecotect work with DOE data (EPW), meteonorm, data collected by korean weather agency, and GBS VWS (which is apparently a dataset that uses extrapolation), and it seems like there isn't a striking difference except some spikes on values due to perhaps missing data.\n\non this [link](https://knowledge.autodesk.com/search-result/caas/CloudHelp/cloudhelp/ENU/BPA-GBSWebService/files/GUID-B82244EC-9798-4CF7-8F53-1D79B6B4A53C-htm.html) it shows what the GBS studio data has and it seems like it has most parameters that are shown [here](https://github.com/mostaphaRoudsari/ladybug/blob/master/src/Ladybug_Import%20epw.py) for the ladybug.\n\nIF if could find a way to convert GBS VWS dataset into epw file format, meaning simply downloading autodesk GBS dataset as csv and use a program to create an epw file, would that give a misreading results, by principle?\n\nand one more question, in order to use butterfly, do I also need to have an epw file?\n\nThanks!\n\n \n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1694838", "name": "aiktp_201303_035.pdf"}], "created_by_name": "Youngjae chung", "created_at": "February 19, 2017 at 2:33am", "created_by": "YOUNGJAECHUNG", "topic": "[SOLVED] Non-US based project, absence of an epw file - how to work with Ladybug tools, a possible work around?", "replies": [{"body": "\nThere are a couple of mixed questions here so I try to separate them and answer some of them.\n\n\n\n1. Can one create an epw file if you have weather data in other formats?\n\nThe short answer is yes. It doesn't mean that your weather data will be changed to TMY but you can always format the data in EnergyPlus Weather (epw) file structure.\n\n\n\n2. If one has the data how they can create an epw file from the raw data.\n\nEpw file is a csv file. Check [this link](http://bigladdersoftware.com/epx/docs/8-3/auxiliary-programs/energyplus-weather-file-epw-data-dictionary.html) to understand how it is structured. You can create one from scratch or modify an available weather file. There are also a couple of programs such as WeatherConverter which comes with EnergyPlus installation (C:\\EnergyPlusV8-6-0\\PreProcess\\WeatherConverter) that can help you to automate the process.\n\n\n\n3. Does one need to have access to epw file to run butterfly?\n\nNo.\n\n\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "February 19, 2017 at 10:03am", "created_by": "MostaphaSadeghipour", "replies": [{"body": "\nThank you for the explanation Mostapha. This study concerns a winning proposal of multi use training facility in south korea, and I hope to be able to provide a good example.\n\n\n\nI managed to get hold of .bin file and .cvs file and converted it into epw file using elements software by bigladdersoftware. I simply saved the bin file as epw file. [http://bigladdersoftware.com/projects/elements/](http://bigladdersoftware.com/projects/elements/)\n\n\n\nI tried to run the integrated daylight and energy simulation and I am getting runtime errors in the Hoenybee run daylight simulation and Honeybee run energy simulation. For energy simulation I am getting \"Solution exception:'ascii' codec can't encode character '\\uCE5C' in position 211\"\n\n\n\nCould this has to do with making sure the epw file is in the right format? \n\n\n\nThank you again Mostapha.\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1696658", "name": "Integrated_Daylight_and_Energy_simulation_yj.gh"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1696659", "name": "GBS_06M12_11_048082.bin"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1696660", "name": "GBS_06M12_11_048082.epw"}], "created_by_name": "Youngjae chung", "created_at": "February 21, 2017 at 3:41am", "created_by": "YOUNGJAECHUNG", "replies": []}, {"body": "\nThere are &lt;not available&gt; values in the header of epw file. simply remove them and keep the space between commas empty. That should solve the problem.\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1696699", "name": "GBS_06M12_11_048082.epw"}], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "February 21, 2017 at 8:35am", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nThank you Mostapha, with the fixed Header the simulation is working.\n\n\n", "attachments": [], "created_by_name": "Youngjae chung", "created_at": "February 26, 2017 at 8:57am", "created_by": "YOUNGJAECHUNG", "replies": []}]}], "id": "1694663"}