{"body": "\nChris, all:\n\n\n\nI'm struggling to get a finished Therm analysis of a custom detail, having had success with the example files.\n\nThe problem is that when I wire all my ThermPolygons to the WriteTherm component, it reports the following error:\n\n\"Failed to call _polygons and boundaries_ from the HB Hive. Make sure that connected geometry to _polygons is from the 'Create Therm Polygons' component and that geometry to boundaries_ is from the 'Create Therm Boundaries' component.\"\n\nIt seems to be only certain ThermPolygon components that trigger this (the 4 situated last - and currently unwired - in the attached .gh file)\n\nFurther, some of the geometry tends to lose it's reference (and report Null) when I close and reopen the .gh file.\n\nI checked that the Rhino surfaces are all contiguous and form a single polysurface, with normals all in the same direction.\n\nI am a Rhino novice, so hoping that i am missing something easy and obvious here.\n\n\n\nI'm running the 02/05/17 version of the Honeybee components.\n\n\n\nThanks to anyone in advance for any help,\n\nJoe\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1694022", "name": "Curtain Wall Test.3dm"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1694023", "name": "Curtain Wall Test.gh"}], "created_by_name": "Joe Simms", "created_at": "February 17, 2017 at 9:57pm", "created_by": "JoeSimma", "topic": "Therm: Help with \"Failed to call _polygons and boundaries_ from the HB Hive\"?", "replies": [{"body": "\nI can't help with the Therm question but back to the issue with internalizing geometries that's a GH problem and if you search the forum you should find a good number of discussions about this issue. Not sure if there is a fix for that.\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "February 18, 2017 at 8:16pm", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\n*bump*\n\nI've spent another round trying to solve this, but keep getting the error already mentioned.\n\nAny suggestions appreciated.\n\n\n\nThanks all,\n\nJoe\n", "attachments": [], "created_by_name": "Joe Simms", "created_at": "March 13, 2017 at 1:28pm", "created_by": "JoeSimma", "replies": [{"body": "\nJoe,\n\n\n\nI am pretty sure that this is happening because you have an older version of the THERM writing component in your file with a newer Honeybee_Honeybee.  I will check once I get the chance (it should be very soon).\n\n\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "March 13, 2017 at 3:57pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nJoe,\n\nI am nearly positive that this has to do with an older HB_HB that you have flying on another GH canvass.  I was able to run the file that you uploaded at the start of this post and import it into THERM:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/9e-LbPNbsUsFd86U40pi9SY-EynuMvyskg5Bj9hkgygz249lyxfOIMUz8Pkj68ObPyzt6G8VEXDkY5M-aoo6fMXaDX1RVZgL/ImportToTherm.JPG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/9e-LbPNbsUsFd86U40pi9SY-EynuMvyskg5Bj9hkgygz249lyxfOIMUz8Pkj68ObPyzt6G8VEXDkY5M-aoo6fMXaDX1RVZgL/ImportToTherm.JPG)\n\nIt seems that your curved edges were not translating well, though.  I would strongly suggest making all of your geometry as polygons and not curves.  Curves do not exist in the THERM world and the method that Honeybee uses to translate them is not always ideal.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "March 13, 2017 at 4:58pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nChris,\n\nThanks very much for your response.  \n\nI'm still confounded here - no separate GH canvas is open, and all the HB components are ver 0.0.61.  I did grab the latest HB_HB (Feb 27) from github to see if that would solve, but same result.  Clearly though this is something with my configuration since you were able to get the thmx output.  I suppose I could wipe &amp; reinstall LB/HB as next step, although I did try this once already a couple rounds of troubleshooting ago.\n\n\n\nBelow screenshot in case it's any help: \n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/9e-LbPNbsUv7DPkFUDUIQyXKtDcbCwwP0lZHiMd8dXrO0-ybXUpsSXMEEv4StfSJt3eTOft3l--nUOMqlhQ*4KpgdEsohqgO/Screen.jpg?width=721\" width=\"721\"/>](http://api.ning.com:80/files/9e-LbPNbsUv7DPkFUDUIQyXKtDcbCwwP0lZHiMd8dXrO0-ybXUpsSXMEEv4StfSJt3eTOft3l--nUOMqlhQ*4KpgdEsohqgO/Screen.jpg)\n", "attachments": [], "created_by_name": "Joe Simms", "created_at": "March 13, 2017 at 8:50pm", "created_by": "JoeSimma", "replies": []}, {"body": "\nJoe,\n\nThat image was helpful.  I realize now that the error is happening because python's copy module is not working correctly on your system.  Do you experience the same thing when creating HBZones for energy simulations?  Let me see if I can find a different way of doing this that works on your system.  I'll post back shortly.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "March 14, 2017 at 6:04pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nJoe,\n\nThis is not an ideal solution to the problem because, in the best scenario, we would find a way to get copy.deepcopy() to work on your machine.  However, because the THERM workflow really only involves the therm polygon components and the writing component, you actually don't have a need to copy the objects here (as you would with some other Honeybee components like those for energy simulation).  Accordingly, I made a change to the code on the github so that the THERM workflow doesn't copy the objects and everything should now work for you:\n\n[https://github.com/mostaphaRoudsari/honeybee/commit/f36dd65a6136908...](https://github.com/mostaphaRoudsari/honeybee/commit/f36dd65a61369083335c15c7d45b2a8a084aa2dc)\n\nThe working components are in the attached GH file and let me know if they fix the issue on your system.\n\n-Chris\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1712504", "name": "CurtainWallTest_CWM.gh"}], "created_by_name": "Chris Mackey", "created_at": "March 14, 2017 at 6:44pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\n\n\nBingo! the revised Write component did export the thmx file without error.  I wasn't able to get Therm to do the calculation of course because as you already mentioned the curves were not being interpreted properly, so I have some geometry clean-up to do.\n\n\n\nI have not done any energy simulations with HB, so can't say whether the same problem occurs when creating HBZones.\n\n\n\nFor what it's worth, I did get the same error (re the copy module &amp; \"failed to call _polygons...\") on both my office computer and my home laptop.\n\nMaybe it's related to the geometry that was being referenced?  Some of the geometry plugged into the Write component without issue, while others triggered the error.  All the geometry came from Revit, via AutoCAD for some cleanup and flattening, then imported to Rhino - so maybe some strangeness was picked up along the way.\n\n\n\nThanks very much Chris for digging deeper and finding a workaround.\n\n\n\nJoe\n", "attachments": [], "created_by_name": "Joe Simms", "created_at": "March 15, 2017 at 11:34am", "created_by": "JoeSimma", "replies": []}, {"body": "\nJoe,\n\nI'm glad that this worked.\n\nI am pretty sure that the reason why you cannot use ironpython's copy.deepcopy() function is a result of your version of Rhino and not your operating system.  I think that older service releases of Rhino were using a different type of ironpython or something like that.  If you can update your service release of Rhino that might fix it.\n\nOtherwise, I'm glad that you have what you need now.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "March 15, 2017 at 6:30pm", "created_by": "ChrisMackey", "replies": []}]}]}