{"body": "\nHi all ,\n\nI have modeled a simple HBzone with customized glazing surface, besides I added a plenum zone as a box surrounding the glazed surface..\n\nThe question is, If I want to consider a solar air heater within the plenum zone in which this air heater warms the kept air inside the box for a while until it gets to a specific temperature in case of Winter to deliver it to the HBZone; How do you suggest to model it or at least simplify it to have something similar?\n\n\n\nThanks in Advance\n", "attachments": [], "created_by_name": "AMIR TABADKANI", "created_at": "February 23, 2017 at 6:39am", "created_by": "AMIRTABADKANI", "topic": "Air Heater in HBPlenumZone?! Possible?!", "replies": [{"body": "\nHi Amir,\n\nWhy do you need a plenum and not modeling it as an unconditioned zone? The only issue that I can see is that E+ algorithms are not meant to be used for small zones. I'm not sure though. Maybe they have addressed the limitation in the new releases. I suggest you post your question to unmethours.com\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "February 27, 2017 at 7:26am", "created_by": "MostaphaSadeghipour", "replies": [{"body": "\nThanks Mostapha for your reply, \n\n\n\nConsider you have sth like DSF zone which is not conditioned but you still have natural ventilation as we could do it as HBplenumZone.. Then it is combined with an implemented solar air heater inside it ,, in which this air heater warms the air inside the zone until a specific temp. and then release it into the adjacent zone .. I was trying to simulate the solar air heater as a black body surface inside the zone but I still can not control the temperature... I hope I could describe the issue clearly .. and I know maybe this is more CFD related matter rather than E+ .. but I wanna try if there is any simplification for it .. \n\n\n\nI ll post there also ..,, \n\nThanks Mostapha,,\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1702159", "name": "Untitled.png"}], "created_by_name": "AMIR TABADKANI", "created_at": "February 28, 2017 at 3:54am", "created_by": "AMIRTABADKANI", "replies": []}]}], "id": "1698640"}