{"body": "\nNOTE: Apologies, I posted this on the main Grasshopper discussion page - I now realise this would've been much more appropriate here. Sorry for the double post!\n\n\n\nHi all,\n\n\n\nI am an amateur user of Rhino/Grasshopper but am beginning to explore its possibilities in my capacity as a sustainability consultant. I'm looking to use the Ladybug PV tools to provide as much information as possible about PV sizing, orientation, shading and expected outputs.\n\n\n\nI've been using the \"020 PV shaded analysis\" example canvas as a starting point (very useful, thanks to its creators) and have been trying to incorporate the **TOF** and **PV_SWH_SystemSize **modules but am having issues with both.\n\n\n\nFor the **TOF **module, I find that no matter which inputs I provide, the **optimalTilt **is always 45 and the **optimalAzimuth **is always 180. I'm providing a weather file input and a north vector.\n\n\n\nI'm then using the **optimalTilt **and **optimalAzimuth **outputs to supply the **PV_SWH_SystemSize **inputs for **arrayTiltAngle** and **arrayAzimuthAngle - **obviously this isn't actually doing anything useful at the moment as the outputs from the **TOF** are always 45 and 180.\n\n\n\nWith the **PV_SWH_SystemSize **module, I'm having issues with the spacing it is providing between the rows of PV. I know it calculates this based on the sun position on a date based on the altitude of the location the weather file provides, but I think the spacing is far too large, especially for a rooftop array where the space is more like 1-2m normally. I'm trying to specify a summer date in the format the **minimalSpacingDate** output provides (15 NOV 15:00) so the calculated spacing is lower, but it just throws up an error whenever I do.\n\n\n\nFinally, it would be really useful to be able to get the **PV_SWH_SystemSize **component to actually produce the array it has created as Rhino geometry, so they can be viewed when rendered; is that possible? Also, is it possible to restrict the module so that it only creates rows with dimensions such that it fits within a surface you provide?\n\n\n\nApologies, I know these are a lot of probably very basic questions! I've attached my canvas - again, I'm sorry it's not as neat as it could be. Thanks in advance for any and all help!\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1702948", "name": "Basic Dense Massing.3dm"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1702949", "name": "20170228-Photovoltaics shaded analysis Basic Dense Massing-v2 (updated LB).gh"}], "created_by_name": "T Wigg", "created_at": "March 1, 2017 at 5:20am", "created_by": "TWigg", "topic": "Ladybug PV analysis: TOF issues and general advice", "replies": [{"body": "\nHi Wigg,\n\nI am stuck with some other work this spring, and this is the reason why you didn't get the reply straight away. I apologize for that. I am probably going to reply even rarely in the next couple of weeks. But if you are patient I think we will try to solve most of the issues.\n\n\n\nFor the TOF module, I find that no matter which inputs I provide, the optimalTilt is always 45 and the optimalAzimuth is always 180. I'm providing a weather <br/>file input and a north vector.\n\nYou are the second user who reported this which means that I was wrong in my assumption of setting a very low default value for the **precision_** input, it should have been higher as more user friendly for beginners. Basically the TOF component results depend on the **precision_** input. The best would be to set this value to 100, let your PC run the whole night, and in the morning you would get the most precise tilt and azimuth optimal angles. However, as some of us are using weaker PCs, and as sometimes the difference between results from **precision_** = 100 and say **precision_** = 30 is less than a degree, you can try using the **precision_** = 30 for the start.\n\nBy default the **precision_** is set to only 2. I will make sure this is increased in the next release of this component. Your topic definitively contributed to that!\n\nAnother thing I noticed is that \"TOF\" component does not support **north_** inputs not equal to 0, in terms of graphical representation of results. It would probably take me some time to fix this. But the numerical results (which is what we need) are supported.\n\nBy looking at some other similar PV applications, I haven't seen the optimal tilt/azimuth graphical representation which supports change of north angle direction, so maybe this is not too much of an <br/>issue after all. The important thing is the numerical part, which is outputs correct results.\n\n\n\nI'm then using the optimalTilt and optimalAzimuth outputs to supply the PV_SWH_SystemSize inputs for arrayTiltAngle and arrayAzimuthAngle - obviously <br/>this isn't actually doing anything useful at the moment as the outputs from the TOF are always 45 and 180.\n\nIt will make sence now, that you increase the upper precision_ input.\n\n\n\nWith the PV_SWH_SystemSize module, I'm having issues with the spacing it is providing between the rows of PV. I know it calculates this based on the <br/>sun position on a date based on the altitude of the location the weather file provides, but I think the spacing is far too large, especially for a rooftop array <br/>where the space is more like 1-2m normally. I'm trying to specify a summer date in the format the minimalSpacingDate output provides (15 NOV 15:00) so <br/>the calculated spacing is lower, but it just throws up an error whenever I do.\n\n**minimalSpacingPeriod_** input of the \"PV SWH System Size\" component accepts data from Ladybug \"Analysis Period\" component. But again, I apologize: as this is my mistake for not mentioning this in its docstring (that's the explanation you get when you hover your mouse over this input). I will make sure this gets added to the next release of \"PV SWH System Size\" component as well!\n\nI also noticed a bug with \"PV SWH System Size\" component - at the moment the values it calculates are not correct if **north_** input is not equal to 0. This is due to the component using another Ladybug developer's code which calculates sun position angles. For some reason this code does not support changing the north angle direction. I will contact the author to see how this can be solved.\n\nSo to be clear: it's not that all Ladybug Photovoltaics component do not support **north_** inputs not equal to 0. It's that \"PV SWH System Size\" component currently does not due to the upper issue. And \"Tilt and Orientation Factor (TOF)\" component does not support for its graphical representation of results. I will see if at least the first one can be fixed.\n\n\n\nFinally, it would be really useful to be able to get the PV_SWH_SystemSize component to actually produce the array it has created as Rhino geometry, so <br/>they can be viewed when rendered; is that possible? Also, is it possible to restrict the module so that it only creates rows with dimensions such that it fits <br/>within a surface you provide?\n\nThe PV_SWHsurface output of \"PV SWH System Size\" component contains Grasshopper geometry of all PV rows. Are you familiar with [baking in Grasshopper](https://www.lynda.com/Grasshopper-tutorials/Saving-baking-Grasshopper-files/174491/194099-4.html)?\n\n<br/>I attached below an example of how to perform a shaded PV analysis. I rotated the whole context by 40 degrees so that the issue with \"PV SWH System Size\" component could be overlooked. When you determine your **minimalSpacingPeriod_** input, we can internalize its \"PV SWH System Size\" output, rotate back your context and use \"40\" as a value for **north_** input for all components.\n\nLet me know if something was not clear, or if I replied vaguely to some of your questions.<br/>I apology in advance if it may take me a bit longer to answer to your next question. This spring period has really toughen my free time.\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1705305", "name": "Photovoltaics shaded analysis.gh"}], "created_by_name": "djordje", "created_at": "March 4, 2017 at 3:48pm", "created_by": "djordje", "replies": [{"body": "\nHi Wigg,\n\nThe issue with \"PV SWH System Size\" component not accounting for **north_** input has been fixed.<br/>So right now all Ladybug Photovoltaics components support **north_** input apart from graphical representation of the \"Tilt And Orientation Factor (TOF)\" component.<br/>This is what graphical representation means:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/F2Psn398QBw8ZCudFxWyhp*T2kIIGpkxBdMXWVN3ZqCImni-LsW2q8AfHo248mUTKwaC0gynjoEWU4g5BpSL0a*IUWm4nx5n/tof_Gatwick.jpg?width=250\" width=\"250\"/>](http://api.ning.com:80/files/F2Psn398QBw8ZCudFxWyhp*T2kIIGpkxBdMXWVN3ZqCImni-LsW2q8AfHo248mUTKwaC0gynjoEWU4g5BpSL0a*IUWm4nx5n/tof_Gatwick.jpg)\n\n\n\nSo even though the north angle of \"40\" has been inputted in upper **Photovoltaics shaded analysis.gh** file, the \"TOF\" component will still show the graphical result as if north is defined at 0. I do not think I will be changing this, as it will require from me to rewrite much of the \"TOF\" component.<br/>\"TOF\"'s numerical calculation will support the **north_** input which is what is important.<br/>This is what numerical calculation is (the numerical outputs):\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/F2Psn398QBxHaKk7fQLzd-8go0yCyVJnHdf3B8T9L2W-HnCh0EqKp2INFFvZkrsrUoJBdGmtWgbMOAIEtUduh10uLuTbRKcr/numericalOutputs.jpg?width=250\" width=\"250\"/>](http://api.ning.com:80/files/F2Psn398QBxHaKk7fQLzd-8go0yCyVJnHdf3B8T9L2W-HnCh0EqKp2INFFvZkrsrUoJBdGmtWgbMOAIEtUduh10uLuTbRKcr/numericalOutputs.jpg)\n\n\n\nSo I attached a new grasshopper definition below where all components have **north_** input set to \"40\" and your context has been rotated back to -40, as you had it on the very beginning.\n\n\n\nLet me know if you have any questions.\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1708289", "name": "Photovoltaics shaded analysis2.gh"}], "created_by_name": "djordje", "created_at": "March 8, 2017 at 5:53pm", "created_by": "djordje", "replies": []}, {"body": "\nHi Djordje,\n\n\n\nI'm hoping to be able to start incorporating your changes this weekend but I just wanted to express my gratitude for your quick, detailed and comprehensive response. I've been impressed with the support on the forums as a spectator, but not experienced it myself until now. I know you have been busy yourself and taking the time out to respond to my (probably rather trivial) issues is not expected. \n\n\n\nI hope you are well and I haven't distracted you from your work for too long. Thanks again for your help.\n\n\n\nWigg\n", "attachments": [], "created_by_name": "T Wigg", "created_at": "March 9, 2017 at 2:09am", "created_by": "TWigg", "replies": []}, {"body": "\nHi Wigg,<br/><br/>Your question was certainly not trivial, and it actually contributed in finding and solving the bugs with the **north_** input.<br/>With users like yourself and topics like this, the Ladybug tools are becoming more stable and reliable each day. So it is I who needs to thank you.<br/><br/>Let me know when you have more questions.<br/><br/>Regards,<br/>Djordje\n", "attachments": [], "created_by_name": "djordje", "created_at": "March 9, 2017 at 3:46am", "created_by": "djordje", "replies": []}]}], "id": "1702950"}