{"body": "\nHello,\n\n\n\nI am doing a shading study for a trellis. (Please see attached) \n\n\n\nI am trying to understand the legend for the shading study. I know that this is telling me the amount of daylight hours on the testing surface. What I don't understand is why the hours are not adding up to the total number of hours for that month. \n\n\n\nI know June has 744 Hours but the total number of hours for June in the analysis adds up 1809.5. If anyone can explain this to me I would greatly appreciate it.  I have also added the study for the month of December and again the total number of hours adds up to 1221 hours. \n\n\n\nAny guidance would be greatly appreciated. I also included the script being used. \n\n\n\nThank you!\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1704245", "name": "June.jpg"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1704246", "name": "December.jpg"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1704247", "name": "17_0301 Shadow_Range_analysis.gh"}], "created_by_name": "Melissa Jimenez", "created_at": "March 2, 2017 at 4:04pm", "created_by": "MelissaJimenez", "topic": "Shading Analysis", "replies": [{"body": "\nHi Melissa\n\n\n\nYour test surface is divided into test points from your _gridsize input. Each of these test points has the ability to experience each of the 744 sunlight hours in June. In this instance the ones with red are going to receive direct sunlight not more than 329 times and the ones in yellow 164.5 times which is due to your geometry blocking out the direct sunlight.\n\n\n\nAdding up the legend to get total hours is incorrect. You have to look at the test points individually. Perhaps a good way would be to think of it as percentages of the 744 total possible hours. \n", "attachments": [], "created_by_name": "Duncan Cox", "created_at": "March 6, 2017 at 4:09am", "created_by": "DuncanCox", "replies": [{"body": "\nHi Duncan,\n\n\n\nThank you for your quick reply.\n\n\n\nI do have a follow up question. When you say 329 times do you mean 329 hours of the 744 possible hours? \n\n\n\nSo the 329 times would be a total of 44% of the time in June? Is this correct? \n\n\n\nI want to make sure I can understand this correctly so that I may use ladybug and honeybee in the best possible way. \n\n\n\nThank you again!\n", "attachments": [], "created_by_name": "Melissa Jimenez", "created_at": "March 6, 2017 at 9:45am", "created_by": "MelissaJimenez", "replies": []}, {"body": "\nMelissa,\n\nWhat is the question that you want to answer with the analysis? I don't understand what are you trying to do with all those \"sunny\" hours. There are, for instance, standards that require minimum exposure hours for some day on the year (say, 21.12). Let's say you get X hours, what do you want to do with this result?\n\nJune = 720 hours (not 744), but not all of them are daylight hours.\n\n\n\nThis is not so helpful for you but i think it is important to know why you do what you do ...\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "March 6, 2017 at 11:13am", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nHello Abraham,\n\n\n\nI am trying to understand how many hours of daylight for each month are in the space. \n\n\n\nSo for example, I am trying to determine the size of a trellis based on the amount of daylight the space gets and the shadow range of the trellis. So if the trellis covers the deck at a depth of 20' there is no need for the trellis to be 30' deep. So I want to be able to study this relationship and more importantly I want to be able to justify it with based in the numbers given by ladybug. I want to be able to say this area of the deck is not occupied by people so it does not have to be shaded and this area gets X amount of hours of daylight in the month of June. \n\nI hope that makes sense. \n", "attachments": [], "created_by_name": "Melissa Jimenez", "created_at": "March 6, 2017 at 2:14pm", "created_by": "MelissaJimenez", "replies": []}, {"body": "\nHi Melissa,\n\nRight now you are trying to deal with the shading part of your problem, right (assume that because so far no daylight requirements were mentioned).\n\nWhat i would do is taking 2-3 critical dates (i.e. 21.12, 21.6, 21.4/9), give the range of hours i want to check the shade and probably average the results to get the area in shade/exposed. I'm not convinced the number of hours you mentioned will give you what you want, unless you do the average i just wrote.\n\nHope this is clear enough ... if no, let me know.\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "March 6, 2017 at 10:23pm", "created_by": "AbrahamYezioro", "replies": []}]}], "id": "1704248"}