{"body": "\nHi all, i'm trying to check the diference of illuminance between a passive and active user for some variations of building elements: window size, shade type and size, orientation of building and numbers of shades. For that i used static blinds for simulate the passive user and the dynamic blinds with Honeybee_Advanced Dynamic Shading Recipe for active users. To see the results i'm using  Honeybee_Read Annual Result II to see the results between the custom range of 500 to 5000 lux, i could do all the variations of elements that i wanted for the passive user, but when i started using the Honeybee_Advanced Dynamic Shading Recipe i keep getting a error with Honeybee_Read Annual Result II and cant get any result. It works fine with Honeybee_Read Annual Result I, but i can't change it to show me the range 500 to 5000lux. There's a way i can see this result? Also, i used the excel to calculate the UDI for the static blinds, there's a way to calculate that for the dynamic blinds?\n\n\n\nThank you all!!!\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1709933", "name": "mandar para o forum.gh"}], "created_by_name": "Allyson Carvalho Silva Santos", "created_at": "March 11, 2017 at 7:44am", "created_by": "AllysonCarvalhoSilvaSantos", "topic": "Problem with Read Annual Daylight Results II", "replies": [{"body": "\nHi Allyson,\n\nHoneybee_Read Annual Result II is not designed to deal with dynamic blinds and schedule. Once you run Honeybee_Read Annual Result I it generates a new .ill file that you can use excel to open that file and calculate the custom UDI.\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "March 11, 2017 at 12:32pm", "created_by": "MostaphaSadeghipour", "replies": [{"body": "\nHi Mostapha, thank you for your answer!\n\nI did the simulation again and ran Honeybee_Read Annual Result I, but i didn't find the new .ill file that it generates, and if this .ill is the result of the 3 shading states together.\n", "attachments": [], "created_by_name": "Allyson Carvalho Silva Santos", "created_at": "March 13, 2017 at 6:37am", "created_by": "AllysonCarvalhoSilvaSantos", "replies": []}, {"body": "\nHi, Mostapha! I'm doing the daylight simulations with Allyson, and we aren't finding the new .ill file, we just found the file for the three shading states. How can we find the .ill files for dynamic shading simulations?\n", "attachments": [], "created_by_name": "Juliana P. Vilar de Carvalho", "created_at": "March 16, 2017 at 6:03am", "created_by": "JulianaPVilardeCarvalho", "replies": []}, {"body": "\nHi Allyson and Juliana,\n\nIf it doesn't generate a new ill file you have to do it yourself for now. You can use the shading profile from the generated .csv file to find the shading state for each hour and then use that to merge 3 .ill files into one based on shading states. [You can also load the shading profile into Grasshopper using Honeyb...](http://hydrashare.github.io/hydra/viewer?owner=mostaphaRoudsari&amp;fork=hydra_1&amp;id=Integrated_Daylight_and_Energy_simulation&amp;slide=0&amp;scale=4.713068322751456&amp;offset=-2521.5077349854946,-1281.1625578131225).\n\nMy apologies for the wrong information. I should have checked before posting the answer here.\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "March 16, 2017 at 6:20am", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nHi Mostapha, thank you again for your answer! We're working now to merge the .ill files based on shading states.\n\nBut it occurred other question, this time about Honeybee_EnergyPlus Window Shade Generator. Does shade control type also affects the shadding state for annual Daylight Simulation, or just for energy simulation? And if it does, how can i see that it is affecting?\n\nAllyson Santos\n", "attachments": [], "created_by_name": "Allyson Carvalho Silva Santos", "created_at": "March 16, 2017 at 7:15am", "created_by": "AllysonCarvalhoSilvaSantos", "replies": []}, {"body": "\nEnergyPlus Window Shade Generator is currently doesn't affect the annual daylight modeling with Daysim. It's control type will only be used in energy model. You should set up the control in your daylight model to follow the same logic.\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "March 16, 2017 at 10:58am", "created_by": "MostaphaSadeghipour", "replies": []}]}], "id": "1709934"}