{"body": "\nI am modelling multiple buildings (67 in total) in Rhino and I am having error for some of them, in particular a few buildings that are titled in a certain angle (most of them are shoeboxes with 0 degrees).\n\n\n\nThe following error appears, when simulating on EnergyPlus, after creating the geometry with Honeybee and Grasshopper:<br/><br/>** Severe ** checkSubSurfAzTiltNorm: Outward facing angle of subsurface differs more than 90.0 degrees from base surface.<br/>** ~~~ ** Subsurface=\"RETAIL_SRF_3_GLZ_0_GLZP_0\" Tilt = 90.0 Azimuth = 262.8<br/>** ~~~ ** Base surface=\"RETAIL_SRF_3\" Tilt = 90.9 Azimuth = 61.8\n\n\n\n\n\nInitially I created the geometry for this buildings by creating polylines from lower left corner, turned into a surface and extruded. secondly, I copied from a zero degree shoebox and tilted it, and finally I copied one of the tilted building that was working to use as base for the ones that were giving the error. None of these approaches seems to solve the error. Any ideas of what to do?<br/><br/>PS: If it is not clear, I can submit some images to illustrate or ask permission to see if I can share the model.<br/><br/>Thank you!\n", "attachments": [], "created_by_name": "Luis Santos", "created_at": "March 19, 2017 at 6:50am", "created_by": "LuisSantos", "topic": "error (tilted surfaces)", "replies": [{"body": "\nLuis,\n\nI can guess that the normal of the hosting surface (wall) is different from the child surface (window). This is the first thing i would check ...\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "March 19, 2017 at 7:03am", "created_by": "AbrahamYezioro", "replies": [{"body": "\nDear Abraham,\n\n\n\nit makes sense what you said, can you please advice me on how to check and fix this?<br/>I have created the glazing with Honeybee_Glazing based on Ratio, just like as I did for the 64 other buildings without any problem.\n", "attachments": [], "created_by_name": "Luis Santos", "created_at": "March 19, 2017 at 7:13am", "created_by": "LuisSantos", "replies": []}, {"body": "\nSorry for the delay,\n\nAttached an example where you can get the normal directions for one selected zone.\n\nWhat to do with that? It depends how you built your geometry. Supposedly to need to flip the original surface in rhino. But you didn't say anything about your modeling process.\n\nFrom the attached you can see the name of the surfaces so you can easily identify the one giving you trouble.\n\nBTW, is the simulation running (giving results)? Sometimes this error passes through.\n\n-A.\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1716990", "name": "TestNormals.gh"}], "created_by_name": "Abraham Yezioro", "created_at": "March 20, 2017 at 11:33pm", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nLuis, Can you share your example? Honeybee has built-in checks to make sure the normal direction of the host and window surfaces are matching.\n\nAlso did you try using the OpenStudio component instead of the EnergyPlus component. OpenStudio model has its own check which may fix the problem but again it may fix it in the wrong direction.\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "March 21, 2017 at 4:05pm", "created_by": "MostaphaSadeghipour", "replies": []}]}]}