{"body": "\nHi Guys,\n\n\n\nThis is my first post here and I am extremely new to Rhino-Grasshopper-LB+HB operations so please excuse me if I come across uninformed. First of, thanks for creating this tool and making it freely available!\n\n\n\nI am proposing a project for my final year thesis in which I am looking at mitigating measures for the UHI effect and the repercussions this has for thermal comfort and increases in energy demand. I have noticed the potential of Ladybug / Honeybee for climatic simulations and was wondering if it there was potential for using it for my exact purposes.\n\n\n\nI want to validate different urban greening situations such as green roofs and green facades as well as increased tree and park coverage etc against a base case urban situation to show that improvements to urban greening can reduce UHI impacts.\n\n\n\nIs it possible to incorporate variations of green space in a model using LB+HB? In what way would this be accounted for? Also, is there any functionality within LB+HB to estimate energy demands for these different situations?\n\n\n\nI also have a final question about .epw files which is whether or not there was a way of transforming these so that they are location specific. For example, the Energy+ .epw file I am currently using is from a site approx. 50km as the crow flies from where I am concerned.\n\n\n\nThanks,\n\n\n\nDeclan Fay\n\n\n\n\n\n\n", "attachments": [], "created_by_name": "Declan Fay", "created_at": "March 22, 2017 at 9:14am", "created_by": "DeclanFay", "topic": "Mitigating UHI effects with Vegetation", "replies": [{"body": "\nHi Decian\n\nFirstly, you can try using meteonorm to get interpolated meteorological data closer to your area of interest. Alternatively, you may use 'elements' ([http://bigladdersoftware.com/projects/elements/](http://bigladdersoftware.com/projects/elements/)) to adjust the EPW using local mean monthly values if you get them from another source.\n\nIf you are working at the micro scale (eg a park with surroundings) you could calculate the shadow effect of trees on human comfort, on surface temperatures and the heating/cooling loads of buildings using E+. There are ways to account for the variation in tree seasonal transmissivity. If material porosity is implemented in butterfly you could do a CFD analysis as well. Currently there is no way to account for tree evaportranspiration using ladybug as far as I am aware. The other, non ladybug, alternative is Envimet, which is not suitable for mesoscale studies and now even the full academic version costs money.\n\nPerhaps you might want to look at Dragonfly and the Urban Weather Generator for morphing a rural EPW into an urban one. It does take into account trees and vegetated building surfaces but it makes a lot of simplifications/assumptions. Other more complete solutions at the mesoscale level are UMEP (free- still under development) and SURFEX, both of them are quite complicated.\n\nI hope you find this information useful.\n\nAris\n", "attachments": [], "created_by_name": "Aris V", "created_at": "March 23, 2017 at 1:56am", "created_by": "ArisVartholomaios", "replies": [{"body": "\nHi Aris,\n\n\n\nThanks for taking the time to reply. The intended model area is my university campus. I am looking towards either modelling the whole area at once or doing separate microscale models of different regions in the campus. To be honest, this depends really on what software I can use easily for either option.\n\n\n\nI have already tried ENVI-MET and it seems really straightforward to use however the simulation time is extremely slow and there are limitations to using the free version.\n\n\n\nWith regards your other suggestions, there are going to be issues for me in learning them as it seems a lot are based around Python language which I am completely new to. There is a lot of information available on the applications but without this basic understanding of Python etc. my interpretation is very limited.\n\n\n\nI will keep trying with ENVI-MET for now but thereafter, maybe UMEP is the best option.\n\n\n\nThanks,\n\n\n\nDeclan\n", "attachments": [], "created_by_name": "Declan Fay", "created_at": "March 23, 2017 at 3:23am", "created_by": "DeclanFay", "replies": []}, {"body": "\nThat was a good overview of the options available, Aris.  Delcan, if you are mostly interested in fast simulations that model the overall UHI, then the Dragonfly connection to the Urban Weather Generator (UWG) would probably be the best.  This will warp your rural EPWs to account for UHI, given input building geometries and vegetation cover.  Most UWG simulations take less than 20 minute to run.  Here's an example file:\n\n[http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;for...](http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;fork=hydra_2&amp;id=Urban_Weather_Generator_Workflow&amp;slide=0&amp;scale=1&amp;offset=0,0)\n\nI will warn that you might be a little disappointed to find that the UHI effect is really very small.  It's almost an order of magnitude smaller than the changes that are all in store for us by 2050 with projected global warming.  Still, its useful to understand this and account for it when possible.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "March 25, 2017 at 10:43pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nHi Chris,\n\n\n\nThanks for getting back to me! I am going to have a look into the Dragonfly example as it seems like a good place to start.\n\n\n\nNow that UWG has come up, it reminds me of the first option I was looking into for this project... I was originally going to use UMI ([http://urbanmodellinginterface.ning.com/](http://urbanmodellinginterface.ning.com/)) to evaluate UHI and to quantify building energy demand in different scenarios. It seems that the inter-functionality of UMI-UWG is no longer available though.\n\n\n\nDeclan\n", "attachments": [], "created_by_name": "Declan Fay", "created_at": "March 26, 2017 at 7:59am", "created_by": "DeclanFay", "replies": []}]}], "id": "1718518"}