{"body": "\nHi there!\n\nI'm pretty excited about the Butterfly beta release... as always, thanks a lot to all contributors for the amazing work!\n\n\n\nNow I've got a question: Is it possible to use it with a regular, non-docker installation of OpenFOAM?\n\nI have, for example a Linux machine with different OF versions plus Virtualbox with a Windows 10 Guest system on it. Is it somehow possible to let Butterfly use the OF installation of the host system? (Installing OF for Windows is not possible with Virtualbox)\n\nOr can I even set up a case on my Windows Laptop and use the seperate Linux machine (or maybe even an Amazon EC2 instance) to run the OF calculations?\n\nIf not, is it planned?\n\nCheers\n", "attachments": [], "created_by_name": "Albert Pressler", "created_at": "March 24, 2017 at 5:49am", "created_by": "AlbertPressler", "topic": "Using Butterfly with regular OF in VM", "replies": [{"body": "\nHi Albert,\n\n\n\nThanks for testing Butterfly. It is indeed quite possible, and actually very efficient, to set up the case in Butterfly and run it in Linux. OF running in Linux is, at this moment, at least 50% faster than Windows. Of course that is to be expected with a Docker installation.\n\n\n\nEssentially, what BF will do is to help you run through the case preparation phase which is usually very time consuming. You can also use the write option in the run component to save the case and its files before you go to Linux.\n\n\n\nHope this helps! Please don't hesitate to add these issues in GitHub as well, or any other issue you might find.\n\n\n\nKind regards,\n\nTheodore.\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "March 25, 2017 at 1:42am", "created_by": "TheodorosGalanos", "replies": []}, {"body": "", "attachments": [], "created_by_name": "Albert Pressler", "created_at": "March 25, 2017 at 2:54am", "created_by": "AlbertPressler", "replies": [{"body": "\nI have never tried that so I'm not sure. I'd bet it won't work out of the box since I'm not sure how you can tell BF to look into a native Linux installation. That doesn't mean it is impossible just possibly not doable atm. However, I think it would be quite inefficient way to run things.\n\n\n\nMy above answer was concerning this sentence\n\n\n\nOr can I even set up a case on my Windows Laptop and use the seperate Linux machine (or maybe even an Amazon EC2 instance) to run the OF calculations?\n\n\n\nThis is certainly possible with the use of BF I described above. Concerning AWS instances, I am about to find out this week hopefully when I'm going to try my first cloud OF run. Will let everyone know if I do.\n\n\n\nKind regards,\n\nTheodore.\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "March 25, 2017 at 3:11am", "created_by": "TheodorosGalanos", "replies": []}, {"body": "\nalright, so i'll have to stick with writing the case via BF and then manually copy it to my EC2 instance and run it there.\n\nI've done plenty of simulations on AWS, the cool thing about that is you can create clusters and have as much computing power as you like. That way I've done some complex simulations with more than a hundred cores. There are some good explanations for creating clusters and running OF on the Amazon cloud in general on this site: [https://cfd.direct/cloud/aws/](https://cfd.direct/cloud/aws/)\n\n\n\nCheers\n\nAlbert\n", "attachments": [], "created_by_name": "Albert Pressler", "created_at": "March 25, 2017 at 7:13am", "created_by": "AlbertPressler", "replies": []}, {"body": "\nAs Theodore said it's not possible at the moment however this is definitely part of the plan down the road. All the new development for any type of analysis (daylight, energy and CFD) should be cloud-enabled. We should both provide it as a service and let users such as yours set up their own and run the analysis wherever they want.\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "March 25, 2017 at 11:44am", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "", "attachments": [], "created_by_name": "Albert Pressler", "created_at": "March 25, 2017 at 11:59am", "created_by": "AlbertPressler", "replies": []}]}], "id": "1719706"}