{"body": "\nHello!\n\n\n\nI'm having trouble understunding a result of a grid based radiation analysis on a external surface for a specific hour of the year. In fact when i add/remove ptsVectors_ input from the genTestPts definition into/from grid based simulation definition, results change significantly.\n\nCan someone explain me why, what is the difference and what result is more reliable?\n\n\n\nThank You!\n\nBest regards\n\nF\n", "attachments": [], "created_by_name": "Filippo", "created_at": "March 30, 2017 at 1:54am", "created_by": "Filippo430", "topic": "HoneyBee: Grid Based Simulation", "replies": [{"body": "\nYou have different results because most likely your analysis direction are different in two cases. You can open the two *.pts files to compare the differences.  \n\n\n\nThe ptsVectors output from genTestPts gives you normal vectors of your input geometry. \n\nWhen this output is not connected to the recipe, the analysis direction is taking a default value instead (I imagine it's {0,0,1} pointing upward, not 100% sure). \n\n\n\nWhich result is more reliable? Depending the external surface you are calculating. If it's a horizontal surface, the vectors should point upward. If it's a vertical facade, like external walls of building, then the vectors should point outward.\n\n\n", "attachments": [], "created_by_name": "vhoang", "created_at": "March 30, 2017 at 3:06am", "created_by": "vhoang", "replies": []}, {"body": "\nHello,\n\n\n\nthe fact is that I used the same surface to do the analysis. the surface direction is the same as the vectors.. \n\nthere should be another reason i guess..\n\n\n\n(I evaluate the surface direction and the normal is (1.0,0.0,0.0) and the verctor direction (output of gen test point definition are all  (1.0,0.0,0.0) )\n\n\n\nthank you\n\nf\n", "attachments": [], "created_by_name": "Filippo", "created_at": "March 30, 2017 at 3:50am", "created_by": "Filippo430", "replies": []}, {"body": "\nI did some other tests and still there are ambigous outputs:\n\n\n\n1. The analysis with pts vectors input is not sensible to the surface colour while the one where only the testPoints is plugged in it is sensible. meaning: if the reflectance of the surface is set to 1 (white) or 0 (black) the results are equal for the simulation where pts vectors are plugged in and very different for the one where it's not plugged in.\n\n\n\n2. The same analysis made with Ladibug radiation analysis gives different results!\n\nI attach the files so maybe someone can help me understand!\n\n\n\nThank you!\n\nf \n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1724210", "name": "Comparison.3dm"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1724211", "name": "Comparison.gh"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1724212", "name": "Comparison.PNG"}], "created_by_name": "Filippo", "created_at": "March 30, 2017 at 5:17am", "created_by": "Filippo430", "replies": [{"body": "\nThe normal direction of the surfaces in your case are not all 0, 0, 1. You have to connect the vectors to the component. All those vertical surfaces are looking in different directions. You just needed to read vhoang's reply carefully.\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/KvRTshp0Kc5sMdz9RWPKU2qbWGJWqZYYYpjC-10Rw5tlPr3SmX4-yO6-lheUF3Sdv8gZTRy9yJaX0ZDUEY0oHY9hQMWw67z7/test_surfaces.png?width=721\" width=\"721\"/>](http://api.ning.com:80/files/KvRTshp0Kc5sMdz9RWPKU2qbWGJWqZYYYpjC-10Rw5tlPr3SmX4-yO6-lheUF3Sdv8gZTRy9yJaX0ZDUEY0oHY9hQMWw67z7/test_surfaces.png)\n\nRegardless, search the forum for radiance stochastic and you will get [these results](http://www.grasshopper3d.com/group/ladybug/forum/topic/search?groupId=2985220%3AGroup%3A658987&amp;q=radiance+stochastic) about how radiance works. Again in your case you're making a mistake by not connecting the vectors but regardless you can get slightly different results from radiance for each run, specially when radiance parameters are set to a low quality.\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "March 30, 2017 at 5:57am", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nHllo\n\n\n\nfirst of all thank you to the both of you..\n\nI read carefully both answer but I'm not sure i'm understanding your answers.. \n\nI made so many different surfaces because I wanted to analyse the solar availability on each orientation.\n\nBut to make thinks (hopefuly! :-) ) clearer, I attach a simplified version of my analysis using the same one surface to run the three different cases. I assume that the direction of the surface is now the same, still results are different. The top case in rhino correspond to the top case in the GH canvas, the lower in Rhino to the lower in GH..\n\n\n\nI expected a difference in each run.. but the cases differ of 100% not 10% that would be reasonable.. \n\n\n\nCase 1   158 W/m2 for the \"only test point\" option\n\nCase 2   314 W/m2 for the \"test point + pts Vectors\" case\n\nCase 3   282 W/m2 for the ladybug option\n\n\n\nThe analysis is made the day 1 , hour 12h  and the the solar radiation condition are:\n\nDirect 125 W/m2\n\nDiffuse  164 W/m2\n\nGlobal Horiz 207 W/m2\n\n\n\nThe interesting thing is that the three cases made for the orizontal surface give the same results.    ** **\n\nmoreover if the materials reflectance is changed to 1, the results are very similar but the values are higher than the sum of direct + diffuse as for case 2\n\n**125+164 = 289   results give 314 **\n\n\n\n(diffuse radiation is obviously calculated on horizontal surface in the weather file and the surface analysis is vertical so the percentage of diffuse radiation that the surface will receive will be even less).\n\n\n\nHope that I've been clearer and sorry if you already have answered my question, but I'm not understanding the results. (i'm not a GH pro-user but I'm quite familiar with analysis and these stuff)\n\n\n\nThank you again\n\nfilippo\n\n\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1724004", "name": "Comparison_simplified.3dm"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1724005", "name": "Comparison_simplified.gh"}], "created_by_name": "Filippo", "created_at": "March 30, 2017 at 7:46am", "created_by": "Filippo430", "replies": []}]}]}