{"body": "\nA question about setting up the proper controls for conducting a night flush sequence during the summer. I recognize that the Honeybee_Set EP Airflow component allows me to set the maxOutdoorTemp and maxIndoorTemp for natural ventilation but it seems using these controls does not produce a logical sequence to determine when to flush.\n\nFor example, just using the maxOutdoorTemp, if I set it to 33C (studied comfort threshold for Indian populations), the flush sequence will not start until outdoor temp drops below 33C even if outdoor temp is significantly lower than indoor. I am seeing this occur in the late-night and early hours of the day when indoor temps rise above 33C from daily heat gains. The indoor temp may be around 37C and outdoor temp can be 34C, yet no cooling will occur since outdoor has not dropped below 33C yet. The zone remains in a closed state until the outdoor temp drops below 33C which may occur at 4am, which leads to minimal flush hours. \n\nWhat I desire is the ability to write a sequence/conditional statement that will operate the ventilation based on the indoor-outdoor temperature difference. If outdoor temperature is ever lower than indoor in the cooling season, night flush should ensue. \n\nIs there currently a way to create this type of logic diagram?\n", "attachments": [], "created_by_name": "Kit Elsworth", "created_at": "April 2, 2017 at 1:25pm", "created_by": "KitElsworth", "topic": "Honeybee Night Flush", "replies": [{"body": "\nTo illuminate this issue more, I plotted the outdoor and indoor temp in excel and annotated the graph below. The time frame is nine days in the summer. \n\nThe brown line represents the indoor temperature when the 33C maxOutdoorTemp is used. It is obvious that the nightflush does not start in the evening until outdoor temperature drops below 33C, even when indoor is above 37C. However, in the morning, it is not clear to me why the zone does not always reach a closed state when outdoor temperature exceeds 33C. Instead, it looks like it occurs around 35C. \n\nI see that these conditions are not persistent so perhaps some clues to why these few instances stand out would be helpful. \n\n\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/dszxoG-AMGmjOTO4QGEVbcogyLFvjIwJ58sqbDO4uD277aTKl0pGAn-R7XwywMYjplkTBP6ZZcuBZDvAtY2cuzqs6LyPmFPH/Honeybeeerror.PNG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/dszxoG-AMGmjOTO4QGEVbcogyLFvjIwJ58sqbDO4uD277aTKl0pGAn-R7XwywMYjplkTBP6ZZcuBZDvAtY2cuzqs6LyPmFPH/Honeybeeerror.PNG)\n", "attachments": [], "created_by_name": "Kit Elsworth", "created_at": "April 3, 2017 at 8:51am", "created_by": "KitElsworth", "replies": [{"body": "\nHi Kit,\n\n\n\nThis is a very good question. I realized that there is an E+ input that allows you to make the exact control strategy that you have specified here, which I forgot to expose on the EPAirflow component.  If you need the result right now, you can get it by editing this input in the IDF file that Honeybee writes:\n\n\n\n[http://bigladdersoftware.com/epx/docs/8-5/input-output-reference/gr...](http://bigladdersoftware.com/epx/docs/8-5/input-output-reference/group-airflow.html#field-delta-temperature)\n\n... And then use the rerunIDF component to run the simulation with your new IDF.\n\n\n\nI'll try to expose this DeltaTemperature input shortly and post back here once it's added to the github.\n\n\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "April 7, 2017 at 7:24am", "created_by": "ChrisMackey", "replies": []}, {"body": "\nThanks for the reply, Chris. I've been able to get back into the model and try out some IDF editing. However, it seems that there are some errors in re-running the IDF within grasshopper. See below for the error message I get from the HB component as well as my ZoneVentilation:DesignFlowRate parameters I used to set the nightflush using the deltaT approach. \n\n\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/KKxcsif2Kp13Vo-2-hXj9cbU92HCfRGRP2DhLADtQmTKj999GEXRkdpBxYZQPk1FQ7WgoJX7sT6rakHNCy*GeXgzC0oS6Hd9/rerunIDF_error.png?width=721\" width=\"721\"/>](http://api.ning.com:80/files/KKxcsif2Kp13Vo-2-hXj9cbU92HCfRGRP2DhLADtQmTKj999GEXRkdpBxYZQPk1FQ7WgoJX7sT6rakHNCy*GeXgzC0oS6Hd9/rerunIDF_error.png)\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/KKxcsif2Kp16ByTwNoEBVV4Lw4sd-eZM5xw5gecKxpohlV778a1TJkUUq*pUXqLylA9c5oDhvC4dMaAkDG--pWCX4rFiguIq/IDFparameters.PNG\" width=\"704\"/>](http://api.ning.com:80/files/KKxcsif2Kp16ByTwNoEBVV4Lw4sd-eZM5xw5gecKxpohlV778a1TJkUUq*pUXqLylA9c5oDhvC4dMaAkDG--pWCX4rFiguIq/IDFparameters.PNG)\n\n\n", "attachments": [], "created_by_name": "Kit Elsworth", "created_at": "April 25, 2017 at 9:51am", "created_by": "KitElsworth", "replies": []}, {"body": "\nKit,\n\nIt looks like the file address to your weather file is not correct.  Everything with the deltaT variable seems good.  I think I've finally gotten a bit of time to add this in and I'll try to do it now.  It it proves to be an issue that's solveable in a couple of hours, you should have it soon.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "April 25, 2017 at 3:12pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nKit,\n\nDeltaTemperature is now a part of Honeybee:\n\n[https://github.com/mostaphaRoudsari/honeybee/commit/89d0b94c338f395...](https://github.com/mostaphaRoudsari/honeybee/commit/89d0b94c338f3959360079de552cd20cd230245d)\n\nSee attached for a file that shuts off natural ventilation any time the outdoor temperature gets above the indoor temperature.\n\n-Chris\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1739839", "name": "deltaTemperature.gh"}], "created_by_name": "Chris Mackey", "created_at": "April 25, 2017 at 5:00pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nAwsome Chris! This can really help with this component, especially in climates like the one I am in where diurnal variations are not really a thing.\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "April 26, 2017 at 5:21pm", "created_by": "TheodorosGalanos", "replies": []}]}]}