{"body": "\nHello everyone;\n\nI am trying to run a radiation and daylight analysis but I can't run it and it gets a null result. I have searched a lot about this problem but I didn't find a proper solution. Can anyone help me to get rid of this problem?\n\nI have attached my algorithm here. I hope I can correct it.\n\nRegards\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1727589", "name": "960116.gh"}], "created_by_name": "leila pasandi", "created_at": "April 5, 2017 at 1:16am", "created_by": "leilapasandi", "topic": "Null Radiation and Daylight Analysis", "replies": [{"body": "\nI dont see the honeybee_honeybee and ladybug_ladybug component in your file. Try to put those in and see what happens with it. If it still doesnt work, would you mind uploading your rhino files as well?\n\n\n", "attachments": [], "created_by_name": "Willy Tsui", "created_at": "April 5, 2017 at 2:02am", "created_by": "WillyTsui", "replies": [{"body": "\nhi Willy\n\nI had put honeybee-honeybee and ladybug-ladybug but I think for uploading my files I have deleted them.. but it still has the same problem.. \n\nI have attached my rhino file too. I will be happy if you can fix it.\n\ntnx\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1727509", "name": "960116.rar"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1727810", "name": "960116.gh"}], "created_by_name": "leila pasandi", "created_at": "April 5, 2017 at 2:31am", "created_by": "leilapasandi", "replies": []}]}, {"body": "\n- For the radiation analysis, you don't have any HBObjects connected.\n\n- For the annual daylight analysis, your weather file input is Null right now. You are giving the file path to OpenEPW component and then later pass to analysisRecipe, that's not correct. You have to connect directly the directory of your weather file to analysisRecipe component.\n\n\n\nAdditional note, check your analysis vectors, they are all facing downward, is that what you want to simulate?  \n", "attachments": [], "created_by_name": "vhoang", "created_at": "April 5, 2017 at 3:39am", "created_by": "vhoang", "replies": [{"body": "\nHi vhoang;<br/>I didn't understand your solution. you said \"You have to connect directly the directory of your weather file to analysisRecipe component\". Can you please send me an example or correct my algorithm? I will appreciate it. :)<br/>By the way you said that my vectors are downward! what do you mean? My goal is to analyze the radiation and daylight autonomy throughout the school year(9 months) to see how much radiation my classroom is getting. and also for DA I want to analyze how many percentage of my classroom is getting 300 lux of daylight in average.<br/>This is what I understand from honeybee and if there is something wrong with my algorithm please tell me that :)<br/>Best\n", "attachments": [], "created_by_name": "leila pasandi", "created_at": "April 5, 2017 at 4:30am", "created_by": "leilapasandi", "replies": []}, {"body": "\nSomething like this.\n\n\n\nIf you look at the ptsVectors output from HB Gen Test Points component, your analysis vectors/direction are looking downward, which should not be the case when you want to study daylight ON the floor, meaning the vectors should be pointing up.    \n\n\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/YduLzJ9K5AysTtSTJK69x*iSsUx6elOqPf28Mqik91TPDOwNBmsb--OnZFy*3hkzFtsctlsN8C8*LVQVUFegoiWfTnFXm2sR/Unbenannt.PNG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/YduLzJ9K5AysTtSTJK69x*iSsUx6elOqPf28Mqik91TPDOwNBmsb--OnZFy*3hkzFtsctlsN8C8*LVQVUFegoiWfTnFXm2sR/Unbenannt.PNG)\n", "attachments": [], "created_by_name": "vhoang", "created_at": "April 6, 2017 at 4:53am", "created_by": "vhoang", "replies": []}]}]}