{"body": "\nHi!\n\n\n\nI am running a basic test for a shading scheme with advanced shading control:\n\ninterior sensor: on the floor next to the glass (highlighted below)\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/MIhWJtLxwsETK-rKNHFq4I50KINk7bE1Hx3-mm6kxA5wOw0am5vvkIXRk6*LyOZ*mQ5hASKvoOlLI46DKnYg2as9orfUsgCL/Capture.JPG?width=750\" width=\"750\"/>](http://api.ning.com:80/files/MIhWJtLxwsETK-rKNHFq4I50KINk7bE1Hx3-mm6kxA5wOw0am5vvkIXRk6*LyOZ*mQ5hASKvoOlLI46DKnYg2as9orfUsgCL/Capture.JPG)\n\nShading Group 1 State 1: curtains pulled at the corner, solid surface, reflectance 0.18, when there is NO direct sunlight on the sensor (illuminance&lt;10000 lux).\n\nShading Group 1 State 2: curtains along the glass, trans surface, transmittance 0.2, when there is direct sunlight on the sensor (illuminance&gt;=10000 lux).\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/MIhWJtLxwsGaH43GER-n7s9Ha8gAl6vQDRUaYXethnls81JxHjhUX1I*zHXcaz6yh7OFLlRrweB9Yd3T3yj1cqBQpPsUYNwy/Capture.JPG?width=750\" width=\"750\"/>](http://api.ning.com:80/files/MIhWJtLxwsGaH43GER-n7s9Ha8gAl6vQDRUaYXethnls81JxHjhUX1I*zHXcaz6yh7OFLlRrweB9Yd3T3yj1cqBQpPsUYNwy/Capture.JPG)\n\nAfter the run I checked the ill files in the folder and the shading schedule in the intgain.csv file and found some inconsistency, taking Jan 1st as an example\n\nIn the intgain.csv, the shading schedule shows the curtain only covers the glass (state 2) at 9.5,11.5,13.5. \n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/MIhWJtLxwsECRCI*cTZv7StfSGyCSNm0sUnQNpZ-QmgRTyxu4PXfwaolaFo*OyTNsLOZw-fZqSGdb9RHEsOkd4T-OJZHIUKH/Capture.JPG\" width=\"547\"/>](http://api.ning.com:80/files/MIhWJtLxwsECRCI*cTZv7StfSGyCSNm0sUnQNpZ-QmgRTyxu4PXfwaolaFo*OyTNsLOZw-fZqSGdb9RHEsOkd4T-OJZHIUKH/Capture.JPG)\n\n\n\nBut in the ILL file with no dynamic shading, the sensor point (first column after hour) illuminance is above 10000 lux from 10 to 15. **So the shading schedule should be 1 from 9.5 to 14.5, right? Or am I missing something here?**\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/MIhWJtLxwsF8Vml1PPfSXVVVZ6nVpKNtNC*vHZMgX28T016ovDhsThNAMVa4zOvjjCtjGfc-W8GLpj48CI6Co6jD7HdmymIv/Capture.JPG\" width=\"312\"/>](http://api.ning.com:80/files/MIhWJtLxwsF8Vml1PPfSXVVVZ6nVpKNtNC*vHZMgX28T016ovDhsThNAMVa4zOvjjCtjGfc-W8GLpj48CI6Co6jD7HdmymIv/Capture.JPG) \n\nI'm trying to get the lux hours/accumulated illuminance for the test point, but there is no ILL file that actually combined the ill, state-1 ill, and state-2 ill together based on the shading schedule? (My understanding is the \"read annual result I\" visualizes the Daylight Autonomy based on the advanced shading schedule but didn't generate another ill file?)\n\nI was doing it in Excel and found the difference between shading schedule and the sensor reading. Please let me know if I made any mistakes in the simulation setting! Any comments on a better data processing method would be much appreciated!\n\n\n\nBest,\n\nXF\n\n\n", "attachments": [], "created_by_name": "XF", "created_at": "April 6, 2017 at 6:37pm", "created_by": "XF", "topic": "Question about Annual Simulation with Advanced Dynamic Shading", "replies": [{"body": "\nTwo quick comments:\n\n1. What are the illuminance value for the first state of the shading [0.5]?\n\n2. Keep in mind that Daysim is using a light switch model that tries to consider human behavior and lighting controls as well as illuminance values. Make sure you're setting up the desired shadingControl.\n\n[http://daysim.ning.com/page/daysim-shading-control-modes](http://daysim.ning.com/page/daysim-shading-control-modes)\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "April 7, 2017 at 6:05am", "created_by": "MostaphaSadeghipour", "replies": [{"body": "\nHi Mostapha,\n\n\n\nThanks for your help!\n\n\n\n1. Since State 1 (curtain was pulled over at the corner) always exists unless the curtain is in State 2 (covering the glass), the illuminance value for State 1 is  min 0 lux, max 1 lux; the illuminance value for State 2 is min 9999 lux max 10000 lux.\n\n2. Please correct me if I were wrong, I set up a Thermal Control with 1 interior sensor, and I didn't set any lighting groups in the model. But to your point: I sometimes found lighting group control data in intgain.csv although I didn't set anything. I thought only the manual control will trigger the Light Switch Model in Daysim?\n\n\n\nThanks!\n\nBest,\n\nXF\n\n\n", "attachments": [], "created_by_name": "XF", "created_at": "April 7, 2017 at 9:08am", "created_by": "XF", "replies": []}, {"body": "\n2.1. If you don't assign the control honeybee will assign a default one for you. Hover over the input to be able to read the default assumptions.\n\n2.2. Based on the [source code](https://github.com/MITSustainableDesignLab/Daysim/blob/combined/src/daysim/ds_el_lighting.c#L234) it does it regardless of control mode and based on user behavior (active vs passive).\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "April 10, 2017 at 7:08am", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nHi Mostapha,\n\n\n\nThanks! To 2.1: yes I noticed that if I don't assign any min/max Illuminance for DSShadingState, the shade will be the manually controlled. Other than that and glare control recipe, I didn't find any other input to specify the control mode. Please let me know if I'm missing something here. \n\nOver the weekend I tried different settings of min/max illuminance, and found something wrong with my setting:\n\nIdeally State 1 is only in use between 1-9999 lux and State 2 is only in use when it's above 10000 lux (on the sensor point). However in the component, the min illuminance is for the blind to open, and max illuminance is for the blind to close.\n\nIf I set State 1 (min 0 max 1), State 1 will be in use when it's above 1 lux; Then I set State 2 (min 9999 max 10000), State 2 will be in use when it's above 10000 lux; Then from the inter gain csv file, I found State 2 stays even after the illuminance dropped back to less than 9999 lux. \n\nBased on the [daysim example](http://daysim.ning.com/page/daysim-shading-control-modes), State 2 should go back to State 1 when the sensor illuminance drops below the min illuminance set. Am I doing something wrong that led to this error?\n\n\n\nThanks so much!\n\nBest,\n\nXF\n", "attachments": [], "created_by_name": "XF", "created_at": "April 10, 2017 at 1:12pm", "created_by": "XF", "replies": []}]}]}