{"body": "\nHi!\n\n\n\nI'm having a bit of trouble figuring out the right approach for something.. \n\nI'd like to model a wall which has pipes embedded in the walls acting as heat exchangers throughout the day. I'd like to optimize the size of pipe, number of pipes, location etc etc using software like Therm which outputes a heat map.\n\n\n\nThing is, I'm having difficulty linking this up to Galapagos/Octopus since each run of analysis requires you to open up Therm Seperately, run an analysis and re-import it into GH. \n\n\n\n... Any Suggestions how to go about this? Is there a way to perform the analysis entire through grasshopper so it can be easily linked to Galapagos etc.?\n\n\n\nthanks!\n", "attachments": [], "created_by_name": "Chris bc", "created_at": "April 10, 2017 at 2:03pm", "created_by": "Chrisbc", "topic": "Thermal Wall Optimization", "replies": [{"body": "\nHi Chris,\n\nExcellent question.  We have historically not been able to run THERM directly from Grasshopper because the Command Line Interface (CLI) version of THERM has not been free.  However, the wonderful scientists at LBNL have changed this policy with the release of [THERM 7.5](https://windows.lbl.gov/software/therm/7/index_7_5_9.html) and it seems they are gradually working towards an eventual open source version of the software.\n\nI have had the implementation of the THERM CLI in Honeybee [on my agenda for a few months now](https://github.com/mostaphaRoudsari/honeybee/issues/618) and you have given me a good reason to get it done.  I will try to implement this soon and I will post back here once it is ready.  Once this is in place, you will be able to parametrically generate THERM files and automatically run them through THERM to get the results.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "April 11, 2017 at 9:26pm", "created_by": "ChrisMackey", "replies": [{"body": "\nHi! Oh that\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1731963", "name": "121.png"}], "created_by_name": "Chris bc", "created_at": "April 12, 2017 at 5:24am", "created_by": "Chrisbc", "replies": []}, {"body": "\nChris,\n\nI am not sure what your response is referring to.  Was my response clear and could you elaborate?\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "April 12, 2017 at 4:15pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nhi! sorry really did not notice this reply until now!\n\nI had send this reply via my mobile - apparently it didn't send properly. The gist was that it would be a great idea to implement THERM in honeybee because referencing and importing 100 results into grasshopper was becoming a pain. The screenshot was showing\n", "attachments": [], "created_by_name": "Chris bc", "created_at": "April 23, 2017 at 1:20am", "created_by": "Chrisbc", "replies": []}, {"body": "\nChris BC,\n\nI just finished implementing THERM Command Line Interface so that you can now run THERM simulations directly from Grasshopper without the need to open files in the THERM interface.  Now, the running of 100 THERM models should be much easier.  I updated the example file here to show how to do it:\n\n[http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;for...](http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;fork=hydra_2&amp;id=THERM_Export_Workflow&amp;slide=0&amp;scale=1&amp;offset=0,0)\n\nCheers,\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "May 14, 2017 at 1:12pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nThis is great Chris!!\n\nThanks,\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "May 14, 2017 at 9:02pm", "created_by": "AbrahamYezioro", "replies": []}]}, {"body": "\nI wonder is there a standard way to draw this for a Therm study, to include the pipes covering different  areas of the wall?\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "April 12, 2017 at 9:56pm", "created_by": "TheodorosGalanos", "replies": []}], "id": "1730805"}