{"body": "\nHi, I am gettting an error with the following: \n\n\n\nFOAM FATAL IO ERROR: <br/>Cannot find patchField entry for boundingbox\n\n\n\na model of underground parking lot space with an inlet on a side, and multiple wind towers on the top, and a large round outlet. The model is in meters.\n\n\n\nPlease comment, thank you.\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1734130", "name": "underground_CFD_skylight.3dm"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1734131", "name": "02_0_indoor_airflow_SAB_YJ.gh"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1734132", "name": "butterfly error.txt"}], "created_by_name": "Youngjae chung", "created_at": "April 16, 2017 at 11:17am", "created_by": "YOUNGJAECHUNG", "topic": "buttterfly indoor 3d analysis error", "replies": [{"body": "\nHi Youngjae,\n\nWhenever you see this error it means that means that the snappyHexMesh is touching the boundingbox that is created by butterfly. There are usually two reasons for this to happen:\n\n1. The locationInMesh is outside the case, and the mesh is created in the wrong place. Use ParaView (if the mesh is large) or loadMesh to visualize the mesh.\n\n2. The case is not a close geometry and the mesh is created for the whole boundingbox. Again visualizing the mesh should show the issue.\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "April 17, 2017 at 6:35am", "created_by": "MostaphaSadeghipour", "replies": [{"body": "\nI echo mostapha's comment and this has definitely to do with your mesh. The boundingbox patch is the artificial box Butterfly is adding around your geometry as a background mesh.\n\n\n\nIf you location is **inside** the room and the geometry is closed then the boundingbox should not remain in your patches (or be there with 0 faces which would not be an issue). So you should check either of those things. Visualizing the mesh will let you know where things were bad, most of the times.\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "April 18, 2017 at 3:38am", "created_by": "TheodorosGalanos", "replies": []}]}]}