{"body": "\nHey All,\n\n\n\nI am trying to run a ray tracing off a geometry that has reflective ( a mirror base - red) and non reflective parts (opaque sticks - black) as in the photo. I tried assigning honeybee materials to them but the component still seems to be reflecting the rays off all of the surfaces.\n\n\n\nIs there another component i could use to get the visualization of the ray lines? \n\nThank you\n\n\n\nGabriella\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1736784", "name": "HB.png"}], "created_by_name": "Gabriella Rossi", "created_at": "April 21, 2017 at 4:49am", "created_by": "GabriellaRossi", "topic": "Differential Material RayTracing", "replies": [{"body": "\nLadybug components calculate raytracing based on geometrical calculations and doesn't consider materials. If I understand what you're trying to achieve correctly you should use bounce from surfaces component and connect the black surfaces to context.\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "April 21, 2017 at 7:57am", "created_by": "MostaphaSadeghipour", "replies": [{"body": "\nHey Mostapha, \n\n so i tried the component you suggested, it still gives me some pretty wierd results, whether i use the HBsurface component with it or not. I am attaching the gh file if you could please have a look at it\n\n\n\nThank you\n\nGabriella\n\n\n", "attachments": [], "created_by_name": "Gabriella Rossi", "created_at": "April 21, 2017 at 9:39am", "created_by": "GabriellaRossi", "replies": []}, {"body": "\nhere is the file\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1737037", "name": "raytracing problem.gh"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1737038", "name": "HB.png"}], "created_by_name": "Gabriella Rossi", "created_at": "April 21, 2017 at 9:41am", "created_by": "GabriellaRossi", "replies": []}]}, {"body": "\nWhat is the end goal here? The way rays will behave after hitting an object is essentially a function of surface properties of the materials and the spectral composition of the source radiation. As Mostapha mentioned, Ladybug raytracing is based on geometric calculations.\n\nSo, any raytracing results that you are achieving are likely to only be compatible with a very small subset of materials that we find in Construction. Lambertian surfaces, that are far more common in real world, tend to scatter light diffusely instead of casting sharp rays.\n", "attachments": [], "created_by_name": "Sarith Subramaniam", "created_at": "April 21, 2017 at 10:55am", "created_by": "sarith", "replies": [{"body": "\nHello Sarith,\n\n\n\nI understand that the Raytracing component is geometrical and just calculates the ray based on incidence angle = reflection angle rule. And that's why Mostapha suggested using the Bounce components since i am able to differentiate which is the reflective specular surface and which is the opaque surface that i do not want to reflect the light ray. However that does not seem to work. My end goal is visualizing which rays (at different times) are going to be reflected by the mirror surface, and which are going to be blocked from reaching the mirror thanks to the opaque sticks. \n\nThat doesnt seem to happen, all rays look like they are reflected and a wierd wiggle happens where the ray is broken but it doesnt touch any of the surfaces. please check my attachements in the previous reply\n\n(and yes i understand that in reality there are no sharp rays and that this is just a geometric modelisation of a physical reality....but that is not the point here)\n\n\n\nThank you for your time\n\nGabriella\n", "attachments": [], "created_by_name": "Gabriella Rossi", "created_at": "April 21, 2017 at 11:18am", "created_by": "GabriellaRossi", "replies": []}, {"body": "\nI opened the file and have to say that don't understand the model (geometry). What are the units? I work in meters and the model is extremely small. Also the point are located somewhere in the space, away from the geometry. The context is just a plane.\n\nIn short, hard to help here ...\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "April 22, 2017 at 9:53am", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nmy bad if i stripped down the geometry to the necessary minimum, so not to upload GBs of useless geometry. In short, the plane is a floor which i am interested to see the light ray hit after bouncing off the reflector geometry. And no the context is not ONLY the plan, but also the sticks that are masking the reflective surface. Working in meters is fine\n\n \n\nThe problem appears when you zoom in o the reflector geometry, the rays behave really weird (as in the photo), and bounce off also the opaque sticks even though they are specified as opaque material.\n\nGabriella\n", "attachments": [], "created_by_name": "Gabriella Rossi", "created_at": "April 24, 2017 at 7:28am", "created_by": "GabriellaRossi", "replies": []}, {"body": "\nThe bounce component doesn't take into account the material definition. As Mostapha said, LB doesn't count for materials properties. Your input oh HB materials is useless for that matter (you can disconnect them). The component shows, i will say, the \"potential\" of reflecting vectors (sun rays in this case).\n\nIf you want me (or others) to take a look at the example, please upload again with the right size.\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "April 24, 2017 at 8:10am", "created_by": "AbrahamYezioro", "replies": []}]}], "id": "1736785"}