{"body": "", "attachments": [], "created_by_name": "Octagon26", "created_at": "May 2, 2017 at 4:01pm", "created_by": "Octagon26", "topic": "Can i get RADIANCE R,G,B results from a Honeybee_Annual Daylight Simulation?", "replies": [{"body": "\nMy discussion comment seems to have gotten erased when i posted (leaving only the title), so here it is again.\n\n\n\nI am trying to get the R,G,B channel data from an annual simulation. It seems to only preserve the illuminance results (in the .ill file).\n\n\n\nI am trying to get the R,G,B result on an hourly basis over the year. But there seems to be no .res file generated if the annual daylight simulation recipe is used.\n\n\n\nAny suggestions or ideas for how to get the R,G,B result for each point over all 8760 hours of the year?\n\n\n\nIs this possible with Honeybee components, or even DAYSIM?\n\n\n\nAny suggestions would be appreciated !!!\n", "attachments": [], "created_by_name": "Octagon26", "created_at": "May 2, 2017 at 4:05pm", "created_by": "Octagon26", "replies": [{"body": "\nHoneybee uses Daysim for annual simulations. Spectral information isn't considered in Daysim-based simulations: [http://daysim.ning.com/subprogram/radfiles2daysim](http://daysim.ning.com/subprogram/radfiles2daysim) . You can derive RGB values by running simulations with Radiance directly.\n\nThe sky and sun models used in conventional daylighting simulations are based on luminance (brightness) alone. So, any values that you do derive for RGB channels will still be limited in accuracy.\n", "attachments": [], "created_by_name": "Sarith Subramaniam", "created_at": "May 2, 2017 at 5:52pm", "created_by": "sarith", "replies": []}, {"body": "\nSarith,\n\nIt would quite cool to be able to get RGB values out of Daylight simulations in LB Tools. Is this something that could be possible in HB+? Or is it something very difficult to achieve within LB Tools?\n\n\n\nThis would make my ML studies interesting :)\n\n\n\nP.S.: An external Radiance script could work but if there isn't much hassle getting this information then I think not going outside HB is better.\n\n\n\nKind regards,\n\nTheodore.\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "May 3, 2017 at 12:05am", "created_by": "TheodorosGalanos", "replies": []}, {"body": "\nHi Theodore,\n\n\n\nYes, it is possible in HB[+]. We take the three channel (RGB) irradiance results and convert it into illuminance ([example](https://github.com/ladybug-tools/honeybee/blob/master/scripts/TwoPhaseIllum.py#L80-L86)) as per the [Photopic curve](https://en.wikipedia.org/wiki/Photopic_vision). So, if we were to not combine the results, we'll end up with RGB values.\n\nHowever, as I mentioned before, CIE skies and Perez skies are geared towards brightness and not spectral calculations. So, such a simulation is unlikely to be physically relevant. A case in point is during twilight, when daylight has a warmer hue. The spectral nature of this sun and sky is not captured in daylighting simulations.\n", "attachments": [], "created_by_name": "Sarith Subramaniam", "created_at": "May 3, 2017 at 11:34am", "created_by": "sarith", "replies": []}]}], "id": "1744290"}