{"body": "\nI'm currently working on a model where we're looking at the use of natural ventilation.\n\n\n\nI'm getting simultaneous heating and vent happening, which is driving heating demand up. I've played with the set point parameters and have concluded that I'm  doing something wrong on the set points... \n\n\n\nThe heating is set to 18C, the natural vent controls are as per the image in the PDF attached.\n\n\n\nThe second image in the PDF is form the ESO file, where we can see the internal temp rising and then the heating kicking in...as the windows open in winter (this is for Canberra, Australia, hence the June date).\n\n\n\nI've played with the lower limit on natural vent, but this doesn't resolve the issue. \n\n\n\nAny pointers, much appreciated.\n\n\n\nErik\n\n\n\n\n\n\n\n\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1744329", "name": "Document1.pdf"}], "created_by_name": "erik moore", "created_at": "May 2, 2017 at 5:09am", "created_by": "erikmoore307", "topic": "Natural Ventilation Simultaneous Vent and Heating", "replies": [{"body": "\nHi Erik,\n\nEverything looks correct with the natural ventilation component so I would assume that the issue is happening for other reasons.  3 degrees between your heating and your nat vent set points should be sufficient to avoid simultaneous heating and ventilation in most cases that I have run but perhaps there's something special about your case.\n\nI can't understand why the temperature is suddenly rising in the afternoon.  Is this a west-facing facade and is the sun suddenly streaming in?\n\nIf you can upload a gh file with the minimum needed to show the issue, I can take a look.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "May 2, 2017 at 5:51pm", "created_by": "ChrisMackey", "replies": [{"body": "\nSweet. It is indeed a north west facing facade that those results are for. I've appended the file for information. let me know if you spot anything? I appreciate the input!\n\n\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1744736", "name": "170428_CP_A10_U-Value_error testing.GH"}], "created_by_name": "erik moore", "created_at": "May 2, 2017 at 10:17pm", "created_by": "erikmoore307", "replies": []}, {"body": "\nErik,\n\nI was able to recreate the situation that you are talking about:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/fA3fM7bX7uJGLd0bbHHL2-6f101uJLmMx2TXGEzAWaUnAlx2aPyFyfLrzR1xgWuuMJRyuGIOuAq-WX-vgjqOfJGB9eOfIjuY/SimultaneousVentAndHeating.JPG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/fA3fM7bX7uJGLd0bbHHL2-6f101uJLmMx2TXGEzAWaUnAlx2aPyFyfLrzR1xgWuuMJRyuGIOuAq-WX-vgjqOfJGB9eOfIjuY/SimultaneousVentAndHeating.JPG)\n\nThe reason for this is that your zone volume is very small (3x3 meter cube) in comparison to the operable area of your window (~1.1 square meters).  So, when you open the 1.1 square meter operable area in the middle of winter, the zone cools down so fast that you instantly shut the windows in the next timestep and start heating.  In other words, you simulation does not have simultaneity heating and ventilation but it is unstable to the point that it is opening/closing the window every 10 minutes and turning the heating system on/off every 10 minutes.\n\n\n\nThere are a number of different ways to fix this:\n\n1) You can still have the windows open in winter but you use an openingAreaFractionalSched_ to ensure that the windows only open a small crack in the winter months so that you don't overcool the zone.  So you could make a CSV schedule that has a 1 value for all summer months but maybe only a 0.25 for all winter months.\n\n2) Alternatively, you can add in a minOutdoorTempForNatVent_ that ensures that natural ventilation never happens when the outdoor temperature is very low.  Typically, occupants will not open windows when outdoor temperatures are below 12 C and plugging in 12 to this input might help.  I would say that you could go up to a 15C  minOutdoorTempForNatVent_, given that your climate is fairly warm.\n\n3) You could increase the timestep of your simulation so that the windows are only opening for 4 or 5 minutes instead of 10 (on the Energy Simulation Par component).  While this might fix the issue, it's probably not realistically how a building would behave in real life.\n\n3) You could reduce the operable area of your window.  As I suggested earlier, it's a bit oversized for such a small zone.  Alternatively, if your zone were deeper, the operable area would be more reasonable in relation to the zone volume.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "May 6, 2017 at 5:08am", "created_by": "ChrisMackey", "replies": []}, {"body": "\nAwesome, thanks Chris.  Yes, the spaces are rather small student accommodation rooms.\n\nI'll have a play with scheduling the areas and/or discharge coeff to better represent some modulation in cold weather operation as playing with the other parameters results in over-heating.  Thanks for taking the time to also have a look! Much apreciated.\n\nErik\n", "attachments": [], "created_by_name": "erik moore", "created_at": "May 7, 2017 at 4:32pm", "created_by": "erikmoore307", "replies": []}]}], "id": "1744330"}