{"body": "\nHi\n\n\n\nFor many years now Radiance's text based system has permitted 'sets' of materials to be created which have a similar base definition but might be modified slightly differently - perhaps due to their placement in the building.\n\n\n\nI have created a radiance material file in the Ladybug directory with a bunch of material definitions. I note that any the have alias in them cause the Honeybee \"Fly\" component to have conniptions...\n\n\n\nI am guessing we need to think through how these base definitions might be subsequently modified by another GH module?\n\n\n\nIs there any guidance somewhere on this?\n\n\n\nm \n", "attachments": [], "created_by_name": "Michael Donn", "created_at": "May 2, 2017 at 6:51am", "created_by": "MichaelDonn", "topic": "Radiance definitions using 'alias' and 'inherit'", "replies": [{"body": "\nHi Michael,\n\n\n\nThis issue is related to parsing Radiance materials from strings. Inside the [Honeybee source-code](https://github.com/mostaphaRoudsari/honeybee/blob/master/src/Honeybee_Honeybee.py), parsing of Radiance materials from strings is done by the functions called [createRadMaterialFromString](https://github.com/mostaphaRoudsari/honeybee/blob/master/src/Honeybee_Honeybee.py#L1011-L1042) and [analyseRadMaterials.](https://github.com/mostaphaRoudsari/honeybee/blob/master/src/Honeybee_Honeybee.py#L912-L972) The parsing logic within these functions is only compatible with the basic Radiance primitive format documented in page 4 of the [Radiance File Formats](http://radsite.lbl.gov/radiance/refer/filefmts.pdf).\n\n**modifier type identifier**\n\n**n S1 S2 S3 ..Sn**\n\n**0**\n\n**m R1 R2 R3 ..Rm**\n\n\n\nAliases, which are mentioned in Page 5 of the same document, are not implemented in Honeybee. In the Grasshopper scheme of things, it is easier to implement a simple script that swaps out the name of the original (stored) material with the name of material in the scene.\n", "attachments": [], "created_by_name": "Sarith Subramaniam", "created_at": "May 3, 2017 at 7:43pm", "created_by": "sarith", "replies": []}], "id": "1744249"}