{"body": "\nHi Ladybug team,\n\nI ran into this problem where the MicroclimateMap component returns a 'terminated by user' error when trying to calculate UTCI for a day. I searched the forum and found that the problem has been around for some time. Has anyone found a solution to this?\n\nI attach the gh definition below and the E+ results in.csv file to save time as the simulation can take 20 mins.\n\n\n\nAnd a slightly off-topic question: is it possible to create another MicroclimateMap component that is fed surface temps and radiation data from honeybee and all the other parameters from Envi-met? This hybrid approach could help generate more spatially detailed results.\n\n\n\nAll the best\n\nAris\n\n\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1748081", "name": "courtyard_EPLUS_internalised.gh"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1748082", "name": "in.csv"}], "created_by_name": "Aris V", "created_at": "May 9, 2017 at 1:57am", "created_by": "ArisVartholomaios", "topic": "MicroclimateMap termination error", "replies": [{"body": "\nAris,\n\nYour file is running perfectly fine on my machine (although it takes a good half-hour to run all of the way through).\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/qwRdyPROLy3gdMYMpBI*HnNUPnkhLl9XynMMM5Y8vY*UV5zkz*6dfbMVFFFB*cXy3lMA0hwmtc9wgTIS6ZJaXHBfAPAi58hB/UTCIMapWorking.JPG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/qwRdyPROLy3gdMYMpBI*HnNUPnkhLl9XynMMM5Y8vY*UV5zkz*6dfbMVFFFB*cXy3lMA0hwmtc9wgTIS6ZJaXHBfAPAi58hB/UTCIMapWorking.JPG)\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/qwRdyPROLy3o8i7PkTdLeb1EAGifrg2Tz8QidvRr1lio7VPxmDrqeQxk8hH8t9U5hZqJgkuxXEQC2AtF2*PyHDHbX-k49RAF/WorkingUTCIGH.JPG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/qwRdyPROLy3o8i7PkTdLeb1EAGifrg2Tz8QidvRr1lio7VPxmDrqeQxk8hH8t9U5hZqJgkuxXEQC2AtF2*PyHDHbX-k49RAF/WorkingUTCIGH.JPG)\n\nMy guess is that your issue happens because you might be trying to create HBZones separately from your EnergyPlus results and these two really need to be done together.  This is because the microclimate maps work by matching the names of the HBZones and surfaces to the results of the EnergyPlus model and these can get out of sync if you re-generate HBZones and don't rerun them through E+. So, if you run everything in your script together, it should work.\n\n\n\nI also know that outdoor microclimate maps are time intensive and they are really built for cases where you need a lot of freedom to test different strategies and geometries (like all of the strategies E+ can run and all of the geometries that Rhino can create).  If you are ok with the simplification of ENVI-MET's pixel world, you don't need to test strategies beyond the usual ones, and your test area is small enough to be accommodated by ENVI-MET's free license (I forget how many pixels by how many pixels it allows), Antonello has built a connection from Ladybug to ENVI-MET that he posted here:\n\n[http://www.grasshopper3d.com/group/ladybug/forum/topics/lb-envi-met](http://www.grasshopper3d.com/group/ladybug/forum/topics/lb-envi-met)\n\n\n\nCheers,\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "May 9, 2017 at 6:43am", "created_by": "ChrisMackey", "replies": [{"body": "\nJust to make Chris comment on ENVImet, it doesn't work on pixels but with grids. The free license allows 100*100*30. The size range for the grid can be from 0.5 to 10 mts.\n\nENVImet is also time consuming ...\n\n\n\nMay i ask here, what are the compromises you can allow from the Energy point of view if you are interested only in the external microclimate? Maybe instead of multiple zones per floor, per building, define only one zone per floor?\n\nMaybe a wish for the future, input external wall temperatures from data, instead of calculating the whole energy model?\n\nMakes sense?\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "May 9, 2017 at 8:23am", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nChris,\n\nIndeed at some point I directly referenced the microclimatemap to the E+ results file to save time. I took a number of actions (deleted folder with generated files, updated HB,LB, reloaded grasshopper, deleted and added new microclimatemap component) and the problem persists. Meanwhile, surface temps are mapped in the correct order. <br/>As a side note, an earlier version of the posted gh def. could run the component although the model was technically full of errors (eg: Building masses were not intersected). It also returned the same result when grid resolution was set at precisely 1m which is also weird.<br/><br/>I will also attempt the approach suggested by Abraham. Assuming that the internal spaces are always conditioned and we are only interested in the external wall heat balance, one could theoretically create one superzone and subdivide the surfaces of interest near the pedestrian level. This way the surface temp. results can also inform a CFD analysis using butterfly.<br/><br/>Aris\n", "attachments": [], "created_by_name": "Aris V", "created_at": "May 10, 2017 at 2:51am", "created_by": "ArisVartholomaios", "replies": []}, {"body": "\nAbraham,\n\nThose are all very good points and you are right that my use of the term\"pixel world\" was very unscientific.  \"3D\" grid is much more appropriate.  All of those methods for simplifying the model are good ones.  The super-zone idea is actually probably good enough for most outdoor comfort situations but you likely want to assign internal loads that sum to the total internal heat gain over the number of floors of the building.\n\nOn a side note, you can actually plug in custom surface temperature data into the microclimate maps and I have done it before using surface temperatures that I measured form an experiment.  You just need to label all of your HBSrfs and coordinate that labeling with headers that you put on the custom data.\n\nAris,\n\nAre you saying that you were not able to run the GH file that you uploaded here and get the same results as I did?  If so, maybe there's an error on your machine and we can try to investigate further.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "May 10, 2017 at 6:50am", "created_by": "ChrisMackey", "replies": []}, {"body": "\nThanks Chris,\n\nI think the \"super zone\" is not a very good idea, specially if you have a tall building. In this way you'll get only one temperature per surface out of E+. I believe that the MRT calculation can be a bit of erroneous for such cases ... or at least, too gross/coarse.\n\nI suppose that a \"mid super zone\" can be better (maybe one zone per floor or every 2 floors).\n\n\n\nNice that measured temperatures can be customized and used. One day i'll try.\n\n\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "May 10, 2017 at 7:00am", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nChris,\n\nYes, even with no stored/internalized geometry and data the problem persists. I'm 100% sure that the component was able to run in an earlier gh definition (see pic) but only with grids with dimensions different than 1m precisely (or larger?...i don't remember). I will try to run the same definition in another machine if possible tonight.\n\n\n\nAbraham,\n\nYou can subdivide any honeybee surface into smaller ones and then join them into a zone, like Chris' hydra examples with EP ground zones. Since conditions inside the superzone are stable, assuming an ideal HVAC system and schedules, each subdivided patch of zone surfaces will yield a different Tsurf result based on the external heat balance and internal temps. Theoretically this freedom to describe surface patches in more detail can speed up calculations and provide better results.\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1748905", "name": "Frame_00012.png"}], "created_by_name": "Aris V", "created_at": "May 10, 2017 at 7:25am", "created_by": "ArisVartholomaios", "replies": []}, {"body": "\nYes Aris,\n\nI forgot about this option.\n\nI guess the \"best\" solution will be per case. The openings in the facades make a difference with the hydra case (which was divided in the opaque surfaces. But this is a matter of thinking the best way to do it.\n\nGreat.\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "May 10, 2017 at 7:41am", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nAbraham, Aris already pointed it out but you are right that I would not recommend modelling a tall building with one surface per facade.  You would want to at least subdivide the facade floor-by-floor and possibly within each floor facade if you want to capture the effects of sun falling in different parts of the building.  Also, as I mentioned earlier, one really should try to match the internal loads of the \"one-zone building\" with that of the fully detailed one.  Finally, it goes without saying that this \"one-zone building\" method is really only for outdoor studies.  Any time that you want info about the interior of a building (like heating/cooling or indoor thermal comfort), you should model the building with at least one zone per floor.\n\nAris, keep us posted as you try to recreate the error.\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "May 10, 2017 at 3:38pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nYes Chris. Thanks.\n\nYou can stress this in tomorrow's webinar ... that i'll see on recording ... :-)\n\n\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "May 10, 2017 at 4:01pm", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nChris,\n\nFirstly, I would like to thank you for your informative webinar on microclimate analysis yesterday.\n\nRegarding the problem in question I'm inclined to believe that it is not a system issue since both yesterday's street example and another very quick test I did on the same machine ran fine. It may have to do with:<br/> (i) either improper geometry generation, as I already intersected some of the common surfaces manually in sketchup and then did the rest with the intersect masses tool.  E+ throws an error about 2 surfaces that do not calculate insolation properly which I have yet to detect. The updated honeybee openstudio component even refused to provide the resulting in.csv file address although one was generated (it returned null instead although the old one would be ok).\n\n(ii) or perhaps an issue of mix and matching old and new hb components, which is just speculation till now.\n\n\n\nTwo other issues I detected:\n\n1)  When using the PET recipe, MicroclimateMap produces the following error: Solution exception:global name 'PETComfMtx' is not defined. This happened on yesterday's street gh definition I tried to play with.<br/><br/>2) In both UTCI and PET recipes: the description of cloAbsorptivity that appears on rollover is misleading as it refers to radiation reflected off of the ground. I suppose the description in the code for clothingAbsorptivity_ is the correct one.<br/><br/><br/>\n\n-Aris\n", "attachments": [], "created_by_name": "Aris V", "created_at": "May 12, 2017 at 10:48am", "created_by": "ArisVartholomaios", "replies": []}, {"body": "\nAris,\n\nI am glad that you found the webinar informative and thanks for tuning in!\n\nYour explanations sound very plausible.  I wouldn't worry too much about the E+ insolation surfaces as that should throw off your calculation too much and it's usually easy to correct once you look over your model for L-shaped surfaces.\n\nThanks for finding the incorrect cloAbsorptivity description in the comfort recipes.  I just fixed it:\n\n[https://github.com/mostaphaRoudsari/honeybee/commit/bf4ec8ee115e0c8...](https://github.com/mostaphaRoudsari/honeybee/commit/bf4ec8ee115e0c8110c1e7dd19a495975df621fa)\n\nI'll see if I can recreate the issue with the PET recipe now.\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "May 12, 2017 at 4:47pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nAris,\n\nI was able to recreate the issue with PET and it turned out to be a small typo.  It is fixed now:\n\n[https://github.com/mostaphaRoudsari/honeybee/commit/eba231d656d77dc...](https://github.com/mostaphaRoudsari/honeybee/commit/eba231d656d77dc2d097ce58004a0767d1b6c27f)\n\nThanks again for finding and reporting these issue!\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "May 12, 2017 at 5:35pm", "created_by": "ChrisMackey", "replies": []}]}], "id": "1748083"}