{"body": "\nHello, <br/> <br/> I am working on some research project that deals with daylight and energy simulation, thus I was working on the model on GH. But the surface type of createHBSrfs doesn’t match with the outputs of Honeybee_Decompose Based On Type component, thus the consistency of the model becomes loose by the visualization and I am little bit concerned about the model and simulation result.\n\n<br/> For example, srftype input for floor that touches ground, 2.5 “SlabOnGrade”  in createHBSrfs doesn’t recognized as groundFloors on the decompose based on type rather its seen as exposed floor.<br/> <br/> <br/> Does it really matter when doing energy simulation when the EPconstruction type is same?\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1749655", "name": "1.PNG"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1749656", "name": "2.PNG"}], "created_by_name": "Amaraa", "created_at": "May 11, 2017 at 4:02am", "created_by": "Amartuvshin", "topic": "Surface type consistency", "replies": [{"body": "\nDoes it really matter when doing energy simulation when the EPconstruction type is same?\n\nYou should also consider the Boundary Condition which for a slabOnGrade is Ground but for exposedFloor is Outdoors. Your input 2.25 is underground slab and not 2.5 slabOnGrade. In any case, Decompose based on type is for visualization and as far as the construction and boundary condition is set correctly it will work fine in EnergyPlus.\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "May 11, 2017 at 7:05am", "created_by": "MostaphaSadeghipour", "replies": [{"body": "\nYes indeed, I was trying with the different floor types for matching the outputs. And this capture was made while I was testing. Now I've checked the boundary condition and it seems quite Ok. <br/>Thank you for clarifying.<br/><br/>Also one more thing, does childSurface of Honeybee_addHBGlz still cannot be 100% to the HBObj in the latest version of LBHB? Because i have red somewhere in the discussion forum that it cannot be over 95% of the ancestor surface due to Energy Plus. \n", "attachments": [], "created_by_name": "Amaraa", "created_at": "May 11, 2017 at 8:40am", "created_by": "Amartuvshin", "replies": []}, {"body": "\ndoes childSurface of Honeybee_addHBGlz still cannot be 100% to the HBObj in the latest version of LBHB?\n\nYes, and it won't change unless EnergyPlus starts to support 100% glazing which I don't think will ever happen. You need a small offset for the child object (window) to be inside the parent object (wall).\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "May 11, 2017 at 8:44am", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nI have simply used offset component to make the child surface with minimal distance possible and it works beautiful. Thank you :)\n", "attachments": [], "created_by_name": "Amaraa", "created_at": "May 29, 2017 at 1:03pm", "created_by": "Amartuvshin", "replies": []}]}]}