{"body": "\nHi Ladybug team,\n\nI just seem to bump into different issues with honeybee lately. Please see attached definition to check if these problems occur:\n\n1) Latest changes in Github did not show up when updating Hb using the component - had to download directly and overwrite files.\n\n2) Colorsurfaces component returns this: Solution exception:name 'lb_preparation' is not defined. I don't remember this being an issue earlier but now it won't go away unless I plug a slider to 'stepsOfSimulation' and then unplug.\n\n3) PETrecipe component returns this: Solution exception:global name 'Icl' is not defined. Goes away if value is unplugged from clothinginsulation @ bodycharacteristics component.\n\n4) AdaptRecipe component returns null for outdoor case with minimal inputs (worked fine earlier)\n\n5) Decompose EPmaterial: the last value (visual absorbance?) is missing from comments\n\n\n\nand a less technical question (so that I won't flood the forum with more threads): Can ecoroof material be used to simulate grass on ground? I did an experiment and I got higher surface-temp results than concrete and no indications of shadow effect from obstacles. I'd post this def. but I bumped into the above problems.\n\n-Aris\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1752368", "name": "colorzones_issue.gh"}], "created_by_name": "Aris V", "created_at": "May 16, 2017 at 6:49am", "created_by": "ArisVartholomaios", "topic": "lb_preparation not defined (and some other stuff)", "replies": [{"body": "\nAris,\n\nThanks for reporting.  2 and 3 were minor bugs that I just fixed:\n\n[https://github.com/mostaphaRoudsari/honeybee/commit/cc22a4a2a9a578a...](https://github.com/mostaphaRoudsari/honeybee/commit/cc22a4a2a9a578a2ed0cf96f3cacdea0be548ce6)\n\nThanks for finding them.\n\n\n\n1 is likely a result of your internet connection at the time. 4 - the adaptive and PMV comfort recipes have always required the input of indoor data as they are indoor comfort models.  The UTCI and PET recipes, however, have the option of only plugging in surface temperature as they are outdoor comfort models.  5 -I see the last comment is usually missing when HB_HB imports materials from the OpenStudioMaterTemplate.idf.  I'll try to add this soon but, yes, it's visual Absorptance for opaque materials.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "May 16, 2017 at 8:09am", "created_by": "ChrisMackey", "replies": [{"body": "\nChris,\n\nThanks for the quick reply and bug fixing! Regarding #4, its my mistake, I confused the components.\n\n-Aris\n", "attachments": [], "created_by_name": "Aris V", "created_at": "May 16, 2017 at 9:24am", "created_by": "ArisVartholomaios", "replies": []}]}]}