{"body": "\nHi all,\n\nIf I use Honeybee transparent material to make a prism. Do you think that Honeybee can understand the properties of the prism? so it can give me the spectrum light dispersed from the prism if I point direct sunlight on it.\n\n\n\nOr there is another plugin for that sake?\n\n\n\nI can get spectrum light from the prism using V-Ray in 3D Max, but I need to use Grasshopper to control more parameters. \n\n\n\nThank you..\n", "attachments": [], "created_by_name": "Ahmad Eltaweel", "created_at": "May 17, 2017 at 4:38am", "created_by": "AhmadEltaweel", "topic": "Inquiry about Honeybee transparent material.", "replies": [{"body": "\nAhmad,\n\nVery good question but unfortunately, Radiance really isn't built to model light's wave-like properties.  It's ray-tracing methods are exceptionally good at modeling illuminance in all of its forms but I don't think there's a rendering engine that currently exists that is able to model light refraction and diffraction in the way that you are describing.  Sarith (one of the great Radiance gurus of our community) should confirm this but he already explained to me why light diffraction isn't modeled with Radiance here:\n\n[https://github.com/mostaphaRoudsari/honeybee/issues/597](https://github.com/mostaphaRoudsari/honeybee/issues/597)\n\nExtending his explanation, we can also conclude that it can't model prisms and light refraction in the way that you describe.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "May 17, 2017 at 1:49pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nHi Ahmad,\n\n\n\nTo add to what Chris mentioned, the spectral dispersion that we see with prisms require a full-spectrum continuous-band light source like daylight or light from an incandescent source. The x-axis in the image below are wavelengths.\n\n[<img class=\"align-left\" src=\"https://upload.wikimedia.org/wikipedia/commons/2/21/CIE_illuminants_D_and_blackbody_small.gif\"/>](https://upload.wikimedia.org/wikipedia/commons/2/21/CIE_illuminants_D_and_blackbody_small.gif)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nRadiance considers only three channels for calculation (RGB) that mostly corresponds to the Trichomatic Theory. In short, as Chris said, Radiance (and therefore Honeybee) will not be able to replicate light dispersion through a prismatic material.\n", "attachments": [], "created_by_name": "Sarith Subramaniam", "created_at": "May 17, 2017 at 2:26pm", "created_by": "sarith", "replies": [{"body": "\nSarith,\n\nPurely out of curiosity, do you know of any rendering engines that are built to do full-spectrum analyses?  I feel that every engine that I know uses Trichromatic Theory.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "May 18, 2017 at 4:05pm", "created_by": "ChrisMackey", "replies": []}]}, {"body": "\nHi Chris and Sarith,\n\n\n\nThank you very much for your replies. As I told you before, V-ray for 3D MAX can simulate a full spectrum light analysis. Grasshopper as a parametric software can understand angles and equations which are unfortunately not applicable with 3D MAX. \n\n3D MAX can only visualize the spectrum light with no specified angle or pre-scripting, just you can move the light manually till you get reflected and refracted light. \n\nI think it would be really helpful to make a V-ray for Honeybee (RADIANCE), so we can use V-ray parametrically!   Do you think it is possible to merge the two software?  \n\n\n\nThanks\n\nAhmad\n", "attachments": [], "created_by_name": "Ahmad Eltaweel", "created_at": "May 19, 2017 at 4:51am", "created_by": "AhmadEltaweel", "replies": []}], "id": "1752950"}