{"body": "\nHi Mostapha, Chris and group members,\n\n\n\nIs it possible to simplify the setting process of construction u-value with a series of u-value numbers rather than a range of detailed settings  in order to accelerate the process of conceptual design process?\n\n\n\nBecause for the designers, especially architects in the conceptual stage, the u-value of constructions such as walls, roof and floor, and the u-value and SHGC of window may draw more attentions. And of course, we can make a range of constructions from **Honeybee_Call from EP Construction Library**, but the interval of constructions values seems discontinuous, not enough and also limited. And is it possible for designers to find the optimal u-value of constructions and then to develop the detailed construction settings such as wall's thickness, roughness? Could find a proper solution or workflow for this thought?\n\n\n\nThank you in advance.\n\n\n\nXiaojian\n", "attachments": [], "created_by_name": "Bi Xiaojian", "created_at": "May 19, 2017 at 9:01pm", "created_by": "BiXiaojian415", "topic": "Simplify the setting process of u-value", "replies": [{"body": "\nHi Xioajian,\n\nThere is the NoMassOpaque Material Component found in the construction tab of Honeybee. You can plug in directly an R value there along with absorbance parameters, however, as the name implies the calculation will not take into account any thermal mass.\n\nAris\n", "attachments": [], "created_by_name": "Aris V", "created_at": "May 20, 2017 at 5:00am", "created_by": "ArisVartholomaios", "replies": [{"body": "\nHi Aris,\n\n\n\nThank you for your great help and so sorry for my late reply. That seems the only way to handle the problem. But does that can change the result much as the calculation will not take into account any thermal mass?\n\n\n\nXiaojian\n", "attachments": [], "created_by_name": "Bi Xiaojian", "created_at": "June 26, 2017 at 7:55am", "created_by": "BiXiaojian415", "replies": []}, {"body": "\nHi Xiaojian,\n\n\n\nYes, a construction with no mass may help in modelling thermal bridging but will result in inaccurate results if you try to make a detailed simulation. Perhaps what you might want to do is create a custom construction and play with the thickness of the insulation material to get different U values.\n\n\n\n-Aris\n", "attachments": [], "created_by_name": "Aris V", "created_at": "June 27, 2017 at 1:55am", "created_by": "ArisVartholomaios", "replies": []}, {"body": "\nHi Aris,\n\nThank you for your great help. \n\nIt is exactly what I want to do. And thank you for your detailed explanations, I think I will never get confused about the NoMassOpaque again.\n\nXiaojian\n", "attachments": [], "created_by_name": "Bi Xiaojian", "created_at": "June 28, 2017 at 1:24am", "created_by": "BiXiaojian415", "replies": []}]}], "id": "1754725"}