{"body": "\nI could not find any discussions on this topic. Harmful light exposure to museum objects is often measured in lux hours (visible light is used also as a proxy for UV). I do not think this is something that can be generated out of the box with Honeybee. I created the attached solution, which works ok when there are a small number of surfaces to be analyzed, but it would be tedious to analyze a larger number of surfaces because I do not know how to visualize them all at once.\n\n\n\nI would appreciate any suggestions regarding my solution, comments on lux hours and sensitive museum objects, and - I obviously think this would be a great added tool in Honeybee.\n\n\n\nThank you in advance!\n\n(Obviously, I need to learn Python.)\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1757075", "name": "Lux_hours.gh"}], "created_by_name": "Ernst Bay", "created_at": "May 24, 2017 at 1:33pm", "created_by": "ErnstBay", "topic": "Light Exposure - Lux Hours", "replies": [{"body": "\nHi Ernst,\n\nSince you're using the visible light as a proxy for UV, can you use the sunlight hours analysis in Ladybug to evaluate surfaces of interest to you?\n\n\n\n\n", "attachments": [], "created_by_name": "Devang Chauhan", "created_at": "May 24, 2017 at 4:49pm", "created_by": "devang", "replies": [{"body": "\nSunlight hours won't give me annual lux hours. It is a step towards evaluating direct exposure though (noted by Sarith below).\n\n\n\nThanks.\n", "attachments": [], "created_by_name": "Ernst Bay", "created_at": "May 25, 2017 at 6:20am", "created_by": "ErnstBay", "replies": []}]}, {"body": "\nIf this for an actual project and not just a thought experiment, I think your solution might be overly simplistic. Both [CIE 157:2004](http://www.cie.co.at/index.php?i_ca_id=433) and [LG8:2015](http://www.cibse.org/Knowledge/knowledge-items/detail?id=a0q20000008I7kIAAS) (which appears to defer to CIE 157:2004) mention limiting illuminance and limiting exposure (lux hours). Hours with direct solar irradiance are likely to exceed the limiting illuminance thresholds, which range from (200 to 50 lux as per Table 3.4 in CIE 157:2004). It makes sense to consider direct illuminance (an ab=0 simulation in Honeybee)  separately from a normal illuminance calculation.\n\n\n\nAssuming that the museum exhibits have low to high responsivity to light, an ideal solution would minimize direct sunlight. For daylight from the sky and reflected light, it might be enough to keep the illuminance levels below the recommended thresholds and then sum up lux-hours.\n\n\n\nDaysim, the annual daylighting engine used by Honeybee and DIVA, is not very accurate for direct-sun calculations. You will get more accurate results if you run your analysis with Radiance directly.\n\n\n\nInstead of considering the horizontal illuminance grids, one can create grids that correspond to the dimensions of the exhibit and then average those values. I think single points, as shown in your gh file might not suffice. Calculating lux-hours is by far the simplest part of such a simulation. It will only require averaging these points, extracting them into an array and then summing up that array.\n", "attachments": [], "created_by_name": "Sarith Subramaniam", "created_at": "May 24, 2017 at 5:29pm", "created_by": "sarith", "replies": [{"body": "\nThank you for the detailed response, Sarith!\n\n\n\nCould you elaborate on why Daysim is not accurate for direct illuminance analysis? Is there any way to run \"pure\" radiance analysis with Rhino/Grasshopper?\n\n\n\nJust to be clear: what you are saying is that one should:\n\n-Minimize (or eliminate) direct solar exposure\n\n-Limit lux-hours\n\nOr are there some additional considerations one might take into account? For example: ere you aware of a way to estimate UV more directly?\n\n\n\nCould you also elaborate on:\n\n\"It will only require averaging these points, extracting them into an array and then summing up that array.\" \n\nI do not understand your logic here.\n\n\n", "attachments": [], "created_by_name": "Ernst Bay", "created_at": "May 25, 2017 at 6:32am", "created_by": "ErnstBay", "replies": []}, {"body": "\nHi Ernst,\n\n\n\nDaysim isn't very accurate for direct illuminance analysis because the position of the sun is [approximated to one of 65 locations for the entire year](http://daysim.ning.com/subprogram/rtracedc). The [DDS version of Daysim](https://www.radiance-online.org/community/workshops/2009-boston-ma/Presentations/Radiance%20WS2009_DaysimInnovations_CReinhart.pdf) is more accurate but that is not implemented in Honeybee. Pure Radiance calcs for the entire year will probably take over 10 days to run for the entire year (which is why use Daysim in the first place!).\n\n\n\nWith regards to your questions about solar exposure, and lux-hours, Yes, that is what I meant. Within the context of Daylighting simulations, it is almost useless to consider UV modeling.  Radiance is a three channel ray-tracing engine, where each channel corresponds to a certain [cone sensitivity](https://en.wikipedia.org/wiki/Cone_cell). Daysim is a simplification of Radiance, which only considers the [photopic curve](https://en.wikipedia.org/wiki/Luminosity_function). I am not sure if it would be possible to get the spectral reflectance distributions and spectral transmittance distributions of all the involved surfaces to get a proper idea of UV incident on a particular surface\n\n\n\nI recommend referring CIE 157:2004 for more info on this ([IES has an RP document on this topic](https://www.ies.org/store/recommended-practices-and-ansi-standards/recommended-practice-for-museum-lighting/), but since I haven't referred it before, I can't vouch for it). \n\n\n\nAbout the array stuff, I was referring to the data structures in the python scheme of things. Assuming that you have a rectangular frame that you'd like to count lux hours for, it makes sense to average the illuminance on it at any given time. The sum of average illuminances for every hour will result in lux hours.  The CIE document uses a similar logic for calculating threshold lux hours. For example, a threshold illuminance of 50 lux for 3000 hours will result in lux-hours of 150000, which will result in noticeable fading in high responsivity materials.\n\n\n\nSarith\n", "attachments": [], "created_by_name": "Sarith Subramaniam", "created_at": "May 25, 2017 at 5:22pm", "created_by": "sarith", "replies": []}]}, {"body": "\nOn a slightly separate note:\n\nI believe the GH file I posted produces annual lux-hour values and it allows you to visualize results with colored grids. My actual file is more complex and I think visualizing results in this manner will help understand what kinds of design choices would limit lux-hours in the most exposed areas. The issue I have is that I can't visualize all the results at once, but rather I have to cycle through the analyzed surfaces (only two surfaces in the example).\n\n\n\nCan anyone point me towards a solution that would allow me to visualize any number of analysis surfaces at once?\n", "attachments": [], "created_by_name": "Ernst Bay", "created_at": "May 25, 2017 at 6:35am", "created_by": "ErnstBay", "replies": []}]}