{"body": "\nHi,\n\nI am super new to the Honeybee tools and started using it specifically for the THERM integration. I so excited by its potential and have run a few tests.\n\nThe process works amazingly but there were discrepancies between the THEM output in Rhino and from THERM.\n\nI imported the THERM file created by HB into THERM to do some trouble shooting and found that the THERM file from HB uses an Automatic Enclosure model for the boundary condition radiation.\n\nOur calculations always use Blackbody for the exterior BC radiation model.\n\nI can see how to change everyother setting for the BC but not this.\n\nI have done some digging but cannot see where to change this, is this possible?\n\nThanks\n\nJonny\n\n\n\n\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1757023", "name": "BC setting.PNG"}], "created_by_name": "Jonathan Story", "created_at": "May 24, 2017 at 9:26am", "created_by": "JonathanStory", "topic": "THERM - Control over BC Radiation Model", "replies": [{"body": "\nJonathan,\n\nThanks so much for the post.  The radiation model can be assigned in the thmx file that Honeybee writes and I just didn't expose it on the Boundary Condition component as I have usually not applied it my own workflows (to be honest, I am not as big of a THERM power user as I am sure that you and many others in the community are).  Now that you have explained it, I see that it's really important and I will add in the ability to assign the radiation model as soon as I can.  I have created a github issue for it and I should have it added to Honeybee within a day or two:\n\n[https://github.com/mostaphaRoudsari/honeybee/issues/629](https://github.com/mostaphaRoudsari/honeybee/issues/629)\n\n\n\nWhile I have you here, do you mind if I ask you a few questions about your workflow (and the boundary condition inputs that I might need to expose on the BC component):\n\n\n\n1) Is is generally good practice to model the exterior BC with a black body radiation model?  If so, I can make the BC auto-assign to a black body radiation model if someone inputs \"outdoor\" for the film coefficient. I know the black body radiation model well but I don't know if it's typically better suited to outdoor conditions compared to the AutoEcnlosure model.\n\n\n\n2) Is is necessary to expose the view factor input for the black body model or do you think everyone will always want to assume a view factor of 1?\n\n\n\n3) Do you ever use the \"Constant Heat Flux\" Boundary condition?  I have never seen a workflow using it yet but I have always assumed that it was used to account for things like solar flux.  I know that I can assign it from the thmx file and, if I understood how it was supposed to be applied, I would know how to expose it properly.\n\n\n\nThanks again,\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "May 26, 2017 at 1:13pm", "created_by": "ChrisMackey", "replies": [{"body": "\nHi Chris,\n\n\n\nI am Jonny's colleague. Thanks a lot for your reply! It would be very helpful if Therm users could directly assign Radiation model through Honeybee.\n\n\n\nRegarding your questions,\n\n\n\n1. Yes. According to NFRC(National Fenestration Rating Council) manual, the exterior is always assigned to “Black body radiation model”.\n\n\n\n2. I will assume the view factor is 1. Also, the view factor is defined as 1 in the build-in boundary condition library from Therm. \n\n\n\n3. I have never used the \"Constant Heat Flux\" before.\n\n\n\nI attached screenshot from Therm for \"NFRC Exterior Boundary Conditions\" and \"Interior Thermally Broken Frame Boundary Conditions\" here, hope the information could help a little bit. \n\n\n\nThanks again,\n\nGrace\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1758466", "name": "NFRC Exterior boundary condition.PNG"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1758467", "name": "NFRC Interior boundary condition - Frame.PNG"}], "created_by_name": "Grace Huang", "created_at": "May 26, 2017 at 10:40pm", "created_by": "GraceHuang", "replies": []}, {"body": "\nGrace and Jonathan,\n\nThank you so much for all of the information.  I also did some research over the last few hours and I can confirm that you are correct. NFRC states that we're supposed to use a black body with view factor 1 for the exterior.  Accordingly, I have set this as the default whenever anyone plugs in the words 'outdoor' for the film coefficient or plugs in a convective film coefficient greater than 10 W/m2K (which is pretty certainly an outdoor condition).  You can see the changes here on the github and, if you update your components to sync with the github, they will now work in this manner:\n\n[https://github.com/mostaphaRoudsari/honeybee/commit/8804bbdc65bc26a...](https://github.com/mostaphaRoudsari/honeybee/commit/8804bbdc65bc26a2eef97f5ab358a3191b8b6b12)\n\nI'll update the example files with these new components soon.\n\n\n\nFurthermore, for the sake of giving complete control over to people using the THERM components, I have added an extra input for a \"Custom Radiant Environment\" (customRadEnv_) and an extra component by the same name to generate what is needed for this input:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/B3HakomPt9XSs3tTpAE0gca5vtwiwPHPSJ89pAJ6tpLI891N-XGsniBvwREJCF4*pPzkS30cL7GB3ffuRYWJR-b1XZvcCWKe/BlackBodyTHERMSimulation.PNG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/B3HakomPt9XSs3tTpAE0gca5vtwiwPHPSJ89pAJ6tpLI891N-XGsniBvwREJCF4*pPzkS30cL7GB3ffuRYWJR-b1XZvcCWKe/BlackBodyTHERMSimulation.PNG)\n\nThis allows you complete control over the radiation model, view factor, radiant temperature of the environment, and the emissivity of the environment.  If you leave the viewFactor input blank, it will assume an autoEnclosure model but, if you specify a viewFactor, it will use the black body model along with that view factor.\n\n\n\nFinally, I confirmed that the Constant Heat Flux Boundary Condition is mostly intended to account for solar radiation.  So I added an input for this on the boundary condition component.\n\n\n\nI'll post back here once I get the chance to update the example files.\n\nThanks again,\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "May 26, 2017 at 11:50pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nGrace and Jonathan,\n\nSorry to post back so late but I finished adding all of the options with boundary conditions a few days ago and updated the example file:\n\n[http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;for...](http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;fork=hydra_2&amp;id=THERM_Export_Workflow&amp;slide=0&amp;scale=1&amp;offset=0,0)\n\nThe THERM components are now wired to use NFRC boundary conditions by default and you can full customize them with the new \"Honeybee_Custom Radiant Environment\" component.\n\nLet me know if you have any questions and I will start making some youtube tutorials of the THERM components within the next couple of months.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "June 5, 2017 at 9:50am", "created_by": "ChrisMackey", "replies": []}]}], "id": "1757024"}