{"body": "\nHi Mostapha, and everyone!\n\n \n\nI simulated some days and hours using ladybug e honeybee and I set São Paulo epw.\n\nSo, the december is the summer and june winter. **The corectly result would be december, march, september, june**.\n\nI did two kind of simulation. The first one - just one hour 10h and then 15:30. The second, 10:00 to 15:30h. I think that's something wrong with the results kWh/m² because the biggest values for radiation, are for winter. And the results simulation 10:00 to 15:30h the result are different too, the biggest values for winter (june), then september, march, and them december (summer)\n\n \n\nThe results are (kWh/m²)\n\n10:00h           15:30h     10 to15:30h\n\n**21/03** 0,69      1,15        2,61\n\n**21/06** 1,14      1,13        3,71\n\n**23/09** 0,96      0,90        2,79\n\n**21/12** 1,31      1,22        2,45\n\n \n\nI will be very gratiful with your answer I'm using this software to a important academic work, and in my Country Its not commom use this software, I don't know anyone that could help me with this. I'd like to encourage university start to use this kind of software.\n\n \n\nThank you\n\n \n\nCamila\n\n<font face=\"Calibri\" size=\"3\"> </font>\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1758049", "name": "RadiationAnalysis.gh"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1758050", "name": "BRA_Sao.Paulo-Congonhas.837800_SWERA.epw"}], "created_by_name": "Camila Leone", "created_at": "May 25, 2017 at 8:50pm", "created_by": "CamilaLeone", "topic": "Problems with radiation result", "replies": [{"body": "\nHi Camila,\n\nI took a look at your file. Seems ok. I suggest looking at annual direct normal radiation data for the Sao Paulo location. That should shed more light I believe.\n", "attachments": [], "created_by_name": "Devang Chauhan", "created_at": "May 26, 2017 at 12:25am", "created_by": "devang", "replies": [{"body": "\nHi Devang,\n\n\n\nHow/where can I take a look annual direct normal radiation data for the Sao Paulo?\n\n\n\n\n", "attachments": [], "created_by_name": "Camila Leone", "created_at": "May 26, 2017 at 11:01am", "created_by": "CamilaLeone", "replies": []}, {"body": "\nHi,\n\n\n\nPlease find the file attached. You may observe that the data for the dry bulb temperature is probably in line with your expectation, but the direct normal radiation data is not.\n\n\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1758181", "name": "Sao Paulo Annual Radiation.gh"}], "created_by_name": "Devang Chauhan", "created_at": "May 26, 2017 at 12:09pm", "created_by": "devang", "replies": []}, {"body": "\nAnd how could I solve this problem?The problem is with epw?\n", "attachments": [], "created_by_name": "Camila Leone", "created_at": "May 26, 2017 at 1:48pm", "created_by": "CamilaLeone", "replies": []}, {"body": "\nHi,\n\nI believe the problem is neither with Ladybug nor with the epw file. The TMY (Typical Meteorological Year) format used for most weather data files was developed by Sandia national library. The method is based on 12 years of measured data. Starting with January, January which is closest to the mean of twelve Januaries is selected based on a composite weighing of solar radiation, temperature, humidity and wind velocity. The same process is applied for the following months. So as a result, each TMY month most likely correspond to measured data from a different year. That is how the weather data file is composed. Due to this averaging, the data sometimes surprise the residents of that location.\n", "attachments": [], "created_by_name": "Devang Chauhan", "created_at": "May 26, 2017 at 10:01pm", "created_by": "devang", "replies": []}, {"body": "\n\n\nI understand.\n\nI opened your file attached, is exactly this ! The temperature is ok, but radiance shuold be like temperature. What could I do ?\n\nDoesn't have sense, just some part of the world could use the software. So I don't have any idea how to use this software and get reliable results to radiance.\n\nDo you know something that I could do to have reliable results for my simulations?\n", "attachments": [], "created_by_name": "Camila Leone", "created_at": "May 27, 2017 at 8:31am", "created_by": "CamilaLeone", "replies": []}, {"body": "", "attachments": [], "created_by_name": "Camila Leone", "created_at": "May 27, 2017 at 3:42pm", "created_by": "CamilaLeone", "replies": []}, {"body": "\nI suggest you to check some days before/after the ones you are trying to check. It may be that for the specific day the atmospheric conditions affected the direct radiation. The assumption that the 21 of the month is the critical day is true but mostly in theory.\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "May 27, 2017 at 8:34pm", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nHow could I know if my algorithm's results  (attached other day) are from direct normal radiation or diffuse horizontal radiation or global horizontal radiation? \n\nBecause looking at Devang file, I think the results that I think that's incorrect its from direct normal radiation. Could I change results to get global horizontal radiation ?\n\nHow could I modify the algorithm to get global horizontal radiation?\n\nI'm desperate about this !\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1759067", "name": "Diffuse horizontal radiation.jpg"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1759068", "name": "Direct Normal Radiation.jpg"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1759069", "name": "Global horizontal radiation.jpg"}], "created_by_name": "Camila Leone", "created_at": "May 28, 2017 at 10:38am", "created_by": "CamilaLeone", "replies": []}, {"body": "\nI really don't understand your worries.\n\nFirst for all the radiationAnalysis component uses the selectSkyMtx which uses the Global Radiation (unless you ask to remove direct or diffuse).\n\nSecond, i've made some tests, and the results are pretty much consistent to your expectations (December the highest, June the lowest). But i also get a case where the 21.6 at some hours is higher than 21.3, so i changed the day (as i wrote previously) to the 30.3 and then the results are fine (they were fine also before, but just for your peace of mind).\n\nAttached the file i worked on. I plotted a 3dChart also so you can see the differences in the data through the year.\n\nSee red arrow to see the changed day.\n\nHope this makes sense for you now.\n\n-A.\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1759159", "name": "RadiationAnalysis_AY.gh"}], "created_by_name": "Abraham Yezioro", "created_at": "May 28, 2017 at 12:14pm", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nFirst of all thank you very much to help me !\n\nI'm understanding what you did. It's different from what I did. I was comparing the values of colors variations (red to blue), in this case june was the highest number. (In my way)\n\nYou put maximum and minimun values to legend par. (And the number was satisfying. Do you know if this results, attached, is in kWh/m²)\n\nI need to see the image too, not only the numbers, I understand that in your way I saw only the number results, isn't it?\n\nLook the image december and june (attached). June is more \"red\". Like your way results, the corect is the oposit. How could I get corect images ? (understand my question?)\n\nSorry for so many questions\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1759213", "name": "21.06.jpg"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1759214", "name": "21.12.jpg"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1759215", "name": "Results.png"}], "created_by_name": "Camila Leone", "created_at": "May 28, 2017 at 1:39pm", "created_by": "CamilaLeone", "replies": []}, {"body": "\nCamila,\n\n\n\nYou are comparing 5 hours on June 21st with 5 hours on December 21st. That is just not enough data for one to draw any conclusions. Because as per your argument, it is impossible for any five hours in June to be warmer than any five hours in December. Direct-Normal radiation is purely a function of the amount radiation received directly from the sun. So, if the five hours in December 21 in your calculation were cloudy, the amount of direct-radiation for those hours will be zero. Secondly, your statement that.. \"The temperature is ok, but radiance shuold be like temperature..\" is not correct. It can be that you feel warmer on a cloudy day than you do on a sunny day.\n\n\n\nThe monthly weather data for Sao Paulo indicates that most of the rainfall occurs in the months of January and December. This implies that the direct-normal radiation for those months will be low, but the global-horizontal radiation will be high. And this is consistent with the results you are getting.\n\n[<img class=\"align-left\" src=\"http://api.ning.com:80/files/JPX5gKnxX7I6a9OPp5C1Yds7u-uRexx7IRSomPzhSjlJruOXB-LoKySBbXf6zGxegoxjUiRfAhuHgmW9sBK4eWcLkwVHlXS8/Selection_234.jpg?width=721\" width=\"721\"/>](http://api.ning.com:80/files/JPX5gKnxX7I6a9OPp5C1Yds7u-uRexx7IRSomPzhSjlJruOXB-LoKySBbXf6zGxegoxjUiRfAhuHgmW9sBK4eWcLkwVHlXS8/Selection_234.jpg)\n\n\n\n\n\n\n\n\n\n\n\n\n\nTry comparing more number of hours in Winter versus Summer. Something like (10AM to 3PM)* ( June 1 - June 30) versus (10AM to 3PM)*(December 1 - December 30). Finally, for the climate in Sao Paulo, it makes sense to compare direct-normal and global horizontal radiations separately.\n\n\n", "attachments": [], "created_by_name": "Sarith Subramaniam", "created_at": "May 28, 2017 at 3:57pm", "created_by": "sarith", "replies": []}]}]}