{"body": "\nHi!\n\n\n\nI am having a error when using the component \"csvSchedule\" to generate an occupancy schedule for the \"readAnnualResultsI\" component when doing an annual simulation.\n\nIf I use the \"Daysim occupancyGenerator\", it shows good results: every test point has its color. But when I feed the csv path of the file generated with the \"csv schedule\" it shows only a blue color, without difference between test points and no legend.\n\n\n\nI also tried with files generated with this component for other projects, but the results are the same.\n\n\n\nMaybe because these files are for E+ and not for Daysim?\n\n\n\nThanks for the help!\n", "attachments": [], "created_by_name": "Federico", "created_at": "June 4, 2017 at 11:02pm", "created_by": "Federico587", "topic": "Occupancy Schedule Incompatibility?", "replies": [{"body": "\nIt might be because of the difference between the schedules but if I remember right they should both look very similar.\n\n\n\nAre you using float numbers? If I remember correctly Daysim only takes integer values (0 or 1).\n\n\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "June 5, 2017 at 8:24am", "created_by": "MostaphaSadeghipour", "replies": [{"body": "\nI used floating numbers, but I did so because with DIVA for grasshopper I was able to do so.\n\nIn that case I generated my schedule, either using the DIVA \"year schedule\" component or grasshopper native ones, and copy and paste the result into an already existing daysim schedule csv file and save it with another name.\n\nI enclosed the two files, one using this method, the other using the \"csvSchedule\" one.\n\n\n\nI think the differences are in the first lines and in the last column.\n\n\n\nThanks,\n\n\n\nFederico\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1764349", "name": "DAYSIM.csv"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1764350", "name": "Honeybee.csv"}], "created_by_name": "Federico", "created_at": "June 5, 2017 at 6:33pm", "created_by": "Federico587", "replies": []}]}], "id": "1763827"}