{"body": "\nI've used forward tracing to study the effect of a series of reflectors on a west-facing facade, trying to get the limited direct light from that elevation as deeply into a space as possible. \n\n\n\nI'm now trying to run an annual analysis to get comparative metrics of the reflectors vs nothing vs a light shelf. However, I'm not seeing any difference in results at the moment. I think that my issue is the \"resolution\" of the sky. Is there a way to increase the sky divisions or change the sky matrix for an annual daylight simulation so the reflectors are \"seen\" by the study?\n\n\n\nSample file attached for reference (Ignore the notes on the file, I used a file I made for others as a tutorial as a base.)\n\n\n\nThanks!\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1763280", "name": "Simple CDA Simulation-Embedded.gh"}], "created_by_name": "Jason Smith", "created_at": "June 4, 2017 at 5:16am", "created_by": "JasonSmith", "topic": "Annual Radiance Study — Sky \"Resolution\"", "replies": [{"body": "\nRegarding the sky resolution issue, Daysim (in Honeybee) is limited to 145 patches.\n\n\n\nThat being said, I think your model can be improved. Mirror material is probably not the best choice for architectural studies like this. You are better off using the \"metal\" material instead. Considering that your model has dense geometry around the glazing, it might be useful to do a single climate-based point-in-time simulation to ascertain how the ambient parameters (divisions, bounces, resolution etc) affect the results and then use those parameters for the annual simulation.\n\n\n\nBy forward raytracing, were you referring to Photon Mapping? If yes, I think in this scenario, annual simulations with out-of-core photon mapping will give you far more accurate results than Daysim based simulations.\n", "attachments": [], "created_by_name": "Sarith Subramaniam", "created_at": "June 4, 2017 at 7:56pm", "created_by": "sarith", "replies": []}], "id": "1763281"}