{"body": "\nHey guys,\n\n\n\nI am in trouble with the preparation of the model for the energy analysis with honeybee. To better explain the design concept i will attach a jpeg file and the .gh file. The idea behind is quite simple: i have an adiabatic room, so no sun exposure, and a surface expose on the south. This surface is discretize by nine opaque's panels, A in the jpeg file, and three glass surfaces, B.\n\n\n\nI set up the model in this way:\n\n- five adiabatic surface;\n\n- two different type of materials for glass (B) and opaque part (A) of the surface.\n\n\n\nThe problem seems  to be after the Honeybee Create Zones component. If i give the same material, glass, to hall the surfaces it works fine.\n\nI cannot identify the problem with this process. Can someone help me?\n\n\n\nThanks in advance to all of you guys!\n\nBest\n\nAngelo\n\n\n\n\n\n\n\n\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1766085", "name": "Building Envelope_concept.JPG"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1766086", "name": "test room_energy analysis.gh"}], "created_by_name": "Angelo Figliola", "created_at": "June 8, 2017 at 7:42am", "created_by": "AngeloFigliola", "topic": "TEST ROOM_ENERGY ANALYSIS SET UP", "replies": [{"body": "\nAngelo,\n\nWindows for EnergyPlus need to be assigned as sub-surfaces of a base surface, which I see that you are doing in you GH file.  However, the sub surface must not go all of the way to the edges of the base surface (it must be smaller than the base surface).  If you just scale your window geometries around their center points by a little bit before you add it with the addHBGlz, everything should work fine.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "June 8, 2017 at 8:57am", "created_by": "ChrisMackey", "replies": [{"body": "\nHi Chris,\n\n\n\nWhat I should say more than thanks? Now, it works fine, i always forget this step!\n\n\n\nAngelo\n", "attachments": [], "created_by_name": "Angelo Figliola", "created_at": "June 8, 2017 at 10:50am", "created_by": "AngeloFigliola", "replies": []}]}]}