{"body": "\nHi All,\n\nHave 2 questions -- one for hot-water calcs and one for heat-recovery systems -- that I want to verify before running 100's of simulations in GH for an academic project. I've skimmed the discussion board but have not found quick answers so am throwing it out here.\n\nHOT WATER\n\nJust wanted to verify that when setting equipment loads around the 4-6 watt/m range for a single-family home, that this number WOULD NOT include hot-water heating, even from an electric hot-water heater with a high COP. As such, to calculate hot-water heating loads then one would need to use the Ladybug Residential Hot Water component.\n\nHEAT-RECOVERY\n\nI also wanted to get feedback on setting up heat-recovery systems for HVAC. I'm using ideal-air loads with the open-studio component so that I can quickly toggle between systems with and without heat-recovery systems. That said, the results with and without a system are only about 1% different. This seems very small to me, especially given the context is Abu Dhabi. Any help would be great. I would attach the file but it is super complex and within a cluster. My set-up though is:\n\nHVAC Air Details with only heatRecovery_ and recoveryEffectiveness set, passed into Assign HVAC System component which has _coolingDetails inputted from HVAC Cooling details but I assume the COP, etc. get's overridden when we are using Ideal Air Loads.\n\n\n\nAny help or verification of these results would be very, very helpful.\n\n\n\nThanks guys,\n\nDavid\n\n\n", "attachments": [], "created_by_name": "David Birge", "created_at": "June 9, 2017 at 10:33am", "created_by": "DavidBirge", "topic": "hot-water + heat-recovery questions", "replies": [{"body": "\nUpdate: Opening a result file in OpenStudio it is clear that hot-water is not assumed when you override equipment loads per unit area.\n\nI'm still unclear on why heat-recovery is only producing 2% differences.\n", "attachments": [], "created_by_name": "David Birge", "created_at": "June 13, 2017 at 7:42am", "created_by": "DavidBirge", "replies": [{"body": "\nDavid,\n\nGood questions.  Right now, Honeybee energy models do not support explicit hot water systems but we should be able to do this in the future because OpenStudio has this full capability.    I think the the US Department of Energy's MidriseApartment template that Honyebee uses is not supposed to include hot water in the equipment loads (equipment loads = 3.875 W/m2).  However, even for residential, hot water typically makes up a relatively small portion of the building energy use (and internal space gains) such that it's usually ok to leave it out of a full building energy model and model it separately.  So I would recommend using the Ladybug hot water components for now or (if you really need the hot water system in your energy model) build the hot water system in OpenStudio after exporting from honeybee.\n\nAs for heat recovery, given that Abu Dhabi never gets that cold, regular-old sensible heat recovery is likely not going to have a large effect.  You want to make sure that you use an enthalpy wheel (set the heatRecovery on the airDetails to 2) and this will ensure that both latent and sensible heat is recovered.  As a result, you will save a lot on the cooling energy because enthalpy wheels will ensure that the incoming air does not have to be dehumidified as much. Also, enthalpy wheels generally have a higher recovery effectiveness than most sensible heat recovery systems so you can set this as high as 0.7 like so:\n\n\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/7XbQiMj5TFOoOuwzvsQraPAt*LjF4XIx9efegYdoxjIcPMc7RZCkcnxysKk0Zx690SETld3DzKClf412nf91Lgm-5tNFB33K/EnthalpyWheelHeatRecovery.JPG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/7XbQiMj5TFOoOuwzvsQraPAt*LjF4XIx9efegYdoxjIcPMc7RZCkcnxysKk0Zx690SETld3DzKClf412nf91Lgm-5tNFB33K/EnthalpyWheelHeatRecovery.JPG)\n\nThe COP is ignored when using ideal air systems and the \"Assign HVAC System\" should give you a warning about this.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "June 13, 2017 at 12:29pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nChris,\n\nThanks so much for the detailed reply.\n\nAs you suggested, I'm modeling hot-water separately now, and though it is fractional when cooling/lighting/equipment loads are set to normative values for current standards, when you push towards passive house standards it becomes a fairly large number. We're also interested in understanding the impact of new, highly efficient heat-pump water heaters. There is one that uses CO2 as a refrigerant with a COP of about 5 if I remember correctly. As a follow up question, do you know of any good resources for calculating equipment loads based on per appliance level details? (Online calc, or books?) We want to project the potential equipment loads from advances in efficiency (where we think they may occur) in future decades. We've done this fairly easily for lighting, but getting good numbers for stoves, laptops, etc., is not as clear-cut.\n\nRegarding heat recovery, I agree that we should be saving a fair amount on cooling (and non on heating), especially because we are setting ACH to about 0.35 (which is the local minimum requirements for new construction). I will look more into it and get back if the numbers continue to not make sense.\n\nI understand and expect the COP to be ignored since we're using ideal air loads. I am adding 5% after our COP division to try and be conservative on the actual impact. I know real-world systems will not behave as efficiently as ideal air load models.\n\n\n\nThanks again Chris.\n\n\n\nBest, David\n", "attachments": [], "created_by_name": "David Birge", "created_at": "June 17, 2017 at 4:32pm", "created_by": "DavidBirge", "replies": []}]}]}