{"body": "\nHi,\n\nThis is going to be a bit long ... sorry for that.\n\n\n\nI'm asking additional outputs that HB is not providing:\n\n1. Surface Shading Device Is On Time Fraction (i want to know when the blinds are activated, when i am defining the condition as radiation hitting on the window - W/m2)\n\n2. Surface Outside Face Incident Solar Radiation Rate per Area (i want to check the radiation hitting the surface).\n\nSo far so good.\n\n\n\nNow i want to plot in 3DChart what is going on regarding the previous outputs for each surface in my geometry (This is a simple octogon, with a window on each surface).\n\n\n\nI'm having 2 issues (see numbers 1, 2 in attached file):\n\n1. Issue 1 is related to the output of the \"Shading Device on\". This is not a standard HB output. On its header one of the lines is missing data (empty line). As a result when i connect the output to the 3DChart i get the following (See 1b and 1c in file):\n\n1. Solution exception:'NoneType' object has no attribute 'Geometry'\n\nTraceback:<br/>  line 585, in main, \"&lt;string&gt;\"<br/>  line 693, in script<br/>  line 2955, in text2srf, \"&lt;string&gt;\"<br/>  line 2890, in createLegend, \"&lt;string&gt;\"\n\nIf i build the header giving some string to the missing line, then the chart is produced (see 1a).\n\n2. Issue 2 is related to the the ConditionalStatement input. I want to filter values according to the incident radiation per facade. Inputting all facades to the same 3DChart filters according to the first surface. All other surfaces data are filtered according to the first one. So i solved this giving individual 3DCharts, one per facade (See 2 in file).\n\n\n\nThanks,\n\n-A.\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1767631", "name": "06_d-RadiationAnalysis_Octogon_CheckHourlyRadOnSurface45282.gh"}], "created_by_name": "Abraham Yezioro", "created_at": "June 11, 2017 at 3:49am", "created_by": "AbrahamYezioro", "topic": "Additional Strings and 3DChart issues", "replies": [], "id": "1767632"}