{"body": "\nHI Folks,\n\n\n\nWhat would be the best way to study the impact of applying solar film inside a window?\n\n\n\nI am thinking adding a brep (maybe using a HB context shading) and locating it in the same plane as the glass and adjusting the transparency of the brep material.  Although I plan to apply the film on the inside of the window, I feel the effect would be as if the glazing and film are in plane.  Would this be a right assumption?\n\n\n\nThanks,\n", "attachments": [], "created_by_name": "Ibby", "created_at": "June 19, 2017 at 12:42pm", "created_by": "Ibby", "topic": "BEST WAY TO TEST IMPACT OF SOLAR FILM", "replies": [{"body": "\nHi Ibby, You need to be more specific to get help on this question. Here is a couple to start:\n\n\n\n1. Is it a daylighting study or energy or both?\n\n2. If daylighting, is it an annual study?\n\n3. What are the information that you have about the solar film?\n\n\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "June 19, 2017 at 2:00pm", "created_by": "MostaphaSadeghipour", "replies": [{"body": "\nHi Mostapha,\n\n\n\nI have some large windows (double height volume space) facing west and are getting baked by radiation in the summer due to solar radiation.  Replacing glazing would be too expensive.  I am thinking of applying film.  I have seen some decorative/ frit like films. See link to one of the designs below.  But before making the decision to buy and install the film.  I am looking for Honeybee data to guide my decision.\n\nI am assuming this film has 50 % opacity (dot frit ratio). I plan to model the frit as a surface and run **both daylight and energy studies.**\n\nFor Daylight I am thinking couple of hourly studies with radiance should give me a good idea of the resulting reduction in illuminance and solar radiation.  I did not think of running an annual study but may be I will run one.\n\nFor the energy model I am not very sure hence the post on the forum. I was thinking adding a brep (maybe using a HB context shading) and locating it in the same plane as the glass. Although I plan to apply the film on the inside of the window, I feel the effect would be as if the glazing and film are in plane.  Would this be a right assumption\n\nI did some shading studies with location of the brep.  I find that if brep is located outside the window I see huge reduction in cooling load.  if brep is located in-plane with the glazing, i see some reduction in cooling load.  if brep is located inside the glazing, i don't see any reduction in cooling load. Hence i am confused as all the film manufacturers say there will be significant reduction in cooling load.  Any advise would be helpful.\n\nThanks,\n\n[https://www.decorativefilm.com/3m-fasara-sh2fgim-illumina-50-high](https://www.decorativefilm.com/3m-fasara-sh2fgim-illumina-50-high)\n", "attachments": [], "created_by_name": "Ibby", "created_at": "June 19, 2017 at 2:23pm", "created_by": "Ibby", "replies": []}]}], "id": "1771267"}