{"body": "\nHello All, back again with what I hope is a simple question, but I have not been able to find a similar thread in this forum.\n\nI am trying to assign certain internal walls as AIR WALL, but I'm running into two problems:\n\n1) The SolveAdj component is assigning the internal ceilings as AIR WALL too, which I don't want; and\n\n2) I can't figure out how to assign only some internal walls as AIR WALL.\n\nI only want the walls between conditioned zones to be AIR WALL.  I separated out my conditioned and unconditioned spaces and tried a two-step SolveAdjacency process, but then it thinks some internal walls are external walls, which I also don't want.  I tried using the setEPZoneIntCnstr component, but when I label surfaces from it, it doesn't appear to have changed anything.  I also just can't figure out how to select only adjacent conditioned surfaces to change.\n\nI have attached my GH file with notes about what is happening when. Would appreciate any assistance on this!  Thank you!!\n\n\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1775908", "name": "170629_AirWallQuery.gh"}], "created_by_name": "Priya Gandhi", "created_at": "June 28, 2017 at 8:19pm", "created_by": "PriyaGandhi", "topic": "Air walls getting erroneously assigned to internal ceilings?", "replies": [{"body": "\nI will admit that I am just a beginner, but, I would look into creating more detailed zones from surfaces as in Chris Mackey's youtube videos. With that work-flow you can just intersect/split the shared surfaces and manually assign their properties. \n\n\n\n\n", "attachments": [], "created_by_name": "daviduburke", "created_at": "June 28, 2017 at 9:24pm", "created_by": "daviduburke", "replies": []}, {"body": "\nHi priya,\n\nYou need to separate every floor's zones to assign only walls as Air walls before SolveAdjacencies.\n\nPlease find attached.\n\nOmid.\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1775957", "name": "170629_AirWallQuery OMD.gh"}], "created_by_name": "Omid Rashidi", "created_at": "June 28, 2017 at 9:32pm", "created_by": "OmidmRashidi", "replies": [{"body": "\nThank you so much, Omid!  I did not know about some of these components, so this was super helpful!\n", "attachments": [], "created_by_name": "Priya Gandhi", "created_at": "June 30, 2017 at 7:44pm", "created_by": "PriyaGandhi", "replies": []}]}]}