{"body": "\nHello, I'm trying to enter custom set point schedules so that my building is only conditioned during occupied hours.  After combing through these forums I tried multiple methods, but I'm still getting results that show heating loads when the building is unoccupied.\n\nI only want to condition the building from 8 am to 8 pm Monday-Friday.  I've been focusing on the heating set points to troubleshoot my issue.\n\nThe main two methods I have tried:\n\nAs a final option, under method #1 I created a heating set point schedule with all hours at 0 to see if I could at least get the heating turned off all the time, but nope!  I still got some hours with heating, although the zone temperature was always well above 0.\n\nI feel like I'm missing something very basic here!  Is there another method to set an HVAC on/off schedule?  I'm not getting any errors, so it's hard for me to know where exactly I'm making a mistake.  I've attached my GH file with some notes.\n\nThank you!!\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1777017", "name": "170701_HVACSchedError.gh"}], "created_by_name": "Priya Gandhi", "created_at": "July 1, 2017 at 4:49am", "created_by": "PriyaGandhi", "topic": "Having trouble properly setting the heating/cooling set point schedules", "replies": [{"body": "\nJust wanted to update that the problem appears to be fixed!  Although I'm not entirely sure what the original issue was.  I rebuilt my model step-by-step, testing outputs along the way.  When I connected the heating and cooling set point schedules this time, they were applied properly and the results show no conditioning outside of occupied hours.  I used identical schedules &amp; set points.  The only difference between the original and updated model is that I simplified the geometry for fewer zones.  I'm not sure why that would have affected assigning schedules.  Nevertheless, I'm happy that it is working!\n", "attachments": [], "created_by_name": "Priya Gandhi", "created_at": "July 2, 2017 at 3:29am", "created_by": "PriyaGandhi", "replies": []}]}