{"body": "\nHi all,\n\n\n\nI'm sure this is a very simple question, but why isn't my baked ladybug radiation analysis layer in Rhino rendering? The rest of my model renders, but the heat map produced by the radiation analysis component doesn't appear. The layer is turned on and visible (even when in 'rendered' view mode) but disappears when I actually render an image.\n\n\n\nI've trawled the forums and google but can't seem to find anything.\n\n\n\nThanks in advance.\n\n\n\nWigg\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1782434", "name": "Issue.PNG"}], "created_by_name": "T Wigg", "created_at": "July 11, 2017 at 9:48am", "created_by": "TWigg", "topic": "Ladybug Radiation Analysis layer not rendering?", "replies": [{"body": "\nI've read that it's necessary to assign a material in order for the layer to render but many of my other layers do not have materials assigned and are still visible. Also, would adding a material not lose the heat map I'm trying to render?\n", "attachments": [], "created_by_name": "T Wigg", "created_at": "July 11, 2017 at 9:50am", "created_by": "TWigg", "replies": [{"body": "\nIf you are doing an irradiance study, the values that you are mapping on your image pertain to the radiation incident on the surfaces and not exitant (ie radiating out from the surface, in which case the properties are relevant).\n", "attachments": [], "created_by_name": "Sarith Subramaniam", "created_at": "July 11, 2017 at 11:14am", "created_by": "sarith", "replies": []}, {"body": "\nHi Sarith,\n\n\n\nMany thanks for your reply. Rendering is new to me and I'm not sure I fully understand it. I simply want the coloured heat map, which represents incident radiation, to render on top of the building massings such that they can be included in a report to comment of the viability of putting PV on the roofs. At the moment, the buildings are rendering, but the radiation analysis is not. Is there a simple fix or workaround for this?\n\n\n\nThanks.\n", "attachments": [], "created_by_name": "T Wigg", "created_at": "July 12, 2017 at 1:57am", "created_by": "TWigg", "replies": []}, {"body": "\nHi,\n\nDid you try baking the colored meshes (heatmaps) generated by grasshopper/Honeybee into Rhino? It seems to me that radiation results only exist as Grasshopper objects right now. It would be helpful for me and others to offer some suggestions if you can include the Grasshopper (and Rhino) file with your reply.\n\n\n\nSarith\n", "attachments": [], "created_by_name": "Sarith Subramaniam", "created_at": "July 12, 2017 at 8:18am", "created_by": "sarith", "replies": []}, {"body": "\nI'm also not sure what is the question here. But in case it is what Sarith writes, i suggest looking at Antonello's component: LB_Texture Maker.\n\nThere is some example on the discussion or even better on hydra. So look for it.\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "July 12, 2017 at 8:26am", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nFor what i said, check these links [1](http://www.grasshopper3d.com/group/ladybug/forum/topics/release-notes-ladybug-0-0-64-and-honeybee-0-0-61?page=2&amp;commentId=2985220%3AComment%3A1765750&amp;x=1#2985220Comment1765750) and [2](http://www.grasshopper3d.com/group/ladybug/forum/topics/ladybug-texture-maker-export).\n\nThere you'll find the answers how to render the simulated results.\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "July 12, 2017 at 11:58am", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nHi Sarith,\n\n\n\nThanks for your response. Unfortunately the massing I'm working on is confidential so I'm unable to share that, but please find attached a Rhino file and GH canvas demonstrating the same issue. I'm baking the coloured mesh onto the Rhino model but it's not appearing when rendering. I'm sure it's probably something basic but I'm not as literate as I'd like to be.\n\n\n\nIf you wouldn't mind answering another question too: do you have the same issue with the analysis hanging and never completing when you reduce the grid size down to less than 0.25m? A 0.5m grid completes in less than a minute on my machine, but a 0.1m grid was left overnight and just hogged 90% of my RAM and never completed. I wonder if it's something fundamentally wrong with my canvas or whether I just don't have enough computer.. what's strange is after a few minutes the processor use drops down to &lt;5% but the memory use stays up at 90%+ no matter how long it's left.\n\n\n\nThanks very much for your help, I really appreciate it and I apologise as I realise my questions are probably trivial compared to what you are used to answering.\n\n\n\nWigg\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1782702", "name": "Basic Dense Massing.3dm"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1782703", "name": "20170303-Radiation Analysis + Shading-v1.gh"}], "created_by_name": "T Wigg", "created_at": "July 12, 2017 at 8:46am", "created_by": "TWigg", "replies": []}, {"body": "\nHi Wigg,\n\n\n\nThe True option for bakeIt_ bakes a colored hatch. If you set the option to 2 instead, you'd mostly likely get the result you are looking for. See the screencap below.\n\n[<img class=\"align-left\" src=\"http://api.ning.com:80/files/n0YUr5BV56RiC7w4P07Vwru6Gj7zmqC44G1NEvj9lOiqfaMcH*QJxHMHS0WID9LfgoSuYOVbZwkRGWbEMXD3Nuhpk7rFcw9Y/exampleBake.png?width=721\" width=\"721\"/>](http://api.ning.com:80/files/n0YUr5BV56RiC7w4P07Vwru6Gj7zmqC44G1NEvj9lOiqfaMcH*QJxHMHS0WID9LfgoSuYOVbZwkRGWbEMXD3Nuhpk7rFcw9Y/exampleBake.png)\n\n\n\nThe grid size is almost inversely proportional to the number of faces created for analysis. In your model, for a gridsize of 6, I get  100 faces. For a gridsize of 1 it is around 3700 faces, 0.5 - 15000 faces etc. So, a gridsize of 0.1 is likely to be around 370000 faces (which probably accounts for why your runtime and computational cost is so high). Considering that the cumulative sky model that generates these results resolves to 145 or 577 luminous patches only, at some point you'd start getting diminishing results from increasing the grid-sizes.\n\n\n\nSarith\n", "attachments": [], "created_by_name": "Sarith Subramaniam", "created_at": "July 12, 2017 at 12:00pm", "created_by": "sarith", "replies": []}]}]}