{"body": "\nHi\n\nIm looking forward to monitoring a surface temperature contour, within a space not on its walls, what should i do for that? \n\nthanks,\n", "attachments": [], "created_by_name": "Ehsan Fouladi", "created_at": "July 17, 2017 at 12:08am", "created_by": "EhsanFouladi", "topic": "contourmesh component", "replies": [{"body": "\nIf you mean you want an MRT map, you want to use microclimate maps:\n\n[http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;for...](http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;fork=hydra_2&amp;id=Microclimate_Map_-_Simple&amp;slide=0&amp;scale=1&amp;offset=0,0)\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "July 17, 2017 at 7:22pm", "created_by": "ChrisMackey", "replies": [{"body": "\nThanks Chris ,\n\nAnd im wondering whether it is possible to simulate a wind flow from outside of a building to inside of it? I mean , Is there any possibility for simulating an air flow which moves from interior to exterior of a building (or vice versa) with Butterfly plug in? \n\nThanks a million\n", "attachments": [], "created_by_name": "Ehsan Fouladi", "created_at": "July 19, 2017 at 3:26am", "created_by": "EhsanFouladi", "replies": []}, {"body": "\nHi Ehsan,\n\nGenerally speaking, as a first step an outdoor flow analysis is performed. This analysis establishes pressure and velocity at air inlets. As a second step, these pressure and or velocity are taken as boundary conditions to run a separate indoor analysis. I believe both types of analysis are possible with the Butterfly plugin.\n\nThanks,\n\nDevang\n", "attachments": [], "created_by_name": "Devang Chauhan", "created_at": "July 19, 2017 at 10:44am", "created_by": "devang", "replies": []}, {"body": "\nHi Devang\n\nI am working with Ansys and there you just need to define some boundaries as \"Interior\" so the solution comes from outside to inside. Something that may vary within the condition you said is the angle of velocity specially as an transient stream, by the way, have you ever compared the results of Butterfly with a CFD simulation engine for one project?  \n", "attachments": [], "created_by_name": "Ehsan Fouladi", "created_at": "July 20, 2017 at 12:45pm", "created_by": "EhsanFouladi", "replies": []}, {"body": "\nEhsan,\n\nI've lost track of the main question of this discussion but the short answer is that you can model pretty much any incompressible flow simulation that you want with butterfly right now.  Typically, it's easier to just study the outside or inside one at a time but, if what you are studying is the transition between indoors/outdoors, there's no reason why you couldn't model it.\n\nOpenFOAM (the CFD engine under the hood of Butterfly) has been validated extensively and is one of the few CFD engines that has been validated to essentially the same degree that ANSYS has.\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "July 25, 2017 at 10:34pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nHi Chris\n\nI couldnt find my last discussions on my discussion page. Sometimes I lose track of our discussion too.By the way, is it possible to simulate a solar chimney in a windy climate?\n\nThanks.\n", "attachments": [], "created_by_name": "Ehsan Fouladi", "created_at": "July 31, 2017 at 3:23am", "created_by": "EhsanFouladi", "replies": []}]}]}