{"body": "\nHi,<br/><br/>I want to optimize number and locations of luminaire (4 parameters) in MOGA. Locations can be achieved because there is _ptList in HB_Luminaire Zone component.\n\nBut how about the number of luminaires? Also, the points of each new added luminaires should be different and should be able to be connected to Octopus' Genome input.<br/><br/>Anybody know how to do this?\n", "attachments": [], "created_by_name": "Albertus Wida", "created_at": "July 17, 2017 at 10:48pm", "created_by": "AlbertusWida", "topic": "How to Optimize Number of Luminaires in MOGA?", "replies": [{"body": "\nThe luminaire component in Honeybee is fairly simplistic and not that suited for such optimization methods (unless you are prepared to wait for the simulations to keep popping on and off!). That being said, I would suggest turning off ambient calculations completely to speed up the process.\n\nOn the issue of optimizing number and locations, in Honeybee the luminaire is specified purely as a function of it's location and is then used in calculations through reverse ray-tracing. So you'd have to devise a way in which you can switch between increasing/decreasing number of points and also moving those points around.\n\nWhat might be more relevant in your case is to use the zonal cavity based Lumen method like the one employed in [Lithonia Photometric Viewer](http://www.visual-3d.com/tools/PhotometricViewer/default.aspx).\n\n[<img class=\"align-left\" src=\"http://api.ning.com:80/files/f*AVq2uXIRQ0rht5N-Y1MuLTM2VyIKWGUo8Se7z3C6NsdY-44WSiiqoutvOZd-1zhyFlaBInk5EufwWxBHf1OnrmlUUoxioa/InkedCapture_LI.jpg?width=721\" width=\"721\"/>](http://api.ning.com:80/files/f*AVq2uXIRQ0rht5N-Y1MuLTM2VyIKWGUo8Se7z3C6NsdY-44WSiiqoutvOZd-1zhyFlaBInk5EufwWxBHf1OnrmlUUoxioa/InkedCapture_LI.jpg)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThere are no grasshopper implementations of this as far as I know. A few years ago I had written such a function in excel to evaluate upto 10,000 luminaire combinations at a time but I never got around to porting it into Honeybee.\n\n\n", "attachments": [], "created_by_name": "Sarith Subramaniam", "created_at": "July 18, 2017 at 12:39am", "created_by": "sarith", "replies": []}]}