{"body": "\nIdeas for using the tools most efficiently to design shading? I am currently working with solargain out from energy plus analysis.\n\n\n\nI feel that this isn't working at a fine enough grain.\n", "attachments": [], "created_by_name": "daviduburke", "created_at": "July 18, 2017 at 12:51pm", "created_by": "daviduburke", "topic": "Best work-flow for addressing solar gain?", "replies": [{"body": "\nIt really depends on what you're trying to achieve. Nevertheless, have you seen [shade benefit elevator workflows](http://hydrashare.github.io/hydra/?keywords=shade%20benefit)?\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "July 19, 2017 at 8:15am", "created_by": "MostaphaSadeghipour", "replies": [{"body": "\nI have a commercial kitchen for a dining hall. I want to minimize solar gain while allowing view as the building is using twice as much cooling energy than heating even in Vermont's cold climate.\n\nI am trying to prove that I am addressing western solar gain through shading.\n", "attachments": [], "created_by_name": "daviduburke", "created_at": "July 19, 2017 at 8:25am", "created_by": "daviduburke", "replies": []}, {"body": "\nThis is an interesting case. Before getting to the radiation analysis you should check the results of the energy analysis and see what is the reason for overheat (which is why you need cooling). Is it because of radiation or the internal load (people, appliances, etc?). When does the space overheat happen? Is there a chance to use free cooling (aka is the outdoor air temperature and humidity good enough at the time that the space overheats)? If you still need to study the radiation and see the effect of your shading design you can use honeybee/radiance and run detailed radiation analysis.\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "July 19, 2017 at 8:38am", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nEnergy shade benefit looks perfect! Thank you\n\n\n", "attachments": [], "created_by_name": "daviduburke", "created_at": "July 19, 2017 at 8:48am", "created_by": "daviduburke", "replies": []}]}], "id": "1785637"}