{"body": "\nHi everyone,\n\n\n\nI have a question regarding the calculation of the mean radiant temperature from the \"MicroclimateMap\" component.\n\n\n\nDoes the MRT from this component take into account the solar reflected radiation from the surrounding buildings ?\n\n\n\nThank you for your help and your answers.\n\nHAMDANI El Mehdi\n", "attachments": [], "created_by_name": "Mehdi HAMDANI", "created_at": "July 24, 2017 at 6:41am", "created_by": "MehdiHAMDANI", "topic": "Solar reflection for mean radiant temperature", "replies": [{"body": "\nMehdi,\n\nVery good question.  The current microclimate maps account for some reflected solar but it's a fairly crude estimation that only accounts for solar radiation reflected off the ground/roof/zone floor towards the occupant (as per the [SolarCal method](http://www.sciencedirect.com/science/article/pii/S0360132314002960) that was recently accepted into ASHRAE-55).  So any surface that is above the plane of the occupant currently does not reflect solar to the occupant. Typically, the effect of these above-occupant surfaces is fairly small but it can be very intense in special circumstances (like the walkie talkie building in London that was able to melt cars with it's parabolic glass facade).\n\nIn the microclimate maps, the reflected solar off of the ground is computed by pulling the solar reflectance off of ground materials in the E+ constructions.  This get's multiplied by the occupant's view factor to the ground (computed in the view factor component) and all of this gets multiplied by the global horizontal solar visible at the occupant location.  Global horizontal solar is estimated through sky view (which accounts for diffuse solar) and direct ray-tracing to the sun position (which accounts for direct solar).\n\nIf you need to model a case like the walkie talkie building, you can check out this thread:\n\n[http://www.grasshopper3d.com/group/ladybug/forum/topics/surface-tem...](http://www.grasshopper3d.com/group/ladybug/forum/topics/surface-temperature-under-reflected-solar-heat-gain)\n\nIt's possible to account for these reflections with Ladybug Tools but the run time can really increase when you need to account for more bounces.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "July 24, 2017 at 10:06pm", "created_by": "ChrisMackey", "replies": []}], "id": "1787985"}