{"body": "\nHello everyone,\n\n\n\nI have been trying for a while now (quite unsucesfully) to make a detailed model following appendix G of ASHRAE 90.1. using honeybee to comply with LEED v3 requirements.\n\n\n\nI´ve been in contact with Anton Szilasi who kindly adviced me to look for other software options more suitable for this kind of model. I just wanted to know if anyone has tried to do something similiar and if someone has any advice. It is a 7 story office building with  4 semi-underground basement levels. \n\n\n\nBest.\n\nArturo Reyes\n", "attachments": [], "created_by_name": "LUIS ARTURO REYES VALENCIA", "created_at": "July 27, 2017 at 3:48pm", "created_by": "LUISARTUROREYESVALENCIA", "topic": "LEED detailed model  appendix G ASHRAE 90.1", "replies": [{"body": "\nHi Arturo, To be able to help with this question you need to be more specific on why you have been unsuccessful for building your model?\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "July 27, 2017 at 5:22pm", "created_by": "MostaphaSadeghipour", "replies": [{"body": "\nHello Mostapha,\n\nThank you for responding.\n\nI started with an overly clomplex model and had lots of trouble with adjacencies. Then it was so big that it just would´t run.  I am trying to simplify it as much as possible to then just write an OSM file to work with it on OpenStudio and see if I can do some studies of a VRF system cooled with either water or air. Also I think I might need to export two OSM files and I´m not sure how to merge them. I saw a thread Chris Mackey posted about doing that in sketchup´s openstudio plugin.  I am not sure if the honeybee-OpenStudio path is a smart way to do a detailed model.\n\nI´m attaching the files in case you want to take a look.\n\n\n\nThanks again\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1789759", "name": "20170607CLE-Simplificado.gh"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1789760", "name": "20170607CLE-Simplificado.3dm"}], "created_by_name": "LUIS ARTURO REYES VALENCIA", "created_at": "July 27, 2017 at 6:47pm", "created_by": "LUISARTUROREYESVALENCIA", "replies": []}]}], "id": "1789743"}