{"body": "\nDear all, \n\n\n\nIs there any LCC tool in LB / HB?\n\n**Life**-**cycle cost** analysis (LCCA) is a tool to determine the most **cost**-effective option among different competing alternatives to purchase, own, operate, maintain and, finally, dispose of an object or process, when each is equally appropriate to be implemented on technical grounds.\n\n\n\nJose L.\n", "attachments": [], "created_by_name": "Jose Luis", "created_at": "August 4, 2017 at 8:15am", "created_by": "JoseLuis573", "topic": "Life Cycle Costs (LCC) in LB", "replies": [{"body": "\nGood question. There was just a performance network on this but it wasn't part of the ladybug tool set. I've yet to watch the video. This is one thing that Sefaira makes very easy to see with its performance/cost charts. \n", "attachments": [], "created_by_name": "daviduburke", "created_at": "August 4, 2017 at 8:24am", "created_by": "daviduburke", "replies": []}, {"body": "\nThere has been discussions to create it on top of honeybee but there is no good open library out there that we could use.\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "August 4, 2017 at 10:22am", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nThe main problem is, as Mostapha said, there is really not enough open data to accomplish this.\n\n\n\nMost of the times someone does get such data they are not so inclined to share.\n\n\n\nHowever, if you have estimates for the products, materials, and constructions you are using in your model you can easily add the LCCA part on top of it with native GH components. I've done a few of those (rudimentary) models myself.\n\n\n\nKind regards,\n\nTheodore.\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "August 6, 2017 at 11:19pm", "created_by": "TheodorosGalanos", "replies": []}, {"body": "\nThanks a lot for your comments. Hopefully in future it would be on HB. \n", "attachments": [], "created_by_name": "Jose Luis", "created_at": "August 8, 2017 at 7:46am", "created_by": "JoseLuis573", "replies": [{"body": "\nEverybody has pretty much made the point already but I just wanted to add that the LCCAs that we do in my office typically take a month or so to assemble primarily because we need a cost estimator to make an inference about the initial cost of materials and labor of construction.  These quantities vary substantially across different locations and time periods so I would not trust any source that argues for one universal cost value of given material for all projects.  I will say that quantifying energy cost savings is pretty straightforward with Honeybee and you can see an example here:\n\n[http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;for...](http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;fork=hydra_2&amp;id=Calculate_Annual_Utility_Bill)\n\nHowever, cost of construction is tough to quantify, which is why there's a whole profession devoted to just that.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "August 12, 2017 at 6:08am", "created_by": "ChrisMackey", "replies": []}]}]}