{"body": "\nHi,\n\nI'm getting this error using the psychometric chart:\n\n1. Comfort polygon has fallen completely off of the psych chart2.\n\nIt happens when i change the clo value to something like 2 or more. The truth is that when i gave a value of 1.886 is ok and 1.887 is not (metabolic = sitting).\n\nTrying to see what happens when i wear a high clo value (while sitting).\n\n\n\nAlso wanted to ask if how i can combine sitting, standing, sleeping with clo values of 0.6, 1, 3. See images.\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/mF32r5guwc3hEDk-BE2DhyjEsxmKCu5TsQWzvCa-4LTrDIjZL2*i94p9ziZCsACG969HhIaCZP8EvedSXGeLfUbkaBKQUQvE/Capture.JPG?width=750\" width=\"750\"/>](http://api.ning.com:80/files/mF32r5guwc3hEDk-BE2DhyjEsxmKCu5TsQWzvCa-4LTrDIjZL2*i94p9ziZCsACG969HhIaCZP8EvedSXGeLfUbkaBKQUQvE/Capture.JPG)[<img class=\"align-full\" src=\"http://api.ning.com:80/files/mF32r5guwc3-NCsp75ikIOU-0S9BcCnUK7Xl9DptW*1Edr67Qw4a1-3uaGYWta-aemSiUf-ujsF7HckNnV7k7cDzqUVDXn3G/Capture1.JPG?width=750\" width=\"750\"/>](http://api.ning.com:80/files/mF32r5guwc3-NCsp75ikIOU-0S9BcCnUK7Xl9DptW*1Edr67Qw4a1-3uaGYWta-aemSiUf-ujsF7HckNnV7k7cDzqUVDXn3G/Capture1.JPG)Also, following this discusion, i wish the issues mentioned there regarding the passive strategies were solved ... unfortunately y understood that they are not.\n\n\n\nThanks,\n\n-A\n\n\n\nThanks,\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "August 21, 2017 at 3:08am", "created_by": "AbrahamYezioro", "topic": "PsyChart error", "replies": [{"body": "", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "August 21, 2017 at 8:06am", "created_by": "ChrisMackey", "replies": [{"body": "\nHi Chris,\n\ni understand.\n\nAbout the passive strategies, i was following [this discussion](http://www.grasshopper3d.com/group/ladybug/forum/topics/passive-strategy-list-psych-chart). I understand that there is still lack of information to understand how ClimateConsultant define some of the strategies (shading, thermal mass, radiation). Still i miss the implementation of such strategies.\n\nThe bioclimatic chart needs also to implement better some of them.\n\nI was sitting with my TA for next semester and we are moving fully to LB. We are trying to have the same \"functionalities\" we had until now with other tools. That's why i'm asking so much. We are trying to set, at the very beginning of the design process the strategies to implement in the project, JUST from the climatic conditions.\n\n\n\nThanks and sorry if i'm messing things here,\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "August 21, 2017 at 8:43am", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nAbraham,\n\nGlad to hear that you are making the full jump to Ladybug and I hope that I can help in the process!\n\nI probably could have been clearer in that previous discussion that the climate consultant strategies that I did not implement on the psych chart were because I thought that the Climate Consultant methods really mis-represented them.  This was definitely the case for the \"shading\" polygon, which never really made sense to me and, in the case of building shading, it is really too orientation-specific to be represented on the chart.  I could imagine psych chart polygons describing the MRT delta of someone sitting in the sun vs shade  but this is probably better represented using two comfort polygons with high/low MRTs (derived from the solar adjusted temperature component) rather than a specific strategy polygon.  Also the natural ventilation polygon in climate consultant seemed to do more damage than it helped.  I always thought the actual \"comfort\" polygon was a better representation of natural ventilation's potential than any other possible strategy polygon.\n\nFor the three strategies that you cite there, we have a \"Thermal Mass + Night Vent\" polygon in the current psych chart (let me know if I'm mis-understanding your \"thermal mass\" reference). I felt that the climate consultant method was a fair here, although it had some important limitations that are built into the psych chart methods.\n\nAs for the last one (passive solar heating), I agree that this should have a spot on the chart.  Now that I've had time to think about it, I can see a good representation of this as long as the user connects up the \"globalHorizontalRadiation\" to the annualHourlyData.  I'll try to implement this as soon as I get the chance (hopefully before the semester starts):\n\n[https://github.com/mostaphaRoudsari/ladybug/issues/412](https://github.com/mostaphaRoudsari/ladybug/issues/412)\n\nAre there any other important polygons that I am missing?  Also, remember that I added some polygons that climate consultant did not have (like desiccant dehumidification and occupant use of fans). Any new ideas for polygons are always welcome.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "August 21, 2017 at 9:23pm", "created_by": "ChrisMackey", "replies": []}, {"body": "\nHi Chris,\n\nSorry for the delayed response.\n\nIt will be great to have the Passive Solar Heating strategy implemented in the chart.\n\nI agree with your comments. Basically when you have to do with actual design. On the other side i see the potential of \"guiding\" designers BEFORE they have any sketch line for the building and they want to understand the potential of the different passive strategies. This is how i relate to the bioclimatic chart. Now i'm in the \"dilemma\" of which chart to use in class. The bioclimatic one is more intuitive but there is a lot of work to do and until now i neglected it since i released it (just a few small fixes). What worries me about this one is that it shows a very high percentage results ofr each strategy (maybe caused by weird weather data). I need to find the time to make this one more consistent and robust.\n\nThe psychometric is nice, less intuitive but more robust (at least for my initial purposes).\n\nIn case you get to implement the passive solar heating i'll probably go for it.\n\n\n\nAs for the shading strategy i understand and agree. I relate to it as a \"statement\" of the importance of the strategy that of course needs to be well checked and refined during the design process.\n\nThe list of the polygons is fine (evaporative cooling, Thermal mass + night vent, Natural vent, and Passive solar heating).\n\n\n\nI'll keep following this discussion and on the github to see if there are some developments.\n\n\n\nThanks. This is an interesting discussion.\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "yesterday", "created_by": "AbrahamYezioro", "replies": []}, {"body": "", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "yesterday", "created_by": "ChrisMackey", "replies": []}, {"body": "\nOnly 5???!! :-)\n\nGreat!! And many thanks,\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "yesterday", "created_by": "AbrahamYezioro", "replies": []}]}], "id": "1801349"}