{"body": "\nDear Ladybug community,\n\n\n\n[After more than a year of development](https://github.com/ladybug-tools/honeybee/graphs/contributors), we are very excited to finally have a public release for Honeybee[+]. As most of you already know by now, Honeybee[+] is one of our [+] developments, which is an attempt to make Honeybee platform-agnostic, cloud-compatible, scalable and more flexible for development. It currently consists of a [core python library](https://github.com/ladybug-tools/honeybee)  and the plugin libraries for [Grasshopper](https://github.com/ladybug-tools/honeybee-grasshopper) and [Dynamo](https://github.com/ladybug-tools/honeybee-dynamo).\n\n\n\nYou can download the plugin for Grasshopper from [food4Rhino](http://www.food4rhino.com/app/ladybug-tools) and install the Dynamo plugin from the package manager. You must install [the latest version of Radiance](https://github.com/NREL/Radiance/releases/tag/5.1.0) to use Honeybee[+].<br/>\n\n\n\nThis current release introduces Radiance-based workflows for daylighting simulations and supports the following simulation types:\n\n\n\nPoint-in-time illuminance (a.k.a grid-based)\n\nPoint-in-time luminance (a.k.a image-based).\n\nDaylight coefficients (both grid-based and image-based)\n\nThree-Phase Method (grid-based implemented, image-based to be added soon)\n\nFive-Phase Method (grid-based implemented, image-based to be added)\n\n\n\n**NOTE: There has been a very recent update to the Five-Phase method which [was presented at the IBPSA2017 conference last week]((https://www.conftool.pro/bs2017/index.php?page=browseSessions&amp;form_session=190#paperID2401). These changes have NOT been implemented in the current release. We suggest the users to use the daylight coefficient recipe for annual metrics, sDA and ASE until we apply the recent changes.**\n\n\n\nWhile many of you will recognize the first three simulation types above as ones that Honeybee has always supported. Image-based daylight coefficients, Three Phase Method and Five Phase Method are increasingly advanced ways of running annual or time-lapse simulations. Tensor Tree based BSDFs, while supported in Honeybee are not featured in any of the example files. We intend to incorporate this functionality in the near future.  The simulation-methods listed above are based-on [empirically validated research conducted primarily by researchers a...](https://github.com/ladybug-tools/honeybee/wiki/Daylight-Simulation-Technical-Literature). There are also some special workflows (which we call recipes!) that make it easier for beginners to use the plugins.\n\nSolar access simulation aka sunlight hours (which employs point-in-time simulation).\n\nDaylight factor simulation (which employs point-in-time simulations).\n\n[Annual] Radiation simulation (which employs daylight coefficients).\n\nAnnual [daylight] simulation (which employs daylight coefficients)\n\n\n\nEnergy simulation features are yet to be implemented in Honeybee[+] so, if you’re using Honeybee mostly for energy modeling you should keep using the legacy version.\n\n<br/>\n\nFrequently Asked Questions\n\n\n\n\n\nHoneybee[+] addresses several limitations of the legacy version of Honeybee and introduces new features which were not available before.\n\n\n\nBroadly speaking, Honeybee[+]:\n\nIs faster than the current annual recipe implementation as we now leverage the Radiance binaries directly instead of using Daysim.\n\nIs more accurate at calculating direct solar contribution.\n\nCan handle BSDF materials (unlike the current Honeybee annual daylight simulation).\n\nCan run sub-annual daylight simulation by generating sub-annual sky matrix.\n\nUses an improved implementation of Radiance’s daylight coefficient based methods by using Radiance utilities for annual simulation.\n\n[Can calculate the contribution of each light source separately both...](https://github.com/ladybug-tools/Honeybee/pull/157).\n\nHas no limitations on the number of window groups and states of dynamic blinds.\n\n\n\nIt also provides a nearly-matching interface for both Grasshopper and Dynamo. There are a few platform specific components / nodes for each plugin but the overall workflow in each interface is the same. Honeybee[+] should also, in theory, work just fine on Grasshopper for Mac, although we admittedly have not tested this yet.  This also means that you should be able to use Radiance’s built-in parallel processing.\n\n\n\nWe strongly encourage our experienced users to start using Honeybee[+] right away. You will enjoy the new features and the flexibility that you have come to love in the current workflow is all still there. The ability to separate the contribution of each window group is also just so cool and useful. If you’re as nerdy about daylight simulation as we are, you don’t want to miss out!\n\nYou can download the installer from Food4Rhino for Grasshopper and Dynamo Package Manager for Dynamo.You can get yourself started with Honeybee[+] using the example files that is part of the installation part until we capture the video tutorials. The example files are commented as much as possible so you can educate yourself in the process. If you are already using Honeybee for Grasshopper, you will know how to use Honeybee[+]. There are a few changes in the post processing components but there is no major change from the current workflow.\n\n\n\nLet us know if you find any bugs or have any suggestions for new features.\n\nFor Grasshopper users, the answer is yes. Honeybee[+] is a totally separate from Honeybee and won’t replace it at least for one year.\n\n\n\nFor Dynamo users, the answer is no. The new package is an improved version of what was available before and is meant to replace it. In other words, the currently available  “Honeybee for Dynamo” is built using the new Honeybee library.\n\n<br/>\n\nA significant portion of the development work for the daylighting methods implemented in Honeybee[+] forms the basis of Sarith’s PhD research. His dissertation, titled “Parametric Modeling Strategies for Efficient Annual Analysis of Daylight in Buildings”, is expected to be available publicly in early 2018. For the time being, we encourage you to refer the slides of this  [Radiance workshop presentation from 2016](https://www.radiance-online.org/community/workshops/2016-padua/presentations/213-SadeghipourSubramaniam-AutomatingWorkflows.pdf).\n\n\n\nFor those interested in learning more about the Radiance-based methods implemented in Honeybee[+], a comprehensive tutorial for Radiance will be released by LBNL in the coming weeks.\n\nVery soon we will compile all the discussions in [our new discussion forum](http://discourse.ladybug.tools/). It is invite only at this point until we move all the current discussions to the new forum. Meanwhile:\n\n\n\nPost comments and questions about the Grasshopper plugin to the [Grasshopper forum](http://www.grasshopper3d.com/group/ladybug/forum).\n\nPost comments and questions about the Dynamo plugin to the [Dynamo forum](https://forum.dynamobim.com/) and tag it under Honeybee.\n\nFor bugs in the core library, please open an issue on [“Honeybee” repository on GitHub](https://github.com/ladybug-tools/honeybee).\n\nFor plugin specific bugs, please open an issue on [Honeybee-grasshopper](https://github.com/ladybug-tools/honeybee-grasshopper) or [Honeybee-dynamo](https://github.com/ladybug-tools/honeybee-dynamo) GitHub pages.\n\nThe Room To HBZones component for Dynamo is doomed to fail for complex cases. In those cases use Dynamo’s select item(s) nodes to bring the geometries to Dynamo and create Honeybee surfaces. Also [vote up this feature request which will fix this bug if you haven’t...](http://forums.autodesk.com/t5/revit-ideas/api-access-to-room-openings-geometry-and-materials-in-revit/idi-p/6642406)! This will hopefully be the last release that we are still waiting for Autodesk help. If it doesn't happen the next move is to write a more solid solution to address this issue.<br/>\n\n\n\nThis is the first release. However, we have tested the workflow as much as we could and have checked the results against the original Honeybee and other Radiance-based workflows bugs are expected. Double check the results of each study and let us know if you found any bugs.<br class=\"kix-line-break\"/><br class=\"kix-line-break\"/>NOTE: As many of you know by now, Radiance employs a combination of deterministic and  stochastic methods for calculations. For this reason, the results you get from running the same Radiance simulation will be slightly different for each run by a small margin of error (this should be less than 10%).\n\n\n\nExcept for the cloud computing support! We have reached all of the [other major goals that we had for 2016-2017](http://www.grasshopper3d.com/group/ladybug/forum/topics/ladybug-analysis-tools-in-2017). For the rest of the year we will try to address the items below:\n\nDocumentation of the [+] developments. We need to document the current development and get more of the contributors up to speed with the new development.\n\nRelease a new version of Butterfly to support the latest release of OpenFOAM and docker-less installation for Windows 10.\n\nCloud computing service for Butterfly and Honeybee\n\n\n\nFinally we will have a number of major announcement about the future of Ladybug Tools soon! Stay tuned!\n\n\n\nMostapha on behalf of Ladybug Tools development team\n\n\n\nNote added by Sarith:\n\n\n\n\n\nOn the cross-platform aspect, to add to Mostapha's release notes, the [core library](https://github.com/ladybug-tools/honeybee) has been tested on the following platforms:\n\n\n\nLinux Ubuntu: Version 14.04 | 16.04 | 17.04\n\n\n\nLinux RHEL: 6.8\n\n\n\nUnix FreeBSD: 10.0\n\n\n\nLinux (Cloud VM):  [Microsoft Azure H16mr](https://docs.microsoft.com/en-us/azure/virtual-machines/windows/sizes-hpc) running Ubuntu 17.04\n\n\n\nLinux (Cloud VM): [Amazon AWS EC2 t2](https://aws.amazon.com/ec2/instance-types/) running Ubuntu 14.04\n\n\n\nThe core dependencies for running Honeybee on the cloud are Python 2.7, Radiance, git and honeybee . Since Apple computers typically run Unix-like OSs, we don't foresee any portability issues with them.\n\n\n\n\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "August 23, 2017 at 2:10am", "created_by": "MostaphaSadeghipour", "topic": "Honeybee[+] 0.0.3 Release Notes for Grasshopper and Dynamo", "replies": [{"body": "\nThank you guys for such an amazing work, once again :) Conrats :) \n", "attachments": [], "created_by_name": "Peter Zaťko", "created_at": "August 23, 2017 at 2:31am", "created_by": "PeterZatko", "replies": []}, {"body": "\nVery interesting, thank you for the release of Honeybee[+]!! \n\nIs it possible to get an explanation of the installation procedure?\n\nI have few questions:\n\n- do I need to copy the userObjects in the relative GH folder? Together with the other Honaybee and Ladybug .ghuser files.\n\n- or running the installer from the .gh file is enough?\n\n- do we need to do something specific with the python files in the honeybee and ladybug folders? Or are they the installation files that are automatically installed through the installer?\n\n- why there is also a ladybug folder?\n\n- since it is possible to keep installed both Honeybee and Honeybee[+] and the latter use Radiance 5.1.0 we need/can keep also both the version of radiance installed? I think not because the folder name should be C:\\Radiance in any case. This means that also Honeybee works with Radiance 5.1.0?\n\n\n\nBest,\n\nFrancesco\n\n\n", "attachments": [], "created_by_name": "Francesco De Luca", "created_at": "August 23, 2017 at 4:17am", "created_by": "FrancescoDeLuca", "replies": [{"body": "\nDear Francesco,\n\nFor your last point, I think you can run both Honeybee and Honeybee[+] with the latest updated Radiance 5.1.0 version. Honeybee[+] just provides us with a grasshopper interface to leverage the advanced utilities of the latest Radiance version, whereas normal Honeybee legacy version is an interface for the more standard workflow for traditional features of Radiance/Daysim.\n", "attachments": [], "created_by_name": "Mohammad Hamza", "created_at": "August 23, 2017 at 7:20am", "created_by": "MohammadHamza", "replies": []}, {"body": "\nHoneybee[+] has its own tab, so no problem with that.\n\nMy question now is regarding the Radiance version.\n\nV5.1 default is to be installed in ProgramFiles (instead of C:). Is this ok or it has to be in C?\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "August 23, 2017 at 7:39am", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nThank you for the reply.\n\nFrancesco\n", "attachments": [], "created_by_name": "Francesco De Luca", "created_at": "yesterday", "created_by": "FrancescoDeLuca", "replies": []}, {"body": "\nHi Francesco, Mohammad and Abraham, Thank you for the nice comments.\n\n\n\n- The installer takes care of copying both the libraries and the userobjects.\n\n- Honeybee[+] has dependencies on Ladybug[+]. That's why there is also a folder for ladybug.\n\n- Both the legacy version and the new release works with latest release of the radiance. As a matter of fact any release after version 5.0.a.11 is good. [We found a bug](https://unmethours.com/question/17201/rcontrib-misses-one-of-the-modifiers-if-number-of-modifiers-between-240-420/?comment=17658#post-id-17658) in radiance during the development which is fixed in 5.0.a.11 release.\n\n\n\nPS: I updated the installation files to include the sample files. You can also find them [here](https://github.com/ladybug-tools/honeybee-grasshopper/tree/master/plugin/grasshopper/sampleFiles).\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "August 23, 2017 at 9:58am", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nHello Mostapha,\n\nthank you for the clarifications.\n\n\n\nBest,\n\nFrancesco\n", "attachments": [], "created_by_name": "Francesco De Luca", "created_at": "yesterday", "created_by": "FrancescoDeLuca", "replies": []}]}, {"body": "\nBrilliant work as always! I'll dive into the code right away while patiently waiting for the documentations for other developers to contribute :)\n\n\n\nBtw, there's a bug with the automatic installer but I'll copy them manually for now since I'm way too excited to not start at once.\n\n\n\nRuntime error (Win32Exception): WindowsError<br/>Traceback:<br/> line 247, in rmtree, \"c:\\Program Files\\Rhinoceros 5 (64-bit)\\Plug-ins\\IronPython\\Lib\\shutil.py\"<br/> line 223, in onerror, \"c:\\Program Files\\Rhinoceros 5 (64-bit)\\Plug-ins\\IronPython\\Lib\\shutil.py\"<br/> line 249, in rmtree, \"c:\\Program Files\\Rhinoceros 5 (64-bit)\\Plug-ins\\IronPython\\Lib\\shutil.py\"<br/> line 244, in rmtree, \"c:\\Program Files\\Rhinoceros 5 (64-bit)\\Plug-ins\\IronPython\\Lib\\shutil.py\"<br/> line 244, in rmtree, \"c:\\Program Files\\Rhinoceros 5 (64-bit)\\Plug-ins\\IronPython\\Lib\\shutil.py\"<br/> line 244, in rmtree, \"c:\\Program Files\\Rhinoceros 5 (64-bit)\\Plug-ins\\IronPython\\Lib\\shutil.py\"<br/> line 62, in installHoneybeePlus, \"&lt;string&gt;\"<br/> line 87, in script\n", "attachments": [], "created_by_name": "Pin", "created_at": "August 23, 2017 at 5:50am", "created_by": "Pin", "replies": [{"body": "\nThanks Mostapha!!\n\nSo many good news in so short period of time. Great!!!\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "August 23, 2017 at 6:49am", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nHi Pin! Thanks. Seems the issue happens during removing the files. I can add an exception there in case other people also face this issue.\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "August 23, 2017 at 10:01am", "created_by": "MostaphaSadeghipour", "replies": []}]}, {"body": "\nThank you so much guys! Incredible work and hats off to the entire development team!!!\n", "attachments": [], "created_by_name": "Mohammad Hamza", "created_at": "August 23, 2017 at 7:21am", "created_by": "MohammadHamza", "replies": []}, {"body": "\nWow! Thank you Mostapha for the great news.\n", "attachments": [], "created_by_name": "Omid Rashidi", "created_at": "August 23, 2017 at 10:53am", "created_by": "OmidmRashidi", "replies": []}]}