{"body": "\nHi,\n\nJust wondering if you have some hints regarding simulating lightshelves in E+ (without using daylight simulations. Just plain E+)?\n\nSay i have the geometry of the LS fitting the window and i know the window and the zone to be applied.\n\nI'll appreciate your ideas.\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "August 29, 2017 at 6:03am", "created_by": "AbrahamYezioro", "topic": "Lightshelf in E+", "replies": [{"body": "\nHi Abraham,\n\nLight shelves are really starting to hit the limits of E+ because the best E+ solar distribution calculation option is really only able to model a single light bounce on the exterior.  It doesn't model any reflections on the interior, although E+ does decide how to distribute the interior solar between the surfaces of the zone using the angle at which the exterior light enters. So, when modeling an exterior light shelf, you will be able to account for the exterior light bouncing off the top of the light shelf into the window above the light shelf.  However, there will be no accounting for the effect of light bouncing off the ceiling of the zone to the other interior surfaces of the zone.  To account for an effect like this, you really need to run an annual daylight simulation with Radiance as you have mentioned.\n\nMore info on the assumptions of the E+ solar distribution calculation can be found here in the E+ input output reference:\n\n[http://bigladdersoftware.com/epx/docs/8-0/input-output-reference/pa...](http://bigladdersoftware.com/epx/docs/8-0/input-output-reference/page-006.html#field-solar-distribution)\n\n\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "yesterday", "created_by": "ChrisMackey", "replies": [{"body": "\nHi Chris,\n\nYes. I know the limitations of the E+ daylight models and i know coupling Radiance and E+ is the way to go. I'm just now in a case that i \"have\" to deal only with E+.\n\nFrom [this reference](http://bigladdersoftware.com/epx/docs/8-0/input-output-reference/page-016.html#daylightingdeviceshelf) i see that in effect E+ accounts only for the ceiling reflection (but no mutual surface reflections).\n\nMy question was more related to the technical procedure to be done in HB to include the lightshelf in the calculation.\n\nWhile i'm writing this i see that it will be pretty much complicated. For the LS to be defined i need to divide the window in two parts (upper and lower) in addition to all other definitions\n\nWell. I'll drop this for now.\n\nThanks for the help.\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "yesterday", "created_by": "AbrahamYezioro", "replies": []}]}]}