{"body": "\nHey guys\n\n\n\nI was wondering if the \"PETComfRecipe\" is implemented with the mPET (Chen, Y. &amp; Matzarakis, A. - 2014) or the original PET (Hoppe, P.)? \n\n\n\nThanks!\n", "attachments": [], "created_by_name": "Christian Kongsgaard", "created_at": "August 29, 2017 at 2:08am", "created_by": "ChristianKongsgaard", "topic": "PETComfRecipe - PET or mPET?", "replies": [{"body": "\nHi Christian,\n\n\n\nIf Djordje Spasic is around on the forums, he is the most qualified to answer this one since he added the functions to calculate PET, which are used both by the Ladybug_Thermal Comfort Indices component and the Honeybee PET comfort map recipes.\n\n\n\n For the time being, I can point you to Djordje's contributed code to calculate PET here:\n\n[https://github.com/mostaphaRoudsari/ladybug/blob/master/src/ladybug...](https://github.com/mostaphaRoudsari/ladybug/blob/master/src/ladybug_ladybug.py#L5215-L5511)\n\n\n\nYou see at the top that he references Peter Hoeppe so it's looking probable that Ladybug is using the original PET.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "yesterday", "created_by": "ChrisMackey", "replies": [{"body": "\nThanks for the clarification Chris! Yes it certainly looks like only the original model has been implemented.  \n\nIs it possible to wish for the mPET to be implemented?\n", "attachments": [], "created_by_name": "Christian Kongsgaard", "created_at": "yesterday", "created_by": "ChristianKongsgaard", "replies": []}, {"body": "\nHi Christian,\n\nChris already gave the answer to your question. Thank you Chris!!\n\nAs for the mPET: it would require complete understanding of each line of code of the original Hoeppe's PET code, and the understanding of mPET's YCC model and its [implementation](http://www.urbanclimate.net/matzarakis/papers/15_chen.pdf) in original PET<br/>I must admit, I am not the right person who can do this.\n\nFor simplified analysis, and if you would like to use mPET for academic/scientific purposes, you can contact Profesor Matzarakis at the email addresses provided on his [university page](http://www.urbanclimate.net/rayman/rayman.htm).<br/>He will send you the newest version of Rayman software for free, which among other Thermal Comfort indices, includes mPET.\n\nSorry if this was not the answer that you were expecting.\n", "attachments": [], "created_by_name": "djordje", "created_at": "yesterday", "created_by": "djordje", "replies": []}]}], "id": "1805397"}