{"body": "\nHi there,\n\n\n\nDo you ever tested what´s the maximum amount of points for the multi-phase calculations ? I tested a huge one -with 50K points, and the simulation went fluently but after it was done, GH and Rhino just froze for 12h, and then I just killed it.\n\nI have  32GB RAM , so it´s not really normal for it to froze. \n\n\n\nBest,\n\nPeter \n", "attachments": [], "created_by_name": "Peter Zaťko", "created_at": "August 30, 2017 at 1:20am", "created_by": "PeterZatko", "topic": "Maximum amount of points to calculate for HB[+]", "replies": [{"body": "", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "11 hours ago", "created_by": "ChrisMackey", "replies": [{"body": "\nHi Cris,\n\nYes, it has everything, I also ran it on Linux-CentOS, and tried to \" load back in\", but the same waiting time. I can´t upload the files anywhere cause it´s 45 GB.\n\nSorry to already pushing the boundaries of the tool :) \n\n\n\nBest,\n\nPeter\n", "attachments": [], "created_by_name": "Peter Zaťko", "created_at": "10 hours ago", "created_by": "PeterZatko", "replies": []}]}, {"body": "\nHi Peter,\n\n\n\nWhich analysis recipe are you using? There are differences on how Honeybee[+] loads the results based on the recipe.\n\n\n\nFor most of the recipes Honeybee[+] loads 2 * number of hours * number of blind state for each test point. The 2 is there because it loads the results for total and direct contribution separately. If you don't have dynamic blinds use the Annual recipe which is a flavor of daylight coefficient recipe that doesn't load the results to memory and just calculates the annual metrics.\n\n\n\nLet me know what is your goal and we can take it from there.\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "6 hours ago", "created_by": "MostaphaSadeghipour", "replies": [{"body": "\nHi Mostapha,\n\n\n\nSince I´m not using any BSDF for this calc, and have just one state (unshaded)- cause of huge overhangs, I´m using Daylight coefitients. BUT, since I want to show the contribution of each facade + skylight I divided them into groups, that´s the reason of the size + compare the results with Daysim.\n\nIt´s not crucial, I´m just interested where are the limits\n\n\n\nBest,\n\nPeter\n\n\n\n\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1806438", "name": "PZ_DC_gridbased.gh"}], "created_by_name": "Peter Zaťko", "created_at": "5 hours ago", "created_by": "PeterZatko", "replies": []}, {"body": "\nWe can and we will get to the place to handle large files like this. There are a couple of items that needs to be addressed before we get there.\n\n\n\nFor comparison studies to Daysim you should use the Annual Recipe. That is using the daylight coefficient recipe to run the analysis and similar to the Daysim workflow it doesn't load the results for each test point for calculating the annual metrics.\n\n\n\nHere is the good news. If you copy your current files under the annual folder and change the recipe to annual and leave reuseMtx to True the component will read the results without re-running the analysis. That should give you the option to compare the values. No window group is supported though.\n\n\n\nAs I said there are solutions to be developed for specific cases. Keep us posted on your findings, needs and suggestions.\n\n\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "5 hours ago", "created_by": "MostaphaSadeghipour", "replies": []}]}], "id": "1806080"}