{"body": "\nHello Mostapha,\n\nwhen working with the component Ladybug_GenCumulativeSky I get a null result and the report \"epwWeatherFile address is not a valid .epw file\" I downloaded the epw file from the Energy Plus website. There are some known issues about this?\n\nI have downloaded the GenCumulativeSky.exe file manually. It has to be placed in the workingDir or can stay anywhere? The workingDir should contain all or some of the project files?\n\nThank you.\n\n\n\nFrancesco\n\n\n\n\n", "attachments": [], "created_by_name": "Francesco De Luca", "created_at": "May 27, 2013 at 4:00pm", "created_by": "FrancescoDeLuca", "topic": "GenCumulativeSky problems", "replies": [{"body": "\nHi Francesco,\n\nApparently, for some reason the component cannot find the epw file. Are you sure that you are referring to the right address? The address should be to the file and not to the directory.\n\n\n\n[<img class=\"align-center\" src=\"http://api.ning.com:80/files/sqEmYzaj13pTrtNtIir*PrB7ukxQwb2kGAvVVVnhr0NELd7Z2nw16x6IvfA7c7Pg6oeYKyxQZVJC4P*h68SvsEOuuS9RJzQh/gencumulativesky_path.jpg?width=721\" width=\"721\"/>](http://api.ning.com:80/files/sqEmYzaj13pTrtNtIir*PrB7ukxQwb2kGAvVVVnhr0NELd7Z2nw16x6IvfA7c7Pg6oeYKyxQZVJC4P*h68SvsEOuuS9RJzQh/gencumulativesky_path.jpg)\n\nCheers,\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "May 27, 2013 at 4:13pm", "created_by": "MostaphaSadeghipour", "replies": [{"body": "\nHello Mostapha,\n\nthank you. Actually I did to write the right address and file name. Anyway now it worked, could be that before there were not in the same directory of the .epw file also the other files, the .ddy .stat and .txt that comes together when you download it?\n\n\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/BykvwnNi9Lsz*t0tKk-s-Jv9KJabrn3EQLnOqiEV25J53F-yuZ8MCPYMXBxOlRz8Fhx9RzzT0Lje5e4svvDmUuPr91jYOlts/GCS_ok1.png?width=721\" width=\"721\"/>](http://api.ning.com:80/files/BykvwnNi9Lsz*t0tKk-s-Jv9KJabrn3EQLnOqiEV25J53F-yuZ8MCPYMXBxOlRz8Fhx9RzzT0Lje5e4svvDmUuPr91jYOlts/GCS_ok1.png)\n\n\n\nI have one general question: so to perform solar radiation analysis with LadyBug is necessary the weather file .epw, right? This is quite a limitation because for many minor locations it doesn't exist. If I understand correctly this will be not a problem anymore with Honeybee right? (because it uses EnergyPlus I understood, like Diva). When you think you will release Honeybee? Thank you for the work you are doing.\n\n\n\nBest regards.\n\n\n\nFrancesco\n", "attachments": [], "created_by_name": "Francesco De Luca", "created_at": "May 30, 2013 at 4:40am", "created_by": "FrancescoDeLuca", "replies": []}, {"body": "\nHi Francesco!\n\nGood to know that it works now. You don't need to download .ddy and .stat files for GenCumulativeSky. The folder also shouldn't cause any problem since the component checks and downloads GenCumulativeSky to workingDir in case it is not already there.\n\nI agree that it is hard to find .epw file (EnergyPlus Weather file) for many locations. There are websites that you can purchase the weather files for many locations and there are software that generate the data. They may be open to share the data for free for educational purposes.\n\nNevertheless EnergyPlus and Radiance or any interface such as DIVA, OpenStudio, etc on top of these engines need some sort of data to calculate the sky condition and the radiation. Honeybee won't be any different!\n\nI'm so bad in predicting the release time so let me not to do that! :) The only thing that I can say is I'm doing my best to release a test version as soon as possible. I've already solved almost all the technical issues but the workflow is not solid enough for a public release. Thank you for your interest and your patient. :)\n\nBest,\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "May 31, 2013 at 11:37am", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nHello Mostapha,\n\nok then probably was some other reason the previous issue.\n\nDon't worry no need to make predictions for the Honeybee release, it was just to have an idea :) So with Honeybee the installer will set EnergyPlus and Radiance as well? (Like DIVA) About use the epw files the interesting thing is that you can work out analysis in realtime, that's very good.\n\nI appreciate a lot the the LadyBug's direct sunlight hour calculation component. It is the first, at least in my experience, between the different environmantal analysis tools for GH that does this straight and easily. So far I used to calculate with with a whole definition I built.\n\nAbout websites for epw files I usually visit this [http://apps1.eere.energy.gov/buildings/energyplus/weatherdata_about...](http://apps1.eere.energy.gov/buildings/energyplus/weatherdata_about.cfm?CFID=978762&amp;CFTOKEN=93446a83f0be39a4-FF443C22-00F2-ECA9-6896C874CAA44242)\n\nthere are others? What tool you suggest to create weather files? Even if I imagine they should not bee very easy to use. I mean this more for the teaching aspect than for the research one. \n\n\n\nThanks for your work.\n\nBest\n\n\n\nFrancesco\n", "attachments": [], "created_by_name": "Francesco De Luca", "created_at": "June 1, 2013 at 4:38am", "created_by": "FrancescoDeLuca", "replies": []}, {"body": "\nHi Francesco,\n\nSorry to get back to you late!\n\nBack to Energyplus and Radiance I'll probably ask users to download and install them manually. I really like the idea to let the users know what is really happening in the background. I believe the more you know about the workflow the smarter you'll use the tool.\n\nThank you for the comment. If you are extensively using the analysis components let me know and I'll send you a newer version for test which is much faster.\n\nThere are other resources that you can use. Weather Analytics is one of the options [http://www.weatheranalytics.com/weather-products/](http://www.weatheranalytics.com/weather-products/) and White Box Technologies [http://www.whiteboxtechnologies.com/weather_data.html](http://www.whiteboxtechnologies.com/weather_data.html) is another one. I know that in some cases they provide it for free for educational use.\n\n\n\nBest,\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "June 6, 2013 at 5:28pm", "created_by": "MostaphaSadeghipour", "replies": []}]}, {"body": "\nExcuse me.I just study ladybug.And I can't  downloaded the GenCumulativeSky.exe.So where did you get it?Could you send me the soft to my E-mail addressed zsbill@yeah.net?Thank you.\n", "attachments": [], "created_by_name": "Bill Chow", "created_at": "August 10, 2014 at 2:24am", "created_by": "BillChow", "replies": [{"body": "\nHi Bill, Here is the file: [http://dl.dropbox.com/u/16228160/GenCumulativeSky/GenCumulativeSky.exe](http://dl.dropbox.com/u/16228160/GenCumulativeSky/GenCumulativeSky.exe)\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "August 10, 2014 at 11:29am", "created_by": "MostaphaSadeghipour", "replies": []}]}]}