{"body": "\nHello Mostapha,\n\nwhat is for the input Parallel in Sunlight Hours Analysis component?\n\nIt need to be set to True if we have more Sunlight Hours Analysis components (one each object to analyse) working at the same time? Like in the image I attach.\n\nActually i am working on a simulation to find the optimal reciprocal solution of three buildings (using Galapagos) so each time, in each Sunlight Hours Analysis component one building is the geometry and the other two are the context.\n\n\n\nThank you\n\n\n\nFrancesco\n\n\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/NqkuYxlxVg3TKuAfb1asRb-78r8iv4hvNqGJ0s6*I62SxmZgoiP5IEMd4fu1K4QRySPudZ0GMR8XYkEPxxitwgUg-iMpCJrV/Parallel.JPG\" width=\"677\"/>](http://api.ning.com:80/files/NqkuYxlxVg3TKuAfb1asRb-78r8iv4hvNqGJ0s6*I62SxmZgoiP5IEMd4fu1K4QRySPudZ0GMR8XYkEPxxitwgUg-iMpCJrV/Parallel.JPG)\n", "attachments": [], "created_by_name": "Francesco De Luca", "created_at": "June 5, 2013 at 3:28am", "created_by": "FrancescoDeLuca", "topic": "Parallel input in Sunlight Hours Analysis component", "replies": [{"body": "\nFrancesco,\n\nParallel component controls number of cores...so False is one core and True is all cores in your PC\n", "attachments": [], "created_by_name": "Michal Dengusiak", "created_at": "June 6, 2013 at 4:34pm", "created_by": "MichalDengusiak", "replies": [{"body": "\nMichal,\n\nthank you for the info.\n\n\n\nFrancesco\n", "attachments": [], "created_by_name": "Francesco De Luca", "created_at": "June 8, 2013 at 6:25am", "created_by": "FrancescoDeLuca", "replies": []}]}, {"body": "\nMichal is right about the parallel option.\n\nFor the optimization though, if you are using Galapagos (which is a single-objective solver) I'm curious to know why are you calculating the result separately for each skin? I assume you add up the result into a single number. If that is the case you can connect all the geometries to geometry and leave the context input.\n\nYou may also want to try Octopus ([http://www.grasshopper3d.com/group/octopus](http://www.grasshopper3d.com/group/octopus)) and solve it as a multi-objective problem.\n\nApparently you are intensively using the bug these days! That's pretty cool. :) As I said if you want to fully enjoy the use of parallel option let me know to send you a newer version for test.\n\nBest,\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "June 6, 2013 at 5:47pm", "created_by": "MostaphaSadeghipour", "replies": [{"body": "\nFrancesco,\n\nIt seems that we got similar interest in Environmental studies (Ladybug, Galapagos ...or Octopus). Please share if possible your final results and let us know if you managed to achieve your goal,\n\n\n\nMichal\n", "attachments": [], "created_by_name": "Michal Dengusiak", "created_at": "June 7, 2013 at 12:34am", "created_by": "MichalDengusiak", "replies": []}, {"body": "\nHello Michal,\n\nok I will!\n\n\n\nBest\n\n\n\nFrancesco\n", "attachments": [], "created_by_name": "Francesco De Luca", "created_at": "June 8, 2013 at 6:35am", "created_by": "FrancescoDeLuca", "replies": []}, {"body": "\nHello Michal,\n\nas we said few time ago I post a video about the studies i am doing (it is a very short part of all the simulation). The goal is that to find the optimal layout of three buildings inside a plot. The scope is that to have the maximum direct sunlight hours hitting the facades of the three buildings. So I used the Ladubug Sunlight hour component (in the way it is possible to see at the beginning of this post) to obtain the sunlight hours for each building and in each of this one building is the geonmetry and the other two are the context (after that I got to know that it is possible to do everything also with only one component and not three). So I used the Galapagos evolutonary solver used in Maximize mode. I am still working on this, in the videao you can see the three towers ca just shift inside the plot, in a new simulation I am working on they can also rotate.\n\nFrancesco\n\n\n\n<iframe _origwidth=\"420\" frameborder=\"0\" height=\"315\" src=\"//www.youtube.com/embed/HMOKcO_KNJU?wmode=opaque\" width=\"420\"></iframe>\n\n\n \n", "attachments": [], "created_by_name": "Francesco De Luca", "created_at": "July 2, 2013 at 9:32am", "created_by": "FrancescoDeLuca", "replies": []}, {"body": "\nHi Francesco! This looks pretty nice! Let me know when you have the final version so I''ll post it on Ladybug's Facebook page to get more people to watch it! -Mostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "July 2, 2013 at 7:07pm", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nHi Francesco,\n\nThanks for your interesting movie. Looks very interesting. I got some questions:\n\nQ1. Do you use any function for galapagos input?\n\nQ2. at which setting are you running your galapagos?\n\nQ3 How did you set up a limit for building to be moved within the plot?\n\n\n", "attachments": [], "created_by_name": "Michal Dengusiak", "created_at": "July 3, 2013 at 3:09am", "created_by": "MichalDengusiak", "replies": []}, {"body": "\nHello Mostapha,\n\nI am working on a research project. I have three buildings with different height that I have to place on a plot. The goal is that the building create as less as possible overshadowing on each other. So I am calculating the result separately because each time one building is the Geometry (input) and the other two are the Context (input). If I would calculate together I have to use all the buildings at the same time as Geometry and as Context, so I thought that if a building is Geometry and Context at the same time the calculation can get wrong. Isn't it?\n\nThank you for the indication about Octopus, I will see about it.\n\nWell yes I am using quite a lot your tool recently, thank you for your work. I am preparing the materials for a workshop about these topics I will tutor in my university and I think I will use LadyBug and Diva. By the way there are limitations in the use of your plug-in?\n\n\n\nBest\n\nFrancesco\n", "attachments": [], "created_by_name": "Francesco De Luca", "created_at": "June 8, 2013 at 6:34am", "created_by": "FrancescoDeLuca", "replies": []}, {"body": "\nYou don't need to connect them one by one separately. Ladybug does automatically solve the self-intersection. As I said it will be probably easier to help if you upload the definitions or email them to me.\n\nI'll send you a link to download a newer iteration of Ladybug.\n\nBest,\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "June 8, 2013 at 9:55pm", "created_by": "MostaphaSadeghipour", "replies": []}]}], "id": "866454"}