{"body": "\nHi Mostapha,\n\nA couple of things for your attention:\n\n1. On the LB Sunpath component when you add a conditional statement it writes \"**Conditiontional**\" on screen (I'm not sure if i reported this before, but just in case).\n\n2. I don't understand why when i open the attached file it didn't run the LB Analysis period. But if i close it and open again it does. I can also make it work if i change one of the sliders.\n\n\n\nBTW i'll llove to test the updated version ... if you wish :-)\n\nThanks,\n\n-A.\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A869086", "name": "TMP.gh"}], "created_by_name": "Abraham Yezioro", "created_at": "June 9, 2013 at 3:12pm", "created_by": "AbrahamYezioro", "topic": "A couple of (mini) bugs", "replies": [{"body": "\nHi Abraham!\n\nSorry to get back to you late. I'm moving to a new city and it has been so busy these days. Thank you for reporting the bug! I fixed it. I can't believe that I haven't seen it this long!\n\nI can't repeat what you said on my system. It just works fine here... Does it give you any warnings or so?\n\nAbsolutely! I only didn't want you to be upset as I haven't yet applied all of your comments! Can you send me your email?\n\nBest,\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "June 18, 2013 at 1:57pm", "created_by": "MostaphaSadeghipour", "replies": [{"body": "\nHi Mostapha,\n\nGood to hear from you.\n\nPoint 2: The only \"warning\" appears in the LB AnalysisPeriod component saying that i need first let the Ladybug fly ... which is set to true from the beginning. I toggle to false and then to true again but nothing. Just moving any of the sliders connected to the LB_AnalysisPeriod does it.\n\nMy email: ayez@ar.technion.ac.il\n\nOf course i won't be upset. On the contrary. I know how to appreciate work in progress. I'm into that myself.\n\nThanks a lot,\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "June 18, 2013 at 2:13pm", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nHi Abraham,\n\nI see what's happening. It is because of the order that Grasshopper executes the script. For some reason it does execute the LB AnalysisPeriod before LB_Ladybug component, so when LB AnalysisPeriod looks for Ladybug it is not there and it gives you the warning.\n\nJust changing Ladybug to True afterward doesn't help since LB AnalysisPeriod is not constantly listening to changes. You need to re-execute the LB AnalysisPeriod again after Ladybug is released to make it work.\n\nI'll send you an email. Thank you for your understanding and support!\n\nBest,\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "June 18, 2013 at 3:13pm", "created_by": "MostaphaSadeghipour", "replies": []}]}]}