{"body": "\nHi everyone,\n\n\n\nI've been working on my Dissertation when I found this fine tool and many thanks to Mostafa, it's been very helpful.\n\nWell, what I am working on is a kinetic facade (kinetic shading system) which tracks the sun to cast shadow and/or produce electricity (using PV panels) more efficiently. However, my problem is that the facade follows the sun movement manually and I cannot have the whole day or month analysis since the analysis are done based either on Series component or Intervals, but my shading system moves based on the sun vector and time of the day. What I'm trying to say is that the geometry input for Ladybug components cannot change respective to the time. \n\nWhat I need is Ladybug to be able to get the appropriate geometry as it changes, and uses that geometry according to the time which the given geometry belongs to! For example, the shadings change their local angle every hour as sun moves; also, they move around the building (from east to south and then to west facades) as sun changes its location accordingly. Therefore, the analysis results should be based on the geometry respective to the time and location of the sun.\n\n \n\nI don't know if I could explain the issue well enough, so if you think more explanation may help please do not hesitate to ask. I would appreciate any help or hint.\n\n \n\nMany thanks,\n\nEhsan\n", "attachments": [], "created_by_name": "Seyed Ehsan Ayatollah", "created_at": "July 27, 2013 at 4:51pm", "created_by": "SeyedEhsanAyatollah", "topic": "Ladybug and Kinetic Facade Design!", "replies": [{"body": "\nHi Ehsan,\n\nI'm not sure if I fully understand what are you exactly looking for in your study. Do you want to run radiation analysis for each hour of the year for a dynamic shading? If that is the case then you need to animate a slider for each hour of the year and export the result to an external file. You should be able to read the result back for visualization.\n\nHope it helps,\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "July 29, 2013 at 9:06pm", "created_by": "MostaphaSadeghipour", "replies": [{"body": "\nDear Mostapha,\n\nThanks a lot for your response, but I don’t think that’s the case, or if it is I didn’t get it. Attached is the file I am working on right now (my apologies for it is so messy). There is one \"Nemed View\" called “Sun Path 2” saved where you may change the \"hour\" slider and see how the facade would react respectively. I do not need radiation analysis (it would be great if I could have it though) and \"Sunlight Hour Analysis\" would be enough for me. Also, I only need to be able to run a day long analysis not a year around (again if I could have it, it would be great). Right now however, I'm stuck where I still have to work on facade's movements but I do not know whether I would be able to evaluate them. I would appreciate it if you could take a look at the file and see if you could come up with a solution. By the way, it's not important, but I work on Los Angeles weather file. kheili az lotfet mamnonam.\n\nMany thanks,\n\nEhsan\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A894044", "name": "Test 5.gh"}], "created_by_name": "Seyed Ehsan Ayatollah", "created_at": "July 29, 2013 at 11:22pm", "created_by": "SeyedEhsanAyatollah", "replies": []}, {"body": "\nHi Ehsan,\n\nI checked the attached file. I think it will be much easier to understand what are you looking for if you can comment the file and clearly indicate what/where is the question. Do you need help to create shadings geometries?\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "August 3, 2013 at 4:50pm", "created_by": "MostaphaSadeghipour", "replies": []}]}]}