{"body": "\nHi,\n\nI'll continue the tread here as a discussion and not as a comment. I've found some issues that maybe a discussion is more appropriate.\n\nI was curious about the original question and Mostapha's reply. So i decided to check this more thoroughly.\n\nStarted comparing the solar vectors LB calculates against DIVA's, for Tel Aviv EPW, 10 am. There are differences, even meaningful ones (5-6 degrees in the azimuth, 2-3 degrees for altitude). Then i calculated by myself the numbers and even consulted a couple of websites ([NOAA &amp; ESRL](http://www.esrl.noaa.gov/gmd/grad/solcalc/azel.html) and [pveducation](http://pveducation.org/pvcdrom/properties-of-sunlight/sun-position-calculator)). The differences with LB remain about the same.\n\nSince my calculations are consistent with those of the websites and Diva's, and even with those of Ecotect (yes, i have the numbers) i started to thing what could be the problem (it is not daylight savings!!). I've found that the input time in LB is, probably, the Solar Time and the others is the local time (or civil time ... your clock).\n\nAfter i use the Solartime as input for receiving the azimuth/altitude the results are more consistent with those of LB (for this specific example, instead of giving 10 i gave 9:38).\n\nI don't know if LB calculations take into account the Equation of Time, or earth declination, but i think the formula should be revised.\n\nAlso the input time is a matter of discussion. People (me) always thing about Time as the one you see in your clock (civil) and not the one according to sun position. As you can see the differences can be very significant.\n\nI'm attaching my checking file, using Tel Aviv EPW at 10 am, for your convenience i concentrated the numbers in excel.\n\nHope this helps to make this (important) point clear. Sorry for the length.\n\n\n\n-A.\n\n\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A906399", "name": "SunpathCompare-LB-Diva.gh"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A906400", "name": "SunpathCompare-LB-Diva.xlsx"}], "created_by_name": "Abraham Yezioro", "created_at": "August 29, 2013 at 7:30am", "created_by": "AbrahamYezioro", "topic": "Sun path from Ecotect vs Ladybug", "replies": [{"body": "\nHi Abraham,\n\nThank you so much for checking this. I'm using Radiance's sunpath equations and based on my understanding the difference should always be less than a degree. I'll check this issue in more details this weekend and let everybody know the result.\n\nBest,\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "August 29, 2013 at 7:43am", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nHi again Abraham,\n\n\n\nI checked the sunpath and the difference, as you mentioned, is the difference between solar time and local time. As you can see in the image below if you provide longitude and time zone the difference between the result of Ladybug and your results is less then a degree.\n\n\n\n[<img class=\"align-center\" src=\"http://api.ning.com:80/files/ZXoWXLs1YKPnBjiaFbCa3TaISn0fHczAFKgVleajQMxgkFIfaCp15Zo0eZZscdzdInEm56Nqy7p3zLDCQ9Wg5e7zZNwSb863/sunPath_check.png?width=700\" width=\"700\"/>](http://api.ning.com:80/files/ZXoWXLs1YKPnBjiaFbCa3TaISn0fHczAFKgVleajQMxgkFIfaCp15Zo0eZZscdzdInEm56Nqy7p3zLDCQ9Wg5e7zZNwSb863/sunPath_check.png) \n\nYour point about how people input the hour is fair. One option is to remove latitude, longitude, and timeZone inputs from the component and have the weather file as the input so the correction will be always applied. The only concern is in some cases you may want to draw the sunPath for locations that you don't have the weather file but you have the lat, lng, and time zone. Maybe we can have two sunpath components?\n\n\n\nThe other option is to add a component to convert solar time &lt;-&gt; local time and then use the solar time as the input. It might be confusing though.\n\n\n\nThanks again and let me know what do you think.\n\n\n\nBest,\n\nMostapha\n\n\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "September 2, 2013 at 6:17pm", "created_by": "MostaphaSadeghipour", "replies": [{"body": "\nHi Mostapha,\n\nI see that now the azimuth difference is a bit more than 1 degree (1.1 to 1.3). The altitude is quite close.\n\nWhat to do (i think):\n\nFirst, what NOT to do: 2 sunpaths. It will be quite confusing.\n\nAgree that the conversion Local &lt;--&gt; Solar may be confusing. But sometimes user may want to use each of them(SunlightHours vs Radiation, for instance). I would only add an explanation in the Help of the relevant components about the meaning of using Solar vs Local.\n\nWhat may lead to the confusion is that the ImportEPW component has only Latitude output. For Local time you need both Longitude and TimeZone. It is a bit of unconvenient to look for these, and then sometimes user may \"forget\" or miss to input one/both of them into the Sunpath component (as seems to be the case with Stefania ... and me :-) ).\n\nThe DecomposeLocationData component has the 3 outputs and then the correction works. But this component is not included in the released version (v0.0.35). If so, it will difficult to users to catch what to do (input manually the Longitude and TZ).\n\nSo i think the things to do are:\n\nHope this helps.\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "September 2, 2013 at 11:46pm", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nHi Abraham,\n\nLocation input is a great idea. You can either take it from importEPW or create it yourself. Pretty cool! I think I'll apply it this weekend.\n\nAnd yes, let's make a component for local versus solar time. Sounds useful.\n\nThanks, :)\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "September 5, 2013 at 11:01am", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nDone except the solarTime component. Will work on it later this week...\n\n\n\n[<img class=\"align-center\" src=\"http://api.ning.com:80/files/adytKKwpEgTRnFr-5Qt1GCS7vUtcebW-orJ2cTTdIDd9jyRFO2DTHNldC*g-jL3JGDgMLp9MjqWVBj2nKK6d0i7miPmHak5V/newSunPath.png?width=721\" width=\"721\"/>](http://api.ning.com:80/files/adytKKwpEgTRnFr-5Qt1GCS7vUtcebW-orJ2cTTdIDd9jyRFO2DTHNldC*g-jL3JGDgMLp9MjqWVBj2nKK6d0i7miPmHak5V/newSunPath.png)\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "September 9, 2013 at 10:02pm", "created_by": "MostaphaSadeghipour", "replies": []}, {"body": "\nLooks good!!\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "September 9, 2013 at 10:34pm", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nHi Mostapha,\n\nAny news on this front?\n\nThanks,\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "September 16, 2013 at 3:30am", "created_by": "AbrahamYezioro", "replies": []}, {"body": "\nSent you an email!\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "September 17, 2013 at 9:20pm", "created_by": "MostaphaSadeghipour", "replies": []}]}, {"body": "\nHi Mostapha,\n\nThanks for the hard work. I am trying to do sun hours with ladybug. I also noticed some differences in the results, comparing different sources. I read all the comments in this discussion and saw some new components being used. I have version.0.0.35, therefore, missing the new components from february/july. Are these components already available? If yes, where can I download them?\n\nThanks a lot,\n\nAlejandra C\n", "attachments": [], "created_by_name": "Alejandra", "created_at": "September 17, 2013 at 2:49am", "created_by": "Alejandra", "replies": [{"body": "\nHi Alejandra,\n\nYou can download the decompose location component from [here](http://www.grasshopper3d.com/xn/detail/2985220:Comment:910269) and then you should be good to go for sunlight hours study. :)\n\nLet me know if you need anything else.\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "September 17, 2013 at 9:20pm", "created_by": "MostaphaSadeghipour", "replies": []}]}, {"body": "\nHi Mostapha,\n\nThanks a lot for the quick response. I will try it whenever grasshopper wants to cooperate with me a bit more. ;). I am having problems with GH whenever I try to open it. Very few times it opens inmediately,sometimes it opens, but takes ages and some time it doesnt open at all. I have the version 0.9.0056 (may 16). Can you give me a hint? Is is the version? Any suggestions are appreciated.\n\nBest,\n\nAlejandra \n", "attachments": [], "created_by_name": "Alejandra", "created_at": "September 18, 2013 at 3:47am", "created_by": "Alejandra", "replies": [{"body": "\nThey released a new version last week (090061 i believe) that is supposed to solve this issue.\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "September 18, 2013 at 7:29am", "created_by": "AbrahamYezioro", "replies": []}]}]}