{"body": "\nHi Dimitris,\n\n\n\nThese are very good question and I am happy that you are asking them.\n\n\n\nI am not sure what you mean by \"gendaylit,gendaymtx\", I used the genClimateBasedSky and now all the 3 types are working.\n\n\n\nI was referring to Radiance commands to generate each of them. gendaylit generates a climate-based sky for a point of time. gendaymtx creates climate-based sky for every hour of the year, and gensky generates standard CIE skies. What you are doing is right.\n\n\n\nNot sure how I could benefit from the RadiationValues output of the CB sky component. I hope I am not missing any connection there?\n\nIf you use CB sky, to put gridbased analysis together then you can run radiation analysis with Honeybee.\n\n\n\nI understand that GRD type of analysis provide results only for certain day and time of the year? Is it possible to do the same analysis for a period of time?\n\nShort answer is yes. If you are looking for radiation analysis then just use CumulativeSky (CM). It let's you generate the sky for an analysisPeriod and so the results will be for an analysis period. For daylighting you can use annual analysis. There is a way to use annual analysis to get the results for radiation which is the answer to your next question\n\n\n\nCould you please explain why  the annualDaylightSimulation component doesn t have the same 3 types of Simluation? And also seems to be irrelevant of the SkyFile?\n\nIn annual analysis, the sky will be generated during the process using the weather file. I don't know if it is possible to models luminance values but you can switch between illuminance and radiation. Default is illuminance but yo can change it to radiation using DSParameters.\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/51GNwYDFQ0Rp*cbnfo33qGdlmHOXcgksz*3Uqlho9-6vb9cRss8N03DW97NWkSXKvxIiJdknhYcVWVjs9kKcjwt9-d1vZeKC/setAnnualDaylightAnalysisToRadiation.png?width=721\" width=\"721\"/>](http://api.ning.com:80/files/51GNwYDFQ0Rp*cbnfo33qGdlmHOXcgksz*3Uqlho9-6vb9cRss8N03DW97NWkSXKvxIiJdknhYcVWVjs9kKcjwt9-d1vZeKC/setAnnualDaylightAnalysisToRadiation.png)\n\n\n\n\n\n\n\nIs there any difference between the Ladybug Annual Radiation Analysis (attached) and the Honeybee AnnualDaylight Simmulation?\n\nAnnual radiation in Ladybug returns cumulative incident radiation for each point during the year whereas Honeybee's annual daylight calculates illuminance value for each hour of the year, which can be also used to find the amount of radiation. One difference to keep in mind is that Honeybee considers materials and inter-reflection but Ladybug just calculates incident radiation.\n\n\n\nLet me know if you have any other questions,\n\nMostapha\n\n\n\n\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "December 3, 2014 at 8:21pm", "created_by": "MostaphaSadeghipour", "parent_id": "topic_1180181", "id": "reply_2985220_Comment_1180385"}