{"body": "\nGrasshope,\n\nThere are several things that have to be clarified here:\n\n1) It seems that you do not need to add any other outputs other than those already in the 'Generate EP Output' component to get the information that you desire.  Just set zoneEnergyUse and zoneGainsAndLosses on the component to true and you get the equipment load (equal to equipment gain), internal lighting load (equal to lighting gain), the people gain, and the total solar gain.  If you also need window heat loss, you can get this on a window-by-window basis by setting the surfaceEnergyAnalysis to true (and, after the simulation, use the 'Surface Data Based on Type Detailed' component to pull out just the window data from the list of al surfaces).\n\n2) There was a bug in the otherZoneData of the 'Read EP Result' component when you set the \"normByFlrArea\" to True.  Thanks for finding it. I fixed it in the attached GH file so that you can get those specific Zone-level outputs if you want them instead of what I have suggested above.\n\n3) There is currently not a component to read meter outputs mostly because this information would be misleading with the 'Run Energy Simulation' and it use of an ideal air heating/cooling system.  The energy from ideal air systems is not factored in meter outputs and you need to specify a complete, real HVAC system for such thermal outputs to affect things like meter electricity or meter fuel.  Now that development is picking up on the OpenStudio component, which can write these complete HVAC systems, we will eventually have a new result reader that parses the E+ SQL output (including meter outputs).\n\n-Chris\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1330855", "name": "tut_test_v016_CWM.gh"}], "created_by_name": "Chris Mackey", "created_at": "July 22, 2015 at 05:47PM", "created_by": "chris", "parent_id": "reply_2985220_Comment_1330730", "id": "reply_2985220_Comment_1330853"}