{"body": "\nHi Grasshoppe,\n\n\n\nI am terribly sorry for the late response. Let's take this one by one.\n\n\n\nThe first two steps seem to be ok. Did you supply a grading to your initial blockMesh through the BF components? It seems that the X and Z direction are graded, with the grading in the X direction not being symmetrical (which is ok if X is the wind direction). If you didn't we would need to check our default settings but if memory serves they should be set at no grading. \n\n\n\nAs a side note here, a suggestion is to keep your refinement levels, either global or the ones set per boundary, to equal (optimal case) or not very different values. The (2,10) you supplied could potentially create sudden cell size changes which is not optimal, even though probably the 10 isn't going to be used. Settings like (2,3) or (2,4) would be ok. If you want to go higher, raise both numbers.\n\n\n\nThe update fvSchemes functionality is an added option of BF itself and not a command within OF. Essentially what it does is apply proper schemes to your model according to the mesh quality you have achieved. This is why OF won't recognize it. When we get BF going with the new version this will be done automatically for you.\n\n\n\nFinally, the error you are seeing is again eliminated through the use of BF which takes care of the clean up and folder set up for you prior to running the case. For now, to do it manually, what you need to do is this:\n\n\n\n1.Delete the /constant/polyMesh folder\n\n2.Cut the polyMesh folder from the /2 folder and paste it to your /constant/polyMesh folder.\n\n3.Delete the /1 and 2/ folders\n\n4.Rename the /0.org folder to /0 (if that was not the case already)\n\n4a.Run the case in serial mode with the simpleFoam command.\n\nor \n\n4b.Run the case in parallel with:\n\n        decomposePar<br/>        mpirun -np x simpleFoam -parallel\n\n\n\nWhere the x is the number of processors set in your decomposeParDict found in the /system folder, usually set at 4. You can change that number of processors by simply changing that number in the beginning of the dictionary. To avoid other problems here with different number of processors change to scotch method in the same dictionary.\n\n\n\nP.S.: Another easier but dirty (to my sensibilities) way is to simply paste the 0 folder inside the 2 folder. Provided boundaries and boundary conditions are set ok this should run. This would work for the serial way.\n\n\n\nI hope this helps! When BF is up and running soon most of this will be hidden in the background. But the brute force method you are taking now is also quite educational.\n\n\n\nLet me know if you have any other questions or issues! Thanks for testing!\n\n\n\nKind regards,\n\nTheodore.   \n\n\n\n\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "August 5, 2016 at 7:05am", "created_by": "TheodorosGalanos", "parent_id": "reply_2985220_Comment_1575613", "id": "reply_2985220_Comment_1577134"}