{"body": "\nTheodoros, thank you for the useful reply!<br/><br/>Amaraa my apologies for taking me too long to reply.\n\n\n\n-I have noticed that daylight simulation runDaylightAnalyis havs a _HBObjects input which directly take other geometries thus it influences the daylighting results (tested).\n\n<br/>Sunpath shading component needs to distinguish between opaque and semi transparent objects. That is why there are three types of context inputs. Do you find this troubling?<br/><br/>\n\n-Then, I have tried to connect as you sketched on the grasshopper definition, however it shows the error of recursive function. Which makes me think that I have to internalize the data output from ACenergyPerHour instead of directly connect ot ACenergyPerHour_ on SunpathShading as well as the annualShading to annualShading on DCtoACderateFactor (image). Please correct me if I am wrong about connecting these three components.\n\n<br/>I agree that this principle of internalizing the ACenergyPerHour from Photovoltaics surface component and then getting back the annualShading back to it, is a bit clumsy solution. But I do not think there is a better one. This is due to the [method we are using for calculation of the shading](http://solardat.uoregon.edu/download/Papers/UsingSunPathChartstoEstimatetheEffectofShadingonPVArrays.pdf).<br/>It needs to calculate the unshaded ACenergyPerHour, and then the shaded ACenergyPerHour with the use of unshaded ACenergyPerHour.<br/>As Theodore mentioned in his reply, a small trick to overcome this is to use another Photovoltaics surface component at the end. Check the attached file below.\n\n<br/>-I am parametrically changing the façade geometry and in every generated instances should be take an account of shading from upper floor of the façade geometries to get realistic data from PV surface electricity generation.\n\n<br/>Just to be sure I understand you correctly: when you mention the \"upper floor of the façade geometries\", is this what you have in mind (check the attached photo)?<br/><br/>I think I understand what was causing the confusion, and if you reply to my last question I will elaborate a bit more on the shading issue.\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1538011", "name": "FindingoptimalsizeofPVingivenarray5.gh"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1538012", "name": "upper_floor_facade_geometry.jpg"}], "created_by_name": "djordje", "created_at": "May 28, 2016 at 02:18AM", "created_by": "djordje", "parent_id": "reply_2985220_Comment_1537607", "id": "reply_2985220_Comment_1538010"}