{"body": "\nHi Mostapha,\n\n \n\nSorry for my late reply and thank you very much for your kind suggestions!\n\n \n\nThe reason why we chose DB is that it can not only conduct energy simulation by running Energyplus but also carry out the reliable CFD simulation and assign the CFD boundary condition from the Energyplus simulation result easily. For our case, the \"temperature distribution\" is quite important due to its large volume of the building (because different locations within the large volume/thermal zone have quite different temperatures)\n\n \n\nIs there a way, do you think, to figure out the \"temperature distribution\" within a large volume/thermal zone by using OpenStudio?\n\n \n\nIf we cannot get the \"temperature distribution\" directly from the CFD simulation (because it is time consuming and not suitable for the early phase design), we supposed another compromised way - dividing the large volume/thermal zone into small thermal zones separated by zone boundary surfaces that don't really exist - like \"air walls\" material (in Energyplus/OpenStudio) or \"virtual partitions\" (in DB).\n\n \n\nl   \"air walls\" in Energyplus:\n\n[http://energyplus.helpserve.com/knowledgebase/article/View/18/0/air...](http://energyplus.helpserve.com/knowledgebase/article/View/18/0/air-wall-open-air-connection-between-zones)\n\n \n\nl   \"air walls\" in OpenStudio:(using Energyplus as its simulation engine)\n\n[http://openstudio.nrel.gov/forums/openstudio-plug-google-sketchup/h...](http://openstudio.nrel.gov/forums/openstudio-plug-google-sketchup/help-desk/air-wall-construction-material)\n\nBut if I understand right, according to the OpenStudio Developer, \"air walls\" in OpenStudio are in support of Radiance simulations instead of energy simulations.\n\n \n\nl   \"virtual partitions\" in DB: (using Energyplus as its simulation engine)\n\n[http://www.designbuilder.co.uk/helpv4.1/#Virtual_Partitions.htm?Hig...](http://www.designbuilder.co.uk/helpv4.1/#Virtual_Partitions.htm?Highlight=virtual%20partitions)\n\n[http://www.designbuilder.co.uk/helpv4.1/#Add_Hole.htm?Highlight=holes](http://www.designbuilder.co.uk/helpv4.1/#Add_Hole.htm?Highlight=holes)\n\nA virtual partition is a partition between 2 zones which exists purely to sub-divide the space up and has no corresponding wall in the actual building. Virtual partitions are modelled using a \"hole\" that fills the whole surface area.\n\nThe way that airflow through holes (and virtual partitions) is modelled depends on the Natural ventilation model option selection, including \"scheduled\" and \"calculated\" natural ventilation. In the Scheduled Natural Ventilation, the airflow through internal holes is calculated (using the EnergyPlus Mixing option) based on the airflow rates and schedules for this flow; In the Calculated Natural Ventilation, the airflow through holes is calculated (using the EnergyPlus Airflow network) based on the pressure difference across the opening and a coefficient of discharge of 0.65.\n\n \n\nHowever, I was wondering if the gbXML file generated from Honeybee Zones and GrizzlyBear includes(defines) the information regarding these \"holes\" or \"virtual partitions\"? In other words, is it possible to automatically generated \"holes\" or \"virtual partitions\" (which allow airflow between thermal zones) in DB when importing the gbXML file (generated by Honeybee Zones and GrizzlyBear)?\n\n \n\nAlternatively, can we just use Energyplus related components in Honeybee to get each different temperature of the subdivided thermal zones which compose the large thermal zone and allow airflow between them? How to achieve this? (Share surfaces between the subdivided thermal zones should be carefully treated to approximate the situation of airflow through \"holes\")\n\n \n\nThank you again for all your help!\n\n \n\nBest,\n\nDing\n", "attachments": [], "created_by_name": "Ding", "created_at": "July 11, 2014 at 03:13AM", "created_by": "doudou", "parent_id": "reply_2985220_Comment_1095303", "id": "reply_2985220_Comment_1100710"}