{"body": "\nHi Ernst,\n\n\n\nDaysim isn't very accurate for direct illuminance analysis because the position of the sun is [approximated to one of 65 locations for the entire year](http://daysim.ning.com/subprogram/rtracedc). The [DDS version of Daysim](https://www.radiance-online.org/community/workshops/2009-boston-ma/Presentations/Radiance%20WS2009_DaysimInnovations_CReinhart.pdf) is more accurate but that is not implemented in Honeybee. Pure Radiance calcs for the entire year will probably take over 10 days to run for the entire year (which is why use Daysim in the first place!).\n\n\n\nWith regards to your questions about solar exposure, and lux-hours, Yes, that is what I meant. Within the context of Daylighting simulations, it is almost useless to consider UV modeling.  Radiance is a three channel ray-tracing engine, where each channel corresponds to a certain [cone sensitivity](https://en.wikipedia.org/wiki/Cone_cell). Daysim is a simplification of Radiance, which only considers the [photopic curve](https://en.wikipedia.org/wiki/Luminosity_function). I am not sure if it would be possible to get the spectral reflectance distributions and spectral transmittance distributions of all the involved surfaces to get a proper idea of UV incident on a particular surface\n\n\n\nI recommend referring CIE 157:2004 for more info on this ([IES has an RP document on this topic](https://www.ies.org/store/recommended-practices-and-ansi-standards/recommended-practice-for-museum-lighting/), but since I haven't referred it before, I can't vouch for it). \n\n\n\nAbout the array stuff, I was referring to the data structures in the python scheme of things. Assuming that you have a rectangular frame that you'd like to count lux hours for, it makes sense to average the illuminance on it at any given time. The sum of average illuminances for every hour will result in lux hours.  The CIE document uses a similar logic for calculating threshold lux hours. For example, a threshold illuminance of 50 lux for 3000 hours will result in lux-hours of 150000, which will result in noticeable fading in high responsivity materials.\n\n\n\nSarith\n", "attachments": [], "created_by_name": "Sarith Subramaniam", "created_at": "May 25, 2017 at 5:22pm", "created_by": "sarith", "parent_id": "reply_2985220_Comment_1757666", "id": "reply_2985220_Comment_1757964"}