{"body": "\nAbraham,\n\nIt admittedly took both the flight there and back but I finally have a passive solar polygon that I am satisfied with and that I have pushed to the github.\n\nHere you can see an image of it in action:\n\n\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/wULhhoiI5wFdCU2AAsmCz*uL-Dq9y*NcGRBuFmSLQe6oifZbvF9mJruC9eLECH8k84iNH9hdt2xkEwW2Kk7HJJI1Bbys7UOB/PassiveSolarOnPsych.JPG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/wULhhoiI5wFdCU2AAsmCz*uL-Dq9y*NcGRBuFmSLQe6oifZbvF9mJruC9eLECH8k84iNH9hdt2xkEwW2Kk7HJJI1Bbys7UOB/PassiveSolarOnPsych.JPG)\n\nMuch like the climate consultant polygon, not all hours that fall within the passive solar polygon are counted as comfortable and a given hour is only considered comfortable if it falls within the polygon AND the solar radiation for the last few hours of the EPW is enough to overcome the temperature delta between the outdoors and the building balance point.  In order to give you control over the parameters that determine this, I have added two more inputs to the \"Ladybug_Passive Strategy Parameters\" component.  The most notable one is the timeConstant_, which determines how many hours back in the EPW the component will look for solar radiation values to see if there is enough solar to passively heat the space.\n\nAlso, unlike the climate consultant polygon, I have added an extra component that allows you to assume that your passive solar facade is facing any direction that you desire.  This new component should have a variety of uses and is called \"Ladybug_Surface Hourly Solar.\"  Here you can see how I would recommend using it with the psychrometric chart to model a south-facing passively-heated space:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/wULhhoiI5wE7baRIza39TEXtsoxP4m13ODiXrtr7PFQc9R9IzTn1YQbahYEqyTtLiV1K3IPk*QXo8cn4uockBbO*ejLH8yJM/HourlySolar.JPG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/wULhhoiI5wE7baRIza39TEXtsoxP4m13ODiXrtr7PFQc9R9IzTn1YQbahYEqyTtLiV1K3IPk*QXo8cn4uockBbO*ejLH8yJM/HourlySolar.JPG)\n\nThe file that produced the images is attached.\n\nLet me know if you have any questions or comments about the methods of the component.\n\n-Chris\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1808435", "name": "passiveSolarPsychChart.gh"}], "created_by_name": "Chris Mackey", "created_at": "September 03, 2017 at 11:22PM", "created_by": "chris", "parent_id": "reply_2985220_Comment_1805644", "id": "reply_2985220_Comment_1808434"}