{"body": "\nHi\n\nUnfortunately I would have to get someone else's permission to upload the .shp import file (using @it - thanks for the example Mostapha). Therefore, I cannot supply the import .shp plus extrude example, but this file creating towers of a particular volume linked to their equivalent low-rise volume where I make boxes using Bumblebee so I can build performance graphs etc in Excel should suffice. \n\nUltimately what I had in mind was to build an analysis tool that allowed me to explore the Simple Static Heat Losses in the spreadsheet for the design alternatives, or even to have a set of heat losses for each 5 storeys of the building height from 5 through 100 storeys - to understand heat loss, linked to Rhino/GH to plot a 3D landscape of these options. This would then be linked to HB so that I could (first) plot the solar gains on the building facades for one building in a neighbourhood of similar height, and then divide up these basic towers into bottom middle and top floor Energy Plus and Daysim analyses of a standard 5 zone division of the floor.\n\nFailing the intelligence test, and not even being able to move from simple mesh to simple analysis in LB has the grand vision stalled at step 2!\n\nBTW: with my (2016) version of Excel I get Excel.Interop error messages if I try to use the &lt;Live&gt; option for streaming the spreadsheet into Rhino/GH, so I re-read the spreadsheet manually by toggling the Boolean &lt;Runit&gt; option to read in the data.\n\nM\n\n\n\n\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1499686", "name": "heat Loss Calculator ver2 copy.xlsx"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1499687", "name": "Read_tall_buildings_spreadsheet_honeybee_beginnings.gh"}], "created_by_name": "Michael Donn", "created_at": "April 04, 2016 at 01:39AM", "created_by": "MichaelDonn", "parent_id": "reply_2985220_Comment_1498427", "id": "reply_2985220_Comment_1499684"}