{"body": "\nHi Alejandro,\n\nGlare is a tough thing to quantify as it really depends on whether someone is looking at your area of high contrast (in this case, I guess it would be looking at the sun bouncing off of your fully glazed building).  Once a person looks away from the glazed building, they no longer experience glare.  If you know the view that someone will have looking at your building, Honeybee has a large number of tools that will give you real and reliable numbers for glare.\n\n\n\nI know that you are planning to use a different method here but I point out the above just to be clear that you are not necessarily sure that people will experience glare if you are just looking at the times of the year when direct sun will be bouncing off of the glass building onto another building.  However, I can see this as a good starting point to assess the hours where there is a risk of glare in the building where light is being bounced to.\n\n\n\nWith that preamble out of the way, I can say that you are using a version of Ladybug that is 6 months old and I have updated your file for you.  To update your components and to be sure that the file below works correctly, you should re-download the user objects from the main Ladybug page and drag them onto your canvas.\n\n\n\nIf you want to look at sunrays for a whole year, I would keep your number of test points low by increasing your grid size (I think 5 should suit your purposes).  Also, you should only set the number of bounces to 1 as you are only really concerned about the one bounce off of the glass building.  With these two things done, you can then hook up an analysis period and have it do bounces for every sun-up hour of the period an not take for ever to calculate on your machine.  Perhaps an easier way to do this would be to take a sun-up hour for every month instead of a full analysis period, as I have done in your attached file.\n\n\n\nFinally, you need to make the last bounce length long enough to intersect the neighboring building (I increased it to 15 meters).  Then you can use the native grasshopper components to count the number of intersections.\n\n\n\nYou can see this all in this file:\n\n[https://www.dropbox.com/s/poe7i1zwut2fjg6/Glarescript19sept_CWM.gh?...](https://www.dropbox.com/s/poe7i1zwut2fjg6/Glarescript19sept_CWM.gh?dl=0)\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "September 19, 2014 at 11:57am", "created_by": "ChrisMackey", "parent_id": "topic_1133791", "id": "reply_2985220_Comment_1134225"}