{"body": "\nYou want to make sure that you associate the correct colors with the correct geometry when baking.\n\nIn the example below, baking the output directly from the ladybug windrose component will generate colored meshes. (For some reason I have noticed that my windrose meshes always need to be flipped once they are baked).\n\nYou could go the long way, (as I droned on about in my previous post), and continue working with the meshes....or you could take Andrew's advice and do one or two more steps and bake them as colored hatches.  That way you can export the results directly to an AI file.\n\n(the attached definition requires ladybug/honeybee, human tools, and I think UTO mesh edit tools...not sure if the explode and deconstruct mesh components are native or not).  I've attached the weather file I used.\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/UdapVcRNixt4Jg-TLD--f6q3R*n67UFFtqwizcYoeUpTyQlWol1o*0X6q1MRvWNtg7uSycvjY7QPIk4gHp2qKkbCSZrTfKyV/AnalysisMeshToHatchColor.png?width=721\" width=\"721\"/>](http://api.ning.com:80/files/UdapVcRNixt4Jg-TLD--f6q3R*n67UFFtqwizcYoeUpTyQlWol1o*0X6q1MRvWNtg7uSycvjY7QPIk4gHp2qKkbCSZrTfKyV/AnalysisMeshToHatchColor.png)\n\n\n\nSteps after the windrose component are as follows: (i'm sure there are other ways as well);\n\n1- explode mesh (prepping data structure of color selection)\n\n2a - decompose mesh faces to extract vertex colors (each face will have a number of vertices, in this case 4, that will all have the same color).\n\n2b - get the outlines/curves of each mesh face\n\n3 - use the SET component to \"clean\" the color values. (each face has 4 vertices, meshes are \"colored\" by vertices, so each faces vertices will be the same color. we only need one.)\n\n4 - use Human tools to create color attributes from the cleaned, (with data structure in tact).\n\n5- use Human tools create hatch using mesh face curves and color attributes.  Bake into rhino, export as AI file.\n\n\n\n\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1204938", "name": "WindRoseExampleHatch.gh"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1204939", "name": "USA_OH_Akron.725210_TMY2.epw"}], "created_by_name": "Chris Hanley", "created_at": "January 15, 2015 at 11:17AM", "created_by": "ChrisHanley", "parent_id": "reply_2985220_Comment_1204933", "id": "reply_2985220_Comment_1204937"}