{"body": "\nHello Chris,\n\nThank you for your quick and detailed reply!\n\n\n\n-        It works fine now, you are right it doestake a lot of time..took 21 minutes on my laptop to run just a single day! I found that a bit strange because when I ran the same model in Archsim switching off the Airflow Network mode and working on Simple Ventilation (for wind and buoyancy) it took around 2 minutes only to run the simulation for a single day. I don’t understand why the big difference in time since both plugins use Energy Plus?\n\n\n\n-        Do you happen to know why Airflow network simulation produce quite different results (temperature and ach) from those obtained from Simple Ventilation (both in Archsim)?\n\n\n\n-        I agree that I do not need the Air flow Network now, since at this phase I am trying to optimize the form of the double façade (folds, opening sizes, depth, etc.) to get a balance between temperature, airflow, and daylighting needs in the office rooms. I really think heat gain, airflow, daylight (thermal and visual comfort) all influence each other and if possible should be studied together while designing building skins. The plan was to do this using Galapagos, but I am not so sure now given the long simulation time (adding to it daylight simulation too). Anyway, in a later phase I wanted to know how the airflow in the office rooms would be like…as I understand, that could not be done yet in HB right? that’s why I thought of the Airflow network in Archsim.\n\n\n\n-        Thanks for reassuring that the double façade could be treated as a single zone. I am adjusting the model now as you said..that first trial was just to know if it works. I’ll probably use custom openings as some of them will be glazed (on some of the triangular faces, and sizes will depend on incident solar radiation on each face) while others are small air openings (on the mullions and the top horizontal face) to ventilate the cavity and avoid overheating. Also when external air temperature is within comfort range, it could be used for ventilation he office spaces.\n\n\n\n-        About CFD in design builder, i double checked again on their website when u mentioned it, and found the report comparing Design Builder’s results to Pheonics: [https://edmshk.files.wordpress.com/2014/08/designbuildercfdvalidati...](https://edmshk.files.wordpress.com/2014/08/designbuildercfdvalidationvsphoenics.pdf)\n\nHowever I am not sure if this is considered and official validation, and weather it would be valid for complex geometry, not just a room in the form of a cube as in the report. Anyway I don’t think it will work out for me as I tried exporting a gbxml and when I opened it in DesignBuilder it does not understand that this is a zone…also all openings (which I added later to the file) were not exported. I tried exporting your parents' house since I’ve been working on your tutorials (great videos by the way! So much help!) and when I opened it in Design builder, not all rooms were understood as zones (especially the attic). So that rules out DB for me I guess.. I downloaded OpenFoam but turns out to be quite a challenge to use. Lots of learning awaits me!\n\nSorry for my long reply, and thank you for your help!\n", "attachments": [], "created_by_name": "Salma El Ahmar", "created_at": "May 4, 2015 at 6:31am", "created_by": "SalmaElAhmar", "parent_id": "reply_2985220_Comment_1279002", "id": "reply_2985220_Comment_1279877"}