{"body": "\nChris, Mauricio,\n\n\n\nThanks for your help. I perceive there are a lot of things about GH/HB I need to learn.\n\nRegarding the example file, I build up the attached file.\n\nI try to simulate two windows (window in window, image attached, model is a simple box).\n\nThe Big Window shall be controlled by Temperature and the Small Window by Glare (DGP, not illuminance threshold).\n\n\n\n**Q1** After running a daylight simulation with base material I get the DGP values.\n\nI want to set an expression like if(\"x\"&gt;\"0.4\",1,0) to get the values for the csv schedule, but all results are 1 though there are dgp values above 0.4? (No syntax error in expression)\n\nBesides, I already have dgp files from previous simulations with DIVA, but can't import them into GH, the  **importDGP** component is green but the outputs are empty...\n\n\n\n**Q2 **Creating an EP model with a window in window surface (see attached file) is no problem. When I try to add the shade from the **windowshadegenerator** the complete wall disappears.\n\nHow do I correctly build this with two seperate controlled windows in one wall? Do I have to use the addGlazing component or can I simply use an hbsurface component and add the right epconstruction?\n\n(There is a note that for EP simulations I should use addGlazing when setting srftype).\n\n\n\n**Q3** Like the problem in Q2, when adding multiple times the same wall/shading construction, how do I set up Electrochromic Glazing with several dimming stages? For example 3 dimming stages controlled by temperature(22,24,26°C) or glare(3 different schedules/materials).\n\n\n\nBest,\n\nJakob\n\n\n\n\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1498079", "name": "WinW.PNG"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1498080", "name": "ECexample.gh"}], "created_by_name": "Jakob Schmidt", "created_at": "April 01, 2016 at 07:06AM", "created_by": "JakobSchmidt", "parent_id": "topic_1496352", "id": "reply_2985220_Comment_1498077"}