{"body": "\nAntonello,\n\nYou are rocking these forums, man!!!!  The helpfulness of your comments never ceases!\n\nThis wet bulb component is awesome and, if you are ok with it, I think that we should integrate the component into the Ladybug 'AnalyzeWeatherData' tab and your 'WBFUNC' function for wet bulb temperature into the Ladybug_Ladybug [ComfortModels class](https://github.com/mostaphaRoudsari/ladybug/blob/master/src/ladybug_ladybug.py#L3043-L4085).\n\nRight now, all of the functions that I have involving wet bulb temperature are fairly hacky and having your elegant function there would be a huge help in present+future cases.  Notably, [this bit of code that I use in the pych chart](https://github.com/mostaphaRoudsari/ladybug/blob/master/src/ladybug_ladybug.py#L4069-L4073) to derive a dry bulb temperature from wet bulb is really hacky and its brevity is more of an expression of my laziness than anything else. I know the \"while\" loop in your function might make this difficult but, if you can see any way to reverse-calculate dry-bulb and absolute humidity from wet bulb and relative humidity, this might make this application more elegant.\n\n\n\nIn any case, would you be able to send a pull request of an updated Ladybug_Ladybug and your new component to the Ladybug github?  It would be nice to have this included in the next stable release of Ladybug that is happening around next Sunday (the 24th).  That way, we can include it in the release notes and we can spread awareness about it.  Let me know if you need any guidance on putting together a pull request as I know it can be confusing for even seasoned github users.\n\n\n\nFinally, I have one suggestion that might make your component more applicable to a wide variety of cases and this is to have three separate inputs for drybulb temperature, relative humidity, and barometric pressure instead of one 'epwFile' input.  This will allow people to easily calculate wet bulb if they have single values of dry bulb/relhumid or if they have the data in a format that is not an EPW but they can get it into GH.  This will also make it clearer to new users how the wet bulb is derived from air temperature, humidity, and pressure.  Let me know your thoughts on this and, if you agree, I can also help get your component in that format.  I have some functions that I use for the comfort calculator components that help ensure the readability of data in these different formats.\n\n\n\nGreat work!!!!!\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "January 16, 2016 at 2:56pm", "created_by": "ChrisMackey", "parent_id": "reply_2985220_Comment_1439789", "id": "reply_2985220_Comment_1440128"}