{"body": "\nHi Aurelien, Thank you for the kind words and the comments.\n\n\n\nThat's a fair comment and I remember Chris's main critique to the development once he joined the project was the descriptions. He has done a great job rewriting most of them but there is still a lot to be fixed. At the same time, as they say, people are blind to their own mistakes. We need the input from you or other users to get them fixed. If you can provide us a list of the descriptions that you think can be improved we will make sure to get them fixed in the next release.\n\nGenerally speaking we need better documentation but we have right now what is available is the [primers](https://www.gitbook.com/@mostapharoudsari). That should be a good place to start.\n\nI think both of this comments takes an effort from the community more than the developers. We can definitely help to get it started like the primers but then making it perfect takes a group of people.\n\n\n\nFor the rest of your questions see my replies between the lines\n\n\n\n- It might be a WIP, but a tool to add/change some parameters could be nice. For instance temperature control based on operative T° instead of air T° or other very small things like that that could lead to a perfect customizable tool !\n\nIs it a request for set points in Energy simulation? Then it should be possible and I would open an issue for this on GitHub.\n\n\n\ncomponent to add surface properties to shading/context geometries.\n\nEnergyPlus has limitations for how much you can set the properties for shading objects but there is room for improvement in this case. See [this discussion](http://www.grasshopper3d.com/group/ladybug/forum/topics/energy-simulation-taking-into-account-albedo-of-urban-context-1?commentId=2985220%3AComment%3A1526511&amp;groupId=2985220%3AGroup%3A658987).\n\n\n\nif possible: get the losses trough the envelope of the building to add to the energy balance.\n\nThis is already there you can get the conduction both for transparent and opaque surfaces. [Here is an example](http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;fork=hydra_2&amp;id=Energy_Balance&amp;slide=1&amp;scale=1&amp;offset=0,0).\n\n\n\nchange only one surface of an existing HBzone (maybe it is possible now actually)\n\nThis is already possible. Try decomposeHBZone component!\n\n\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "January 23, 2017 at 06:05PM", "created_by": "mostapha", "parent_id": "reply_2985220_Comment_1676968", "id": "reply_2985220_Comment_1677336"}