{"body": "\nHi Leland,\n\n\n\nI have been thinking about this since I started working in this sector. I am working in a quite specific environment (the tropics) where definitely different parameters affect building performance than in other places. \n\n\n\nMy idea, which I haven't been able to follow up, is to make a performance-based matrix for building construction. It would be a simple matrix, dividing a building to its main components (e.g. ACMV, envelope, massing, glazing, etc.) and then dividing those components to their elements (e.g. chiller types, AHUs, WWR, U values, thickness, etc. etc.). \n\n\n\nBy itself this isn't that ground breaking, I imagine there have been hundreds of these papers around. My idea, in order to actually make this a performance-based tool as I mentioned, was to connect all this to Life Cycle Analysis. In essence, LCA could be used to inform both on the 'supply side' of things, that is environmental assessment of manufacturing, transportation, construction, and implementation of the different types of components and elements, and on the 'demand side' of things, that is operational performance analysis of buildings.\n\n\n\nIn this way we could get some kind of matrix which could be quickly used to form strategies on early stage design. However, to do this, in a meaningful timeframe, we would need two things:\n\n\n\n1. Some kind of database of construction materials, product solutions, and systems (EPDs seem the obvious candidate here).\n\n2. Some kind of meta analysis of data from actual operating buildings.\n\n\n\nThe first is quite easy, or at least doable (I have around 250 EPDs from a 2-day searching 'trip' online). The second is much harder, this data is usually sensitive. But perhaps, for the sake of early design, research data can be used here to draw general conclusions.\n\n\n\nNow, linking this to LB/HB. Do you mean a kind of component that outputs templates for different buildings and/or climates? Perhaps a template that would then set the different options for the different elements? Or maybe, this would be more valuable I think, a component indicating which elements should be investigated (in a parametric way) allowing for quick generation of different models?\n\n\n\nKind regards,\n\nTheodore.\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "July 16, 2015 at 01:26AM", "created_by": "TheodorosGalanos", "parent_id": "reply_2985220_Comment_1326381", "id": "reply_2985220_Comment_1326684"}