{"body": "\nGreat Bug-Catchers Abraham and Grasshope!\n\n\n\nThank you for your attention on this component.  Thanks to your efforts, I feel that we are really weeding out a lot of the small errors I made when I originally put the component together a few months ago.\n\n\n\nAbraham, the case of 1.2 failing was because of a bug where I simply put \"&lt; 1.2\" in the code instead of \"&lt;=1.2\".  The error was specifically happening with 1.2 because that is the wind speed threshold at which the \"hump\" of the ASHRAE adaptive comfort polygon grows.  It is perhaps easier to see this threshold in the inputs of the CBE Adaptive comfort chart:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/b8ZVJ4Q*UlLAzjHWpvcxI5X6ofVXOVwByuA0-4gRGnFSTqvyYD6q5oplaScHDTVDz*ghdsbsnBNEU8LHFtwlF3zxpHFn4SOC/CBE_AdaptiveCategories.JPG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/b8ZVJ4Q*UlLAzjHWpvcxI5X6ofVXOVwByuA0-4gRGnFSTqvyYD6q5oplaScHDTVDz*ghdsbsnBNEU8LHFtwlF3zxpHFn4SOC/CBE_AdaptiveCategories.JPG)\n\nI fixed the bug in the attached file and on the github.\n\n\n\nGrasshope, to address why you are getting branched data and the 2 comfort polygons, it is because you have connected up the EPW windSpeed to the component.  Usually, if you connect up multiple values for windSpeed_, the component will produce a comfort polygon for each wind speed.  However, I built a mechanism into the component that stops it from generating 8760 comfort polygons (one polygon for each hour) if you connect up full EPW data.  8760 comfort polygons takes almost a minute to generate and so I figured that this is probably not what people want to do most of the time.  Instead, the component just generates one polygon for the minimum wind speed and another for the maximum wind speed (to show you the range).  The branched data that you get out of the component are values for each polygon (2 branches for two polygons).  If you connect up the data to the 3D chart, this might make things clearer:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/b8ZVJ4Q*UlL3P9N5mx33k*9sRNuaNqJw*Ecs8EdmrVNyXHOXFTpM3z6XEbslP36jRT0cuUCei2W8n3nvDQ8MFakdCq2CTTwi/AdpativeComfRange.JPG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/b8ZVJ4Q*UlL3P9N5mx33k*9sRNuaNqJw*Ecs8EdmrVNyXHOXFTpM3z6XEbslP36jRT0cuUCei2W8n3nvDQ8MFakdCq2CTTwi/AdpativeComfRange.JPG)\n\nOne polygon is for 0 wind speed and the other is for the maximum EPW wind speed.\n\n\n\nI am interested in hearing your thoughts on my way of dealing with this since I am thinking of implementing something similar on psychrometric chart.  I realized that a lot of people were crashing the psych chart by connecting up the EPW wind speed, which currently tells the component to generate 8760 comfort polygons.\n\n\n\nThanks, as always, for all of your help,\n\n-Chris\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1490569", "name": "thermal_comfort_calc_v002_CWM.gh"}], "created_by_name": "Chris Mackey", "created_at": "March 22, 2016 at 08:56PM", "created_by": "chris", "parent_id": "reply_2985220_Comment_1490137", "id": "reply_2985220_Comment_1490568"}