{"body": "\nBurin,\n\nThanks for sticking with this problem and being committed to solving it.  I think that I have finally realized what the problem was with the original economizer.  The error was in a place that we would not expect.\n\nI was requesting the wrong cooling/heating outputs from the ideal air system.  From the image below taken from the E+ input/output reference, it seems that I should be requesting \"Zone Ideal Loads Supply Air Total Heating Energy\" instead of \"Zone Ideal Loads Zone Total Heating Energy\" (with the same situation for cooling).\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/BYH6s*jgRS9ynL-vWOLc8*94XotA24J2*VVK*-F6fvnPp2wFv7jKjBbpPAkF2SPk*8YP4dxyhSbEie6-vX3hKF8-oIGjb*4Y/EPIdealAirOutput.PNG\" width=\"629\"/>](http://api.ning.com:80/files/BYH6s*jgRS9ynL-vWOLc8*94XotA24J2*VVK*-F6fvnPp2wFv7jKjBbpPAkF2SPk*8YP4dxyhSbEie6-vX3hKF8-oIGjb*4Y/EPIdealAirOutput.PNG)\n\nMan, I swear that the E+ output names are the most confusing things that I have encountered in my coding experience thus far.\n\nI have now corrected all of the components involved with the requesting of this output and I have re-instantiated the economizer.  You now see a very big jump in cooling energy between having/not having an economizer.  Adding in the economizer now practically drops your entire cooling load to a third of its non-economizer value in San Francisco.  Also, your cooling values are now generally a lot lower (both with and without economizer) because the outdoor air requirement does a lot of cooling for you, which you are seeing now that we are requesting the right output.  If you change the outdoor air requirement to \"None\", you get values close to that originally posted at the start of this discussion. \n\nI have changed the default conditioned HBZone to now have an economizer and have an outdoor air requirement set by \"Sum\" since, as you say Burin, that is what ASHRAE recommends.  You can still change this outdoor air input on the Set Ideal Air Loads Parameters component and I have made clear in the description that there is an assumption of demand controlled ventilation when the outdoor air is set to \"Maximum\".  The default conditioned HBZone does not have heat recovery but it seems to be working correctly now that we are requesting the right output.\n\nThanks again for sticking with this, Burin, and let me know if the attached GH file makes sense.\n\n-Chris\n\n\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1234885", "name": "05_HVACIssues_CWM3.gh"}], "created_by_name": "Chris Mackey", "created_at": "March 02, 2015 at 03:31PM", "created_by": "chris", "parent_id": "reply_2985220_Comment_1234006", "id": "reply_2985220_Comment_1234884"}