{"body": "\n\n\nI am using exploded breps as inputs. I get one radiation mesh still but the radiation results are branched. So at first I tried to map the values with colors and represent the value with lines/ circles - just to start out. I tried to branch the values by what face they are on, using the data structure of the radiation results or by finding similar values between the radiation results and the color values on mesh vertices. However, handling 100k points with find similar poses challenge. I dont think it runs fast enough.\n\n\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/YLaeso7tISAVKj582Pfgbmp*j*vrByE-s3bEJNligTGTFOUhOxPJgKVURLEmY2WWmBPQlBZBfEkM8Br1aYbkiRLS-rsYAL-H/Screenshot2014112009.42.31_fix.png?width=721\" width=\"721\"/>](http://api.ning.com:80/files/YLaeso7tISAVKj582Pfgbmp*j*vrByE-s3bEJNligTGTFOUhOxPJgKVURLEmY2WWmBPQlBZBfEkM8Br1aYbkiRLS-rsYAL-H/Screenshot2014112009.42.31_fix.png)\n\nBut now that I think about it, since the test points are branched and so are the radiation results , so I thought I am set there if I just use exploded breps as inputs to test an idea of interpreting radiation results for outlining embedded functional aspects to detail semi unitized facade components.\n\n\n\nI am particularly interested in designing facade components using solar radiation to create a spectrum of thermal distribution between South/West and Northern facades, and between vertical facades and overhangs in order to draw natural ventilation across the floor plates during the summer and in the winter have the facade components work as efficient thermal break/ micro winter gardens / heat collectors.\n\n\n\nAt any rate, I would need face normals for most cases so I thought I could get the normals from mesh vertices. \n\nBut as it turns out the testing points are not the same as the mesh vertices. The testing points are center points of the mesh faces. but no problem, I could just evaluate mesh and get normals in branches that way. easy.\n\n\n\n[<img class=\"align-center\" src=\"http://api.ning.com:80/files/YLaeso7tISB7wbBnP5k9qOkBG41jyRvQwhRpGibUS3HVek*uIdusjs4M4iUxphcU56Fas7nHPzZm-mh36kbbY4J2WcmaNcIm/Screenshot2014112010.59.05_fix.png?width=721\" width=\"721\"/>](http://api.ning.com:80/files/YLaeso7tISB7wbBnP5k9qOkBG41jyRvQwhRpGibUS3HVek*uIdusjs4M4iUxphcU56Fas7nHPzZm-mh36kbbY4J2WcmaNcIm/Screenshot2014112010.59.05_fix.png)\n\nNow the issue however, is that the points are in branches, but they are not necessarily in an order that is useful. It is because there are triangle and square faces mixed. for this one brep face, the algorithm created two triangular wedges that when in as a list of points, it is either listed in the beginning or the end of the points. so - if you read the polyline of the points, you see first the polyline skips the mid row, and anyways, you can see there is a problem with the way I'm using exploded breps as inputs although it would be the easiest way to organize and branch the testing points, the radiation result values, and the face normals. \n\n\n\n[<img class=\"align-center\" src=\"http://api.ning.com:80/files/YLaeso7tISDGiPUOJIXWSRGUhhVkh6scP85iIReLN4-hL7Dr-hCaohidKQYdr9C2N*Vk*MJWy*-u9MLlfe566tGo3YFcWPSm/Screenshot2014112011.22.43_fix.jpg?width=721\" width=\"721\"/>](http://api.ning.com:80/files/YLaeso7tISDGiPUOJIXWSRGUhhVkh6scP85iIReLN4-hL7Dr-hCaohidKQYdr9C2N*Vk*MJWy*-u9MLlfe566tGo3YFcWPSm/Screenshot2014112011.22.43_fix.jpg)\n\n\n\nSo alternatively I could mesh the breps first, then use the meshing pattern to unflatten the.. radiation mesh? I dont know what you I mean, I have to try it myself. If I can control the way the brep is meshed, and then It might be possible for me to also have a consistent logic of how test points are organized... which I think is really crucial to work with the radiation results. For example, If I want to some how get this information over to revit (I think [Mr. Sobon](http://http://www.grasshopper3d.com/profile/konradksobon) recently release Mantis Shrimp), I would need to have the points organized neatly.\n\n\n\nI will post if I get some progress on the meshing approach you suggested. I think the way triangle and quad faces are mixed are a bit random now... or it might be that I can find a clever way to list points... I think [Mr Stasiuk](http://www.grasshopper3d.com/profile/DavidStasiuk) had some interesting approahes with mesh indices.\n\n\n\n// \n\nAs for the RAM issue, I don't understand how grasshopper handles ram enough to comment on what you said. But if there were a \"purge\" function where the user can decide to empty undo history after saving the definition, and if that lowers RAM use, that would make a lot of sense.\n\n\n\n// as for SAM, I'm glad to know it exists and I have to look in it!\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "attachments": [], "created_by_name": "Youngjae chung", "created_at": "November 20, 2014 at 9:42am", "created_by": "YOUNGJAECHUNG", "parent_id": "reply_2985220_Comment_1171980", "id": "reply_2985220_Comment_1172722"}