{"body": "\nAlejandro,\n\nThank you for testing this out so diligently.  It's because of devoted users like yourself that we are able to find bugs that we would never find ourselves.\n\n\n\nI was able to replicate your error and I'm sorry that this did not happen sooner.  The error was actually happening for a couple of reasons reasons:\n\nFirst, there was a very clear bug in that, while the mechanical ventilation flow rate was being written into the IDF, the HVAC system object in the IDF was not referencing this flow rate.  So the HVAC system just resorted to the default flow rate in every case.  I have since fixed this error in the WriteIDF component on the gitHub and in the attached version of your GH file.\n\nSecond, there was a mistake that I had made when I first put the videos together and wrote the description for the \"Set EnergyPlus Zone Loads\" component.  This is that the units for ventilation input to the component should be cubic meters per second per person (m3/s-person).  Not liters per second per person (l/s-person) as I had initially stated.  I noticed that, with the numbers you were inputting and the fact that you were using the old component with the old description, you were thinking that the ventilation was in l/s.  So, for your project, you should divide your current numbers by 1000.  I have put in the components with the right description and the right numbers into your file.\n\n\n\nAgain, thank you so much for finding this bug and for being patient with us while we fixed it.  This was definitely a pretty big one in terms of skewed results that people could have gotten.  Let us know if you find anything else that smells like a bug.  I haven't gotten the chance to ask Chien Si the status of his heat recovery into OpenStudio Systems but it seems like you could set one up for the Ideal Air HVAC system with the E+ IDFEditor.\n\nStay awesome,\n\n-Chris\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1168891", "name": "141107WTCHB_CWM2.gh"}], "created_by_name": "Chris Mackey", "created_at": "November 14, 2014 at 9:35pm", "created_by": "chris", "parent_id": "reply_2985220_Comment_1166829", "id": "reply_2985220_Comment_1168890"}