{"body": "\nHi Stefania,\n\n\n\nYou are indeed becoming an expert at crashing Rhino.  Again, this is happening for the same reason as your previous post ([http://www.grasshopper3d.com/group/ladybug/forum/topics/glazing-cre...](http://www.grasshopper3d.com/group/ladybug/forum/topics/glazing-creator-crash?commentId=2985220%3AComment%3A1471084&amp;xg_source=msg_com_gr_forum)), which is that Rhino is getting overwhelmed by the \"guess and test\" method that is used to find the correct offset distance to make the window from the edge of the wall surface.  Rhino really does not like these \"while\" loops for \"guess and check\" functions and there is really nothing that I can do to completely solve it as it's an issue on McNeel's end.\n\nHowever, in the event that this helps the component be more robust, I just re-wrote the guess-and-check function to use this awesome fast method that I pulled from the CBE comfort tool.  At the least, I can tell you that the component is now faster than it was before:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/365GxOU9aqwn1Qh5tHCgYS7c7xw2T5GA-2ly4qwyIhnRV-DJgG1SGOKDYKDLpHAQMfePJc1p5y6zClP2swmcgO*OsR53LnXg/FasterGlazingRatio.JPG\" width=\"654\"/>](http://api.ning.com:80/files/365GxOU9aqwn1Qh5tHCgYS7c7xw2T5GA-2ly4qwyIhnRV-DJgG1SGOKDYKDLpHAQMfePJc1p5y6zClP2swmcgO*OsR53LnXg/FasterGlazingRatio.JPG)\n\nHopefully, this means that it will also be able to handle more of the curved geometry that you throw at it before Rhino crashes.\n\n\n\nAlso, I should say that this guess-and-check method is only used for curved surfaces so the easiest way to solve your problem (and make the component run faster) is to planarize your geometry.\n\n\n\n-Chris\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1496781", "name": "FasterGlazingRatio.gh"}], "created_by_name": "Chris Mackey", "created_at": "March 30, 2016 at 8:08pm", "created_by": "chris", "parent_id": "reply_2985220_Comment_1495191", "id": "reply_2985220_Comment_1496779"}