{"body": "\nHi Antonello,<br/><br/>Thank you for the component permission, and approval of the icon usage !<br/><br/>I couldn't test your component due to usage of secure https connection, which does not work on my operating system.<br/>I am not knowledgeable about google maps nor google maps api, but from what I read the two components will definitely show a bit different results due to different topography sources.<br/>If it is judging by this 2010 [article](http://www.opentopography.org/blog/lidar-beginning-appear-google-maps-terrain-layer), your Terrain Generator component offers much higher precisions for USA. Precision goes up to a couple of meters, which is amazing!!<br/>On the global scale it offers either [SRTM 1 or 3 arc-second](http://www2.jpl.nasa.gov/srtm/) data or [30 arc-second GLOBE](http://www.ngdc.noaa.gov/mgg/topo/globe.html) data. Again this is from the mentioned article, I couldn't find this information by searching the Google Maps website.<br/><br/>Terrain Generator 2 component always uses SRTM 1 arc-second data from opentopography.org, and it is limited to [60 degrees north](http://api.ning.com/files/w-Qoov2ENCzQRg6lRoBzUQK52EScXu296*ta5F11vq-cExASG85CmDN5Kn72VorG8LlpGSVOztahbuyI9JQj-kvl0cJH9KqY/srtm_cover_map.jpg) and does not have data for Antarctica. It does not come with satellite image either which is another very convenient feature that you have!<br/>I couldn't find information about the allowed radius provided by the Google maps api free account. I limited the \"radius_\" input to 100 000 meters, even though opentopography.org provides more than that (I successfully downloaded 300 000, but Rhino 5 was not able to create a topography on my PC from such a large amount of data).<br/><br/>Even though I couldn't compare the results from two components, by looking at your upper **example_LB_terrain_generator.gh** definition: set the \"I\" input of \"Surface from points\" component to True. In this way the surface will be interpolated through points, which is what we want.\n\n<br/>Again thank you for the permission, and I look forward seeing those high precision topography that Google maps offers!!\n", "attachments": [], "created_by_name": "djordje", "created_at": "August 25, 2016 at 03:44AM", "created_by": "djordje", "parent_id": "reply_2985220_Comment_1588102", "id": "reply_2985220_Comment_1588204"}