{"body": "\nHey Chris,\n\nYeah, I was expecting it to work just fine since I set my background color to a nice clean white. Strange stuff. I'll upload my LB definition as well as my viewport settings (make sure to back yours up first if you want to see the again XD). I didn't have any geometry at that point, just a new rhino document and wireframe top view with LB's diagram.\n\nOh, really?  Thanks, that's nice to hear because I felt like I was one of those typical apple users complain about some aesthetic feature being not \"cool\" enough or something. Up to a point I wish I could just quickly code something myself and see if it looks as good as I thought it would, so yeah, it would be a pleasure for me to help you guys even a little bit. \n\nI am currently learning Java's Processing (because it is said to be great for beginners and fun to learn and indeed it is). Before that I only learnt Visual Basic in chinese XD as one of compulsory courses after which I had enough XD. So right now despite my growing love for coding I had to slow down because of my graduation project. So yeah, let me jump right in Python after I graduate and find a job otherwise I'm afraid I'll spread too thin and won't accomplish anything. \n\nAnyway, I'm really looking forward helping your team and learning something new and awesome, let's come back to this topic after I deal with uni and job if that's ok?\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1507352", "name": "Wireframe.ini"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1507353", "name": "Rendered.ini"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1507354", "name": "01_Wind.gh"}], "created_by_name": "Tim", "created_at": "April 12, 2016 at 9:29pm", "created_by": "Timur582", "parent_id": "reply_2985220_Comment_1506887", "id": "reply_2985220_Comment_1507351"}