{"body": "\nAbraham,\n\n\n\nI'm glad that we are finally coming to an agreement about what these terms refer to and that, at this point, we are just trying to define them in a clear manner so that others do not get as confused as we once were. Also, I agree that explaining what the components are intended to do is more helpful than explaining all of the possible things that you could do with the component.  So, to describe the two big areas of confusion that we want to clarify to new users:\n\n\n\nThe first is that we **could** use the Honeybee VSC component for urban heat island analyses to understand heat loss from surfaces of all orientations if we run it with a uniform sky (this would be just Sky Component without any 'Vertical').  However, I realize that having new users do this is potentially confusing if they have not gone through the same long process that we have or are approaching the VSC metric from its applications in day lighting and not urban heat island.  In fact, I remember Oke using the terms 'Sky Component' and 'Sky View Factor' interchangeably in a number of his papers (similar to your first definition, Abraham) and I think that this interchangeable use of terms might be partly to blame for my confusion over these past few discussions. Accordingly, I have revised the description of the Honeybee_VSC component to reflect this daylight-evaluating definition and I will leave the original name VSC for this reason.\n\n[https://github.com/mostaphaRoudsari/Honeybee/commit/755dc6c632398c8...](https://github.com/mostaphaRoudsari/Honeybee/commit/755dc6c632398c8082de029e731c2a8edaf1f41c)\n\n\n\nThe second issue is that (as you also point out Abraham) some researchers do not differentiate between 'Sky View' and 'Sky Exposure'.  The example that I think you cite of people taking fish-eye images of the sky (a point-based method) and calling the visible portion of the sky sphere 'Sky View' is one that I have encountered a few times.  I also think that the Ecotect shading mask might not make this distinction and that the old Ladybug_Shading Mask also does not make this distinction.  However, I have just committed a new version of the shading mask component, which calculates both Sky Exposure and Sky View with a corresponding spherical or planar visual output that should help people understand the difference between the two.\n\n[https://github.com/mostaphaRoudsari/ladybug/commit/51a3a825ae394c48...](https://github.com/mostaphaRoudsari/ladybug/commit/51a3a825ae394c489504808257b93f6505b784e4)\n\n\n\nFor the sake of clarity to new users, let me know if you agree with the following standard across Ladybug + Honeybee:\n\n\n\n**VSC** should be used for daylight applications of exterior vertical walls (using the UK Building Research Establishment's definition) and calculated with the Honeybee_Vertical Sky Component recipe.\n\n\n\n**Sky View** should be used for urban heat island applications, evaluating the heat loss of surfaces facing all different directions.  It should be calculated with the Ladybug_View Analysis component (or, if you only want to do a detailed analysis at a point, you can use the new Ladybug_Shading Mask component with the proper input).\n\n\n\n**Sky Exposure** should be used to evaluate general visual connection of people to the sky and should be calculated with the the new Ladybug_Shading mask component that I just committed (or, if you need to test a series of points in a given region, the Ladybug_View Analysis might be helpful).\n\n\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "February 15, 2016 at 2:10pm", "created_by": "ChrisMackey", "parent_id": "reply_2985220_Comment_1463328", "id": "reply_2985220_Comment_1463832"}