{"body": "\nFarnaz, Mauricio, and Nick,\n\n\n\nThanks for the great discussion here.  Mauricio, your beautiful and comprehensive answer is correct.  The current implementation of THERM in GH accounts for the surface resistance of radiative and convective heat transfer through the _filmCoefficient input on the \"Create Therm Boundaries\" component.  This filmCoefficient in W/m2K represents the \"U-Value\" of the air film between the edge of the THERM materials and the surrounding environment that is at the specified _temperature.  The extra resistance from this air film is why the full construction U-Value that you are getting out of THERM is a lower than just the (conductivity of material) / (depth of the material).  Accounting for air films is particularly important when you get constructions that have a high overall conductivity (like a single pane window), since almost all of the resistance of such a construction is due to the air films.\n\n\n\nTo elaborate further, you might have noticed that, in the example files on [hydra](https://hydrashare.github.io/hydra/index.html?keywords=LBNL), I set this filmCoefficient to be either \"indoor\" or \"outdoor\", which basically uses some code that I wrote to autocalculate the film coefficient for you.  I take into account both the emissivity of the material at the boundary (which gives you more air film resistance for lower emissivities) as well as the orientation of the boundary in the 3D space of the Rhino model.  The code I wrote will take these parameters and match them to those published in ASHRAE Fundementals, which you can see in table 1 of the first page of this PDF:\n\n[http://edge.rit.edu/content/C09008/public/2009%20ASHRAE%20Handbook](http://edge.rit.edu/content/C09008/public/2009%20ASHRAE%20Handbook)\n\nI interpolate between these values in the event that your emissivity is not 0.05, 0.2, 0.9 or the orientation of your boundary is not any one of the 5 that they give.\n\n\n\nI know that THERM also has the capability to actually run the radiative and convective formulas that you posted, Mauricio, as opposed to just using a single film coefficient to account for all of this resistance.  The running of these formulas is particularly useful is the radiant temperature at the boundary is different than the air temperature.  However, as long as you are ok with this assumption that the air and radiant temperatures are the same (which is the case for all of the situations that I have encountered), the film coefficient is perfectly sufficient.  If anyone ever has need for this capability of running boundary conditions that have different radiant and air temperatures, please post here and I can think of a way to implement it.  I rather like the simplicity of the current interface, though, and I think that I will keep it this way until we understand the purposes for why someone would need separate radiant and air temperatures.\n\n\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "May 14, 2016 at 11:26pm", "created_by": "ChrisMackey", "parent_id": "reply_2985220_Comment_1527368", "id": "reply_2985220_Comment_1530175"}