{"body": "\nLeonardo,\n\nI am glad that you found this discussion as it is probably the most complete description of the solar fan/envelope tools.\n\nI do not understand your question exactly.  There is a finite amount of sunlight and I think that you need to assess the tradeoffs between having the sun go to the roof or the ground.\n\nAlso, I would encourage you to be critical of taking a solar envelope as the actual boundary of what you should build.  As far as I understand, the methodology is meant mostly to make you aware of what sun you might block with a building and there seems to be a consensus that taking the boundary too religiously in several cases does not yield much benefit: [http://www.gsd.harvard.edu/research/gsdsquare/Publications/Solar_En...](http://www.gsd.harvard.edu/research/gsdsquare/Publications/Solar_Envelope.SimAUD2011.pdf)\n\nThe benefits can probably be improved if you have a clear reason for why solar access is needed (ie. is it to ensure that street trees get sufficient sunlight for photosynthesis, or for passive solar heating of neighboring buildings, etc.).  This reasoning would give you criteria for selecting sun vectors with annualHourlyData and a conditional statement (for example, selecting just the sun vectors when it is cold out and the solar radiation is above a certain minimum will give you a sense of how to build in a manner that does not infringe on neighboring buildings's passive solar heating).\n\nLastly, you should probably play around a bit with the boundary of the \"site.\" If you are concerned about solar access to the street, the present setup that you have is ok but, if you are looking at the effect on neighboring buildings, you should extend the boundary out to the base of these buildings.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "February 28, 2015 at 7:45pm", "created_by": "ChrisMackey", "parent_id": "reply_2985220_Comment_1232209", "id": "reply_2985220_Comment_1233681"}