{"body": "\n@ Abraham: thank you for pointing to the component!<br/><br/>@ Giacomo,\n\n\n\nI was just curios to see this terrain shading mask working because, for future projects, it would be easier and faster to use.\n\n<br/>If it is not working, then this can be a limitation of Honeybee, not the Terrain shading mask component.<br/>You can authenticate the mask shape by using the [Udeuschle panorama generator](http://www.udeuschle.de/panoramas/makepanoramas_en.htm) (I used the following Trento coordinates: [lat:46.066667, long:11.116667](https://www.google.rs/maps/place/46%C2%B004'00.0%22N+11%C2%B007'00.0%22E/@46.066667,11.1144783,17z/data=!3m1!4b1!4m5!3m4!1s0x0:0x0!8m2!3d46.066667!4d11.116667)):\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/qSnsnrdRZgGp-JsOe0qcZ1WnJ85RQAsQ9ZQrB0MJla2Hplnb8jpR30INA2haLovxTWlYr1gUBt1rt2LuJXDxKqDvDnFqoAuj/Trento_terrainShadingMask2.jpg?width=250\" width=\"250\"/>](http://api.ning.com:80/files/qSnsnrdRZgGp-JsOe0qcZ1WnJ85RQAsQ9ZQrB0MJla2Hplnb8jpR30INA2haLovxTWlYr1gUBt1rt2LuJXDxKqDvDnFqoAuj/Trento_terrainShadingMask2.jpg)\n\n[Sketchup has a similar plugin](https://www.youtube.com/watch?v=Ja4Hi_Kq2FU) for Trynsys3D terrain shading masks.<br/><br/>\n\nI gave a reply on your upper questions [in here](http://www.grasshopper3d.com/xn/detail/2985220:Comment:1577283), in component's release topic, so that it would be useful for others users too.<br/><br/>\n\n\n\nActually I tried also to create the mask of the mountain using the topography I imported from Sketchup and the Ladybug Shading Mask II component. In this way the shading effect is well noticeable, but the process of creating the mask from such a complex geometry is very slow.\n\nI can make a component which will automatically generate the topography of the local terrain, for a given latitude/longitude, but you will have to wait some time. I am currently doing some repairing around my house and cottage, and I do not have any spare time.<br/>Have in mind that depending on the configuration of you PC, you may not be able to have the terrain radius of up to 100 km. While Terrain Shading Mask component actually creates this terrain, it does not add it to the grasshopper document. In your case the terrain will be added to the grasshopper document which may crash Rhino depending on your PC configuration (for example it crashes Rhino on my PC).\n", "attachments": [], "created_by_name": "djordje", "created_at": "August 05, 2016 at 02:47PM", "created_by": "djordje", "parent_id": "reply_2985220_Comment_1573898", "id": "reply_2985220_Comment_1577089"}