{"body": "\nKhalid,\n\nYou can read in the illuminance values for a given hour using the \"Read Hourly Results for an Annual Daylight Study\" component like the image below and in the attached GH file:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/egskNbhDO62Z9qPSGK1MuQb1MjKkU08DJmO9AYXFpQ93CVv-qGF2lko9Yd5YnYw5jtZ09IGoQYCnBA0C*7yXAF2M0jPqPqZ0/HourlyDaylightResults.JPG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/egskNbhDO62Z9qPSGK1MuQb1MjKkU08DJmO9AYXFpQ93CVv-qGF2lko9Yd5YnYw5jtZ09IGoQYCnBA0C*7yXAF2M0jPqPqZ0/HourlyDaylightResults.JPG)\n\nDepending on your goal, you might also find the \"Read DS Result for a Point\" component and the \"Read All the Hourly Results from Annual Daylight Study\" component helpful (man, all of these daylight result components have really long names!)\n\n\n\nFrom my limited understanding of Daysim, I don't think that it can compute the daylight results at a timestep that is less than one hour.  I am fairly certain that the values in the csv file are given on the half-hour because the interpolation between the hours in the weather file gives a more accurate result over the whole year (without east-west bias). I know that this is why I had to do some interpolation between hours for this rough Annual Sun Exposure (ASE) calculation with the sunpath:\n\n[http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;for...](http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;fork=hydra_2&amp;id=Estimate_Glare_Potential_Over_a_Year)\n\nThe other members on the forum who have a better knowledge of Daysim might be able to give a better answer than I but it seems reasonable to take the HOY that you input into the \"Read Hourly Results for an Annual Daylight Study\" component as the results for that hour of the study if it would help with your sanity regarding the large data structure.\n\n\n\n-Chris\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1422667", "name": "Honeybee_Annual_Daylight_Simulation_Example_CWM.gh"}], "created_by_name": "Chris Mackey", "created_at": "December 16, 2015 at 8:14pm", "created_by": "ChrisMackey", "parent_id": "reply_2985220_Comment_1422031", "id": "reply_2985220_Comment_1422665"}