{"body": "\nHi Abraham\n\nOK I think I am the right path then.\n\nRegarding your curiosity I hope the following makes sense: \n\nTo start with I just wanted to understand what was happening in EP when calculating energy fluxes. All this sphere-approx-thingy was only to get a sense of flux from any direction from the entire year.\n\nHowever my final goal in this case is to approximate annual flux-rates through any types of transparent surfaces. Ideally I want real time feedback of thermal indoor environment - which I know is quite difficult and all sorts of other concerns than solar gain is of course very important. For now I only wanted to estimate the impact of changing solar intensity. \n\nI made a definition that approximates maximum direct irradiance (only beam component for now) (heavily depended on Ladybug but no Energy+/Honnybee or other simulation-programmes is required). The idea is to make a **critical sky component** from weather data that simply computes max Watts from certain points in the sky. All surfaces with windows first goes through a simple shadow analysis (isovist/culled everything behind normals) and then computes amount of effect from each critical sky components. This of course need to be adjusted by the angle of incidence, the g-val (SHGC), window area and other factors. To do this I need to validate the concept. And I thought HB/EP's flux would make it much easier to do. Now after I found the case with non-planar child-object it certainly is super simple to validate the heat- and beam fluxes. \n\n[<img class=\"align-center\" src=\"http://api.ning.com:80/files/m3kRA-aqkq*KNm4CEGnQ6ZpY2FKX6Ee7oAsbxZACYRrPeF33Ah9nfTjtRk4525Zkio1XOSAEdGcRRcrm2oqwvicj7Zmh9ahf/fastflux.PNG?width=500\" width=\"500\"/>](http://api.ning.com:80/files/m3kRA-aqkq*KNm4CEGnQ6ZpY2FKX6Ee7oAsbxZACYRrPeF33Ah9nfTjtRk4525Zkio1XOSAEdGcRRcrm2oqwvicj7Zmh9ahf/fastflux.PNG)\n\nI'll post an update on my progress as soon as I get results and promise to share my files when they make more sense.\n\n/K\n", "attachments": [], "created_by_name": "Kristoffer Negendahl", "created_at": "November 17, 2014 at 07:10AM", "created_by": "KristofferNegendahl", "parent_id": "reply_2985220_Comment_1170100", "id": "reply_2985220_Comment_1170106"}