{"body": "\nAbraham,\n\n\n\nI went and checked the thermal mass polygon in a couple of climates where I know it has a big effect and I got results that made sense to me.  Specifically, in the San Fernando Valley of Los Angeles, which has 12% of the year made comfortable, and Shiraz, Iran, which also has 12% comfortable (assuming default parameters).\n\nJerusalem also makes sense to me.  There is only a maximum possible 9% of the year that is inside the polygon (you'll see this if you set the timeConstant to a very high number).  The default strategyPar makes 6% of these hours comfortable and 3% without cool enough temperatures in the previous hours.  This seems reasonable to me.\n\nI could be convinced to change the default time constant to 12 hours (instead of 8) as I know that 12 is the default of climate consultant but that seemed really idealized in my opinion.  You'll need really high exposed mass and insulation without much internal heat gain to make conditions stable for more than 8 hours in my opinion.\n\n\n\nAs for the solarHeatCapacity, I get changes when I drop it down to 10 W/m2 or boost it up to 100 W/m2.  It's definitely a parameter that operates on an \"order of magnitude\" scale and little tweaks to it won't change it too much.  You can think of this number as representative of a lot of other physical properties: most notably the depth of the space being passively heated and the thermal mass of that space's materials that participate in heat exchange over the time constant.  Climate consultant uses a default assumption of 30 W/m2 but, from my calculations, this is likely assuming a space that has a facade to floor area ratio that is greater than 1.  If we say that we need to raise the temperature of 10 cm of an exposed concrete floor for passive heating purposes, and we have a facade-to-floor area ratio of 1:\n\nRequired solar flux = ((1 facade-to-floor ratio) x (0.1 m3 of concrete) x (2400 kg/m3 concrete density) x (880 J/kg-K concrete specific heat capacity)) / 3600 seconds/hour\n\n\n\nThis lands you with a required solar flux of 58 W, which is almost twice the 30 W climate consultant default. While me might say that not all 10 cm of concrete participates over the course of a default 8-hour time constant (most of the action is probably within the first 5 cm), we also have to account for things like transmittance of solar though the window, which, for triple pane, is probably only half of the incident solar.  So 50 W seemed to be a more reasonable rule of thumb from my perspective, essentially assuming a facade-to-floor ratio of roughly 1 with 5 cm of concrete participating in an 8 hour heat exchange and a little more than half of solar heat getting through a fully glazed window.\n\n\n\nLet me know if that makes sense or if you have any suggestions,\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "September 09, 2017 at 08:33PM", "created_by": "chris", "parent_id": "reply_2985220_Comment_1810324", "id": "reply_2985220_Comment_1811177"}