{"body": "\nHi Olivier,\n\n\n\nThanks for trying out BF! And I am sorry for responding so late, I have been quite busy at home lately. \n\n\n\nFirst of all thanks for finding out kinks in the HumanUI file. That one is just intended for an easier application of BF and not really for learning how to use BF, hope it was helpful. Not sure what this error is though as I can't reproduce it in my computer. Are you sure you have the latest Human components? I'll try and look it up when I can for you.\n\n\n\nConcerning your results, they do look as expected. A heavy wake area behind the building has been created as you can see, with a quite clear pattern of wind deceleration and a recirculating vortex. This is a standard pattern in outdoor wind and something that generally we try to either minimize or plan activities around since these areas tend to have lower wind velocities and less recirculation, thus leading to debris/dust deposition and potentially higher pollutant concentration.\n\n\n\nThere are a lot of nice examples of urban wind patterns online you can check, it makes easier for you to help validate the results you get.\n\n\n\nFinally, the k and epsilon values for outdoor studies are currently being calculated with (pretty) standard equations for the k-e family of turbulence models. I believe you can find these in the BF source code. Unfortunately I don't have access right now to check where exactly but I would look before the blockMesh component, since the case folder with all the values is created at that point.\n\n\n\nGood luck in your CFD journey! Please keep posting results and issues!\n\n\n\nP.S.: Btw if you are interested on the effect of your building geometry at a section parallel to the wind direction you could also try a 2D simulation. You can do that either by manually editing your blockMeshDict and setting 1 cell width on the direction perpendicular to your wind or by simply assigning a 1m wide windTunnel (centered at your geometry). This will allow you to refine your model much more than possible in a 3D case with lower run times as well. Ofc it's not as accurate as a 2D case but it's nice for experimentation.\n\n\n\nKind regards,\n\nTheodore.\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "September 13, 2016 at 06:23PM", "created_by": "TheodorosGalanos", "parent_id": "reply_2985220_Comment_1598925", "id": "reply_2985220_Comment_1598806"}