{"body": "\nHi Bi,\n\n<br/>The process can evaluate the self shading from the input analysisGeometry and surrounding shading from the input context.\n\nYes, you are correct. That is what the Sunpath shading component will do.\n\n<br/>2. PV SWH Systemsize, can also do that, but there would be no second type of self shading for the chosen minimalSpacingPeriod_ criteria.\n\nPV SWH System Size will not account for the context shading (underlaying roof trees, buildings...)\n\nThere will be no second type of self-shading (the shading from the PV rows in front) **only** for the chosen solar window. Sorry if I haven't explained this clearly in Amaraa's topic. You control this by minimalSpacingPeriod_ input.<br/>You can also let the PV SWH System Size component pick the PV minimalSpacingPeriod_ input automatically (if you do not input anything to it).<br/>Out of that solar window, the second type of self shading will appear. But this is mostly insignificant time of the year (like earlier than 9am or later than 3pm on winter solstice).<br/>The larger the solar window the more annual AC energy you will produce. So for example: you can set the solar window to be from the sun rise to to sunset on winter solstice. This will result in maximal possible AC energy generated. And it may generate a 1% or 2% more AC energy than if you set your solar window from 9am to 3pm on winter solstice. But in the first case, the minimalSpacing (distance) between the rows would be tens of times longer than in the second case. Such large distances are uneconomical. So by producing more AC energy, does not necessarily mean that your PV system is optimal.<br/>I hope I did not explain this in some confusing way. If I did, please let me know, I will try to make it more clear.<br/><br/>\n\nPV SWH Systemsize can only deal with the angled or flat surface, not the curved?\n\nYes, you are correct. The baseSurface_ input is based on a planar surface (horizontal or vertical or angled).\n\n\n\n<br/>So my question is, if I choose to make a curved roof to form a best pv array with best ACenergy, whether should I only choose the first above...\n\nHm, yes, it looks like you would have to go with the upper mentioned 2)a) option.\n\n<br/><br/>What's the relationship between TOF and PV SWH Systemsize?\n\nTOF component can find the optimal tilt and optimal azimuth angles for PV SWH System Size component (its arrayTiltAngle_ and arrayAzimuthAngle_ angles).<br/>If you do not use TOF component, then you need to use Photovoltaics Surface component along with Galapagos to find the optimal tilt and azimuth angles.\n\n\n\n<br/>Also, I'll do my best to make a parametric model as soon as possible and upload it to you, so we can make the discussion more detailed.\n\n<br/>For start it would be enough, if you would attach the roof on which the Photovoltaic modules will be laid. And just point where would you like the PV modules to be.<br/><br/>Regards,<br/>djordje\n", "attachments": [], "created_by_name": "djordje", "created_at": "November 3, 2016 at 3:42pm", "created_by": "djordje", "parent_id": "reply_2985220_Comment_1632174", "id": "reply_2985220_Comment_1632708"}