{"body": "\nHi Theodore,\n\nThank you for starting this discussion. Back to similar questions my first answer is what are you really interested to do in this area? What is the topic that jumps on your nerves and you think should be done in a better way? I think that's what you should be doing for your first development. It shouldn't be hard to get started with development for Ladybug and Honeybee and so far we had a good experience with several developers who joined us.\n\nIf I want to answer my question above based on what I can see down there, you're really interested in LCA. That could be one of the options that we really need some help there. There is an on-going effort for LCA to connect Honeybee to Tortuga ([https://github.com/moethu/Tortuga#tortuga](https://github.com/moethu/Tortuga#tortuga)). If you like I can put you in touch with the team so you can get involved and help them with the process.\n\n\n\nHere is the list of other topics that we currently need help with:\n\n- Implementing AFN for EnergyPlus [Honeybee]\n\n- Implementing 3Phase daylight simulation [Honeybee]\n\n- Finishing Implementation of HVAC systems with OpenStudio\n\n- Connection to OpenFoam for CFD simulation [Butterfly] - I'm planning to restart the process now that OpenFoam will have a Windows version and the initial project is outdated. I need some people with CFD simulation expertise and good knowledge of OpenFOAM \n\n- Data visualization There is so much to be done here. Interactive web based data visualization is something critical that we are still missing from the process. I have started some work but never had enough time to get something really useful done more than epwmap and pollination\n\n\n\nAgain I think you should first answer the question about what is the topic that has been bothering you for a long time and you feel excited enough to solve it to stay up all night and figure it out!\n\n\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "July 16, 2015 at 8:34am", "created_by": "mostapha", "parent_id": "topic_1326279", "id": "reply_2985220_Comment_1326965"}