{"body": "\nYes it is clear now, but can this be something you implement in the Ladybug_Sunlight Hours Analysis? I think could be useful that you can decide if an object is only geometry and not context until you don't input it in the context input. \n\n@ Chris I tried to graft the geometry input to get separate studies but I think is not working. As you can see from the images I have two buildings (dark grey) that are the same building in different locations, surrounded by other buildings (context). If I graft the geometry input I get six branches, the six sides of each box. It means that in each branch the results of the two boxes are merged, in factt if you see the results of the single building the number of test points is exacly the same. I tried also not with the copy of the same box but with two different and the result is the same. Or do I miss to do something?\n\nOk I could split each branch in two sub-branch {0;*} and {1;*} then I should separate the six branches of one box and the six brances of the other box... quite tricky.\n\nIf it is possible would be good that it works like I mentioned, that until you don't input the same object in geometry and in context, but you input only in geometry it acts only as geometry so no need to deal with complicated lists.\n\nI say this because the reseach I work on requires the calculations of minimum sunlight hours for each day (of the specified period) for each test point so it gets really complicated. Thank you!\n\n\n\nFrancesco\n\n\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/9M8ZSgZ5BuUW3hQzeoJYAEK*CSHhnxy*SQHvIXUGbiTuc*wWSCtDrKGzTJy*KozxLl9V0lR7-QLH0uRzctwL0ChgmDiRt6QY/1.jpg?width=721\" width=\"721\"/>](http://api.ning.com:80/files/9M8ZSgZ5BuUW3hQzeoJYAEK*CSHhnxy*SQHvIXUGbiTuc*wWSCtDrKGzTJy*KozxLl9V0lR7-QLH0uRzctwL0ChgmDiRt6QY/1.jpg)\n\n\n\n\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/9M8ZSgZ5BuWgNAkU7oC2YAXLyQYs77o7*c0NqgpAYGYPibkjTvV3OQYwKhYXB*13ngWBFOcSAxtQnDW5EcBoqFygTY79wPUL/2.JPG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/9M8ZSgZ5BuWgNAkU7oC2YAXLyQYs77o7*c0NqgpAYGYPibkjTvV3OQYwKhYXB*13ngWBFOcSAxtQnDW5EcBoqFygTY79wPUL/2.JPG)\n", "attachments": [], "created_by_name": "Francesco De Luca", "created_at": "January 15, 2017 at 9:50am", "created_by": "FrancescoDeLuca", "parent_id": "topic_1669294", "id": "reply_2985220_Comment_1672455"}