{"body": "\nNick and Antonello,\n\n\n\nThank you for pointing out and fixing these bugs and I am sorry for being a bit late to the conversation.  I originally wrote the Adaptive Comfort component such that you should not connect up any analysisPeriod if your input data is not for the full year.  Nick, you will see that if you disconnect the analysisPeriod from the Adaptive Comfort component in your file, the analysis period in the Ladybug header is output correctly. \n\nAntonello, your first bug fix for this is helpful and you are correct to ask whether it works for all cases.  When someone connects up and analysis period for data that is not annual, I agree that we should just ignore this connected analysisPeriod as your fix suggests.  However, we should give a warning to the user that this is happening.  I have done this in the attached file and on the version of the component I just pushed to the github:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/iwhKaf*i-h1wBCpeF437F*fmilZDf*HJQNVDNABzjMiyNl9Ux1z63n-Ww3Ia6DNUgvPxEXe11ak*dZdZf*VCCB1*jLDQUW-q/WarningonAdaptiveComponent.jpg?width=721\" width=\"721\"/>](http://api.ning.com:80/files/iwhKaf*i-h1wBCpeF437F*fmilZDf*HJQNVDNABzjMiyNl9Ux1z63n-Ww3Ia6DNUgvPxEXe11ak*dZdZf*VCCB1*jLDQUW-q/WarningonAdaptiveComponent.jpg)\n\nAs for your second bug-fix, Antonello, man that is elegant!  I haven't really used deques before but they are clearly very useful.  I just committed your fix and thank you for tackling it.  My coworker actually discovered the same bug the other day but I forgot to add an issue to the github.  I have added you as a contributor to the 3D chart component for this:\n\n[https://github.com/mostaphaRoudsari/ladybug/blob/master/src/Ladybug...](https://github.com/mostaphaRoudsari/ladybug/blob/master/src/Ladybug_3D%20Chart.py#L7)\n\n\n\nThanks for sharing your insight here and stay awesome!\n\n\n\n-Chris\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1498327", "name": "Improved Adpative Comfort.gh"}], "created_by_name": "Chris Mackey", "created_at": "April 1, 2016 at 8:49am", "created_by": "chris", "parent_id": "reply_2985220_Comment_1498178", "id": "reply_2985220_Comment_1498325"}