{"body": "\nHi Mauricio ! \n\n\n\n1) Your answer is quite interesting ! I have tried to understand what you noticed. The schema attached shows that for direct radiation the \"red part\" shouldn't be reached by the sun path (60° max in Paris), but the problem stil arises for the angle theta (for the south but also for the others orientations). For the diffuse radiation, this difference should be 10% as you noticed.\n\n \n\n2) I have done some simulations and tried to analyse the weather file used. You can find my results in the Excel File attached. Some simulations take into account the glazing and others just determine the \"occultation factor\" of the shading device, to which I apply then the solar factor of the window. I found there is a noticeable difference between \"_shading_1\" and \"_Focc_1\" for exemple, we should have found similar values ... ? It seems to happen something strange when the rays passe through the glass to reach the analysis points. Facing those results, I still have trouble to draw conclusions. I also determined the diffuse part of radiations for each day from the weather file used, it may help to understand ... If you have any suggestion to explain those results, please let me know.\n\n\n\n3) Another point attracts my attention :\n\nThe horizontal infrared radiation intensity of the weather file is quite high and constant. I'm wondering if HB take into account this solar radiation's component which represent about 50% of the solar energy ?!\n\n[http://bigladdersoftware.com/epx/docs/8-3/auxiliary-programs/energy...](http://bigladdersoftware.com/epx/docs/8-3/auxiliary-programs/energyplus-weather-file-epw-data-dictionary.html#field-horizontal-infrared-radiation-intensity)\n\n\n\nI continue my research about what is going under the hood (reading documents on Radiance and Daysim calculations) and let you know about the progress of my searches.\n\n\n\nThank you again for your support !\n\n\n\nRegards,\n\nSeverine \n\n\n\n\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1506475", "name": "schema.jpg"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1506476", "name": "Results.xlsx"}], "created_by_name": "Severine", "created_at": "April 12, 2016 at 4:24am", "created_by": "Severine", "parent_id": "reply_2985220_Comment_1502510", "id": "reply_2985220_Comment_1506474"}