{"body": "\nNita,\n\nAs I understand it, Galapagos requires a single number input to guide the optimization. The trick is developing a fitness function that balances the multiple objective parameters into one value. I have found that this is tough because energy , glare, view quality, daylight autonomy and aesthetics cannot be directly compared. How many units of view are worth a 10% reduction in energy? Somewhere along the line the user needs to make a subjective call on how to balance these objectives, which throws off the accuracy of any optimization.\n\nAs far as the GH code in concerned, I think you would needs to weigh each objective with coefficients and sum them into one final number. This would be a custom script that normalizes all outputs, multiplies by a weighting factor, then sums them all together.\n\n \n\nI'm curious how others get past the inability of optimization scripts to truly balance dissimilar objectives. I think the solution lies in avoiding optimization altogether. I ran into the idea of Pareto efficiencies while exploring a similar question. Take a look here:\n\n[http://en.wikipedia.org/wiki/Pareto_efficiency](http://en.wikipedia.org/wiki/Pareto_efficiency)\n\nIf you iterate through a variety of options (possibly using Galapagos to run fewer options) and then review the entire landscape of solutions, you may be able to find a Pareto frontier that identifies many solutions that maximize most of your objectives. You can also use something like Pollinator to better navigate the solution landscape.\n\n[http://www.grasshopper3d.com/group/ladybug/forum/topics/new-develop...](http://www.grasshopper3d.com/group/ladybug/forum/topics/new-development-pollination-for-exploring-multi-dimensional-data)\n\n \n\nI've struggled with this issue for a while and was hoping someone would have a better answer. I'm all ears.\n\n-Leland\n", "attachments": [], "created_by_name": "Leland Curtis", "created_at": "March 31, 2015 at 07:54AM", "created_by": "LelandCurtis", "parent_id": "topic_1253437", "id": "reply_2985220_Comment_1253287"}