{"body": "\nHi Bernardo,\n\nThank you for reporting.  I just did a massive overhaul of this component this past weekend and I found the bug that you mentioned in this discussion.  The bug was essentially that the context was not being meshed correctly and it has since been fixed.  You can get the new component by syncing with the github or by using the component that is in the attached GH definition.\n\nAlso, I should note that a key new feature that has been added in this overhaul is the ability to run a much faster calculation using a method that was developed by the awesome comfort scientists over at the center for the built environment ([http://escholarship.org/uc/item/89m1h2dg](http://escholarship.org/uc/item/89m1h2dg)).  The new method gets you results that are very close to that of the full mannequin mesh but in about 1/50th of the time by extrapolating the mannequin geometry down to a set of 9 points and using some coefficients to compensate for the geometry of the human body.\n\nLasty, I put in options of 3 simplified mannequin meshes for the 3 different body positions (standing, sitting, and lying down).  This should allow you to run a faster version of the older method if you so desire.  They can be accessed by plugging integers 3,4 or 5 into the BodyPosture input.\n\nUltimately, the new fast methods are going to allow us to factor in direct solar radiation in the indoor temperature maps that I have been working on:\n\n[https://www.youtube.com/watch?v=__cRBh2DGMA&amp;list=UUc6HWbF4UtdKd...](https://www.youtube.com/watch?v=__cRBh2DGMA&amp;list=UUc6HWbF4UtdKdjbZ2tvwiCQ)\n\nI will post a new tutorial video on the updated solar MRT adjustor and the indoor temperature maps once I finish developing the full workflow to make indoor comfort maps.\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "October 28, 2014 at 02:54PM", "created_by": "chris", "parent_id": "topic_1157280", "id": "reply_2985220_Comment_1157378"}