{"body": "\nThank you, Abraham, for clarifying, Saeran for explaining the situation, and Mostapha for weighing in,\n\n \n\nI am sorry that I have been out of the loop for the past 5 days while my classes have been starting up but I’m glad the discussion has been rolling!\n\n \n\nI understand what you mean, Abraham with property boundary rights and I’ll admit that I can potentially see some usefulness in what you are suggesting with the solar envelope.  For example, I could imagine this integrated into the component as a \"trimWithSiteBoundary\" boolean input that a user could flip if they are only interested in seeing what is going above their property boundary.  However, I have a big fear that new users might not fully understand what this operation is doing if they are first encountering my component and would therefore end up with a misleading result.  In other words, I would like users to see the complete solar geometry before they trim it with the site boundary extrusion so that they are fully aware of what is going on.  Also, because this trimming operation is very easy to set up with existing grasshopper components (you were able to do it yourself pretty easily in the file that you uploaded), I would rather have users employ this method rather than having something built into the component.\n\n \n\nAs for the solar fan suggestion, I think that filling in that portion of the fan would just be too misleading.  I could all-too-easily see new users making the mistake of saying that a neighbor’s cantilever over the north part of their site blocks their sun, which is simply not true. Also, there is the argument that this operation (if the user really wants it) should be very easy to set up with existing grasshopper components.  However, I see that in your uploaded GH file, this has not been working correctl.  I have been playing around with it for the last hour and I am pretty confident that you have found a bug in Grasshopper that I will report to Guilio shortly.  In the meantime, I have uploaded a new file in which you are able to get the type of solar fan that you desire.  I will try to keep you posted.\n\n \n\nAs Mostapha and Saeran have suggested, I think things would be best if we press forward with having my component useful for very detailed lengthy solar fan/envelope analysis and Saeran’s component useful for quick, initial analysis.  By the way, Saeran, I am really impressed with the speed of your component, especially for the solar envelope.  I like the methodology you used and it’s a huge asset to the Ladybug suite.\n\n \n\nThanks again, Abraham, for all of the feedback and I hope that you are able to get a lot of use out of these components.\n\n \n\n-Chris\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1005630", "name": "solarFan_solarEnvelope_2_A_edited.gh"}], "created_by_name": "Chris Mackey", "created_at": "February 8, 2014 at 4:28pm", "created_by": "chris", "parent_id": "reply_2985220_Comment_1003899", "id": "reply_2985220_Comment_1005629"}