{"body": "\nAlright so I ran through the whole thing again as an extra check and it turns out it was a false alert (terribly sorry about that) where I was pushing the list from honeybee one index down through a rogue script I wrote. Again, apologies for the false alert.\n\nHowever the comparison for solar gains between IES and HoneyBee still stands. I get an average error of roughly 25% in the Summer (when I account for daylight savings) where HoneyBee is underestimating compared to IES. In the Winter both results are very similar but gradually deteriorate as they go into the summer. I have constructed a fairly simple window and expected only the G-value (SHGC) to affect solar gains. In both programs there is only 1 south facing window (9.6m2) with a G-value of 0.4. Is making a window out of 1 layer of glass the issue? \n\n\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/uoL1jM-yecAXryRQseEjvOST9kghy1ZeJh7ql4XzN9VvfV95hS4nKsPzk1bIwFnCQIwpLkGrJL5bT14h1AN-6CKwHqCxhFmD/HBWindow.PNG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/uoL1jM-yecAXryRQseEjvOST9kghy1ZeJh7ql4XzN9VvfV95hS4nKsPzk1bIwFnCQIwpLkGrJL5bT14h1AN-6CKwHqCxhFmD/HBWindow.PNG)\n\n\n\nOther quick question, is there any way to make EnergyPlus model with daylight savings through HoneyBee? \n\n\n\nI'm also having trouble with natural ventilation (maybe I should post this in a different conversation?), I have set up the windows to open for the same interior and exterior temperature conditions and with the exact same infiltration+auxiliary vent rates but results are very different. Auxiliary vent and infiltration are the same throughout the entire year but whenever the windows open it seems HoneyBee calculates higher flow rates. Windows in both models also have the same operable area (10%).\n\n\n\nI thought maybe the windows weren't opening right for some reason so I created a schedule from the IES window opening to limit the degree of opening of the windows but the results were still very off. Any ideas what might be causing this?\n\n\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/BjPsdF1MrUnc1LvCsCPkiWUZ8opge2HKrUj*KfyqKM5OzwbEgd2oWa3I**MeGCpen2mcnxpm1rRh6LylK6Ela4HoxJu*rN8U/Airflowvolume.PNG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/BjPsdF1MrUnc1LvCsCPkiWUZ8opge2HKrUj*KfyqKM5OzwbEgd2oWa3I**MeGCpen2mcnxpm1rRh6LylK6Ela4HoxJu*rN8U/Airflowvolume.PNG)\n\n\n\nI realise this is quite a mouthfull of stuff to go through, sorry about that, but I've attached the file I'm modelling with as well as the excel sheet I'm writing my results to. I'm also using Bumblebee to read/write data from/to excel.\n\n\n\nThank you!\n\n\n\nAntoine\n", "attachments": [], "created_by_name": "Antoine Dao", "created_at": "May 06, 2016 at 04:22AM", "created_by": "AntoineDao", "parent_id": "reply_2985220_Comment_1523093", "id": "reply_2985220_Comment_1524077"}