{"body": "\nFrancesco and Djordje,\n\n\n\nI apologize for coming so late to this discussion but I have two important pieces of information to add:\n\n\n\n1) I am going to be adding in a microclimate map recipe for PET very shortly (within the next day or two) using the PET code the Djordje added to Ladybug.  This will make it a bit easier to work with PET in the same spatial way as the other comfort metrics.  I will post back here once I finish implementing this recipe.\n\n2) We have a means of accounting for urban heat island effect and the air temperature effects of \"urban context with high buildings\" that you mention, Djordje.  The Urban Weather Generator (UWG) was built expressly for warping rural/airport EPW files based on urban morphology and materials.  It was built by a PhD student at my university using open source code from the Linux-based Town Energy Balance software.  I have built a GH interface for the UWG but I have released it under the name of another insect (Dragonfly), which is currently in beta and meant to enable the general warping of climate data to account for things such as climate change ans urban heat island, as well as linking out to other databases of climate data other than the EPW.  You can find an example file for the Urban Weather Generator here:\n\n[http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;for...](http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;fork=hydra_2&amp;id=Urban_Weather_Generator_Workflow&amp;slide=1&amp;scale=1&amp;offset=0,0)\n\nGenerally, I have found that the effect of urban heat island on urban air temperature is realitvely small in comaprsion to other things such as the variation of radiant temperature over an urban area or the effect of global warming over the next few decades.\n\n\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "May 16, 2016 at 1:08pm", "created_by": "chris", "parent_id": "reply_2985220_Comment_1527295", "id": "reply_2985220_Comment_1531271"}