{"body": "Hi Christian,\n\nThank you for posting the equations and the figures. This confirms that the ASHRAE and EN radiant asymmetry standards are using the same equations. Adding a component that calculates the local discomfort will be easy to implement and worthwhile to have once I get a detailed view factor component up and running. I will make one once I get the view factor component implemented.\n\nI feel that I could have been clearer about my question as I realize that it might not have been obvious before. To try to phase it simply, I just want to know how Olesen defines a cold wall situation versus a warm wall situation.\n\nWith the ceiling case, it is clear how I am supposed to use it. For example, If I am designing a radiant heated ceiling, I should use the \"warm ceiling\" function to estimate discomfort from radiant asymmetry and, if I am designing a radiant heated floor, I could use the \"cool ceiling\" function to estimate potential discomfort from radiant asymetry.\n\nHowever, if I am designing a vertical heated radiant panel in a room that also has cooler windows, what function am I supposed to use? Let's even say for argument's sake that neither the window or the radiant panel are cool/warm enough with respect to the room average to dominate the situation but there is clearly a potential for radiant asymetry to cause discomfort between the two surfaces. Should I always use the cold wall situation to air on the side of caution? Or should use an interpolated function between the cold wall and warm wall? Or is there an implicit direction of the human body in the functions (for example, I use the \"warm wall\" if the person is facing the radiant panel and the \"cool wall\" if the person is facing the window.)?\n\nAny insight that anyone could provide to this would be much appreciated. I just checked both ASHRAE 55/and ASHRAE Fundamentals and neither of them provide any guidance on this.\n\nThanks again,\n-Chris", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "April 06, 2016 at 05:31PM", "created_by": "chris", "parent_id": "reply_2985220_Comment_1502452", "id": "reply_2985220_Comment_1502553"}