{"body": "\nHi - Mostapha, I am glad you mentioned the unit. It was in meters although I was modelling as if it were square feet.\n\n1_When It was in meters, I tried\n\ngrid size 10 = 30 seconds\n\ngrid size 5 = 1.5 mins\n\ngrid size 3 = 2.7 mins\n\ngrid size 2 = ??? memory peaks and rhino freezes.\n\n\n\nHowever now that I have switch the unit of the rhino file to feet, \n\nnow grid size 3 = 18 mins. \n\nwhich makes i suppose since the analysis will have to work with smaller tolerance.\n\nThe below img is what i got after 18 mins. I think also the fact that I have joined the individual units with solid union also make it longer maybe? you can see the mesh triangulation not only around the corners of masses but also inbetween different units (if you look at the top level you will see)\n\noh, and I also have very little disk space left.\n\n[<img class=\"align-center\" src=\"http://api.ning.com:80/files/PhpRQMoFW8YUcJYP1Qt*pGfr*mqz2KvjRPg9YNvNRs4IDwZctzuuYcqHJnvWMAYBysXsYUf2JnfFL8S7o64wLqXII0VkANH7/modelling_024.png?width=721\" width=\"721\"/>](http://api.ning.com:80/files/PhpRQMoFW8YUcJYP1Qt*pGfr*mqz2KvjRPg9YNvNRs4IDwZctzuuYcqHJnvWMAYBysXsYUf2JnfFL8S7o64wLqXII0VkANH7/modelling_024.png)\n\n\n\nI would like to share the file but right its a big mess and has a lot of stuff that is unrelated to this particular memory issue, like revit interoperability and urban modelling. and the definition is set up so that it needs to have an excel file that feeds what you see on the lower left corner, wing mass scales. In order to compare design studies I am animating the index of list component that feeds the different scale of the wings and the width of the floor plates you see. you can see it in my video [here.](http://www.grasshopper3d.com/video/tetra-place-monitoring) I will try to clean it up a bit when I get a chance, but it seems like grid size 3 might work as a starting point.\n\n\n\nwhen I get around to extract values from the mesh vertices and actually apply different facade designs driven from the parameters, I would know better what grid size might be necessary.\n\n\n\n\n\n\n\n\n", "attachments": [], "created_by_name": "Youngjae chung", "created_at": "November 17, 2014 at 02:05PM", "created_by": "YOUNGJAECHUNG", "parent_id": "reply_2985220_Comment_1170167", "id": "reply_2985220_Comment_1170542"}