{"body": "\nTheodore,\n\n\n\nI had meant to respond to this sooner and I think that this statement is very relevant and well-timed. My one point of feedback is to be mindful of the tendency to incorporate new technologies and ideas (in this case agent-based modelling) simply because they are the new cool thing to do and, if we think carefully about how the integration of agent-based modeling will improve the accuracy and usefulness of our models, we are more likely to make lasting contributions through their integration. \n\n\n\nFor example, it seems vital to me that such agent-based models be grounded in some clear quantifiable observations of human behavior in real buildings as opposed to relying on our own coefficients to represent how valuable we think certain things are to the occupants.  I will give an example of two agent-based ideas that I have had - one of which has turned out to seem much more valuable in the long-run because of it's grounding in real-world data and I plan to implement soon.\n\n\n\nTo start with the more valuable example, ever since I read this awesome book on adaptive thermal comfort ([https://books.google.com/books?id=vE7FBQAAQBAJ&amp;printsec=frontco...](https://books.google.com/books?id=vE7FBQAAQBAJ&amp;printsec=frontcover&amp;dq=adaptive+thermal+comfort&amp;hl=en&amp;sa=X&amp;ved=0ahUKEwjDmO6avNnJAhUD9h4KHXWVBuAQ6AEIHDAA#v=onepage&amp;q=adaptive%20thermal%20comfort&amp;f=false)), I have had several ideas for how to integrate the findings of recent comfort surveys into our energy models.  Generally, the focus of thermal comfort research seems to be shifting from theoretical human energy balance calculations to surveys of occupant behavior, giving us a lot of great data that helps incorporate these behavioral factors in our energy models.  To continue one of the ideas that you mention, Theodore, here is a plot from the book that describes the window-opening behavior of occupants as the indoor temperature increases:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/5su4fxPuQsoJFD-RVhBKoczOz0aiETpoAy3ubYtLoTF1RwxWq7sXwyZn0Rw4Z4OBgN2V7CX7WhZ*5L37ZsHZ5*GbFxKAxfS9/NatVentFunction.jpg?width=721\" width=\"721\"/>](http://api.ning.com:80/files/5su4fxPuQsoJFD-RVhBKoczOz0aiETpoAy3ubYtLoTF1RwxWq7sXwyZn0Rw4Z4OBgN2V7CX7WhZ*5L37ZsHZ5*GbFxKAxfS9/NatVentFunction.jpg)\n\nCurrently, EnergyPlus does not easily allow you to set such a function for window-opening, as you point out but the incorporation of this behavior seems necessary to produce an accurate model of a naturally ventilated building (since opening all of the windows as soon as the indoor temperature hits 21 C is far from realistic).  To get around this, I was thinking of including an option on the nat vent component that will put in a series of IF/THEN nat vent objects that approximate this smooth function through a step function:\n\nIF 19 &lt; indoor temperature &lt; 20 THEN WindowOpening = 10%\n\nIF 20 &lt; indoor temperature &lt; 21 THEN WindowOpening = 15%\n\nIF 21 &lt; indoor temperature &lt; 22 THEN WindowOpening = 21%\n\nIF 22 &lt; indoor temperature &lt; 23 THEN WindowOpening = 35%\n\n...\n\nI am hoping to implement this soon.\n\n\n\nTo describe the example that I have realized was not so helpful with time, when I was first drafting the idea for high-resolution comfort maps ([https://www.youtube.com/playlist?list=PLruLh1AdY-Sj3ehUTSfKa1IHPSiu...](https://www.youtube.com/playlist?list=PLruLh1AdY-Sj3ehUTSfKa1IHPSiuJU52A)), I originally thought that I would develop computer models an animations of occupants moving around the thermally diverse space to make themselves more comfortable.  Once I started to get into this, however, I realized that the social characteristics of a space usually have a much larger impact on where people place themselves than the thermal characteristics and it is not until the thermal characteristics become very uncomfortable or the presence of other people is completely removed that the thermal environment dominates the movement behavior. Thus, in order to model the occupant behavior, I would have to code in the relative importance of a large number of these social characteristics in relation to thermal comfort, which would have been a process of me simply making up coefficients to produce cool-looking but somewhat meaningless animations.  It is only when my nicely-designed thermal environments were aligned with the social/programmatic characteristics of the space that I could argue that I was justifiably adding value since the thermal characteristics were not in contradiction to or being weighted against the social ones.  So, in the end, realized that all I needed in order to produce a good design was to align the thermal environment with the placing of program and the agent-based modelling would not have enabled the production of a much better design.  This is the reason why the human silhouettes are manually placed in the thermal animations on the youtube playlist in the above link and is the reason why I do not intend to incorporate agent-based modelling in this particular manner.\n\n\n\nLet me know your thoughts on this as I realize I may also be looking at this from a narrow perspective that is not informed by all that agent-based modelling has to offer.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "December 13, 2015 at 11:40am", "created_by": "chris", "parent_id": "topic_1414654", "id": "reply_2985220_Comment_1420565"}