{"body": "\nHi Theodoros,<br/><br/>I am glad to hear that you are enjoying the Photovoltaics components!<br/><br/>You mentioned TSol. Is this the [T*SOL](http://www.valentin-software.com/en/products/solar-thermal/14/tsol) from Valentin software? Isn't it specific for solar thermal energy analysis? Are you working on a PV system which will power a domestic hot water boiler?\n\n<br/>To answer your questions:<br/><br/>1) Each grasshopper component (ghpython being one of those too) is using grasshopper's data matching algorithm. This algorithm takes care of complex issues which may arise from combining lists with single items, data trees with different number of items per branch and so on.<br/>I think there is a way of introducing a call to other processor's threads per each inputted surface, but this will be a very difficult job, as it will require writing a custom data matching algorithm. I do not think I am up to that task.<br/>Instead I tried to introduce the multithread only to the final part of the PVsurface component and one of its time consuming parts: calculation of sun angles, solar radiation and ac/dc power output.<br/>I attached the test file below, but sadly it didn't go well: the multithreaded version mostly runs at the same time as the regular version.<br/>I do not think I am qualified enough to answer why is that so, but I think that it may have something to do with the type of the function that the multithreading is applied to: the code is suppose to run few separate functions a couple of thousand times, and work with a couple of lists. From my experience, the multithreading works the best when a single list or two are supplied to a single function. I may be wrong on this.<br/>I am very sorry to say that I can not implement this feature.<br/><br/><br/>2) I am not familiar if open source PV modules database has been released.<br/>But one can always download the data for specific modules from [producers websites](http://www.photonsolar.com/datasheets/Consolidated%20Data%20Sheet.pdf). It can then easily be transferred to a .csv file or other text file.<br/><br/>Ladybug Photovoltaics are based on NREL's PVWatts model.<br/>In comparison with other commercial software applications, PVWatts offers a more generalized system model, with some of the values and characteristics being assumed or embedded.<br/>The [Fuentes](http://prod.sandia.gov/techlib/access-control.cgi/2004/043535.pdf#page=17) empirical thermal model we are currently using follows the same logic: it generalizes the Module characteristics. The following characteristics are only editable: module efficiency, temperature coefficient and module mount type.<br/>It may be possible to replace Fuentes with [some other](https://pvpmc.sandia.gov/modeling-steps/2-dc-module-iv/diode-equivalent-circuit-models/de-soto-5-parameter-model/), less generalized 5 parameter thermal model. But as an architect, I would definitively need help on this.<br/><br/>\n\nSorry if my reply did not fulfill your expectations, and thank you for the kind words!\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1527571", "name": "PVsurface_multithreading_test.gh"}], "created_by_name": "djordje", "created_at": "May 10, 2016 at 06:33PM", "created_by": "djordje", "parent_id": "reply_2985220_Comment_1526930", "id": "reply_2985220_Comment_1527570"}