{"body": "\nKit,\n\nI apologize for such a late reply.  I cannot run your file without either the Rhino geometry or the text file.  However, I can say that the long run time of a detailed mannequin radiation study is the reason why we have built three alternative workflows into LB+HB for cases when you are not so concerned about how exactly the radiation is falling on the person.  They are as follows:\n\n1) If you plug in the EPW directNormalRadiation and diffuseHorizontalRadiation into the \"Solar Adjusted Temperature\" component instead of the cumulativeSkyMtx, the component will use a much faster formula for calculating solar-adjusted MRT that approximates the human geometry with a few coefficients and only ray-traces sun vectors from a few points instead of an entire human geometry.  You can see this in this example file:\n\n[http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;for...](http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;fork=hydra_2&amp;id=Urban_Microclimate_-_Simple_Spatial_UTCI&amp;slide=0&amp;scale=1&amp;offset=0,0)\n\n2) Djordje Sapcic added an even faster means of estimating outdoor MRT into the \"Ladybug_Thermal Comfort Indices\" component, which is only applicable to the case where you have a person standing in an open filed without any context shading.  It's very useful if you just want to see what it is like for an person in sun vs shade.\n\n3) If you want to produce a high-accuracy map of temperature that does a detailed accounting of surface temperature for context shading and the ground, you can use the microclimate maps as this example does:\n\n[http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;for...](http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;fork=hydra_2&amp;id=Trees_in_Outdoor_Thermal_Comfort&amp;slide=0&amp;scale=1&amp;offset=0,0)\n\nThese maps assume a seated human that is facing in one direction but the calculation is fast and is what I would recommend if you need a decently accurate spatial map of microclimates.\n\nHope this helps,\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "May 16, 2016 at 12:51PM", "created_by": "chris", "parent_id": "topic_1521683", "id": "reply_2985220_Comment_1531268"}