{"body": "\nTheodore and Ceasar,\n\nA couple of notes about how surface/radiant temperature is calculated in EnergyPlus as well as the current natural ventilation implementation:\n\n1) The surface temperatures result from the balance of heat going into the surface, the amount of heat leaving the surface, and the amount of heat stored in the construction's mass.  Usually, about half of the internal heat gain from people, equipment and lights gets radiated to the surfaces of the room and the other half goes into warming the air.  Almost all incoming beam solar radiation goes into the floor surface and diffuse solar radiation is distributed by view factor to the other surfaces of the zone.  Usually, heat leaves the surface by either conducting all of the way through the envelope to the outside or transferring its heat to the air of the zone.  When you use natural ventilation (or an ideal air cooling system for that matter) the zone is cooled by removing heat from the air and not the surfaces.  So the surfaces are only cooled down after the air has become cool and this is why you will see natural ventilation having a larger on the air temperature than the radiant temperature.\n\n2) The current implementation of natural ventilation takes into account the direction of the wind from the weather file.  Essentially, EnergyPlus looks at the difference between the direction the window is facing and the direction of wind in order to derive a wind pressure coefficient that is used to help determine the flow rate through the window.  Theodore, while you are right to point out that a CFD simulation is the most accurate way to understand airflow, the simulations often take days to compute on high-end machines and so it isn't realistic that we will be able to calculate it dynamically for every hour of the year for the foreseeable future (at least until quantum computers are on the market. Or maybe photonic computers might get us most of the way there).  There are plans in the works (when we finally get butterfly up and integrated) to use point-in-time CFD simulations to help compute more accurate wind pressure coefficients for our EnergyPlus runs.  However, for the next couple of decades, I think we are looking at all dynamic simulations of building energy using a simplification of airflow parameters, which can be better informed by CFD as our computing power improves.\n\n\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "February 21, 2015 at 04:53PM", "created_by": "chris", "parent_id": "reply_2985220_Comment_1228711", "id": "reply_2985220_Comment_1229211"}