{"body": "\nHi Aymeric,<br/><br/>First of all, thank you for the constructive discussion and questions.\n\n\n\n- I can't find any definition in the code of Kglob and hS1. Could you tell me please what are those values referencered to? --&gt; probably the globalHorizontalRadiation but how?\n\nYou are right. Kglob is Global horizontal radiation from the .epw file, in W/m2.<br/>hSl is the sun elevation angle in degrees.\n\n<br/>Do you agree that in this case the MRT does not depend on these inputs: location, meanRadiantTemperature, dewPointTemperature and wind speed?\n\nIt depends on location, as location determines the sun vector's elevation, zenith and azimuth angles.<br/>It does not depend on meanRadiantTemperature, dewPointTemperature and windSpeed.\n\n<br/>It does not depend neither on the other bodyCharacteristics like bodyPosture, age, sex, met, activityDuration...?\n\nI think you are correct. It is based on the following assumptions:<br/>sex_: male<br/>bodyPosture_: standing<br/>metabolicRate_: 2.32 mets (walking 4km/h)\n\n\n\nMRT calculated by the TCI-11 method is the mean radiant temperature of a vector pointing vertically with a sky view factor of 100%?\n\nThe sun vector depends on the sun elevation angle.<br/>If \"Sunpath shading\" component is not used to account for shading, then yes, the sky view factor of 1 (100%) is used.\n\n<br/>It can also be applied to a mannequin thanks to the CumSkyMatrix and thus evaluate the dishomogeneity of radiation exposure.\n\nYes, the MRT in Thermal Comfort Indices component, threats the subject as a single uniform body. Outdoor Solar Adjusted Temperature Calculator component's feature of being able to evaluate different parts of the body is indeed impressive.\n\n\n\nIn contrast to the TCI-11, this component distinguishes diffuse and direct radiation and contextualizes the calculation thanks to _ContextShading input, right?\n\nMRT in Thermal Comfort Indices component is based on Man-Environment Heat Exchange Model 2005 by Krzysztof Blazejczyk, one of the authors of UTCI index. MRT MENEX 2005 model has 4 version of solar radiation accounting. I am using the one with global solar radiation. The reason is because it cooperates well with other indices in the component, those that require solar radiation as an input.<br/>I implemented the MRT MENEX 2005 version which separatelly takes into account the direct, diffuse and reflected radiation in the attached file below.<br/>You can read more about the MRT and the whole MENEX 2005 model in general in the .pdf paper attached below.\n\n\n\nThe default groundReflectivity is set to 0.25 --&gt; is GroundReflectivity taken into account in the Tground or MRT calculation in the TCI component? If yes, what is the hypothesised groundReflectivity?\n\nThe MENEX 2005 model does not provide this information, but I assume that it's possibly 0.2 - 0.25 as you said, which is widely used as urban/suburban default annual average albedo value.\n\n\n\nThe default clothing albedo of 37% (TCI-11 bodyCharacteristics) corresponds to Clothing Absorptivity of 63%?\n\nYou are correct again.\n\n\n\nWhy such a big difference and which of the result should be plugged into the UTCI calculation component?\n\nThis is a complex question.<br/>One of the reasons might be the fact that MENEX MRT version is using a simplified formula to calculate the ground temperature, which may significantly affect the final results. It could be beneficial if groundTemperature_ is set as an input.<br/><br/>Another reason why this might be is that the [study](http://escholarship.org/uc/item/89m1h2dg#page-4) which corrects the Mrt for the influence of local heating of the sunlit parts of the floor, is meant to be used for indoor analysis.<br/>It should be said that a number of outdoor indices have been derived from indoor indices and studies, but with edition of its parameters.<br/>In this case we are simply applying the same indoor formulas to outdoor analysis. The study itself does not provide any suggestion that this kind of approach may be valid.\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1523897", "name": "Comparaison_MRT2.gh"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1523898", "name": "MENEX_2005_Blazejczyk.pdf"}], "created_by_name": "djordje", "created_at": "May 06, 2016 at 01:37AM", "created_by": "djordje", "parent_id": "topic_1520583", "id": "reply_2985220_Comment_1523895"}