{"body": "\nHi Leland,\n\n\n\nThank you for your response, I am one of those who appreciate the long posts in this discussion.\n\n\n\nYou make some very good points. I really liked the example you bring about analyzing and focusing on what matters by backing off on parameters that were not as critical. This is something the whole pollination process can indeed provide.\n\n\n\nI want to focus on your last point. The whole purpose of my personal efforts in my work the last few months has been to move myself and my work from assessment to design. That is because if I don't do it, I will always be kept in the compliance part of the process, with minimum opportunities for meaningful impact. The tools and workflows to do that took and will take a lot of time and collective effort. It is hard to develop but doable.\n\n\n\nThe most difficult part is communication. How do I communicate this to the project team without becoming the enemy. I'm planning to develop workshops exactly for this purpose and perhaps a very interesting discussion for this forum would be: how exactly would you go about communicating and disseminating these tools and information to actual, real-life project teams?\n\n\n\nLEED v4 already includes, and rewards, a parametric charrette process where they define a few parameters to be tested. But how to do it is the question. Pollination really helps here but there are still challenges. The biggest one as I said is how to do it without becoming the enemy, either because you are tampering with design issues (architects are especially sensitive) or because of lack of knowledge of these tools and parameters, which always creates hostility in from other parties. \n\n\n\nI'll post my experiences in this group once I have them.\n\n\n\nKind regards,\n\nTheodore.\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "February 07, 2016 at 04:16AM", "created_by": "TheodorosGalanos", "parent_id": "reply_2985220_Comment_1452919", "id": "reply_2985220_Comment_1456821"}