{"body": "\nHi Chris and thanks,\n\nA bunch of garbage indeed there.\n\nSince i have plenty of questions, first i want to describe the garbage:\n\n1. The schedules for Heating and Cooling were intended to avoid heating/cooling consumption in those months i identified as winter/summer. I defined -50 oC and100 oC for such months. But it was a mistake. Just after i defined all the temperatures the same for winter/summer i get the desired temperatures.\n\n2. Equipment/Lighting schedules: I was mixing the occupancy/lighting schedules (when they are ON) with the loads themselves.  I suppose i get mislead with one of your previous examples. I think i'm getting right now.\n\nSo this is with regard the garbage (attached the file with the fixes if you don't mind to check).\n\nNow the questions:\n\na. HB_setEPZoneThresholds: I'm defining there Cooling/Heating Det point and Setbacks. I don't see them in the IDF. If i define HeatingCoolingSetpoint schedules in the HB_setEPZoneSchedules these definitions are not written in the IDF?\n\nb. HB_setEPNatVent: Im defining min/max indoor/outdoor temperatures. But i also don't see where in the IDF they are registered.\n\nc. I know you are using DualIdealSystem for the dafault HVAC. There is a way of not calculating cooling for winter months? I'm not defining well this question, but in this example i'm getting cooling loads bigger than heating for winter. Can't be (!!). In the worst case you open windows but don't cool. My faculty building shifts the HVAC from cooling to heating  at determined dates in the year. When not needed you don't switch them on. I hope you understand the meaning of the question and find the logic in it. The way i define Ideal Systems allows me to do that, but i can't find how to do that in HB components.\n\n\n\nHope this makes any sense for you.\n\nThanks for your help.\n\n-A.\n\n\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1214856", "name": "HB_shoeboxing_CWM_AY_Resid_ORG.gh"}], "created_by_name": "Abraham Yezioro", "created_at": "January 31, 2015 at 11:56AM", "created_by": "AbrahamYezioro", "parent_id": "reply_2985220_Comment_1213280", "id": "reply_2985220_Comment_1214855"}