{"body": "\nHi Salma,\n\nI do not think that the line that you pointed to was an error but I updated your file to the latest version of HB on the github and exploded your complex polysurface into individual faces and the file seems to be running well now (see attached GH file).  I question whether you need to include such detailed geometry to get an accurate result but the components can handle it if you are willing to wait a long time for the simulation to run (it took 21 minutes to run a single month on my fairly high-power machine).\n\nFor a single-zone model like this, you really do not need an airflow network and I would just use the simple bouyancy driven orifice equation available in the \"Set EP Airflow\" component.  Generally, I prefer this simple method in these cases because it is much easier to understand what is going on and what the assumptions are.  They also make clear that the major aspects of your \"form\" that will increase/decrease your airflow is the area of openings, the vertical height distance between the inlet and outlet, and the minimization of any screens or internal surfaces that can cause friction.  So you don't really need to run a simulation to design a facade with good airflow.  You just need it to make sure that it is working as you intend it.\n\nI can confirm that assuming a double-skin facade as a single zone is a decent assumption in most cases.  However, there are a few things that you have to fix in your model to make this assumption work.  First, you need to use the glazing based on ratio component to assign glazing to your outdoor elements (I imagine that this complex facade is supposed to be glazed).  You can see this in the attached file but you need to separate out your mullion surfaces first.  Next, you need to get rid of all the lighting and internal heat gains of the zone.  You can do this easily with the EP Plenum component in the file.  Lastly, you really need to include the building zone behind the double-skin facade zone since there is probably going to be a lot of heat flow in that direction, especially if this occupied zone behind the facade is conditioned.  This tutorial walks you through setting up a multi-zone model ([https://www.youtube.com/playlist?list=PLruLh1AdY-SgW4uDtNSMLeiUmA8Y...](https://www.youtube.com/playlist?list=PLruLh1AdY-SgW4uDtNSMLeiUmA8YXEHT_)).\n\nFinally, I would be wary of DesignBuilder's CFD engine.  It is not validated and I don't think that I would really trust it with such complex geometry.  Using something validated like OpenFOAM, Phoenics, Fluent, etc. would be much safer.\n\n-Chris\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1279004", "name": "HBpinwheelfoldedfacadeinquiryCWM.gh"}], "created_by_name": "Chris Mackey", "created_at": "May 02, 2015 at 07:03PM", "created_by": "chris", "parent_id": "reply_2985220_Comment_1277548", "id": "reply_2985220_Comment_1279002"}