{"body": "\nHi Aristo,\n\n\n\nMy **replies** are inline.\n\n1. What do you mean by \"That is why the candela values are visualized in the Rhino viewport\"? Are you refering to the luminance analysis (cd/m^2), or am I missing something? I think it would be very useful to have a mapping of light intensity over the field of view of the used camera, and possibly and option to overlay it on the luminance mapping. It would in a very visual way provide information about contrast and glare.\n\n**Doesn't the falsecolor option already do that for luminance mappings? If not can you post an image/screenshot of such a mapping from Dialux/AGI32 or any other software.**\n\n\n\n4. It's just a shoebox type simulation. 11x11 luminaires pointing down to simple materials. The default elapsed time was 3m40s. I have found the _RadParameters component meanwhile, and got it down to 0m30s. I have noticed that the simulation doesn't tax multiple cpu threads completely, most of the time cpu is at 25% during execution.\n\n**The under-utlization of CPUs is a known issue with Radiance (the calculation engine) on Windows based systems. Unfortunately there isn't much that can be done about it at the moment.**\n\n5. Is it possible to map different degrees of translucency, diffuse color, absorptance, reflectance, etc..., by means of a bitmap image, expression, or other?\n\n6. There is a feature that I consider absolutely necessary (and I haven't found it yet), which is the emitting surface feature, with the ability to stipulate homogeneous intensity with luminance values (in cd/m^2) or flux; and by mapped distribution of intensities or luminances (in cd or cd/m^2).\n\nBy emitting surface I don't mean just a flat rectangular plane, such as an area light. It would be absolutely amazing! to perform photometric analysis on irregular and convoluted shapes and the light falling on neighbouring surfaces. 3DS Max with MentalRay provides similar functionality, but without the power of GH + HB.\n\n**In the image below, the HB logo is assigned as a texture to a glass which then creates a pattern of that on the wall when daylight falls on it.**\n\n[<img class=\"align-left\" src=\"http://api.ning.com:80/files/7gjKKn4oGHTy*TBV6*hVZDmJNTBsy7DtIkftXFDcdwMcWwLCNUDDrKBlHJ8RHv15lMw6VomQVz2UftLQFkIJiyqJek1WHiUO/16201784705PM.png?width=721\" width=\"721\"/>](http://api.ning.com:80/files/7gjKKn4oGHTy*TBV6*hVZDmJNTBsy7DtIkftXFDcdwMcWwLCNUDDrKBlHJ8RHv15lMw6VomQVz2UftLQFkIJiyqJek1WHiUO/16201784705PM.png)\n\n\n\n\n\n\n\n\n\n**ln the image below the light from the Batman logo illumninates the scene.<br/>**\n\n**[<img class=\"align-left\" src=\"http://api.ning.com:80/files/7gjKKn4oGHTQIbjyFftFAMLmnm3nWD6C6NgAy9CaKG1l6rbvaBe8zpbE8KPANC*W6zUHwrvF2CE-7cnfYPRoVgHJY4Is3Fmu/16201790123PM.png?width=721\" width=\"721\"/>](http://api.ning.com:80/files/7gjKKn4oGHTQIbjyFftFAMLmnm3nWD6C6NgAy9CaKG1l6rbvaBe8zpbE8KPANC*W6zUHwrvF2CE-7cnfYPRoVgHJY4Is3Fmu/16201790123PM.png)**\n\n**<strong>The images above were Rendered with Radiance. While these things are possible with Radiance, and therefore HB, the reason why they aren't incorporated into the code is that these effects are not \"physically based\" and are not rooted in reality. Radiance is arguably the most intensively tested and validated lighting simulation software in the world. However, once we start applying such \"magic\" to it, the results from it are no longer reliable and therefore no different from other photorealistic engines such as V-ray, Mental-Ray etc. <br/>**</strong>\n", "attachments": [], "created_by_name": "Sarith Subramaniam", "created_at": "January 6, 2017 at 7:13pm", "created_by": "sarith", "parent_id": "reply_2985220_Comment_1667740", "id": "reply_2985220_Comment_1668037"}