{"body": "\nHello everyone,\n\n\n\nThis is a very interesting discussion, even though it started with a mathematical discrepancy.\n\n\n\nTo add to what you were saying I can convey my experiences from Malaysia, the tropics.\n\n\n\nMost indoor spaces in Malaysia are indeed pretty close to what we call a chamber. By that I don't obviously mean they are actually air-conditioned chambers but mechanically conditioned buildings with no operable openings (this is the norm in the tropics unfortunately).\n\n\n\nThere are of course limited areas where a mix of spaces exists, consisting of NV corridors and atria intermingled with air conditioned shop lots (as in the case of big malls for example). To add to this complexity, as Abraham mentioned, there are distinct cultural differences in people's norms, routines, and behaviors which have concrete, material results that impact thermal comfort (e.g. clothing where one part of the population is heavily clothed while the other is in opposite lightly clothed). To make things even worse, I have personally witnessed on a daily basis a very interesting result of the thermal comfort study Chris linked, that people in the tropics prefer their environments to be below neutral (i.e. slightly uncomfortable, that is cold). A way for integrated thermal comfort strategies then is indeed very difficult, if not impossible under these conditions.\n\n\n\nI work a lot with building certification and in that area most of the discussion here is irrelevant. Simulations and studies that we so easily are able to perform with HB/LB (and we thank you for this) are indeed very rarely used. The typical way thermal comfort is assessed in various green building tools is a simple range of temperature and humidity that is deemed comfortable (probably extracted from the same experiments that gave us PMV).\n\n\n\nInterestingly enough it seems, at least from the table Chris posted, that the approach of using temperature (and/or humidity) might be more correct than using ranges of PMV. But what are exactly the ranges of comfort? And more importantly how can we influence these ranges? How can we finally avoid the standard approach of all practical desing methodologies that \"design for the worst case\", which results in suboptimal solutions?\n\n\n\nI have been thinking of these things for a while. I think it is a critical aspect of what I am doing even though the industry really doesn't give a damn. I have a kind of intuition that thermal comfort could be assessed and improved, at least here in the tropics, with design interventions that are neither inside (indoor climate) nor outside (outdoor conditions), but in the interface between them. I feel the impact of high gradient temperature changes to people's comfortable ranges should be properly assessed. One strategy (i.e. PMV) will probably always be suboptimal.\n\n\n\nAs a final note, perhaps another way to deal with the complexity inherent in these studies is to introduce more complexity! By that, I mean introduce adaptive comfort strategies in the buildings. In this way you have a local adaptation instead of a single (suboptimal) adaptation. But then, again in the real world, it is a challenge to convince Clients and Designers that the spaces will be indeed comfortable. That is why I think workflows like the one Chris has provided us with his research are extremely important in the 'effort to convince'. \n\n\n\nWhen I get the time I will try to contribute what little I can by making a few CFD studies analysing the impact of these 'thermal transition spaces' in buildings. But short of real-life experiments which could calibrate various assessment models (ABM anyone?) I can't think of any other way we could practically assess this. Perhaps someone already has done so? Hell, maybe it's already in the Adaptive Comfort book which I've only skimmed through?\n\n\n\nAnyways, long winded. Very nice discussion indeed. I appreciate all your experiences and expertise, they really help stimulate discussion and ideas.\n\n\n\nKind regards,\n\nTheodore.\n\n\n\n \n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "January 31, 2016 at 10:44pm", "created_by": "TheodorosGalanos", "parent_id": "topic_1448575", "id": "reply_2985220_Comment_1451592"}