{"body": "\nHi Filippo,<br/><br/>You can add data to **meanRadiantTemperature_** input even if you are doing an analysis in outside in the sun. This depends on how those **meanRadiantTemperature_** values were calculated.<br/>PET index requires four weather data inputs: air temperature (**_dryBulbTemperature**), relative humidity (**relativeHumidity_**), wind speed at 1.1 meters from the ground (**windSpeed_**) and mean radiant temperature (**meanRadiantTemperature_**).<br/><br/>You can add values to the first three inputs from the Ladybug \"Import Epw\" component. For the last (**meanRadiantTemperature_**), you can add it from Ladybug's \"Outdoor Solar Adjusted Temperature Calculator\" component, or let \"Thermal Comfort Index\" component to calculate it. Both use [different methods](http://www.grasshopper3d.com/group/ladybug/forum/topics/difference-between-mrt-calculation-methods) to calculate the final values.\n\nI attached an example file below with second option.<br/><br/>For more precise calculations you can use Honeybee and [Chris' microclimate maps](http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;fork=hydra_2&amp;id=Trees_in_Outdoor_Thermal_Comfort).<br/><br/>An icing on the cake for the end: one of Ladybug developers yesterday released a set of Ladybug components for modelling in ENVI-met application. ENVI-met is cutting-edge microclimate software, which can be downloaded for free. It opens a number of advanced new analysis in outdoor domain, which couldn't have been done with the current Ladybug+Honeybee tools. So you can perform the simulation in ENVI-met 4 free software, and then add mean radiant temperature values from ENVI-met simulation to \"Thermal Comfort Indices\" component. Here is an [example file](http://www.grasshopper3d.com/xn/detail/2985220:Comment:1701126).<br/><br/>If you would like to go with the last approach, then the best would be to post a question about it in [this topic](http://www.grasshopper3d.com/group/gismo/forum/topics/gismo-ladybug-envi-met-connection?xg_source=activity).\n\n<br/>1) You can make a polygonized tree.<br/>I haven't subtracted the trunk from the crown, but I guess it makes sense that it can be done.<br/><br/>2) In most solar related simulations, a default albedo value of 0.2 is used. This corresponds to average albedo value taken from materials surrounding the urban or countryside location (concrete, grass, gravel, sand, asphalt...). However the presence of snow can significantly magnify the average albedo value several times. \"Sunpath shading\" components **albedo_** input has an ability to calculate albedo due to presence of snow, if nothing is added to it (to **albedo_** input). As you are performing the analysis of PET in a horizontal plane, it will not affect your calculations.<br/><br/>3) Most thermal comfort indices will require performing analysis at 1.1 meters above the ground. This is considered to be height of standing person's gravity center.<br/>The same goes for PET index. So you are correct: you should place the analysis grid at 1.1 meters above the ground before adding it to the \"Sunpath Shading\" component.<br/><br/>It is worth mentioning that \"Thermal Comfort Indices\" component used in this topic's **PET_on_Grid2.gh** and **PET_on_Grid3.gh** files is from last year, and much slower than the newest one (VER 0.0.64 MAR 18 2017) used in the example attached below. Just a remainder if you have been using older version of this component.<br/><br/>Let me know if I misunderstood some of your questions, or if I missed to answer some of them.\n\n\n\n<br/>**EDIT**: sorry for posting a double reply. When I posted it the first time, I only got links visible, with no text. Something has been wrong with grasshopper ning forum for the last couple of months.\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1721326", "name": "PET_trees.gh"}], "created_by_name": "djordje", "created_at": "March 26, 2017 at 03:07PM", "created_by": "djordje", "parent_id": "reply_2985220_Comment_1721008", "id": "reply_2985220_Comment_1721325"}