{"body": "\nHi Dan,\n\n\n\nFirst up, you can download Embryo Viz from here: [http://www.grasshopper3d.com/xn/detail/2985220:Comment:1101387](http://www.grasshopper3d.com/xn/detail/2985220:Comment:1101387) ( I am not sure if there is a proper link for it. Perhaps Mostapha can clarify).\n\n\n\nI had updated the components a few weeks ago but then got too lazy/busy to properly document that anywhere. Some of the additional features are:\n\n1. It is now possible to substitute an IES file with a text string. For example one can paste the contents of an IES file into a text panel and connect that to the input for _iesFilePath. Alternatively, you can read a text file using the native Grasshopper \"Read File\" component, then embed (and internalize) that information inside the \"Text\" component.\n\nSo, either of the below two options will(should) qualify as an input for the _iesFilePath:\n\n[<img class=\"align-left\" src=\"http://api.ning.com:80/files/GTkgWcNU8QmU*AW5-LAJY7YPsfoawm1Fpv0dUk0AGjZZl3mm7OW6qtBa4Zi-5ZrgUKeURmCJhYD9GG06T-JyJad8gX-ACO-i/229201660740PM.bmp?width=500\" width=\"500\"/>](http://api.ning.com:80/files/GTkgWcNU8QmU*AW5-LAJY7YPsfoawm1Fpv0dUk0AGjZZl3mm7OW6qtBa4Zi-5ZrgUKeURmCJhYD9GG06T-JyJad8gX-ACO-i/229201660740PM.bmp)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[<img class=\"align-left\" src=\"http://api.ning.com:80/files/GTkgWcNU8QlNTwof2Woyw-DhKG2OL2gpvbWlOyDylLp3RzjdBDQ1aeKU0l30B9I5dpnZvmy6erQXHKFXLzc*zz4*px*s9x9b/229201660714PM.bmp?width=721\" width=\"721\"/>](http://api.ning.com:80/files/GTkgWcNU8QlNTwof2Woyw-DhKG2OL2gpvbWlOyDylLp3RzjdBDQ1aeKU0l30B9I5dpnZvmy6erQXHKFXLzc*zz4*px*s9x9b/229201660714PM.bmp)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThis makes it possible to embed IES data inside a GrassHopper file, thus doing away with the need for connecting to a file on a local drive.\n\n\n\n2. I created a new component called Honeybee_IES Project which does the following:\n\n\n\n[<img class=\"align-left\" src=\"http://api.ning.com:80/files/GTkgWcNU8QnUS2U9Sn*1Ht-tVT0QDwZZ3gxDl7N6Llx9RUEA9MjSEgRG6fqbljHGC0pt-Aa3A-2V3PFgO3OzCLYEPTrq7ULo/229201661346PM.bmp?width=500\" width=\"500\"/>](http://api.ning.com:80/files/GTkgWcNU8QnUS2U9Sn*1Ht-tVT0QDwZZ3gxDl7N6Llx9RUEA9MjSEgRG6fqbljHGC0pt-Aa3A-2V3PFgO3OzCLYEPTrq7ULo/229201661346PM.bmp)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n1. It consolidates all the electric lighting RAD files for a simulation in one place. The single radFilePaths output from the component can be connected to the daylight simulation instead of connecting individual radFilePath outputs from every luminaire.\n\n2. It creates a BOQ and luminaire schedule for all the luminaires used in the simulation. The schedule can either be viewed in a Grasshopper text panel or exported as excel.\n\nThe values for LLF, Candela Multiplier and Lamp Depreciation factor are printed out for each luminaire.\n\n[<img class=\"align-left\" src=\"http://api.ning.com:80/files/GTkgWcNU8QlLX3*OAELWxnTU9ECfBt25Uq8-CJUsrbZTA0dvRpwvfzL-JjtlfbJul*0ibq7PAyOgM-6uy-tYCS3vhB-ruGlt/229201662011PM.bmp?width=721\" width=\"721\"/>](http://api.ning.com:80/files/GTkgWcNU8QlLX3*OAELWxnTU9ECfBt25Uq8-CJUsrbZTA0dvRpwvfzL-JjtlfbJul*0ibq7PAyOgM-6uy-tYCS3vhB-ruGlt/229201662011PM.bmp)\n\n\n\n\n\n\n\n\n\nThe effect of the multipliers on power consumption can be seen in the BOQ in the Total Power column:\n\n[<img class=\"align-left\" src=\"http://api.ning.com:80/files/GTkgWcNU8Qkv4ukPAZGNoI*Rqs7O8PlQ1oTn29YrL1IUv6eBLxhoYoxjq7bNL3NstVsz2Alh6RSm6DPrkWpzKxfLuZiExmbh/229201662424PM.bmp?width=600\" width=\"600\"/>](http://api.ning.com:80/files/GTkgWcNU8Qkv4ukPAZGNoI*Rqs7O8PlQ1oTn29YrL1IUv6eBLxhoYoxjq7bNL3NstVsz2Alh6RSm6DPrkWpzKxfLuZiExmbh/229201662424PM.bmp)\n\n\n\n\n\n\n\n\n\nAdding lumens to the output will be minor fix. I will update that within a few days.\n\n\n\nI think the point-grid for the photometric and peak candela display are a great idea. I will add that functionality within a couple of weeks.\n\n\n\nAre you implying the inclusion Type B photometry by \"support for all ies file types\" ? If so, that has been on my to-do list for a while. It might, however, be a while before I can get to it as it would require writing a convertor from Type C to Type B so that it can be visualized as a photometric mesh inside the Rhino viewport. I think the hackish way to get Type B photometry to work in Honeybee is to first convert the Type B photometry to Type C using something like the Photometric Toolbox.\n\n\n\nFinally, the electric lighting components were initially written as a hack and they are still pretty much work-in-progress. I agree that calling the simulation a lighting simulation and adding separate inputs for electric lights would be a cleaner way of approaching these simulations. Mostapaha and I weren't sure of the traction that these new features might get. Based on the feedback received we will be simplifying and enhancing these components and the workflow to do electric lighting simulations.\n\n\n\n(PS: Although I have heard a lot about Accelerad, due to the lack of compatible resources, I have never run a gpu-based simulation myself. I am not sure if Nathaniel requires additional flags or information to run Radiance simulations through Accelerad. If not, it should be possible to use files written through Honeybee to run Accelerad simulations. I will defer to Mostapha on the possibility of incorporating Accelerad in the Honeybee project).\n\n\n\n\n\n\n\n\n\n\n", "attachments": [], "created_by_name": "Sarith Subramaniam", "created_at": "February 29, 2016 at 4:53pm", "created_by": "sarith", "parent_id": "reply_2985220_Comment_1474423", "id": "reply_2985220_Comment_1474434"}