{"body": "\n@Artem - didn't mean to make a tangent too far off from your topic, just wanted to reply to Mostapha briefly.\n\n\n\nI did read about your post on butterfly. butterfly is cfd and coolvent is thermal zone as I understand.\n\n\n\nI think honeybee and ladybug together are already a great design tool. I didn't realize the whole story with CFD and the various ways you have tried. Have a lot of respect for your project and your colleagues that are working on this, and I hope you guys get enough credit just going for it considering just how ambitious your project is. and open-source equivalence of at least 7 percent equity share too :) as in per owners. if you guys can offer 1 year cliff and 4 year vesting I will consider joining your team. just kidding what your team is doing are beyond me.\n\n\n\nAfter checking simulation CFD 2015, I realized that one big advantage for LB+HB is that well, I didnt see a built in feature of taking account for direct solar gain as part of the simulation.\n\n\n\nFrom the tutorials I have seen, they set the reference temperature to the exterior walls, but there is nothing solar. Here is a rather comprehensive [video](https://www.youtube.com/watch?v=kI02JEwwvyQ) of how to set up for Simulation CFD . From 10:30 you can see that boundary condition for exterior walls is set with a film coefficient and Reference temperature (around 12:30). At 12:33, there is actually a parameter called radiation right below. I check the parameters for that myself and found that it includes emissivity and reference temperature but not watt hour per square meter like we have it with ladybug. \n\n\n\nSO even for a software like simulation CFD, which already seems very sophisticated with the pay-as-you-go cloud parallel simulation option and all, I don't see that it is designed for simulating natural ventilation. Since with SIM CFD it seems that one can be precise about everything including heat plumes from artificial lights in terms of watts so I am guessing that there is a way to model in solar gain as some kind of projected geometry somehow but it is pretty clear that there is EXTRA WORK needed to factor in solar gain there.\n\n\n\nI think it would be pretty major if there is a way to model solar radiation and CFD for interior/building envelop together because I have not seen that kind of simulation in the industry.\n\n\n\nThank you for the extra ref cayote and coolvent. I will make check them out along with SAM.\n\n\n\np.s. I reread what I wrote and just wanted clearify I sure didn't refer to any of your work with honeybee or ladybug as \"artistic illustration.\" I meant my pretty arrows :)\n\n\n", "attachments": [], "created_by_name": "Youngjae chung", "created_at": "December 16, 2014 at 2:55am", "created_by": "YOUNGJAECHUNG", "parent_id": "reply_2985220_Comment_1188788", "id": "reply_2985220_Comment_1188851"}