{"body": "\nHi Mostapha,\n\n\n\nThanks for writing back and sharing the file.\n\nFirst I want to have results from HB of a typical base case room with opening on one side, so I can compare and justify the optimization at the end.\n\nThen optimize the WWR for one particular location for multiple objectives by using Octopus.In this case the objectives would be min energy use, lighting level of 500lux, solar gains, total radiation on the facade.While the glazing type is a fixed parameter that I am not planning to include.\n\n\n\nHere the problem is as you commented on the other discussion ([http://www.grasshopper3d.com/group/ladybug/forum/topics/idf-import-...](http://www.grasshopper3d.com/group/ladybug/forum/topics/idf-import-and-setepzonethresholds-issues?commentId=2985220%3AComment%3A1267045&amp;xg_source=msg_com_gr_forum))\n\n- How to **weight all objectives properly**? So I could get a .csv and present the results will pollination or in other graphs.\n\n- How to do that in GH and Octopus?\n\n- How would the iteration process go?Would there be a feedback process, where I have to go back and re run energy simulations ?(see image)Because of many objective I find it hard to design this workflow chart, and the definition.\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/tmqA3rmqdgbqAZJk5HVwZub8HxAT4v4BCq3J0gqZk-zbEvNT4Zy8t1pPJkw3Z0KGGl6jLqKI*tTiYBKnNBR8L8SUE44-Ffzl/frame.JPG\" width=\"503\"/>](http://api.ning.com:80/files/tmqA3rmqdgbqAZJk5HVwZub8HxAT4v4BCq3J0gqZk-zbEvNT4Zy8t1pPJkw3Z0KGGl6jLqKI*tTiYBKnNBR8L8SUE44-Ffzl/frame.JPG)\n\nI am a newbie, there are no tutorials online for Oct. and I find it very confusing.\n\n\n\nI will see If I can do something with your file now.But if you have any idea that would accelerate my process of learning by doing, you would be a major time saver :D (you already are a live saver with HB and LB.)\n\n\n\nRegards,\n\nN\n\n\n", "attachments": [], "created_by_name": "Nitë", "created_at": "April 19, 2015 at 8:32am", "created_by": "Nita", "parent_id": "reply_2985220_Comment_1268758", "id": "reply_2985220_Comment_1267164"}