{"body": "\nHi Christian,\n\nThank you so much for this explanation and for the image describing the method that you are trying to use.  I have realized that I may have been misinterpreting the section on radiant asymmetry that has been published in ASHRAE 55 and/or EN-7730 for almost a year now.  I originally thought that this section was just a reiteration of the results from Fanger's study and I had not realized that it had been fleshed-out into a generalizable method for all radiant asymmetry.\n\n\n\nMaking a component that allows you to perform the method that you have posted here should be relatively quick and straightforward.  We already have the functions in the Ladybug code to calculate view factors into a plane and we have validated them as you see in this conversation:\n\n[http://www.grasshopper3d.com/group/ladybug/forum/topics/discussion-...](http://www.grasshopper3d.com/group/ladybug/forum/topics/discussion-sky-view-factor)\n\n\n\nThis method is also similar that which is used inside the \"Indoor View Factor Calculator\" component.  However, this component is not projecting the view factors into the plane of a surface (it is just computing views from a point for MRT calculation) and the component has been streamlined so much for the microclimate maps that it's difficult to pull out the view factor information for something as specific as this. In other words, all that we really have to do to make your method realizable with Ladybug is expose these capabilities in a new component that gives you more access and control over the view factor calculation.  As such, I have added this to the github and I can pull together a component in a few days:\n\n[https://github.com/mostaphaRoudsari/ladybug/issues/251](https://github.com/mostaphaRoudsari/ladybug/issues/251)\n\n\n\nHowever, before I flesh out this component, I have a question about the \"comfort equations from EN-7730\" into which you will throw Δt_pr.  I know that ASHRAE has published the following figure for calculating the percentage of people dissatisfied (PPD) from different types of radiant asymmetry:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/MlwUY2Ci1em0JFwPhV0JHHEXb4wZtjAKoxdWr2IrZ2EDEades43Sf5-6WYn51ibQ8zU7lzGzrETJ7VdTNNmnJY0UXSwOuTwP/RadiantAsymmetry.jpg\" width=\"448\"/>](http://api.ning.com:80/files/MlwUY2Ci1em0JFwPhV0JHHEXb4wZtjAKoxdWr2IrZ2EDEades43Sf5-6WYn51ibQ8zU7lzGzrETJ7VdTNNmnJY0UXSwOuTwP/RadiantAsymmetry.jpg)\n\nI am assume that these are the same \"comfort equations from EN-7730\" that you are referring to and please correct me if I am wrong.  If these are the equations that you are referring to, here is my question:\n\nIn the method that you describe, the radiant asymmetry is only defined as the difference in temperature from one side of a plane to another and so there does not seem to be any distinction between what would count as a \"cool wall\" radiant asymmetry as opposed to a \"warm wall\" asymmetry.  The asymmetry could be either cool or warm depending on which side of the plane you are saying is the cause of radiant asymmetry.  Clearly there is a big difference between these two in the figure and I am wondering how the method you have posted here deals with this situation.  Also, if you could confirm that source of the image that you have posted, this will also help me implement this capability in Ladybug faster and more relaibly.\n\n\n\nThanks again for posting here.  All of this has been really insightful and I'm looking forward to the new capabilities that we can add because of it!\n\n\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "April 06, 2016 at 08:56AM", "created_by": "chris", "parent_id": "reply_2985220_Comment_1501165", "id": "reply_2985220_Comment_1502339"}