{"body": "\nHi Djordje,\n\nthis is really amazing and thank you very much for the example files! <br/> I’m trying with Letizia to calculate the PET Index on an analysis grid (as you do on the PET_on_Grid example files) within an Urban context and taking into account the shading of the surrounding context, and we are testing the Ladybug Thermal Comfort Indices component. For what we understand there are two ways to take into account the Mean Radiant Temperature, you can either plug the meanRadiantTemperature_ or the solarRadiationPerHour_.  According to the meanRadiantTemperature_  description it seems that if we are doing the calculation outside in the sun we mustn’t plug in anything and we must work only with the solarRadiationPerHour_ (as you also do in the example). Is it correct?\n\nsolarRadiationPerHour_ can be calculated in two ways, the first one is shown in your example and uses Ladybug_Radiation analysis component (Very clear thank you so much! : ) ) The other one uses the Ladybug_Sunpath Shading component and from the description is supposed to be more precise. And here are the other questions:\n\n1)       there is a parameter that takes into account vegetation, with which degree of detail should it be represented? 2D(silhouette) or 3D surface? Should we separate the trunk from the crown?\n\n2)      In this component we can also insert an albedo value. Is this value taken into account in the PET calculation and if yes, how?\n\n3)      In the Ladybug_Radiation Analysis component we can input a geometry at the ground level to be calculated and then place an analysis grid at 1.1 _disFromBase. Using Ladybug_Sunpath Shading, where should we place the geometry to be calculated and how can we place the analysis grid like in the other case?\n\nWe apologise for the long post!\n\nThank you very much for all your efforts!!\n", "attachments": [], "created_by_name": "Filippo", "created_at": "March 26, 2017 at 10:54am", "created_by": "Filippo", "parent_id": "topic_1534360", "id": "reply_2985220_Comment_1721008"}