{"body": "\nHi Theodore,\n\nThanks for all of the kind words.  I know that you say that you are a beginner but using the shade benefit evaluation method is a pretty advanced (or at least computationally intensive) operation.  In other words, it is very easy to accidentally run your computer into the ground if you are not careful.\n\nI looked at your Rhino file an the geometry is perfectly good.  The reason why your computer is crashing when you input your geometry is that your Rhino document is in millimeters and the grid size that you input to the Shade benefit component is in Rhino document units (in your case also mm).  The Rhino document that I was using in the videos was in meters and, as such, I set the grid size to 0.5 meters, which is a number that gives me a reasonably-sized set of mesh cells in my case.  In your case, however, you were inputting your geometry without changing the grid size, which essentially set the grid size to 0.5 millimeters.  As you can imagine, this is a huge number of test points and grid cells.  Accordingly, it overwhelmed your memory (as it did mine).\n\nAttached you can find a fixed GH file where the grid size has been set to a reasonable value (500 mm instead of 0.5 mm).  I also updated the components to the most recent version on the github.  There is new an option for a much faster solar-adjusted temperature calculation and a number of other features.  These components will be in the stable release that we are doing in the next few days.\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/eX-lQcksX1kmEYfU9hQgafdVp5aLaUDf*JxvEzZsaFLqY2f7fMFnzhPYpcbsjEOUZn3Sb*w-gWpeRWkWALsh3EZ5d*sTwv10/ShadeBenefitWorking.PNG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/eX-lQcksX1kmEYfU9hQgafdVp5aLaUDf*JxvEzZsaFLqY2f7fMFnzhPYpcbsjEOUZn3Sb*w-gWpeRWkWALsh3EZ5d*sTwv10/ShadeBenefitWorking.PNG)\n\nEnjoy!\n\n-Chris\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1214287", "name": "9 - Outdoor Shade Benefit Evaluation_UPDATED.gh"}], "created_by_name": "Chris Mackey", "created_at": "January 30, 2015 at 9:50pm", "created_by": "ChrisMackey", "parent_id": "topic_1214593", "id": "reply_2985220_Comment_1214285"}