{"body": "\nHi Theodoros,\n\nYou bring up an important topic, which is actually how I first became involved in climate science and thermodynamics.  There have been a lot of topics that together have fallen under the umbrella of Urban Heat Island (UHI) and I am going to try to separate them out in order to give you a sense of the current capabilities in LB+HB.\n\n\n\n**1) UHI as defined as a recorded elevated air temperature in an urban area:**\n\nIf you have access to epw files for both an urban area and a rural area, you can use Ladybug to visualize and deeply explore the differences between the two weather files.  Ladybug is primarily a tool for weather file visualization and analysis and it can be very helpful for understanding the consequences of UHI on strategies for buildings or on comfort.  This said, if you do not have both rural and urban recorded weather data or you want to generate your own weather files based on criteria about urban areas (as it sounds like you want to do), this definition might not be so helpful.\n\n\n\n**2) UHI defined by air elevated air temperature but viewed as a computer model-able phenomenon resulting primarily from urban canyon geometry, building materials, and (to a lesser degree) anthropogenic heat:**\n\nThis definition seems to fit more with they type of thing that you are looking for but it is unfortunately very difficult and computationally intensive such that we do not currently have anything within Ladybug to do this right now.  I can say that the state-of-the art for this type of modeling is an application called Town Energy Budget (TEB) and this is what all of the advanced UHI researches that I know use ([http://www.cnrm.meteo.fr/surfex/spip.php?article7](http://www.cnrm.meteo.fr/surfex/spip.php?article7)).  Unfortunately for those trying to use it in professional practice, it can take a while to get comfortable with it and it currently runs exclusively on Linux (this does mean that it is open source, though, and that you can really get deep into the assumptions of the model).  A couple years ago, a peer of mine translated almost all of TEB into Matlab language making it possible to run it on Windows if you have Matlab.  He wrapped everything together into a tool called the Urban Weather Generator (UWG), which can take an epw file of a rural area and warp it to an urban area based on inputs that you give of building height, materials, vegetation, anthropogenic heat, etc.  I would recommend looking into this for your project, although, bear in mind that is it not open source like the original TEB tool and that you may need to get a (very expensive) copy of MATLAB ([http://urbanmicroclimate.scripts.mit.edu/uwg.php](http://urbanmicroclimate.scripts.mit.edu/uwg.php)).\n\n\n\n**3) UHI as defined by a thermal satellite image of an urban area depicting an elevated average radiant environment that reaches a maximum a the city center and changes by land use:**\n\nThis is the definition of UHI that I am most familiar with and was the basis of much of my past research.  I feel that it is also a definition of UHI that is a bit more in line with where a lot of contemporary UHI research is headed, which is away from the notion of UHI as a macro-scale meteorological phenomena that is averaged as an air temperature over a huge area towards one that accepts that different land uses have different microclimates and (importantly) different radiant environments.  While the air temperature difference between urban and rural areas usually does not change more than 1-4 C, the radiant environment can be very different (on the order of 10-15 C differences). The best way to understand UHI in this context is with Thermal satellite images, for which there is ha huge database of publicly available data on NASA's glovis website ([http://glovis.usgs.gov/](http://glovis.usgs.gov/)) or their ECHO website ([http://reverb.echo.nasa.gov/reverb/#utf8=%E2%9C%93&amp;spatial_map=...](http://reverb.echo.nasa.gov/reverb/#utf8=%E2%9C%93&amp;spatial_map=satellite&amp;spatial_type=rectangle)).  I tend to use thermal data from LANDSAT 5-8 and ASTER satellites in my research.  Unfortunately, there is a lot f bad data with a lot of cloud cover mixed in with the really good stuff and it can take some time to find good images.  Also, there aren't too many programs that read the GeoTiff file format that you download the data as.  I know that ArcGIS will read it, a program called ENVI will read it (I think that the open source QGIS can also red it).  I have plans to write a set of components to bring this type of data into Rhino and GH (I may get to it a few months down the line).\n\n\n\n**4) UHI as a computer model-able notion of \"Urban Microclimate\" with consideration of local differences and the local radiant environment:**\n\nThis is where a lot of my research has lead and, thankfully, is an area that Honeybee can help you out a lot with.  EnergyPlus simulations can output information on outside building surface temperatures and these can be very helpful in helping get a sense of the radiant environment around individual buildings.  Right now, I am focusing just on using this data to fully model the indoor environments of buildings as you see in this video:\n\n[https://www.youtube.com/watch?v=fNylb42FPIc&amp;list=UUc6HWbF4UtdKd...](https://www.youtube.com/watch?v=fNylb42FPIc&amp;list=UUc6HWbF4UtdKdjbZ2tvwiCQ)\n\nI have plans to move this methodology to the outdoors once I complete this initial application to the indoors.  For now, you can use the \"Surface result reader\" and the \"color surfaces based on EP result\" components to get a sense of variation in the outside temperature of your buildings.\n\n\n\nI hope that this helped,\n\n-Chris\n\n\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "February 1, 2015 at 3:54am", "created_by": "chris", "parent_id": "reply_2985220_Comment_1214301", "id": "reply_2985220_Comment_1214695"}