{"body": "\nHi Chris,\n\nI'd like to throw my 50 cents in the jar of proper text for baked objects. I'd also like to ask a tiny winy question about visualization and -ViewCapturetoFile command in Rhino. I didn't want to create a new discussion for this problem because I felt like it have been answered somewhere on the forum but I couldn't get the right words to find it.\n\nAnyway, my question is about how rhino exports .png files with the transparent background and messes up the colors and how to fix it. I don't bake the results, I like to ViewCapture them, is it the wrong way to go?\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/EmXvm3BJSF8pCI4hdzHAlcvcDtraJ9CwtKt47r2eK5KrHn-e7o0sOi7ZQ7u9Mdht4zQh67kT43guVzGdz-An2li9WCF-1kdf/KindergartenSunlightAnalysispersp.png?width=600\" width=\"600\"/>](http://api.ning.com:80/files/EmXvm3BJSF8pCI4hdzHAlcvcDtraJ9CwtKt47r2eK5KrHn-e7o0sOi7ZQ7u9Mdht4zQh67kT43guVzGdz-An2li9WCF-1kdf/KindergartenSunlightAnalysispersp.png)First image was loaded directly here and the one below was opened with native windows app, snipped and loaded here (app couldn't recognize the transparency, not a problem here), In both ways blues were lost and this happens every time and I'd like to know how to get around it and why does this happen in the first place (why blues, other colors seem fine). \n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/EmXvm3BJSF8kBuXclqpHxzn2qN8V0unyu6QDnHETKtzJJOk-oEObocz81UbJbud5UX4gDg83TaG8wurJ-ggMPD7Yf9IDR45s/Capture.PNG?width=600\" width=\"600\"/>](http://api.ning.com:80/files/EmXvm3BJSF8kBuXclqpHxzn2qN8V0unyu6QDnHETKtzJJOk-oEObocz81UbJbud5UX4gDg83TaG8wurJ-ggMPD7Yf9IDR45s/Capture.PNG)Sorry for the offtop, if you think that this one deserves its own discussion, just let me know, thanks.\n\n\n\n\n", "attachments": [], "created_by_name": "Tim", "created_at": "November 28, 2015 at 3:32am", "created_by": "Timur582", "parent_id": "reply_2985220_Comment_1411226", "id": "reply_2985220_Comment_1410967"}