{"body": "\nChristian,\n\n\n\nThanks for posting the information from your talk with Olesen.  They say that good answers to questions leave you desiring more knowledge and this seems to be one of them.  In particular, knowing how to deal with the case of a person between a radiant vertical heating panel and a cool window really merits some more research.  Still, it is great to know Olesen's thoughts and how his cases were defined.  It is also great to know that conduction discomfort is supposed to govern cases of radiant floors and not any radiant asymmetry discomfort.  Thanks again for sharing.\n\n\n\nProducing a spatial map of radiant asymmetry PPD can also be accomplished with the two new components.  Particularly, if you are ok with the assumption that all opaque surfaces are at the same temperature and all window surfaces are also at the same temperature, you can produce one of these maps fairly quickly.  Here is an example file showing you how to set up such a map off of EnergyPlus results:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/8ATjcWHatZqepWQXpok5ty7Z9Kbv7T63lMfIsBaR7PZT8EawIIUo8XcxelEDDAkvWp4taWAA43k4C8mHanKX1Z5mteOj5h6V/Radiant_Asymmetry_Spatial_Map_Rhino.png?width=721\" width=\"721\"/>](http://api.ning.com:80/files/8ATjcWHatZqepWQXpok5ty7Z9Kbv7T63lMfIsBaR7PZT8EawIIUo8XcxelEDDAkvWp4taWAA43k4C8mHanKX1Z5mteOj5h6V/Radiant_Asymmetry_Spatial_Map_Rhino.png)\n\n[http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;for...](http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;fork=hydra_2&amp;id=Radiant_Asymmetry_Spatial_Map&amp;slide=0&amp;scale=1&amp;offset=0,0)\n\n\n\nAs you can see in the file, I take the average temperature of all interior surfaces and the average window temperature to produce the maps and I would say that this is usually a decent assumption for any shoebox model with windows on only one side and a reasonable amount of insulation on the exterior opaque surfaces.  If you need to account for different surface temperatures other than the opaque vs glazed, you should probably break up the zone into a few surfaces like the first file that shared.\n\n\n\nHope this helps,\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "April 17, 2016 at 6:56pm", "created_by": "ChrisMackey", "parent_id": "reply_2985220_Comment_1510414", "id": "reply_2985220_Comment_1510574"}