{"body": "\nYao,\n\nI apologize for getting back so late.  The work week was very busy for me.\n\nThere were 2 things that were weird about your model (and were blowing the heating load out of proportion) and there was one bug on our end.\n\nFirst, you set the natural ventilation setpoint to be only one degree greater than the heating setpoint.  This frequently causes the building to expend heating energy reaching the setpoint only to throw away this heat a few minutes later when the indoor temperature rises by one degree.  Generally, I would leave at least 3 degrees between these two setpoints unless you are using some special types of schedules that ensure this conflict does not happen.\n\nSecond, I do not know what you were trying to do with so many solve adjacency components but, when you hook up only one zone to this component and set \"removeAdjacencies\" to true, you will over-write all of the previous boundary conditions that you set in the surface-by surface method.  These were the boundary conditions that you were sending into EnergyPlus in the file you uploaded:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/edNtLJKyk8rwCiG3NKWb8Fajq5W645lDH5M15EYOvF1YYYo7MYwjaDBQUO4RSEZvtBGtkHutUdxml6RsjWE6uGzw3fRonjV0/BoundaryConditions.PNG\" width=\"633\"/>](http://api.ning.com:80/files/edNtLJKyk8rwCiG3NKWb8Fajq5W645lDH5M15EYOvF1YYYo7MYwjaDBQUO4RSEZvtBGtkHutUdxml6RsjWE6uGzw3fRonjV0/BoundaryConditions.PNG)\n\nAs you can see, you were blowing your heating load out of proportion by getting rid of your originally-set adiabatic walls.  In the attached GH file, I use just one solve adjacencies component and these are your resulting boundary conditions:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/edNtLJKyk8rPDf5PMDHoM7L*-KqExJlwYFfBSUeoZyrbxGUlGTMjAH39lZCifrl813ILc7hgQfYEXFLsGKhPeIf0A*vh63dn/CorrectAdj.PNG\" width=\"647\"/>](http://api.ning.com:80/files/edNtLJKyk8rPDf5PMDHoM7L*-KqExJlwYFfBSUeoZyrbxGUlGTMjAH39lZCifrl813ILc7hgQfYEXFLsGKhPeIf0A*vh63dn/CorrectAdj.PNG)\n\nFinally, there was a bug in the function that checks the normal direction of surfaces input to the energy model and Mostapha just fixed this one this past week ([https://github.com/mostaphaRoudsari/Honeybee/issues/365](https://github.com/mostaphaRoudsari/Honeybee/issues/365)).  This was causing the solar gain calculation to be incorrect in your model, which, admittedly, is the major reason why the heating loads between the north and south facades were not different.  As you see in the attached GH file, you now get very different heating loads for the north and south facades:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/edNtLJKyk8rk5xdmtOQ84qn4Efx39ltaC7hjdLd5RrBvk*snbV8prDLsnOxN5DdAZH3aUgP89gr21TEylKDjCZXhbtykUQJX/DifferentNorthSoutHeatingLoads.PNG\" width=\"661\"/>](http://api.ning.com:80/files/edNtLJKyk8rk5xdmtOQ84qn4Efx39ltaC7hjdLd5RrBvk*snbV8prDLsnOxN5DdAZH3aUgP89gr21TEylKDjCZXhbtykUQJX/DifferentNorthSoutHeatingLoads.PNG)\n\nI hope that all of this helped and, again, sorry for the delay.\n\n-Chris\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1347264", "name": "11nobalconyaddlayer2zonesnew_CWM2.gh"}], "created_by_name": "Chris Mackey", "created_at": "August 22, 2015 at 12:22pm", "created_by": "chris", "parent_id": "reply_2985220_Comment_1343762", "id": "reply_2985220_Comment_1347263"}