{"body": "\nAbraham,\n\nI am just letting you know that I was able to re-create the discrepancy between the Ladybug SVF and Radiance VSC calculations with a simple case.\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/y*uTehDOGQudmpGpsxUWJuRWw*G9v4nrE8X90bTFAlTy8wiAzAQPdZb-Dl5u7Qps8yZS7zq-jQ87po8bgXK5FDcjossy*l46/TestCase.JPG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/y*uTehDOGQudmpGpsxUWJuRWw*G9v4nrE8X90bTFAlTy8wiAzAQPdZb-Dl5u7Qps8yZS7zq-jQ87po8bgXK5FDcjossy*l46/TestCase.JPG)\n\nI also checked the results against the Sky Mask II component, which I think is the most trustworthy of all operations as long as we verify that the output shading mask geometry is correct.  In this validation, I got the following result:\n\nSky Mask II (Most trustworthy if checked) - 43.0423 %\n\nView Analysis (SVF) - 41.277 %\n\nRadiance VSC - 37.10 %\n\nWhile the 1.8% error of the Ladybug view analysis component is acceptable for many of my applications, the almost 6% error on the Radiance calculation seems to be way outside the acceptable range.  Increasing the ambient divisions of the Radiance simulation did not help the issue.  As a result, I am considering taking out the Radiance VSC until we can better understand why the answer is so much lower than the others.\n\nI should also note that all 3 methods were in agreement when I fed in spherical test cases with known solutions for svf.  It is just when we start introducing orthagonal geometry at lower svf that this discrepancy emerges.\n\nMostapha, what are your thoughts on taking out HB VSC for the time being or investigating the issue deeper?\n\n-Chris\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1448488", "name": "viewVectorTest.gh"}], "created_by_name": "Chris Mackey", "created_at": "January 27, 2016 at 4:59pm", "created_by": "ChrisMackey", "parent_id": "reply_2985220_Comment_1448480", "id": "reply_2985220_Comment_1448487"}