{"body": "\nHi Everyone,\n\n\n\nSorry for such a late response but I can answer much more meaningfully now that Butterfly has metamorphosed and is flying!\n\nI definitely realize that 8760 wind speed values for 1000+ test points is a large quantity of data that usually causes Grasshopper to crash.  This is why, if you read the input description of the windSpeed_ it says the following:\n\n\n\n**A value in m/s to set the wind speed of the comfort calculation. Use this input to account for objects like ceiling fans that might increase the interior wind speed or input custom wind speed values from a CFD simulation.**<br/> **_**<br/> **This input can also be a list of 8760 additional wind speed values that represent the hours of the year.**<br/> **Alternatively, this input can be a data tree of values with branches that are each 8760 values long and correspond to the branches of the input viewFactorMesh_.**<br/> **This can also be a data tree of values with one branch for each point in the input viewFactorMesh_.**<br/> ****Finally, this input can be the file path to a .csv file that is organized with 8760 values in each column and a number of columns that correspond to the number of test points. This last option is recommended if trying to synchronize CFD results with the microclimate maps.****\n\n\n\nThis last bolded option is what I would recommend for such a large quantity of data and this is what I have used in my own outdoor comfort maps that have incorporated CFD results.  Over the next few months, I'll roll out some components to make it easier to generate this type of CSV from butterfly's results but, for the time being, you will have to clean your CFD results yourself.\n\n\n\nI'll also say that, if you are only interested in the results at a single hour, you can always take the radiant temperature and air temperature maps from the mircolimate analysis and plug them into the Outdoor Comfort Calculator component along with your CFD values for wind speed.  This will give you comfort values at each point for the hour in question.\n\n\n\nAs for evapotraspiration, you can account for this by running the starting EPW file through the Urban Weather Generator (UWG) using the Dragonfly Beta.  The UWG allows you to warp EPWs to account for urban heat island effect along with the presence/absence of trees/plants. This example file shows you how to do it:\n\n[http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;for...](http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;fork=hydra_2&amp;id=Urban_Weather_Generator_Workflow)\n\n\n\nSome of the other LB developers and I have a paper that is in the final stages of review that outlines the complete methodology for accounting for all aspects of outdoor comfort using the Ladybug Tools suite.  I'll put the link to it here once it's past review.\n\n\n\nFinally, yes, direct sun shining on people is incorporated into the maps using the [solarCal method](http://escholarship.org/uc/item/89m1h2dg) and an [additional term to account for longwave radiant loss to the sky](http://www.grasshopper3d.com/group/ladybug/forum/topics/difference-between-mrt-calculation-methods).\n\n\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "March 14, 2017 at 9:11pm", "created_by": "chris", "parent_id": "reply_2985220_Comment_1698754", "id": "reply_2985220_Comment_1712698"}