{"body": "\nHi Mona,\n\nSorry for getting back so late.  You posted a lot of questions in one reply and we might be able to get back to you faster next time if each question or couple of questions were its own discussion.  Also, your file is huge and it is appreciated if you clean up your GH definition to a level that we can understand where your issue is.\n\nYour issue was that you were mis-matching versions of HB.  Some of your components were from the last stable release in February and some others were for shortly after that.  I updated your file to the latest version of the components on the github using the 'Update Honeybee' component.\n\nAs you can see, you get air temperature, mean radiant temperature, and zone humidity out of the Read EP result component.  You can use these to calculate indoor comfort with either the Ladybug Adaptive Comfort Calculator or the Ladybug PMV Comfort Calculator.  You should watch the comfort youtube playlist to find out how to do this in more detail:\n\n[https://www.youtube.com/playlist?list=PLruLh1AdY-Sho45_D4BV1HKcIz7o...](https://www.youtube.com/playlist?list=PLruLh1AdY-Sho45_D4BV1HKcIz7oVmZ8v)\n\nI would model your interior doors as air walls and, use the Set EP Air Flow component air mixing schedule input to model when the door is closed vs open.  Your exterior doors should be modeled as a separate HBSrf with a construction assigned to it that is representative of a door (I think that the OpenStudio library includes a geeric door construction if you don't want to make one on your own).  Doors do not make much of a difference in most energy simulations since the construction of the door is usually not that far off from the construction of exterior or interior walls.  Oftentimes, there are larger assumptions that you might be worried about like having certain surfaces as adiabatic or the inconsistencies between the simulated EPW file and the climate of your site in the future.\n\n-Chris\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1325958", "name": "READY4ENERGYSTUDYtail01265_CWM.gh"}], "created_by_name": "Chris Mackey", "created_at": "July 14, 2015 at 1:05pm", "created_by": "ChrisMackey", "parent_id": "reply_2985220_Comment_1296180", "id": "reply_2985220_Comment_1325957"}