{"body": "\nHello Mostapha,\n\nwhat I had to do recently is a bunch of simulations (10) for a total of about 4 days. I wanted to run the first simulation and come back after the weekend (approx.) to find everything done. So I prepared all the building variations and I did input every configuration in one daylight simulation component. (next image)\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/HMrNkLH2ZKNwc-f-dv7PqfK1kFBGMbJ14SgWN6YajkCj55SIuyAc1w1Jlx4TOVIjIuHmDy-PIErBugpK3dYwX0KVrvA0*Z97/10simulations.JPG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/HMrNkLH2ZKNwc-f-dv7PqfK1kFBGMbJ14SgWN6YajkCj55SIuyAc1w1Jlx4TOVIjIuHmDy-PIErBugpK3dYwX0KVrvA0*Z97/10simulations.JPG)Afterwards to have one simulation done after the other, since the \"done\" output get true just after the writeRad input is true (as I described before) I used the output resultFiles that before the .ill files are writte is null, when the .ill files are written is not null anymore. So I used this \"switch\" to have a true output after the .ill files where written (and I delayed the true output of 1 miunte). So after 1 minue that every simulation was complete (.ill files written) the next was starting. (next image)\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/HMrNkLH2ZKOyAAjzhjEvdy4gfwekZwGg0622x2tbI8BF2zln7B-iCRBlNI-pF12jmpLQci43utnobbByxwfp2XdHVeWEhgo4/3simdetail.JPG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/HMrNkLH2ZKOyAAjzhjEvdy4gfwekZwGg0622x2tbI8BF2zln7B-iCRBlNI-pF12jmpLQci43utnobbByxwfp2XdHVeWEhgo4/3simdetail.JPG)So the point is that it would be good if the \"done\" output would get true only when the simulation end to use it as the input in the runRad input of next simulation, in order to avoid the trick of the null output (that is just one possibility there could be many).\n\n\n\nBest\n\n\n\nFrancesco\n\n\n\n\n", "attachments": [], "created_by_name": "Francesco De Luca", "created_at": "April 20, 2015 at 6:57am", "created_by": "FrancescoDeLuca", "parent_id": "topic_1264732", "id": "reply_2985220_Comment_1267850"}