{"body": "\nTasos,\n\nI'm glad the components are working well for you.\n\nYou can set the walls to air walls and the floors/ceilings to be a different construction by using two solve adjacencies components in tandem and a \"separateByFloor\" component like so:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/E-eiwesnIS10-2IgQdjp*kFAPHy3gfC4gw6LuCd19tLReFfQx*qnr3IDvu5cz0bTtyyY*V8UBW5F7HPucSzY6MR77Cpv4nBC/SolveAdjacenciesInTandem.PNG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/E-eiwesnIS10-2IgQdjp*kFAPHy3gfC4gw6LuCd19tLReFfQx*qnr3IDvu5cz0bTtyyY*V8UBW5F7HPucSzY6MR77Cpv4nBC/SolveAdjacenciesInTandem.PNG)\n\nI prefer this method since it seems to be more in the spirit of grasshopper component-based workflows and allows you to change the constructions of the floors/ceilings with the second solve adjacency component.\n\nThanks for finding the bug in the default ExportAirWalls.  I just uploaded a fixed version to the github.\n\nThe warning that the \"Add Internal Mass\" component is giving you is telling you that you should make sure that each of your individual surfaces lies completely inside a zone.  If a surface spans between two or more zones, the component doesn't know which zone to assign the surface to.  The component is not copying anything to memory or storing any information.  What might be happening is, if you are changing the tolerance of your Rhino model or have internalized geometry created with a different Rhino model tolerance, the function that calculates whether the surfaces are inside a zone does not use the right tolerance.  I also know that this \"surface inside brep\" function was apparently buggy on McNeel's end and that I should re-write this function soon.  If you upload your file with the issue, I will try to improve it.\n\nI am not sure which components you are using but the \"IsConditioned\" will be overwritten by a more downstream component that has the \"IsConditioned\" input.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "March 16, 2015 at 2:14pm", "created_by": "ChrisMackey", "parent_id": "reply_2985220_Comment_1241151", "id": "reply_2985220_Comment_1243631"}