{"body": "\nHi Abraham,<br/><br/>Thank you for the valuable suggestions!<br/><br/>You can remove any kind of geometry supplied to the **context_** input. This will make the radius of the terrain shading mask equal to that of the Ladybug Sunpath component. This is what I essentially did in the upper photo of [my hometown's mask](http://api.ning.com/files/w-Qoov2ENCwKUsvKkltv1ThJq6kU0Mzo33fX8Iegd2j3J*gbZRgsfy*epnrCIZEbZVYwyHSV2mpgiGMJEjMeVi4zlfogf5T4/surdulica_panorama2.jpg).<br/>For now this is working only for metric units. I will make sure that for the next release at least feets are supported as well.<br/><br/>As for the saving of the time: try increasing the **maxVisibilityRadius_** to say 300. <br/>Depending on your PC configuration and internet speed it may take as long as 15 minutes for the component to run. The topography file will first be downloaded from opentopography.org. That's the .tif file you noticed. Once the mask is created it will be saved to an .obj file. The next time you run it the mask will be imported from the .obj file, skipping the previous 15 minutes:<br/><br/>\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/E636THrB2V1rQgJIRDFT7mGXNRJqK2-mfiEyrxZruX2kkzheyP2s7uO*atV6OWM3kFM3NC1EBpjTxs9dJ6ut4clsy2Cwcbq1/import_mask.jpg?width=300\" width=\"300\"/>](http://api.ning.com:80/files/E636THrB2V1rQgJIRDFT7mGXNRJqK2-mfiEyrxZruX2kkzheyP2s7uO*atV6OWM3kFM3NC1EBpjTxs9dJ6ut4clsy2Cwcbq1/import_mask.jpg)\n\nIt still may take a a couple of minutes (depending on your PC configuration) for the component to complete loading of the mask. The reason why is: the mask needs to be scaled and centered according to the context_ input.<br/><br/>Also the next time a user decides to change the **maskStyle_** input or **context_** input, the topography data will not be downloaded from the opentopography.org website, but rather created from the .tif file.<br/>For default **maximalVisibility_** of 100, these .tif files are mostly a couple of megabytes, which is not that much of a burden on user's hard drive space. On the other hand keeping these .tif files on user's hard drive helps saving the opentopography bandwidth cap.<br/>Let me know if I can answer any further detail or if this one hasn't been clear.<br/><br/><br/><br/>Hi Chris,\n\nThank you too.<br/><br/>Please provide the following data:\n\n1) Zip the \"terrain shading mask libraries 32-bit\" folder in \"c:\\ladybug\" in case you have x86 version of Rhino 5, or \"terrain shading mask libraries 64-bit\" folder in case you have the 64 bit version of Rhino 5. Upload the zipped folder, and post the link in here, please.<br/>Zip the whole folder, not its content only.\n\n<br/>2) What is the full name of the GDAL libraries .zip file that you downloaded? What is your Windows version and Rhino 5 version?\n\n\n\nOn genDayMtx.exe and install of the GDAL libraries: I am reluctant to avoid manual install due to blocking issue. Copying two folders manually is quite a small price to pay in comparison with finding the blocked library among tens of them.\n", "attachments": [], "created_by_name": "djordje", "created_at": "June 30, 2016 at 09:01AM", "created_by": "djordje", "parent_id": "reply_2985220_Comment_1557854", "id": "reply_2985220_Comment_1558272"}