{"body": "\nKit,\n\n\n\nThis is a very good point.  We don't currently have the ability to set transparency on the solar adjusted MRT component or in the radiation study component and it seems like this is something that would be really useful.  Unfortunately, it would take a bit of time to implement this on these components right now because the radiation studies in Ladybug join the context surfaces into one mesh before running ray tracing analyses on it (this is done for speed).  This makes it difficult to assign different transparencies for different surfaces.  In the new version of the radiation study that Mostapha is making right now, we should take this into account, if possible, and I've posted a github issue here:\n\n[https://github.com/ladybug-analysis-tools/honeybeex/issues/12](https://github.com/ladybug-analysis-tools/honeybeex/issues/12)\n\n\n\nIn the meantime, there is a way to factor in tree transparency in thermal comfort calculations using the Honeybee microclimate maps, which uses the same method to compute solar adjusted MRT as the solar adjusted MRT component.  The microclimate components do not allow much flexibility with occupant body position (the occupant is always assumed to be seated) but they will enable you to account for the effect of tree shade on ground surface temperature (very important for microclimate modelling), and they will allow you to see the effect of the tree over large stretches of both space and time.\n\n\n\nI put together an example file showing you how to use the microclimate maps for this purpose here:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/Yh-B8VrdxHjmaN8UZUQd4kUckxlwiZJTGfd2iAlECrujsyaTfuB-BHrSllK1alupaksxdGWDLO7xyd4V7W2tbTkQMiHyCp7k/Trees_in_Outdoor_Thermal_Comfort_Rhino.png?width=721\" width=\"721\"/>](http://api.ning.com:80/files/Yh-B8VrdxHjmaN8UZUQd4kUckxlwiZJTGfd2iAlECrujsyaTfuB-BHrSllK1alupaksxdGWDLO7xyd4V7W2tbTkQMiHyCp7k/Trees_in_Outdoor_Thermal_Comfort_Rhino.png)\n\n[http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;for...](http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;fork=hydra_2&amp;id=Trees_in_Outdoor_Thermal_Comfort&amp;slide=0&amp;scale=1&amp;offset=0,0)\n\n\n\nHope this helps!\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "April 29, 2016 at 12:45PM", "created_by": "chris", "parent_id": "topic_1517657", "id": "reply_2985220_Comment_1518982"}