{"body": "\nHi Mostapha,\n\n\n\nThank you! I did not notice the new release of the components. I have updated them and it works now.\n\n\n\nIn addition, considering that the function of \"daylight control\" or \"daylight threshold\" for energy simulation is not available so far ([http://www.grasshopper3d.com/group/ladybug/forum/topics/hb-daylight...](http://www.grasshopper3d.com/group/ladybug/forum/topics/hb-daylight-setpoint-bug)), I have to set up the energy simulation based on an annual daylight simulation. Hereby, I have some questions as follows.\n\n\n\n- **As for the lighting schedule (in csv format) generated from the \"annual Profiles\" in the \"read Annual Results I\" component in daylight simulation, how can I link it (instead of the default lighting schedule) to the succedent energy simulation? Could you please show this in my GH files?**\n\nI could imagine how to make \"customized\" EP constructions and EP loads and link them to the simulation. But, as for EP schedules, I can not figure out how the energy simulation can receive and recognize a \"customized\" EP schedule (i.e. from csv files). I am asking this because the light schedule generated by daylight simulation is in csv format, and also because the schedules provided by Honeybee are limited to some specific building type (i.e. office, retail etc.). But the schedules of some other type of buildings are not included, like the schedules of sports buildings.\n\n\n\n**- In the attached csv file (which is generated <strong>from the \"annual Profiles\"** in the \"read Annual Results I\" component in daylight simulation), why the **electric **lighting is still partially \"on\" even when the \"occupancy\" shows \"0 (absent)\"?</strong>\n\nFor instance, \"Row 16, 64....\" in the csv file. As I understand, the electric lighting is partially/fully \"on\" only when the both of the following conditions are met, namely, there are people in the space and the illuminance level from daylight is below the threshold. Am I right?\n\n \n\n**- Is**** the above mentioned procedure a proper way to calculate the energy use for electric lighting when there is a lighting dimming system (the <strong>electric **lighting may be continuously adjusted in proportion to the amount of daylight available)? </strong>\n\nApart from the above mentioned way of calculating the energy use for electric lighting, I also made other two ways for comparison showed in the attached image. But, the outcomes are very different. Which do you think is the most proper way to calculate the energy use for electric lighting when there is a lighting dimming system?\n\n\n\n\n\n\n\n \n\nThank you very much in advance!\n\n\n\nBest,\n\nDing\n\n \n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1277592", "name": "unnamed_0_space_0_intgain.xlsx"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1277593", "name": "3 ways to calculate energy use for electric lighting.png"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1277594", "name": "text6.gh"}], "created_by_name": "Ding", "created_at": "April 30, 2015 at 1:28pm", "created_by": "doudou", "parent_id": "topic_1272120", "id": "reply_2985220_Comment_1277590"}