{"body": "\nHi Nicholas,\n\nThank you for posting.  I will be perfectly honest and say that the geometric acrobatics that go on to split masses into core and perimeter and then intersect these geometries to make reciprocal surfaces is fraught with bugs, many of which are not just the result of LB+HB code but are also issues that are being worked through by McNeel and the creators of RhinoCommon.\n\nVolumetric operations like this are just a really tough thing to automate when you have the complex geometric capabilities that Rhino gives you to start with.  In the process of making components to do split up these volumes, I have discovered a fairly long list of things that are at least idiosyncrasies in RhinoCommon if not unintentional bugs. I am going to post these all to Guilio at some point soon but I have developed a few workarounds in the interim.\n\nNotably, I just loaded a few more into the Intersect masses component after looking deeper at your issue and it should now be able to handle core and perimeter zones and not fail (though I still recommend baking/checking the output geometry). In any case, your primary problem was resulting from the fact that you put intersected geometry into the splitBldgMasses component and this is not recommended.  You usually want to use the intersectMasses component after you have split your building up into zones.  I have since put in a warning to make users aware of this if they do input intersected geometry.\n\n\n\nSo the general guidelines for using these components are as follows:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/y39xTR5a6g5zYOIJRe674usBmGCda0Ajz*gOhnl6luX-KO7sRu44jz1yWZqIQh1DfWJcaXp1nrzqmD-WWBU2fWnPF6XDY3oq/InstructionsforbreakingupBldgMass.PNG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/y39xTR5a6g5zYOIJRe674usBmGCda0Ajz*gOhnl6luX-KO7sRu44jz1yWZqIQh1DfWJcaXp1nrzqmD-WWBU2fWnPF6XDY3oq/InstructionsforbreakingupBldgMass.PNG)\n\n\n\nI have attached a GH file that shows you these results with your building geometry.  Let me know if you encounter any other things that seem like big bugs as you assemble the zones for the rest of your building.\n\n\n\nAnd a happy Day of the Dead!\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "November 1, 2014 at 7:26pm", "created_by": "ChrisMackey", "parent_id": "topic_1158972", "id": "reply_2985220_Comment_1159978"}