{"body": "\nThanks Chris!  Really appreciate your quick and thorough reply.\n\n\n\nWe used the \"Read EP HVAC result\" component and found that the ideal air system is introducing 100% of outdoor humidity through ventilation.  Washington D.C. is humid and warm at night in September, so the peak load was occuring at 9pm. The outside air @ 3.6 w/sf I reference is mostly latent load.  This seems like a critical consideration for HB studies in humid climates- if one is modeling an ideal-air system, its possible that unrealistic amounts of humidity are being introduced into zones.  If studying passive strategies, the humidity load can dominate results, hiding the reported effectiveness of things like shades, SHGC, insulation, etc.  Interested in your thoughts on this!\n\n\n\nA couple follow up questions:\n\n\n\n1. We'd like to disect the peak sensible cooling-load hour with our ideal air system.  We've created a workaround by locating the peak sensible hour through the 'otherZonedata' output, running a second single-hour simulation for that hour, and using the energybalance component to look at the solar radiation, conduction, etc. components for that hour.  Is there an easier way to extract the peak sensible cooling hour from an HB simulation and then disect the hour into its individual load components?  I am skeptical about the results of a single hour simulation.  \n\n\n\n2. The 'zone ideal loads supply air sensible' output from 'otherZonedata' outputs really large numbers (days with cooling report 6-7 digit numbers whereas out actual load was only 5.4kW).  Do you know what units these results are in?  In our workaround method we're only using these numbers to locate the peak sensible day (they indicated morning mid-june which sounds right for an E facing room).  That said,  we'd like to understand the numbers so we can QC the output.\n\n\n\nThanks!  \n\n\n\nColin\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/zbUV0kjiVyd96SwoyKnz4gB47Q0HRgtX7joitfNhLazFZnMTBef2vMw6W31vGOcY1bLH8GubBtS6SsrML82Mk8Xz3bqNnUa5/pic2.png?width=721\" width=\"721\"/>](http://api.ning.com:80/files/zbUV0kjiVyd96SwoyKnz4gB47Q0HRgtX7joitfNhLazFZnMTBef2vMw6W31vGOcY1bLH8GubBtS6SsrML82Mk8Xz3bqNnUa5/pic2.png)[<img class=\"align-full\" src=\"http://api.ning.com:80/files/zbUV0kjiVycqie7xqP69LoCn77FQ9PY1kxVs6Gr1vKkIYj0moLfoBOH4oI4ef9Yc0o8FcU8tu81xCOh2iT1AAmIibr147wIZ/Pic1.png?width=721\" width=\"721\"/>](http://api.ning.com:80/files/zbUV0kjiVycqie7xqP69LoCn77FQ9PY1kxVs6Gr1vKkIYj0moLfoBOH4oI4ef9Yc0o8FcU8tu81xCOh2iT1AAmIibr147wIZ/Pic1.png)\n\n\n\n\n\n\n", "attachments": [], "created_by_name": "Colin Schless", "created_at": "March 17, 2016 at 11:43AM", "created_by": "ColinSchless", "parent_id": "reply_2985220_Comment_1486538", "id": "reply_2985220_Comment_1487061"}