{"body": "\nBurin,\n\nSorry for getting back so late.  This is great that you are testing this out as the air side economizer of EnergyPlus is something that I have been struggling to understand for a while.  Thanks to the information that you have provided here, I think that I finally understand it and I am able to make some meaningful changes in the components.\n\n\n\nFirst, I have come to realize that, with the current specifications of flow/person and flow/floor area that the OpenStudio libraries have (and corresponding outdoor air object), there is essentially an assumption of demand controlled ventilation any time that the total flow/floor area is below that of the total flow/person (by default, this seems to be the case for most OpenStudio programs).  Accordingly, to put in an option for demand controlled ventilation on the ideal air loads parameters component is incorrect and I have since taken it out (I have replaced it with something else described later).\n\n\n\nSecond, the big decrease in energy that you see from switching the outdoor air object to \"None\" is not because the air economizer is working.  Rather, it is because you eliminated the requirement of fresh air changes for your zone. As such, in a tightly sealed building with low infiltration, there is a danger that occupants might not be getting enough fresh air with this setting.  Still, this frees up the airflow of the system to be moderated and the supply temperature to be a nicer levels (see further explanation below).\n\n\n\nThirdly, I have realized that the Ideal Air System is very simple any only works in one of two ways: 1) It takes a specified outdoor air fraction and moderates the temperature of the air to meet the cooling/heating load or 2) It takes a specified supply air temperature and moderates the volume of air to meet the cooling load.  The former uses a lot more energy because it often has to make supply air that is at very cold or very hot but always ensures the specified amount of outdoor air is met for the occupants and uses the ventilationPerArea and ventilationPerPerson inputs.  The latter risks not supplying the right amount of fresh air if the building is tightly sealed and completely ignores the ventilatioPerArea and ventilationPerPerson inputs but returns energy values that are more reasonable.  It is also closer in principle to how modern-day VAV or VRF systems operate.  After a long internal debate with myself, I have decided to make the former one (with lower energy values modulating the volume of flow) the default.  I now give you the option to switch between the two with a boolean on the ideal Air Parameters component.\n\nClearly, the air side economizer has a larger effect when the air volume is allowed to modulate so I think that you should now see larger changes in energy use from adding it in.  I have also noticed that adding in the economizer while letting the supply air temperature rise seems to give some pretty high reductions in cooling energy.\n\n\n\nThanks again and I have attached an updated file.\n\n\n\n-Chris\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1231172", "name": "05_HVACIssues_CWM.gh"}], "created_by_name": "Chris Mackey", "created_at": "February 24, 2015 at 08:37PM", "created_by": "chris", "parent_id": "topic_1229923", "id": "reply_2985220_Comment_1231170"}