{"body": "\nHi Mostapha,\n\n\n\nSorry about that yes. I've been on a rampage these last few days, it will slow down :)\n\n\n\nI think it's ok. I mean I got the pollination workflow sorted out and I feel confident using it for the most part. It's an amazing tool actually that I can't wait to apply to real projects.\n\n\n\nThe only issue I found was that if I set a boolean check in my definition that stops the simulation (so that I can save some time in cases I don't need) from running then I get a null value. That is ok though, since I can simply use the native GH component to replace null after the simulations are done and feed the recorders to the pollination component.\n\n\n\nWhat I couldn't overcome was when I tried to calculate VSC (this probably applies generally to several simulations) on 3 different meshes (I broke my one surface to 3 in order to separate the 'pedestrian isle' sort of speak. What happens there is that I need to bang (excuse my english) my result into the three branches and feed that into the recorders to get separate results. The issue was that the bang gives an error due to empty values from the simulation component (which is a very different case than null).\n\n\n\nI looked around and found a component David created that gives a 0 value out of an empty component but that doesn't really help as it gives 1 when it has values (therefore exchanging all real values with 1s).\n\n\n\nAnyways not a big deal I guess, just letting it out there. I'm sure the actual solution is to sit my ass down and think of an algorithm that does all this culling of not-needed experiments prior to things being fed to a simulation component.\n\n\n\nHope I made sense lol. I can provide the definition I guess once I'm back at the office in a few days.\n\n\n\nHave a nice weekend!\n\n\n\nKind regards,\n\nTheodore.\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "February 5, 2016 at 11:54pm", "created_by": "TheodorosGalanos", "parent_id": "reply_2985220_Comment_1456065", "id": "reply_2985220_Comment_1455898"}