{"body": "\nHey Chris,\n\nThank you for taking the time to do this. \n\nAs I can see from the comfort equations in EN 7730, it looks very much like the graph you posted above.\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/cLNDn7vrsS91x8-3LuCGlqp9bbLwlleUa2meUIxX6x19I7OmsnFVsvHpZqkKTSpJH7OGeLz3i2uq3jJUJ6L21HwbE3JDpe-a/Udklip3.PNG?width=500\" width=\"500\"/>](http://api.ning.com:80/files/cLNDn7vrsS91x8-3LuCGlqp9bbLwlleUa2meUIxX6x19I7OmsnFVsvHpZqkKTSpJH7OGeLz3i2uq3jJUJ6L21HwbE3JDpe-a/Udklip3.PNG)As for your last question; I am no expert on this, but to my understanding, the Δt_pr used is the same -  the equations used to calculate are not. Take a look at this (from EN 7730 as well):\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/cLNDn7vrsS-QfuR7Myp-kqni1lH9MCPp0nZB3xwnrLZZOWsA0LbUcMyBnvAoisjeL64LTza6pDXJ-rD6nvuI*2tdfqasrXmw/Udklip4.PNG?width=500\" width=\"500\"/>](http://api.ning.com:80/files/cLNDn7vrsS-QfuR7Myp-kqni1lH9MCPp0nZB3xwnrLZZOWsA0LbUcMyBnvAoisjeL64LTza6pDXJ-rD6nvuI*2tdfqasrXmw/Udklip4.PNG)\n\nIf I can make some wishes too; it would be cool, if you included the last local comfort metrics from EN7730 in LB/HB as well. Besides the local asymmetry there are: an equation for warm/cold floors, stratification and draught. I know, that you will need preform a CFD simulation to properly calculate stratification and draught, but the comfort equations are really simple and seeing that you have(might have) a CFD tool under way it could be useful. Anyways I think it would possible to import external generated CFD data to grasshopper.  \n\n\n\nThe pictures in my previous post are from a paper called: \"A simplified calculation method for checking the indoor thermal climate\" by B.W. Olesen, it can be found in ASHRAE 1983, vol. 25, issue 5. I don't know if there have been any updates to it since '83. <br/>\n\n\n\nLooking forward for the new components, and if there is anything I can help with please let me know.\n\n/Christian\n\n\n\n\n", "attachments": [], "created_by_name": "Christian Kongsgaard", "created_at": "April 6, 2016 at 12:47pm", "created_by": "ChristianKongsgaard", "parent_id": "reply_2985220_Comment_1502339", "id": "reply_2985220_Comment_1502452"}