{"body": "\nArpan,\n\n\n\nThe answer to your question here is very similar to that for the building programs.  You can add in new HVAC systems to Honeybee by editing the code, especially if learn to use the [HVAC- generating functions that I put into the OpenStudio component](https://github.com/mostaphaRoudsari/Honeybee/blob/master/src/Honeybee_Export%20To%20OpenStudio.py#L763-L1326).  If you add in a HVAC system type that is becoming common through the industry, you can send a pull request to the Honeybee github and we will merge the work into the code base for all to use.\n\n\n\nHowever, editing the code is certainly a longer operation and you will likely make much more progress in the meantime using some other workflows.  Notably, if you generate your model with the \"-1. Thermostat Only\" hvac system type and then open your model in the OpenStudio interface by hitting the openOpenStudio_ boolean on the OpenStudio component, you can add a much larger range of HVAC types in the OpenStudio interface.  In particular, OpenStudio has a growing number of user-contributed HVAC system templates that have been integrated into a set of scripts called \"Measures\" that you can apply to your OpenStudio model. You can find these system templates by searching for them in the [building components library](https://bcl.nrel.gov/search/site/?f[0]=im_field_measure_tags%3A956&amp;f[1]=im_field_measure_tags%3A976). Here is a good [tutorial video on how to apply measures to your model](https://www.youtube.com/watch?v=9-saA4x07eQ) within the OpenStudio interface.\n\n\n\nI should also note that you can build an entire custom HVAC system from scratch within OpenStudio by going to the HVAC tab and adding air/water loops and any HVAC components that you desire from the library on the right-hand side of the interface.  However, I recommend starting by observing the HVAC templates and, once you understand how they work by editing/customizing the templates in the HVAC tab, then you might attempt to build your own system this way.\n\n\n\nIf you add a HVAC in the OpenStudio interface (either with measures or your own custom system), you can save the OpenStudio model and continue the workflow in Grasshopper by running the .osm file with the \"Honeybee_Re-Run OSM\" component.  Of course, while this workflow offers a lot of freedom to create any HVAC you want, we understand that the jumping over to the OpenStudio interface can interfere with iterative simulations in Grasshopper (like running through a slider of glazing ratio using a certain custom HVAC, for example).  As such, we are in the process of enabling people to run OpenStudio measures in GH as you see in [Mostapha's demo video here](https://www.youtube.com/watch?v=DHs-inRuHwc).  However, the measure components are currently in WIP because OpenStudio team is still in the process of standardizing the measure file structure.  After a couple more releases of OpenStudio, this should hopefully be stable enough for us to take the Measure components out of WIP.\n\n\n\nSo the ultimate intended workflow for customized HVAC is that you will apply OpenStudio measures to your model in GH.  These measures can have custom inputs depending on the HVAC properties (as you see in Mostapha's video) and there will hopefully be many user-contributed templates available in the Building Components Library.  If you want to build an entirely custom system that does not exist in the library, we will recommend that you make your own OpenStudio measure and contribute it to the Building Components Library.  While we are getting this ultimate workflow ready, there is a lot that you can do in the OpenStudio interface presently (as mentioned above).\n\n\n\nHope this answers the question,\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "August 3, 2016 at 8:54am", "created_by": "chris", "parent_id": "reply_2985220_Comment_1575796", "id": "reply_2985220_Comment_1575854"}