{"body": "\nHi awkweird,<br/><br/>My apologies for the late reply. I had to edit the **PV SWH system size** component in order for it to support overhang PV panels attached to a vertical building wall.<br/>Previously **PV SWH system size** component supported only ground PV panels and angled roof PV panels.\n\n<br/>Download the newest **PV SWH system size** component [from here](https://github.com/mostaphaRoudsari/ladybug/blob/master/userObjects/Ladybug_PV%20SWH%20System%20Size.ghuser) (Click on \"View Raw\" to download it. Then move the downloaded .ghuser file to File-&gt;Special Folders-&gt;User Objects Folder, an confirm to overwrite it with previously located one).\n\n<br/>Just a few opinions on the project you are currently working on:<br/><br/>This kind of fixed, non-transparent (overhang) PV panels attached to a building facade are vert convenient for locations with higher latitudes.<br/>The reason for this is because they (fixed overhang PV panels) are dimensioned according to the sun position at summer solstice. Elevation angles on summer solstice at higher latitude locations are lower, than those of lower latitude locations.<br/><br/>Due to Incheon's low latitude (37), you will get rather short length of the PV panels***** : less than 10 centimeters (0.097 meters in the attached .gh file below). As you have mentioned, Galapagos needs to be used too.<br/><br/><br/>I will just mention some of the good and bad ways in which the upper issue could be somewhat avoided:<br/><br/>1) Increasing the vertical distance between PV panels (PV panels appear above every second window).<br/><br/>2) Increase the tilt angle. This will increase the length of PV panels also, but will decrease the final annual AC energy output.<br/>An example of this solution has been applied at FKI building in Seoul (latitude: 37N):<br/><br/>[<img class=\"align-full\" height=\"114\" src=\"http://api.ning.com:80/files/b*u3sBO-oVUoLhFOzWuoQvuFx3JFj1GqGBZfB8iPx1bG3s326PcYHk2wgiB9AfEk0FuoZjngVHmECvBHzVKLcmCyZGNZJB5A/fki_exterior_detail.jpg?width=721\" width=\"178\"/>](http://api.ning.com:80/files/b*u3sBO-oVUoLhFOzWuoQvuFx3JFj1GqGBZfB8iPx1bG3s326PcYHk2wgiB9AfEk0FuoZjngVHmECvBHzVKLcmCyZGNZJB5A/fki_exterior_detail.jpg)<br/>I already did some tests (with tilt angles: 40, 45, 55) and this does not seem like a good solution, though.<br/><br/>3) Shrinking the \"sun window\" by using the **minimalSpacingPeriod_** input. In Photovoltaics, a planner is suppose to make the 9h to 15h part of the sun window free of any obstructions. If you try to decrease the \"sun window\" to 10 to 14h, the length of your PV panels will increase. You can try to experiment a little bit with this (set your **minimalSpacingPeriod_** to 21th of June 10 to 14hours). In general, shrinking the sun window on summer solstice is not a good principle during planning.<br/><br/>4) Using tracking PV panels, not fixed ones. But Ladybug Photovoltaics components do not support this kind of PV systems. They only support fixed ones.<br/><br/><br/>I would personally go with the first option. You can also experiment with the second and third one.<br/><br/>Comment back if you have any other questions.<br/><br/>-----------------------<br/><br/>***** By \"length of the PV panels\" I mean the: **tiltedArrayHeight_** input of the **PV SWH system size** component.\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1497436", "name": "FindingoptimalsizeofPVingivenarray2.gh"}], "created_by_name": "djordje", "created_at": "March 31, 2016 at 3:56am", "created_by": "djordje", "parent_id": "topic_1492209", "id": "reply_2985220_Comment_1497434"}