{"body": "\nHi Claudio,\n\nMostapha will probably jump in with some better information after me but I thought that I should post what I know now in case it helps you get started.  You are right that you can do in-depth glare analysis with the Honeybee components related to daylight/Radiance.\n\nAlso, I can confirm that will definitely be making a big jump from the previous discussion that you quoted.  However, you will ultimately be able to get a much more accurate understanding of the glare risk this way.\n\nIn order to narrow down your run time, I might start by selecting out a a set of hours of the year where you are interested in studying the glare probability (since running the entire year can be a lengthy calculation that takes many hours).  Next, you can follow these general steps:\n\n1) Set up your Rhino geometry as you would for any daylight simulation.  Import the geometry into Grasshopper as breps and convert them to HBObjects.  For the glass on the outside of the building across the street, I would model the glass as a mirror material instead of a HoneyBee_Radiance_Glass Material and set the reflectance of the mirror equal to that of the glass exterior.  This should ensure that the material behaves as you want it to.\n\n2) Plug the HBObjects into a Run Daylight Simulation component for which you have hooked up an image-based analysisRecipe_ that is set up at the Rhino view of the work station that you are studying.\n\n3) After running the image-based simulation, use the resulting HDR image and a Honeybee_Glare Analysis component to post-process the image to get a daylight glare probability (DGP) for the workstation at the hour of the image.\n\n4) Repeat for more hours of the year so that you get a sense of the times when glare might be an issue.\n\n\n\nLet us know if you have any questions and, Mostapha, let me know if I forgot anything important.  Hopefully, we will get around to producing a tutorial video on this at some point.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "October 14, 2014 at 09:59PM", "created_by": "chris", "parent_id": "topic_1149112", "id": "reply_2985220_Comment_1149024"}