{"body": "\nOk, Guys.  I figured out what the issue is.  Like many of our issues where I can't initially replicate the error on my machine, this is an error that results from the Rhino model tolerance not being small enough.  Because of this and the fact that the standing person generates such small text in the legend, some generated text is smaller than the Rhino model tolerance and this causes the text2srf function to fail.\n\nThank you, Abraham, for giving me a detailed status of the problem.  The reason why you get some text baked into the Rhino scene is that the text2srf function actually works by writing the text into the model, grabbing the outline of the text, and then deleting the baked geometry.  We have to do this since GHPython offers no way to make interactive Rhino text objects and, when this function is interrupted as it was here, you get some text baked into your Rhino scene before it can be deleted.\n\nSo the original issue should be solved if you just decrease your model tolerance from 0.01 to 0.001.\n\nI have made the component in the attached file a bit smarter so that it will sense when this tolerance is not correct and will not fail when your Rhino tolerance is so coarse.  However, I still really recommend that you keep a very fine tolerance if you are working with this component or else you will end up with text that looks like this:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/15pbGCBw7iNNBCFKhBQHNI5OS*2WdPhcoDzMZk6xN9*P1L2894wjHjoHbZ1chItqYEEpmHgyOoEPGEMO4*MfE6OtY-mSAiPX/WeirdText.PNG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/15pbGCBw7iNNBCFKhBQHNI5OS*2WdPhcoDzMZk6xN9*P1L2894wjHjoHbZ1chItqYEEpmHgyOoEPGEMO4*MfE6OtY-mSAiPX/WeirdText.PNG)\n\n\n\nI considered other methods like scaling the whole mannequin but it seems important to keep this component's mannequin at the correct anatomical scale of a human in the Rhino model.\n\n\n\nThanks again, guys for being patient and helping me diagnose the problem.  Mission accomplished!\n\n\n\n-Chris\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1163713", "name": "SolarAdjustedMRT2.gh"}], "created_by_name": "Chris Mackey", "created_at": "November 06, 2014 at 08:14PM", "created_by": "chris", "parent_id": "reply_2985220_Comment_1163365", "id": "reply_2985220_Comment_1163712"}