{"body": "\nAbraham,\n\nThanks for the feedback and for helping make this component complete.  I don't follow the use-case that you are trying to help by having passive solar and the internal heat gain polygons display on top of one another.  I can understand why you would want to have only a PSH polygon (if you are trying to evaluate a space that has no internal heat gain).  But, if the space has heat gain, you really need the PSH and Internal Heat to be added together for them to be useful.  This is why climate consultant uses this method.\n\nFurthermore, I am not inclined to make this change because it means removing the functionality to have the two added together.  At least in the case that you want, you can currently run two separate iterations (one with only PSH and one with only Internal Heat Gain) to get the result that you desire.  If I remove the ability to have these added together, it will become impossible to evaluate a passive heated solar space that also has internal heat gain.\n\nFinally, it's worth noting that virtually all buildings that are occupied by humans have internal heat gain if only from the heat of the people themselves. The same cannot be said for interior fans, evaporative cooling or thermal mass.  For this reason, I feel that my current treatment of the internal heat polygon is justifiable in relation to the other polygons.\n\n\n\nAs for your question about the percentages of the cooling polygons, the thermal mass+night vent is using a similar method to the PSH polygon in that it will only count a given hour as comfortable if there were cool enough temperatures in the previous hours to \"night flush.\"  For this reason, even though the thermal mass polygon looks large, there are often a lot of hours inside of it that are not comfortable because the preceding hours are not cool enough.  On the other hand, all points within the \"Evaporative Cooling\" or \"Occupant Us of Fans\" polygon are counted.  So this is why the percentage is smaller for the thermal mass polygon in relation to the others.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "on Thursday", "created_by": "chris", "parent_id": "reply_2985220_Comment_1808789", "id": "reply_2985220_Comment_1810104"}