{"body": "\nHi Youngjae,\n\nTo respond quickly to your struggles with CFD, I would encourage you first (if you are going to use CFD) to use a package that is validated like Phoenics or Fluent (I believe none of the Autodesk tools are validated yet).  Unfortunately, all of the validated packages tend to cost a great deal of money with the exception of the CFD engine OpenFOAM, which is open source but currently runs exclusively on Linux.\n\nNearly all CFD software will be \"one way\" as you describe it since CFD simulations often take a long time to converge (sometimes days or even weeks depending on the size of the model).  As such, they are really only used for steady-state calculations in most standard practice.\n\nUltimately, for any non-steady-state analysis (or for an analysis for a whole year), you want to be using some type of quick formula like the orifice equation that you posted at the start of this discussion.  You can use a CFD simulation to ensure that your coefficients for this formula are correct and \"calibrated\" with a CFD study that you know is trustworthy.\n\nAs inputs to your initial CFD simulation, you will need to put in either temperature values for surfaces or heat flux values for surfaces.  You can get both of these out of Honeybee simulations that you run with an initial guess of airflow.  Just request surfaceEnergyAnalysis and surfaceTempAnalysis on the Write EP Result Parameters component and, after the simulation, use the Read EP Surface Result to get get the surface results into GH.  Use the Color Surfaces by EP Result component to visualize surface temperature differences.\n\nOnce you get CFD air flow values for a given temperature difference between your zone and outside air, you can use the orifice equation and solve for your discharge coefficient (Cd).  You can then plug this discharge coefficient into your HB energy model and get a sense of airflow through the chimney for the whole year (see attached file for an example).  The attached file includes the Nat Vent component (now re-named the Air Flow component).  Try restarting GH if the component did not appear the first time.  Here are some screenshots of the chimney example file:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/*E1*lxSss-dTIQ6z6tzTZZO-Mrx0Q7jNH4rzOTvKZ*YLx3*ec1I5nQBq-xILcobntg9Ju5oW2LqhEf6*vVmP4xTTR40z1azE/TheValleywithChimney2.PNG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/*E1*lxSss-dTIQ6z6tzTZZO-Mrx0Q7jNH4rzOTvKZ*YLx3*ec1I5nQBq-xILcobntg9Ju5oW2LqhEf6*vVmP4xTTR40z1azE/TheValleywithChimney2.PNG)\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/*E1*lxSss-drTIFDIuibWDmefHXIDPOTEqkmzfsM3xZVyeQ6GP4jzr3y0fbgM49mmR3k4FR3cg3F4QaoKZYhHPHf9S8cu73-/TheValleywithChimney.PNG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/*E1*lxSss-drTIFDIuibWDmefHXIDPOTEqkmzfsM3xZVyeQ6GP4jzr3y0fbgM49mmR3k4FR3cg3F4QaoKZYhHPHf9S8cu73-/TheValleywithChimney.PNG)\n\nI hope that this helps and good luck!\n\n-Chris\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1203364", "name": "ChimneyExample File.gh"}], "created_by_name": "Chris Mackey", "created_at": "January 12, 2015 at 10:00pm", "created_by": "ChrisMackey", "parent_id": "reply_2985220_Comment_1203198", "id": "reply_2985220_Comment_1203363"}