{"body": "\nHello Mostapha,\n\nThank you very much again for the replies!\n\nHB and LB certainly brings much closer to architects the understanding of sustainability matters.\n\nI have some more questions in I would highly appreciate any clarification!\n\n\n\nSo you are saying that using Honeybee I can either get results for Illuminance,Radiation and Luminance for a specific time and date, or get annual results for Illuminance or Radiation. So it is either point in time or annual. I can t set a period? This month to that month etc?\n\n\n\nIn the _gridSize input of the Ladybug_Radiation_Analysis component, you say **\"This value should be smaller than the smallest dimension of the test geometry for meaningful results\". **But what if we want to run it for individual panels (attached)? I set the grid size to something larger than the panels size, in order to just test the center of each panel. Do you think there would be any mistakes with the results there?\n\n\n\nIf there is no context in the context_ input of the Ladybug_Radiation_Analysis the analysis doesn't run. So I 've been using an insignificant small geometry as fake context to simulate the \"no context\" situation. Do you see any issues with what I am doing? Have you considered changing the component to run even with no context?\n\n\n\n(in previous comment) Regarding the \"004_gridBasedAnalysis.gh\", and while switching from type 0 to 2 at the GRD, -you are right- the outputs in the component are correct as you have it in the images. But the Analysis type remains as 1 in the \"glz_.6_TVis_.4.typ\" so the units in the legend read always as wh/m2. Even when changing the target folder. Something maybe with the overwriting the file? (could be at my system but I doubt cause I have admin privileges).\n\n\n\nThose few questions for now!\n\nThanks a lot!\n\nDimitris\n\n\n\n\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1180994", "name": "Radiation_Panels.JPG"}], "created_by_name": "Dimitrios Papadopoulos", "created_at": "December 4, 2014 at 9:57am", "created_by": "doompop", "parent_id": "reply_2985220_Comment_1180385", "id": "reply_2985220_Comment_1180992"}