{"body": "\n<br/>Diffuse solar radiation also needs to be corrected or no? if no what is the formula?\n\nEpw's [diffuseHorizontalRadiation](http://bigladdersoftware.com/epx/docs/8-3/auxiliary-programs/energyplus-weather-file-epw-data-dictionary.html#field-diffuse-horizontal-radiation) is measured on a horizontal surface.<br/>The Perez diffuse model (which Ladybug Photovoltaics are using) uses this data along with previously mentioned directNormalRadiation to calculate the diffuse radiation on angled _PV_SWH_surface. It calculates three components of the diffuse radiation. You can read more about it in the [SAM Photovoltaic reference](http://www.nrel.gov/docs/fy15osti/64102.pdf).\n\n\n\nand which formula is used for ground-reflected component? and all these formulas are used inside TOF?\n\nI gave you a reply on this in the [Annual optimal tilt and azimuth angle of an unshaded PV array comments](http://www.grasshopper3d.com/xn/detail/2985220:Comment:1557172?xg_source=activity). And yes, all those formulas are used by the TOF component.\n\n<br/>for the second question: can you tell me which values changed for the hourly incident solar radiation? I mean, for example for Ib, directNormalRadiation comes from EPW and angle of incidence just change?\n\nYes.\n\ndirectNormalRadiation, diffuseHorizontalRadiation and dryBulbTemperature are taken from the .epw file. Everything else is calculated (angles, shading factors...).\n\n\n\nfor the third question, please look the x-axis in the following picture is about azimuth angle. for each azimuth angle we have some points. the chart is based on the tilt angle and azimuth angle to obtain the maximum solar radiation as well as the optimal tilt angle so we need the formulas that have tilt angle and azimuth angle to obtain the solar radiation component.\n\nYou can also find an answer to this question in the [Annual optimal tilt and azimuth angle of an unshaded PV array comment](http://www.grasshopper3d.com/xn/detail/2985220:Comment:1557172?xg_source=activity).\n", "attachments": [], "created_by_name": "djordje", "created_at": "July 19, 2016 at 1:10pm", "created_by": "djordje", "parent_id": "reply_2985220_Comment_1568402", "id": "reply_2985220_Comment_1568655"}