{"body": "\nHi Claudio,\n\n\n\nGlad that you're excited.  All of your old GH files will still work as they originally did.  The only issue is that, if you want to edit these old files using the new LB+HB components, the old version is not compatible with the new components and you will get a warning from any of the new components that you are not using the latest version if you drop it onto the canvas of an older GH definition.\n\n\n\nIf you have a GH definition that you must update so that you can edit it, the safest way to do this is to go through component-by-component in your definition and replace the old Ladybug + Honeybee components with new ones in your LB+HB tabs.  This is what I would recommend for the majority of the Ladybug community and in cases where you want to be sure that everything works correctly in your new GH file.\n\n\n\nOf course, I know that this process above is tedious and, if you are willing to risk not having a perfect file in order to maximize your speed, I will mention that there is a way of trying to update your old GH definitions using the Ladybug_Update Ladybug component.  The \"updateThisFile\" input can search through your GH definition and try to replace the code in all LB+HB components with new code.  HOWEVER, this does not always work - particularly in the cases where a new component does not have the same inputs and outputs as its older version.  Such components with different inputs/outputs have to be updated manually as stated above after the initial run of the Update Ladybug component. Also, this process with the Update Ladybug component technically syncs the components in your GH definition to what is on our github, which is not as stable as the version that we release here so be wary of bugs in files updated this way.\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "September 15, 2014 at 01:50PM", "created_by": "chris", "parent_id": "reply_2985220_Comment_1131492", "id": "reply_2985220_Comment_1132047"}