{"body": "\nMax D,\n\nI appreciate the effort in updating and for sticking with the issue.  We will get to the bottom of it somehow.\n\n\n\nThere were a few things incorrect about your file:\n\n1) You did not intersect masses before solving adjacency.  As a result, you got adjacent surfaces that did not match in area and a simulation where conservation of energy was not obeyed.\n\n2) The 'Set Ideal Air Parameters has been phased out as per this discussion:  .  I have implemented all of your specifications correctly using the new components in the attached file.\n\n3) You specified a solar distribution of 1- FullExterior and this is not suitable for detailed comfort studies where you really want to know how the solar energy is distributed through the space. \n\n\n\nI corrected all of this in the attached file but, even without changing all of this, I still got the same result that I did earlier:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/y9G3WvU4wnQD24dZiYqWmC15fAX*V0sEgpuEaPTEgqbTizY9BpSXLEGVtJXLOH4yXlWNq5GO7DMIWgBF0NZiMUFf22IF9g8f/StillWorkingMap.JPG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/y9G3WvU4wnQD24dZiYqWmC15fAX*V0sEgpuEaPTEgqbTizY9BpSXLEGVtJXLOH4yXlWNq5GO7DMIWgBF0NZiMUFf22IF9g8f/StillWorkingMap.JPG)\n\n\n\nI just cannot reproduce your error on my machine.  The images that you post seem different from that which is int he GH file that you sent.  Are you sure that you are sending me the right version of the file.  Also, could you send me your userCustomLibrary again (I was using your old one from here)?  Finally, do you have any other GH files open when you expereince this error?\n\n\n\n-Chris\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1572198", "name": "ComfMap_CWM.gh"}], "created_by_name": "Chris Mackey", "created_at": "July 27, 2016 at 04:37PM", "created_by": "chris", "parent_id": "reply_2985220_Comment_1571952", "id": "reply_2985220_Comment_1572197"}