{"body": "\nHere are two [question](http://www.grasshopper3d.com/xn/detail/2985220:Comment:1573716) from the \"daylight simulation using complex surfaces\" topic by Giacomo Luddeni. I posted the answers to them in here as it will be beneficial to keep them in component's release topic:\n\n<br/>I'm wondering how does it decide where to place the mask (given that I put no input data as context_ in the TerrainShadingMask element).\n\n<br/>As Abraham explained in [your initial topic](http://www.grasshopper3d.com/xn/detail/2985220:Topic:1572573?xg_source=activity), if you do not supply anything to the context_ input it will create a mask with the same radius as the sunpath diagram from Sunpath component. This serves for visualization purposes.<br/>So [the photo](http://api.ning.com/files/hbjtvQvq-mFg3g-rPi5SoF4yhJ2O7B4TSQL0Eaa9VP2yhIgRNkpwLUR2vMR93FdysGtDpmHHG3CfdXDPmkeH8ijgy-DYk2kU/terrain_shading_mask_surdulica.jpg) you see in the starting post of this topic has been generated in that way.<br/>However in order for the mask to be used as a shading context for any solar radiation analysis, it needs to be scaled. The component scales the mask until the difference between the [sky exposure factors](http://www.grasshopper3d.com/xn/detail/2985220:Comment:1463066) of four points of the context_'s bouding box is less than 0.01.<br/>Then it should have done the same for the [sunpath shading](http://api.ning.com/files/Z3BWMoplk5SKli5hVB7-9WdIvC1qAnTs4LdiOxOoi5lYNsNMY6Pziuk0mXUcOCMa*Ledz0Sb4XY6n3BjseCTWQTz60LAe0UZ/photovoltaics_shading.jpg).<br/>As I did not succeed in moving the whole \"Sunpath shading\" component to the \"Ladybug Ladybug\" component and calling it from there, this step is omitted. After checking for sky exposure factor differences, the radius will be scaled 3 times, and if lesser than 10000 meters, it will be set to 10000 meters. In most cases this kind of distant radius may not even be needed.\n\n<br/>Is it actually placed in such a way to give the same shading effect as the real terrain geometry?\n\nYes.\n", "attachments": [], "created_by_name": "djordje", "created_at": "August 05, 2016 at 02:47PM", "created_by": "djordje", "parent_id": "topic_1557177", "id": "reply_2985220_Comment_1577283"}