{"body": "\nHi Amanda,\n\nThanks for posting and it's great to see you taking the components to their limits!\n\nLet me make sure that I am understanding you correctly.  If you are trying to test out 8 different cases where all of the windows of the zone have the same transmissivity to see the effect of the building's overall window SHGC on comfort, then your current file looks like it should be correct.  However, if you are trying to analyze a single simulation where each window has a different transmissivity, the Ladybug_Solar Adjusted MRT component is not going to be able to help you since its windowTransmissivity input is not built to understand the relative contribution from elements with different transparencies.\n\nIf you are interested in this latter case, you can model it using the microclimate map workflow that I developed for my thesis, which will look at the relative contribution of each surface and window element on local MRT.  Here is an example of a simple test box that is using this micro-climate map:\n\n[http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;for...](http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;fork=hydra_2&amp;id=Microclimate_Map_-_Simple)\n\nIf you are only interested in Radiant Temperature, you can use the radTempMtx output from the Microclimate Map component and, if you would like the operative temperature or adaptive comfort, you can replace the UTCI recipe in the example above with the \"Honeybee_Adaptive Comfort Recipe\".\n\nThe micro-climate map workflow will compute a starting MRT from the view factor and temperatures of your zone's surfaces and will pull the SHGCs of your windows from the EP constructions of your HBZones when it computes solar-adjusted MRT.  So all that you have to do is assign the SHGCs correctly to your HBZones and the component will take care of the rest.\n\nLet me know if you have any questions and more information on the comfort maps can be found in my thesis document:\n\n[https://www.dropbox.com/s/k4r4rd279y4td9n/Mackey_Thesis.pdf?dl=0](https://www.dropbox.com/s/k4r4rd279y4td9n/Mackey_Thesis.pdf?dl=0)\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "December 16, 2015 at 09:06PM", "created_by": "chris", "parent_id": "topic_1422516", "id": "reply_2985220_Comment_1422672"}