{"body": "\nMostapha,\n\nThank you for the recognition!  It is always good to feel appreciated :)\n\nJulia,\n\nThank you for the comment and I should have put up an example sooner about how you can get custom outputs for anything you want with Honeybee.  The SQL is one method that we have not fully implemented yet but will usually take SOOOOO long to write because E+ will write all of this crud into the SQL that you are usually not interested in.  A better approach in my view is to run the model once and parse the Result Data Dictionary (.rdd) file using the \"Honeybee_Read Result Dictionary\" component.  This allows you to see all of the outputs that you can request and you can even search through it to find a particular output.  Once you find what you are looking for, you simply copy the text into a panel and and plug this into simulationOutputs.  Then you can use the \"Honeybee_Read EP Custom Result\" component to bring the results that you are interested into GH.  I updated the example of the evaportaive cooling tower on Hydra (which already shows how to use additionalStrings) in order to show how to get out a custom output of the energy removed by the tower:\n\n[http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;for...](http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;fork=hydra_2&amp;id=Evaporative_Cooling_Tower&amp;slide=0&amp;scale=1&amp;offset=0,0)\n\nI am going to close the SQL github issue now unless someone has a specific reason why the SQL method is better than the method that I posted here.  If you don't mind, Mostapha, will you direct people who ask questions about custom results to this example file for the time being? If we implement SQL, I don't see it happening until on the legacy version of HB.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "January 28, 2017 at 12:50pm", "created_by": "chris", "parent_id": "reply_2985220_Comment_1678569", "id": "reply_2985220_Comment_1679863"}