{"body": "\nHi Artem, Thank you so much for the feedback. I really appreciate it.\n\n1. I'm not sure but if you are talking about pressure coefficient for a window then, the best way is to use CFD simulation and consider the context. That's exactly one of the shortcomings that EFRI-Pulse project is trying to address by getting CFD simulation integrated to energy simulation.\n\n\n\n2. Can you give me more information about this example? If you are looking for default construction set based on building program, you can create it yourself in Honeybee. In general material (or to be more technically accurate constructions) are assigned based on standards and climate.\n\n\n\n3. This is a great point. We are all for applying passive strategies. The issue is that EnergyPlus is not designed originally for simulating passive strategies. It is always so much extra work to develop components for modeling passive design ideas. Even modeling something like an Atrium is not that easy. I posted a question about it few months ago and as you can see people are doing it in really different ways ([https://unmethours.com/question/42/what-is-the-best-practice-to-mod...](https://unmethours.com/question/42/what-is-the-best-practice-to-model-an-atrium-in-energyplus/)). I have my own approach for personal projects but once I want to apply it to Honeybee, I need to make sure we are implementing it right. It is similar for natural ventilation, green houses, double walls, etc.\n\nThe good news is that we found a really good consultant to help us with natural ventilation and Chris is implementing it to Honeybee. We are closely working with OpenStudio team and other experts on the field to find the best solutions to implement modeling passive strategies and I hope to get them in ASAP. Once we have them set I can say Honeybee can be used as a design tool. I know that we are not there yet!\n\n\n\nThanks again and looking forward for more comments and wishes.\n\n\n\nCheers,\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "December 15, 2014 at 10:49PM", "created_by": "mostapha", "parent_id": "reply_2985220_Comment_1186504", "id": "reply_2985220_Comment_1188825"}