{"body": "\nElly,\n\n\n\nThe project sounds cool and you can absolutely build a GH definition to do what you are asking (perhaps with the addition of a python component of your own).\n\n\n\nWe currently have no component that does sensitivity analysis on a bunch of simulations but I imagine that you can easily write one if you know/learn a bit of python (mathematical calculations like that are how I started learning python myself a couple of years ago and are fairly easy to set up after watching an online python series like this awesome one: [https://www.youtube.com/watch?v=HBxCHonP6Ro&amp;list=PL6gx4Cwl9DGAc...](https://www.youtube.com/watch?v=HBxCHonP6Ro&amp;list=PL6gx4Cwl9DGAcbMi1sH6oAMk4JHw91mC_)).\n\n\n\nOur current building programs come from the OpenStudio library.  I would really recommend using this and editing your HBzones with components to meet New Zealand standards but, if you are really ambitious and have a good deal of time on your hands, you can try to edit the OpenStudio libraries themselves (by editing the OpenStudioMasterTemplate.idf file in your Ladybug default folder).  You might also have to edit some of the code in Honeybee_Honeybee depending on how much you want to change with the building programs (just changing the values or adding some new things should not change too much).  Instead of editing the constructions of the OpenStudio Library, I would just add the constructions you want to the userCustomEPLibrary.idf file in your Ladybug default folder and they will appear whenever you use Honeybee.\n\n\n\nI have not tried this yet but I beleive that the schedules that you create with the \"Honeybee_Daysim Occupancy Generator\" can be plugged into an E+ simulation (this is less-listy).  If it does not work, it should just take a few minor tweaks of the component code to get it to do that.  Let me know if you end up trying it.\n\n\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "August 01, 2015 at 10:15AM", "created_by": "chris", "parent_id": "topic_1333550", "id": "reply_2985220_Comment_1335181"}