{"body": "\nMostapha and Theodoros,<br/><br/>Many thanks for helping.<br/>I have figured out how to use grading to generate denser mesh where needed. Very Useful!<br/>2D cases are convenient, I will post some results of optimisations.\n\n\n\nOn the thermal end:<br/>Although Butterfly is already making things user-friendly like none other, I am still limited by my scarce knowledge on CFD simulations which I am trying to cope with by fumbling around openfoam forums.<br/><br/> I am still unable to use the heat transfer recipe correctly in the indoor example definition. Most of the stepbystep Tutorials are provided with OpenFoam lines which I have come to find uneasy to interpret with what is already written in the components of Butterfly.<br/>I am gaining experience thanks to you.\n\n<br/>I am still unsure of how to set the conditions for a box (heatsource at 37 C, bodytemp) to visualise stack effect in the room.<br/><br/>1. Is it necessary to set custom boundary conditions for this case? If yes, would you recommend a library of the corresponding parameters for different generic items? <br/>As a simplification, could the wallboundary be used to create the geometry and input the temperature ?<br/><br/>2. in the createBgeometry component,must the Jagged component be plugged into meshset? <br/><br/>3. Is the temperature of the Inlet, the temperature of the fluid/air entering the room?<br/><br/>4. With the heat transfer recipe blindly plugged into the solution. I am not sure how to solve these errors:\n\n\"Radiation model not active: Radiation properties not found<br/><br/>...<br/><br/><br/>--&gt; FOAM FATAL ERROR: <br/>Continuity error cannot be removed by adjusting the outflow.<br/>Please check the velocity boundary conditions and/or run potentialFoam to initialise the outflow.\"<br/><br/><br/>Thank you for your patience and for kindly considering these questions.<br/><br/>Best,<br/>Olivier\n", "attachments": [], "created_by_name": "Olivier Dambron", "created_at": "November 28, 2016 at 5:08am", "created_by": "OlivierDambron", "parent_id": "reply_2985220_Comment_1644293", "id": "reply_2985220_Comment_1647202"}