{"body": "\nThanks for reporting Dimitrios and, Abraham, your instincts are very close to the problem.  You are absolutely right to point out that the issue is not with the analysis period but with the data that the analysis period includes.\n\n\n\nTo be perfectly honest with you guys, this is an error that I have know about for a while.  It happens when you have both a very high wind speed and a high metabolic rate is fed into the PMV function, which can happen if you have an hour of your weather file that is in an intense storm and you hook up a high met activity like walking.  The original PMV model was not meant to handle these very extreme cases (being derived from climate chamber tests) and it is only through some mathematical tricks that scientists have found ways of gradually converging on a solution that describes these cases.  Unfortunately, sometimes, this iterative process flies off the handle instead of converging on a solution and so there is another mathematical trick that has to be used to find the solution.  What was happening here was that the initial function was not recognizing when this flying off the handle was happening in order to pass on the results to the other mathematical trick.\n\nI probably should have addressed the issue a while back but I knew that it was an issue in the original code that I got from the ASHRAE model inside the CBE tool ([http://smap.cbe.berkeley.edu/comforttool](http://smap.cbe.berkeley.edu/comforttool)) and it felt a bit wrong to edit code that is a part of the standard.  I see now, though, that it was really just a matter of recognizing that the result was flying off the handle and passing it to the next function so I do not feel so bad about making this change.\n\nAttached you can find your fixed file and an updated PMV and LB_LB component is now on the github.\n\n-Chris\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1233888", "name": "Comfort_Outdoor_SET_01CWM.gh"}], "created_by_name": "Chris Mackey", "created_at": "February 28, 2015 at 09:56PM", "created_by": "chris", "parent_id": "reply_2985220_Comment_1232368", "id": "reply_2985220_Comment_1233886"}