{"body": "\nArie,\n\nIt must be fate that you posted this as I just had a conversation with a co-worker today about this very phenomenon while we were sitting next to a fully glazed building with sun reflecting off it.\n\nAt the moment, I don't account for these reflections in the thermal comfort maps off of energyplus results (what I would usually recommend for exploring thermal diversity across space).  However, this is absolutely something that you can estimate with the solar adjusted temperature component and some creative use of the Ladybug components.  What you want to do is grab the solar radiation values that you get out of the Honeybee simulation and plug these into the cunSkyMtxOrDirNormRad and diffuseHorizRad inputs of the solar adjusted temperature component.\n\nThe only difficult part is figuring out how to split the radiation between these two, which is going to depend on the specifics of the case you are modelling.  Direct radiation is radiation that shines like a beam or reflects off of a mirror surface while the diffuse radiation is distributed evenly across the sky (at least inside the solar adjusted temperature component).  Depending on where your radiation is coming from, you may want to put more radiation to one of these sources.  Also, if your beam radiation is coming primarily from a mirror surface and not the position of the sun, you will have to \"hack\" the usual use of the solar adjusted temperature component and plug in a location and time of day that produces a sun vector representing where the beam of light is coming from.  Along with this, the direct normal radiation that you should model with Honeybee at a plane that is normal to this sun vector.\n\nIf all that sounds confusing and you just need is a back-of-the-envelope estimate of solar temperature delta, plugging all of the radiation into diffuse should give you a worse-case-scenario that lands you around the right order of magnitude (as I do in the attached GH file).\n\nOnce you have the solar adjusted MRT from this component, you plug it into the UTCI component just like I show in this video:\n\n[https://www.youtube.com/watch?v=5nK-rGfPEBk&amp;index=9&amp;list=PL...](https://www.youtube.com/watch?v=5nK-rGfPEBk&amp;index=9&amp;list=PLruLh1AdY-Sho45_D4BV1HKcIz7oVmZ8v)\n\nLet me know if that is clear.  I should also note that you can only model one hour at a time with this method but, by animating a slider, you can produce a set of animated temperature maps that look like this over the course of the day:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/t3tIV4vY4Jp8rblCpq0cziIUiI4*pB78OeG3cdgJCYXcDqWj-R*I9eVfuNwS0YyDzOpMs9P4nUAbZy4NyMXytWHJhpao2igH/UTCIwithReflections.PNG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/t3tIV4vY4Jp8rblCpq0cziIUiI4*pB78OeG3cdgJCYXcDqWj-R*I9eVfuNwS0YyDzOpMs9P4nUAbZy4NyMXytWHJhpao2igH/UTCIwithReflections.PNG)\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "August 20, 2015 at 09:35PM", "created_by": "chris", "parent_id": "reply_2985220_Comment_1346458", "id": "reply_2985220_Comment_1346542"}