{"body": "\nAlejandro,\n\nI have looked through your file and I have not been able to replicate your issue.  I ran your zone with the higher ventilation that you manually input and the lower original defaults and I got very different heating load intensities.  As expected, the higher ventilation zone has a heating load intensity that is almost double the default.  Furthermore, to be sure that the model was being run correctly, I checked the air mass flow rate of air in the mechanical system into the zone that that was also doubled between the low ventilation and high ventilation case.\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/3KGM3KZVxz7JJ-8IegI3mcQcHb62c60lebQs-D5-uITSb5uYBkq-L9v-NEClkuogxUMeisUHzg1cxrFH6d*2Qi*xuNlEp4Lz/VentilationandHeating.PNG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/3KGM3KZVxz7JJ-8IegI3mcQcHb62c60lebQs-D5-uITSb5uYBkq-L9v-NEClkuogxUMeisUHzg1cxrFH6d*2Qi*xuNlEp4Lz/VentilationandHeating.PNG)\n\nI attached the GH file that I used to get these results and let me know if you are not able to get the same.\n\nAlso, to clarify, the ventilation schedule of the zone will follow the occupancy schedule.  When the zone is unoccupied, the ventilation will be governed by the ventilationPerArea_ value and, when the zone has people within it, it will be governed by the ventilationPerPerson_ value.\n\n\n\nFor your heat recovery question, with the Write_IDF component that you are using here, the mechanical system is always ideal air load, which means that it is not modeling the efficiency of any pumps, fans, coils or any of the things associated with HVAC.  The values of heating/cooling energy that you get out of this operation are just the amount of heat that has to be added to or removed from the air of the zone in order to meet the thermostat setpoint (or setback).  Accordingly, adding in a heat recovery system here would not be correct since we haven't modeled the rest of the system.\n\nHowever, if you use the Export To OpenStudio component instead of the Write IDF component, you can include a fully detailed HVAC system in your model.  The last public LB+HB release allowed to you fully model a VAV system or PTHP system in this way.  If you use the most recent components on the github, you can use any of the systems in the OpenStudioHVACSystemsList component.  I believe that, within the last week, Chien Si (the HB developer who has been bringing in a lot of the systems capabilities) just added in the ability to include a heat recovery system.  Mostapha and Chien Si have more knowledge on this than I do but, if they don't respond here soon, I will post what I find out.\n\n-Chris\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1165599", "name": "141107WTCHB_CWM.gh"}], "created_by_name": "Chris Mackey", "created_at": "November 10, 2014 at 10:11am", "created_by": "chris", "parent_id": "topic_1165610", "id": "reply_2985220_Comment_1165597"}