{"body": "\nDavid,\n\nGood questions.  Right now, Honeybee energy models do not support explicit hot water systems but we should be able to do this in the future because OpenStudio has this full capability.    I think the the US Department of Energy's MidriseApartment template that Honyebee uses is not supposed to include hot water in the equipment loads (equipment loads = 3.875 W/m2).  However, even for residential, hot water typically makes up a relatively small portion of the building energy use (and internal space gains) such that it's usually ok to leave it out of a full building energy model and model it separately.  So I would recommend using the Ladybug hot water components for now or (if you really need the hot water system in your energy model) build the hot water system in OpenStudio after exporting from honeybee.\n\nAs for heat recovery, given that Abu Dhabi never gets that cold, regular-old sensible heat recovery is likely not going to have a large effect.  You want to make sure that you use an enthalpy wheel (set the heatRecovery on the airDetails to 2) and this will ensure that both latent and sensible heat is recovered.  As a result, you will save a lot on the cooling energy because enthalpy wheels will ensure that the incoming air does not have to be dehumidified as much. Also, enthalpy wheels generally have a higher recovery effectiveness than most sensible heat recovery systems so you can set this as high as 0.7 like so:\n\n\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/7XbQiMj5TFOoOuwzvsQraPAt*LjF4XIx9efegYdoxjIcPMc7RZCkcnxysKk0Zx690SETld3DzKClf412nf91Lgm-5tNFB33K/EnthalpyWheelHeatRecovery.JPG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/7XbQiMj5TFOoOuwzvsQraPAt*LjF4XIx9efegYdoxjIcPMc7RZCkcnxysKk0Zx690SETld3DzKClf412nf91Lgm-5tNFB33K/EnthalpyWheelHeatRecovery.JPG)\n\nThe COP is ignored when using ideal air systems and the \"Assign HVAC System\" should give you a warning about this.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "June 13, 2017 at 12:29pm", "created_by": "chris", "parent_id": "reply_2985220_Comment_1768481", "id": "reply_2985220_Comment_1768386"}