{"body": "\nMostapha Sadeghipour Roudsari,\n\n\n\nThis is inspiring and great as always. Many congratulations to you on the 4th anniversary. Thank you for everything. Also, a big thanks to Chris Mackey for spearheading the development of Legacy versions. I believe that had a direct impact on the development of Butterfly, Dynamo variants, and Plus variants.\n\n\n\nI have been thinking about providing feedback since the day it was posted. I will put my thought to words.\n\n\n\nWhat is currently missing? Why do you think that missing feature is important?\n\n1. Checklists and notes. I got this idea from a checklist for Daylight simulation from Prof. Christoph Reinhart. Ladybug Analysis Tools is a community of experts. What if there's a way for people to make such checklists/notes and share with everyone. For instance, one would be very interested in looking at a checklist/notes from Sarith, Chris and you before commencing a daylight / electric light simulation. Similarly, a checklist for CFD simulation can come from Theodore and you. And there could be many such checklists. I believe this could be really helpful to the beginners. Maybe, it can have an effect on initial time spent on establishing workflows.\n\n\n\n2. Test cases for developers. This is something I have already shared with you and Chris. The idea is to have test cases for a developer to run before he/she submits the changes in the script. This is one way to make sure that the original capabilities of the component are not harmed by the new implementation.\n\n\n\nIf you could only change one thing, what would it be and why?\n\n1. I would go and write Docstring for all the function definitions. Till now I have only worked on components developed by other developers. Obviously, this is something I felt should be there. Maybe this could be done in the Plus variants you are writing.\n\n\n\n2. I am also in complete agreement with [Aurelien Keller](http://www.grasshopper3d.com/group/ladybug/forum/topic/listForContributor?user=2qf6nk6hn4h1o) about his comment on descriptions. This is necessary, and I am too working towards improving tool tip descriptions and component descriptions as and when I spot the ones that I think could be improved.\n\n\n\nWhat do you like the most about Ladybug + Honeybee that you don't want to change in the new release?\n\nI really like the toolset approach. I believe that should be retained.\n\n\n\nI have no definite answers to the rest of three questions, but will surely comment if I think of something.\n\n\n\nKind Regards,<br/>-Devang\n", "attachments": [], "created_by_name": "Devang Chauhan", "created_at": "January 25, 2017 at 01:18AM", "created_by": "devang", "parent_id": "topic_1677014", "id": "reply_2985220_Comment_1677954"}