{"body": "\nHi Chris and Mostapha,\n\n\n\nFirst of all, happy new year! I wish you all a happy, healthy, and creative 2016.\n\n\n\nChirs, thank you once again for your informative answer.\n\n\n\nI have been thinking a lot about this lately. I believe you are absolutely right to say that the type of behavior to be modelled will define if we actually need an ABM interface. If, as you say, the parameters modelled are temperature or radiation, then I imagine that a lot of studies can be done within E+, perhaps in the stepwise way you described earlier.\n\n\n\nAdditionally, and this is my main critic on ABM in general but I'll leave it for another discussion, the degree of freedom or interaction with the environment that an agent has dictates the possibilities for an ABM. In typical models this has to do with how you model innovation in agents, changes in their practices and norms (which generally isn't there in ABM models). In our case, it related to the type of environments our agents are situated in.\n\n\n\nI can imagine two extreme cases of environments, with ofc a gradient of possible worlds between: the mechanically conditioned building and the naturally ventillated building.\n\nIn the first case, which btw is the one most encountered in my part of the world, the agents have minimal, to sometimes zero, control on their environment and no capabilities of adaptation and change. Imagine a typical building where the set points are set centrally, windows are not operable, and even the shading devices are sometimes out of their reach.\n\nIn this case, I can imagine ABM models helping only as a post processing tool. What that means is that we could potentially use them to analyze occupant behavior within this controlled environment. E+ would give us the hourly space performance and we would feed that to agents to see how they respond. Ofc, in terms of thermal comfort this is almost what your tools are doing. So, such an approach would have little value in an office building for example where people are assumed static but could be interesting in retail buildings where we could potentially model occupant movement according to building performance. The limits of this approach then is some sort of scenario testing of different settings and occupant (response) behavior to them. Here of course, you have a valid point of other building characteristics that should be modelled, apart from climate.\n\n\n\nIn the second case, that of an adaptive building, I believe ABM can be a tool that can be used in a co-simulation approach, as it has been used in the site Mostapha mentioned above. Again though, in ABM it is critical to not overdefine behavior but on the contrary to generate behavior from assigning simple rules to agents. This makes it difficult for me to find the limit of detail in the functions/statistics used to model occupant actions within the building (on windows, shading, thermostats, etc.).\n\n\n\nSince ABM is better fitted to generate patterns that we encounter in the real world, I thought of developing a model that might do exactly that. It took me a while to think of a pattern that would be interesting, but I think I finally have it. It is a bit of a grand gesture of course, but should be worth it.\n\n\n\nAs you know better than me from your research, the adaptive comfort studies found a quite peculiar fact about the tropics. The sentence went something like this (I'm botching it probably), \"people in the tropics tend to prefer environments that are below the limits of their neutral comfort\". Or simpler, people just want to the space to be colder than what one calls neutral.\n\nMy simple minded explanation, after leaving in the region, is that the explanation for this is to be found in the interface between outside and inside. The temperature gradient in that interface is what makes people feel more comfortable in uncomfortable (i.e. colder) conditions.\n\nSo what if we would introduce a shaded, open, naturally ventilated space prior to a MV building's entrance and then increase your indoor temperatures in the building? Or what if we introduced a temperature gradient in the different spaces a visitor/occupant passes through as he enters the building. I feel that energy modelling cannot really understand the impact of these interventions on occupants, at least in its basic form. I think this is where ABM could be useful. Building a model that can generate the above mentioned pattern and then using it to analyze different types of strategies to occupant behavior.\n\n\n\nI wanted to write the things above in a more structured way but I forgot my cheat-sheet at home :) I hope I made some sense.\n\nI will try and be patient and follow the route you suggest however, understanding the E+ resources first and then moving to connecting it to ABM.\n\nI just thought I'd describe the sort of research questions I have in mind for this, hoping someone finds it interesting as well!\n\n\n\nKind regards,\n\nTheodore.\n\n\n\nP.S.: I have left out other areas that would be suitable for ABM modeling within buildings. For example the area of health and safety. ABM is an amazing tool to model occupant behavior in extreme events, e.g. fire in a building or toxic smoke, etc. in order to analyze evacuation patterns and optimize building design. Even though this is something I am also interested, I intentionally did not go into it since we are mostly dealing with environmental design here.\n\n\n\n\n\n\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "January 3, 2016 at 7:47pm", "created_by": "TheodorosGalanos", "parent_id": "reply_2985220_Comment_1429489", "id": "reply_2985220_Comment_1429939"}