{"body": "\nAbraham,\n\nthank you, I think your suggestion works (and I used something similar) but only in the case you already have all the different object variation you want to test.\n\nIn my case I don't have, so I tell you what I had to do and how I did it.\n\nI have the following situation. A urban context with a square plot 40m x 40m surrounded by buildings.\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/Fxq0VavCSuBW*q7TW6Pq7eJ0cmMm1BcuUGXepj0rcdj3IGzqcXokvkixkToExI0LoZrfO*S4L*7uRtOlAYjkXVl2sGuiU3bx/01.jpg?width=721\" width=\"721\"/>](http://api.ning.com:80/files/Fxq0VavCSuBW*q7TW6Pq7eJ0cmMm1BcuUGXepj0rcdj3IGzqcXokvkixkToExI0LoZrfO*S4L*7uRtOlAYjkXVl2sGuiU3bx/01.jpg)\n\n\n\n\n\nIf I extrude the plot I get 4 surfaces and I need to calculate the minimum daily quantity of direct sunlight hours each test point receives in the period from 22nd of April to 22nd of August. For example for the test point at index 21 of surface with index 1 (I am just creating these numbers in my mind) the minimum is on 27th of April and the test point receive 8 hours (this is also invented for the sake of the example) of direct sunlight. All the other days it receives more. So the values I have to found are these minimums for all the test points. Now how to calculate these minimum quantities is a different issue of the topic of this post and actually I manage it.   \n\nContinuing with the explanation of what I had to... so I have only the initial plot that generate 4 surfaces, then I want to test smaller plots generated by an offset of 4 m of the original one, and the relative 4 surfaces for each smaller plot.\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/Fxq0VavCSuD9LTvRtsgp7h1ycpu*O4SLjh9tfdA5-Qeo4w4Umg5UzCbN1TkUP4UsPD6L5F5qjkCqZ03hdfAptLiKmFgodz4r/02.jpg?width=721\" width=\"721\"/>](http://api.ning.com:80/files/Fxq0VavCSuD9LTvRtsgp7h1ycpu*O4SLjh9tfdA5-Qeo4w4Umg5UzCbN1TkUP4UsPD6L5F5qjkCqZ03hdfAptLiKmFgodz4r/02.jpg)\n\n\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/Fxq0VavCSuB9RRYSGqfAbtSnpup10Jpfb*MBo8NJJ8D1g-aZSHxy9GDE9yU3XpwKPumlggE*c-EtV4gU6qgqkHkxZ4jsKSur/03.jpg?width=721\" width=\"721\"/>](http://api.ning.com:80/files/Fxq0VavCSuB9RRYSGqfAbtSnpup10Jpfb*MBo8NJJ8D1g-aZSHxy9GDE9yU3XpwKPumlggE*c-EtV4gU6qgqkHkxZ4jsKSur/03.jpg)\n\nSo in this case I think I cannot use your suggestion because the object don't exist yet.\n\nI managed creating a loop with Anemone, the loop generate an offset starting from the original  at 0 until 4 (then I multiply it by 4 to obtain the offset at 0, 4, 8, 12 and 16. Then I did like you also suggest I record every time the result with the DataRecorder and I create for each result a different branch with the index coming from the loop (0, 1, 2, 3 and 4) with the Flatten component.\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/Fxq0VavCSuAwUd3a0276KWI*aWK4qbnyTT6ZJkX6H2mLh94tRhglGTBsmXBATGawiVUD9AlnlFwkx9QZ5tWJEkvxeHKx-Ame/04.jpg?width=721\" width=\"721\"/>](http://api.ning.com:80/files/Fxq0VavCSuAwUd3a0276KWI*aWK4qbnyTT6ZJkX6H2mLh94tRhglGTBsmXBATGawiVUD9AlnlFwkx9QZ5tWJEkvxeHKx-Ame/04.jpg)In this image you can see all the surfaces saved in the same way as described above and  in white the test points that receive minmum or equal than 2.5 hours per day of direct sunlight in the period from from 22nd of April to 22nd of August and in dark gray the test points that receive less.\n\n\n\nThe main point of this discussion is just the fact that instead use this tricky way I used, or the one you suggest, to analyze separately (because they shade each other) 20 geometries (in this case 20 they could be many more) it would be good if it would be possible just to input all the geometries at the same time and they would not shade each other so to get directly all the results with one run and in a more simple way.\n\n\n\nFrancesco\n\n\n\n\n\n\n\n\n\n \n", "attachments": [], "created_by_name": "Francesco De Luca", "created_at": "January 17, 2017 at 01:26AM", "created_by": "FrancescoDeLuca", "parent_id": "reply_2985220_Comment_1673284", "id": "reply_2985220_Comment_1673532"}