{"body": "\nBernardo,\n\nI have not delved too deeply into RayMan or done a results comparison from both models but, as I understand it, the underlying principle of the indoor and the outdoor MRT calculation is the same and should be applicable to both cases.  Both are trying to estimate the amount of solar radiation that falls on the human body and, in the case of RayMan, this seems to be fed into a human energy balance equation with terms for long wave radiation while, for the CBE Tool, they pull out just the terms of this equation that has to do with direct/diffuse solar radiation to give an MRT delta off of an an existing MRT from long wave radiation.\n\nThe rayMan method is nice for outdoor because you usually have no idea of the longwave radiation from outside surfaces but, for indoor, you usually have accurate MRT already from an energy simulation so all that you need is a delta.  As I understand it, this is the only major thing that makes the tool suited to indoor vs outdoor.  For using the Ladybug tool, I caution that, if you start having a lot of context surfaces in outdoor cases, it is really important to try to get an accurate starting longwave MRT instead of using the air temperature.  Ryaman seems to have ways of doing this long wave calculation and I think I will create some workflows in the future that use the outdoor surface temperature from E+ simulations to help with this.\n\nIn any case, with all of this taken together, the geometry and exact position of the human body usually ends up being very important to estimating an exact MRT delta for solar radiation and, as a designer or engineer, it can be very difficult to know this for your real-world case since all that the occupant has to do is tilt their chair.  This is one of the main reasons why I started this component with a mannequin that showed where the radiation was falling on the person so that everyone could be aware of the assumptions.  So, given this large uncertainty, I would take any of the results of a solar temperature estimator with a significant margin of error from the real-world case (maybe 10-20%) and just use it to get a sense of the order of magnitude change that the sun produces.  Both Rayman and, the CBE method, and the Ladybug component should all fall withing this margin of error and order of magnitude.\n\nI hoe this was helpful,\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "October 29, 2014 at 11:22am", "created_by": "chris", "parent_id": "reply_2985220_Comment_1157587", "id": "reply_2985220_Comment_1157901"}