{"body": "\nHi all,\n\n\n\nso many thanks for your inspiring work concerning getting ENVI-met and Grasshopper together.\n\n\n\nLet me answer some of the Q raised here:\n\nPET: First of all, there is no standard guideline on how to calculate PET. There is the Höppe paper from 1984 which is in German and mostly mo one have everread that. The often cited 1999 paper doesn't give any insights into the calculation methods. It's completely useless to that extend.\n\nSo all of the calculation methods available are basically a code-downstrip of a program called MEMI that has been relesead as a part of a german VDI guideline. Otherwise, it won't be possible to compile the required data.\n\n\n\nThe 1984 Höppe paper was a Diploma thesis (!). We all know, how many errors there are in a diploma thesis. And so is in this one.\n\n\n\nFor the ENVI-met implementation of PET, we went back to the diploma thesis (not a great deal as it as in german) and then removed all the errors inside of it.\n\n\n\nThat was the basis of the completely re-designed PET modul in ENVI-met.\n\nStill, there is an on going project at the university of Hamburg and she found still a number of errors in the corrected ENVI-met version.... So there is still space to go\n\n\n\nCalculation time: The Biomet solves the procedure correctly on a scientific level. You might also get results much faster on a less strict level...\n\nAlso: If you don't change the domain settings in BioMet, the whole 3D space will be calculated, while I assume in the Grasshopper component mentioned here, only one 1D slice is calculated (-you can set this in ENVI-met Biomet, too)\n\n\n\nFinally, I totally understand that the change from a totally free program to a payed program (if you need the full version) is not funny.\n\nHowever, as the post in the forum and others show, there is a huge interest in ENVI-met form the architectural, landscape architectural or urban planing scene.\n\nThey all demand basic or new functions (what is right).\n\nBut with V4, ENVI-met cannot longer be handeld as a hobby project of mine (which it wasup to 3.1).\n\nWe're still not at the point to be able to hire programmers as permanent staff (which would be neccessary to cont our work) but with the selling of the SCIENCE and PRO licenses, we're at least able to carry on working.\n\nWithout this business model, it would be Version 3.1  forever,\n\n\n\nThanks for understanding and best of all\n\n(Keeping track of this great component)\n\n\n\nMichael\n\n\n\n-----------------\n\n\n\n\n\n\n\n\n", "attachments": [], "created_by_name": "Michael Bruse (ENVI_MET)", "created_at": "February 27, 2017 at 03:14PM", "created_by": "MichaelBruseENVIMET", "parent_id": "reply_2985220_Comment_1701394", "id": "reply_2985220_Comment_1701746"}