{"body": "\nHi Abraham,\n\nI have taken a look at your model and I can say that nothing is wrong in the running of EnergyPlus and there are no bugs in Ladybug or Honeybee that are causing those results.\n\nThe very high temperature values in winter are the result of the fact that you have created a mostly glazed south-facing test box in a high solar radiation climate and you have left almost no place for this heat to escape from your zone.  All of your surfaces other than the glazed surface are adiabatic so there is no chance for the heat to escape there.  In the winter months, you do not allow users to pull the blinds (as per the blinds schedule), open the window (as per the minOutdoorTempForNatVent value of 18C) or run the cooling system (as per your cooling setpoint shcedule).  Left with only a small infiltration rate and a small amount of conduction through a window, the heat cannot escape your zone and so it builds up until the indoor temperature reaches up to 55 C in the afternoon.\n\nYou are effectively modeling a solar oven and so I do not find your results that surprising.\n\nTake a look at your solar gains:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/kwvKg1TQ8fUQ*6prgc65s8hDk9DbJo2PjLEX0AobSlDj83eUzQwGHHtzvNEViBUTy1VnsmdxhN9psXsSYCwwTA6Vn9k3zx7M/solargain.PNG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/kwvKg1TQ8fUQ*6prgc65s8hDk9DbJo2PjLEX0AobSlDj83eUzQwGHHtzvNEViBUTy1VnsmdxhN9psXsSYCwwTA6Vn9k3zx7M/solargain.PNG)\n\nTake a look at your total heat gain (people + equip + lights + solar) (you have some interesting internal gains schedules):\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/kwvKg1TQ8fV5rnX5lAx*IIy2dadui5rWLZm009ihy3Idj3Dn2tmi8tWxqJnHqre8ErFddWN7Mpvs6kM0u4-16MfwI-MPrmr-/totalgain.PNG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/kwvKg1TQ8fV5rnX5lAx*IIy2dadui5rWLZm009ihy3Idj3Dn2tmi8tWxqJnHqre8ErFddWN7Mpvs6kM0u4-16MfwI-MPrmr-/totalgain.PNG)\n\nNow take a look at the net flow of heat (solar+conduction) through your window (one of 2 places where heat escapes):\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/kwvKg1TQ8fViA3g2gkQwl*YpAYEemVXrNIGRU1nKnKIqmJUJFhoTkjAhPLgUeAnzIwfY8QsXFrCi3iUVrFB3i25JXERbZ4QA/GlazingEnergyFlow.PNG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/kwvKg1TQ8fViA3g2gkQwl*YpAYEemVXrNIGRU1nKnKIqmJUJFhoTkjAhPLgUeAnzIwfY8QsXFrCi3iUVrFB3i25JXERbZ4QA/GlazingEnergyFlow.PNG)\n\nAnd look at your infiltration loss/gain (the other place where heat escapes):\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/kwvKg1TQ8fVhNINBIiCR8VRhf1T7qKKjE8U*edFIKXMDyxEl-NwEKO7x*Q8OX8njev9mIVdK1XmzgwhmRwxtjb-Jj6Fl7b-J/InfiltrationLoss.PNG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/kwvKg1TQ8fVhNINBIiCR8VRhf1T7qKKjE8U*edFIKXMDyxEl-NwEKO7x*Q8OX8njev9mIVdK1XmzgwhmRwxtjb-Jj6Fl7b-J/InfiltrationLoss.PNG)\n\nWhen your building looses the majority of its heat through infiltration and the outdoor air that is not that cold, you know that the indoor temperature must be high.\n\nI would consider letting people pull blinds, open windows, or run the cooling system.  Or you could make the surfaces of your zone non-adiabatic.  Adiabatic surfaces can really distort energy results unless you know exactly how to use them.  My guess is that this test box is supposed to represent something different than what you are modeling.  I imagine that, if this test box were representing a part of a real building, it would probably be exchanging a lot of heat with a core or north-facing zone behind it.\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1212231", "name": "total gain.PNG"}], "created_by_name": "Chris Mackey", "created_at": "January 26, 2015 at 8:02pm", "created_by": "chris", "parent_id": "reply_2985220_Comment_1211402", "id": "reply_2985220_Comment_1212229"}