{"body": "\nAbraham and Theodore,\n\nThanks for answering Theodore's questions, Abraham, and I'm sorry for being so late to respond here.  I just wanted to clarify that, if you use the \"addInternalMassToZone\" component, regardless of whether you input a number or an actual surface geometry, all that EnergyPulus gets is a number representing the surface area of the mass and a construction representing the material.  As such, any geometry input into the \"addInternalMassToZone\" component is not participating in the solar distribution calculation all all of the heat the mass exchanges with the zone is though the zone air.  This is clarified in the EnergyPlus input/output reference here:\n\n[http://bigladdersoftware.com/epx/docs/8-3/input-output-reference/gr...](http://bigladdersoftware.com/epx/docs/8-3/input-output-reference/group-thermal-zone-description-geometry.html#internalmass)\n\n\n\nSo, if you want a given piece of internal geometry to participate in the solar distribution and have it's temperature determined through radiant interaction with the rest of the zone, you have to model your geometry as a zone surface (for example, modeling a desk against a wall as an indentation in the zone boundary).  At this level of detail, though, I usually call it a day since a desk indentation is really not too different from the wall behind it thermally speaking.  Still, if you produce microclimate maps of zones with interior furniture, you should plug in the interior furniture surfaces as \"contextShading\" to the viewFactor component as this will cause them to block sun directly falling onto occupants in the resulting thermal maps.  This is a bit more accurate than not accounting for interior surfaces at all, even though the interior furniture surface temperatures are assumed to be the same as the zone surfaces behind them.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "May 02, 2016 at 09:03PM", "created_by": "chris", "parent_id": "reply_2985220_Comment_1519425", "id": "reply_2985220_Comment_1521123"}