{"body": "\nHi Alejandro,\n\nThe reason why you don't get values adding to 100 is because the original ASHRAE adaptive standard states that you are not supposed to use the adaptive model when the average monthly temperature is below 10C and you are instead supposed to use the PMV model in theses cases.  However, there is plenty of research that has applied the adaptive methodology to monthly temperatures that are below 10C and the correlations produced by this research are what you are seeing in the WIP adaptive chart.  Here is a recent publication showing these correlations as well ([http://nceub.commoncense.info/uploads/22-01-05-Humphreys.pdf](http://nceub.commoncense.info/uploads/22-01-05-Humphreys.pdf)).\n\n\n\nTo clarify further why the percents on the component are not adding to 100, the percentOfTimeComfortable is always calculated for the whole year (including the months where the average outdoor temperature it is below 10C) and uses the correlations found in new research to determine a target temperature for these very cold months.  So this percentOfTimeComfortable corresponds to the comfortableOrNot list coming out of the component.  The percentHotColdAndExtreme is calculated counting the months where the average outdoor temperature it is below 10C as \"extreme\" and so comfortable hours in this extreme time are added to the percentOfTimeComfortable but not the percentHotColdAndExtreme's comfortable hours.  In other words, this percentHotColdAndExtreme corresponds to the conditionOfPerson list coming out of the component.\n\n\n\nPersonally, I find the expectations of ASHRAE to switch between Adaptive and PMV models for a cooler climate like New York's to be unreasonable, especially given the correlations found in new research.  I have wanted to switch Ladybug's Adaptive model over to one that uses these new correlations in every case (without a cold extreme period) but I did not want to place myself above the building code without good reasons.  Now that I see that it causes confusion on the forums here and I have tested myself to see that the new adaptive correlations for temperatures below 10C are closely in line with the PMV model anyway, I have decided to push ahead with this switch.  Attached, you can find a GH model with this change and the percents now total 100.\n\n\n\nIf anyone is concerned about strictly following ASHRAE, you can easily calculate average monthly temperature for a climate with the Ladybug_AverageData component and simply not use the adaptive model for those months.  Alternatively, you can use only the adaptive model in early design for your own sanity of not switching between comfort models and, if you have to later show code compliance, I have found that you can almost always get the hours that use the wintertime adaptive correlations to work with the PMV model by playing around with the clothing and metabolic rates.  ASHRAE has ignored this really useful research on the adaptive methodology for conditioned buildings for too long and, if they aren't going to revise the standard to account for it, it is about time that practitioners pushed them to.\n\n\n\nI am going to be re-vamping of the adaptive chart up to the point that it gets out of WIP for the next stable release.  This re-vamping will also include correlations for air conditioned and mixed-mode buildings that are also not yet accounted for in the ASHRAE Adaptive standard.  I will keep you posted.\n\n\n\n-Chris\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1313178", "name": "AdaptiveComfortCalculator_CWM.gh"}], "created_by_name": "Chris Mackey", "created_at": "June 21, 2015 at 6:17pm", "created_by": "ChrisMackey", "parent_id": "topic_1312420", "id": "reply_2985220_Comment_1313176"}