{"body": "\nDear Chris,\n\n\n\nmany many thanks for looking at the file again- ah yes, sorry, I had no idea the ideal air system component was going to be phased out. My bad for not intersecting first- script was originally used on the pre-intersected multizone file, which also needed the full exterior distribution only.\n\nRunning your revised version now on these machines here, **the result is identical to the one you posted above** (below screenshot from run on my machine; and yes, the last GH file I sent is the one from which the previous screenshots originated)\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/WDvxeYqj4vobIr72PQ-0c9*lIJ5AePpvB4IZ3AjNWVtuJc-1zAZFmutq8vkPBQi3HpdeOR2WEu9iCUjKNTiPphLf2p704*c4/MDrun_CMscript.jpg?width=721\" width=\"721\"/>](http://api.ning.com:80/files/WDvxeYqj4vobIr72PQ-0c9*lIJ5AePpvB4IZ3AjNWVtuJc-1zAZFmutq8vkPBQi3HpdeOR2WEu9iCUjKNTiPphLf2p704*c4/MDrun_CMscript.jpg)\n\n**(CMap result from your attached script ComfMap_CWM, ran on MD machine)**\n\nThat is, incidentally, identical to what my script produced even before your changes!\n\n**In an earlier post, you showed a result image that comes much closer to what I would expect the output to be** (so, in fact, you have already produced two different results):\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/WDvxeYqj4vqO12LoxfDvNTMOUJ8tk9uF1bQdevyxdC*pJRzgdWDmA*pUZx4BJcF09AyfMVFrZ-QtJZJhdAryznAKsI90iufw/CMrun_CMscript.jpg?width=721\" width=\"721\"/>](http://api.ning.com:80/files/WDvxeYqj4vqO12LoxfDvNTMOUJ8tk9uF1bQdevyxdC*pJRzgdWDmA*pUZx4BJcF09AyfMVFrZ-QtJZJhdAryznAKsI90iufw/CMrun_CMscript.jpg)\n\n**(screenshot from your earlier post on July 11, 2016 at 10:05pm)**\n\nThe \"error\" I was/am hence chasing is in the difference between these two results. The last screenshot from your earlier results shows a radiant temperature dropoff that is much more in line with the contribution of the cold glazing temperatures as evident in the E+ results. What do you think?\n\n\n\nApart from that, I am glad that now, at last, our outputs from the same script are identical on both machines. The usercustomLibrary has not changed, I have however attached it again. Other GH files are usually not open, no; the last results all came from single open file GH instances.\n\n\n\nThank you for your help again Chris- it's an interesting issue. I owe you a beer (or a few) should you stop by in Berlin one day!\n\nBest,\n\nMax\n\n\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1573110", "name": "userCustomEPLibrary.idf"}], "created_by_name": "Max D", "created_at": "July 29, 2016 at 03:37AM", "created_by": "ButWhyprecisely", "parent_id": "reply_2985220_Comment_1572197", "id": "reply_2985220_Comment_1572809"}