{"body": "\nHi Chung,\n\n\n\nI have to say I would suggest you start with simpler studies when getting into CFD. It is also recommended to try simple states of the same study first, then moving to more complicated designs. There were a few issues with your case. I will try to list them, hoping that this can also be helpful to you but also other users in the forum.\n\n\n\n1. The Rhino model contained a lot of open polysurfaces. This is a big enemy of meshing and CFD. The way meshing works is that every single open area, that can be reached from your locationInMesh with a polyline, will be included in meshing. Some of your lanscape volumes were open. I have rectified this in the .gh file attached and now they should be ok to mesh.\n\n2. It is strongly suggested to rotate the geometry and not the incoming wind when creating the wind tunnel. This might as well have been the reason for meshing awkwardly, although can't be sure. I have rotated the geometry by 45 degrees to allow your original wind to have a Y+ direction.\n\n3. I could see a decomposition component in your case study although I cannot be sure if this could be the reason of your problems. It was not connected to anything, but perhaps it might have been the culprit for the paralle issues you were having. I have disabled the component so the case would run in single processor, but you can freely enable it and your case will be run in parallel (4 cores).\n\n4. Your post-processing surfaces have large parts inside the building volumes and under the landscape (if included). You will probably get some issues with visualizing some probes, although this will not affect your study in any way. I recommend to only pass probes that you know to be sure will be inside the mesh to OF.\n\n5. If you decide to include the landscape (I have it disabled in the attached .gh file) I strongly recommend to allow for more cells than 2m. 10m would be a good start imo for this case.\n\n6. I did not check, as it will not make your case break, but your grading was a bit imbalanced at first glance. Try and keep some balance, especially in the X-direction, and make sure to visualize the blockMesh and make sure you achieved what you had in mind.\n\n\n\nI did not actually run the case btw, I leave that to you. I believe it will run without problems, although I cannot be sure it will not diverge (this is something that is very educational for you to deal with).\n\n\n\nGood luck!\n\n\n\nTheodore.\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1736327", "name": "01_0_outdoor_airflow_SAB_20170420_TG.gh"}], "created_by_name": "Theodoros Galanos", "created_at": "April 20, 2017 at 3:46am", "created_by": "TheodorosGalanos", "parent_id": "reply_2985220_Comment_1735986", "id": "reply_2985220_Comment_1736326"}