{"body": "\nHi all, i'm tryng to calculate PET value with Ladybug about outdoor thermal comfort study.\n\n<br/>Hi Luciano. PET outdoor comfort index has been added to the \"Thermal Comfort Indices\" a couple of weeks ago. To get it, just download the **Ladybug_Thermal Comfort Indices.ghuser** file [from here](https://github.com/mostaphaRoudsari/ladybug/blob/master/userObjects/Ladybug_Thermal%20Comfort%20Indices.ghuser) (click on \"View raw\" to download it) and put it in your Grasshopper user objects folder: File -&gt; Special Folders -&gt; User Object Folder.<br/><br/><br/>\n\nI've heard about RayMan model (This research paper) but I didn't realize that it's an actual software. So, upon your response, I searched up the software, and I tried to download it, but there was a problem with their website. To be able to download it I have to fill a short form, I did so but the form won't submit, I think the submit button doesn't work.<br/>[http://link.springer.com/article/10.1007/s00484-006-0061-8](http://link.springer.com/article/10.1007/s00484-006-0061-8)\n\n<br/>Hi Rania. You may have solved this issue, just in case somebody experiences the same problem: The latest version of Rayman can be downloaded from here:<br/>[http://www.urbanclimate.net/rayman/rayman.htm](http://www.urbanclimate.net/rayman/rayman.htm)<br/>\n\n**[Thermal Comfort Indices](https://github.com/mostaphaRoudsari/ladybug/blob/master/userObjects/Ladybug_Thermal%20Comfort%20Indices.ghuser)** component is using the same fortran code to calculate PET, which Rayman is using.\n\n\n\nThe MRT of the \"Thermal Comfort Indices\" is good for calculating a general MRT in sunny conditions.  If you want something that more specifically accounts for human geometry, you can use the \"Outdoor Solar Temperature Adjustor\" component.\n\n<br/>The new version of **[Sunpath shading](https://github.com/mostaphaRoudsari/ladybug/blob/master/userObjects/Ladybug_Sunpath%20Shading.ghuser)** component has an output \"shadedSolarRadiationPerHour\", which when added to **Thermal Comfort Indices**' \"globalHorizontalRadiation_\" input, adjusts the mean radiant temperature for the impact of shading.<br/>Also a new \"meanRadiantTemperature_\" input has been added so it is now possible to use **Outdoor Solar Adjusted Temperature Calculator** component's \"solarAdjustedMRT\" as an input as well.<br/><br/>\n\n\n\nThank you Chris for pointing me to this topic. I missed it somehow.\n", "attachments": [], "created_by_name": "djordje", "created_at": "December 29, 2015 at 7:21pm", "created_by": "djordje", "parent_id": "topic_1208688", "id": "reply_2985220_Comment_1428120"}