{"body": "\nTheodore,\n\n\n\nWe face similar communication issues. To get past them we have rallied around the idea of promoting an informed design process. Data-driven design neuters artistic expression. Data-informed design empowers it. Tools that map the design space, rather than focus towards an \"optimized\" solution, are more useful to designers. Understanding where the current design fits within potential alternates will help convince designers that meaningful improvements can be made. Comparative analysis to nudge the team towards a particular option, or strong data to quantify exactly how much worse one solution is than another, always gives the design team the option of choosing the bad option, but encourages the good option. We recognize that architects have to balance far more than just performance criteria. Client wishes, site constraints, programmatic constraints, all determine the best overall solution. Energy or daylighting analysis is only one part. Due to this reality, it is great to have data that encourages a compromise. If my solution is all or nothing, it will get rejected. If I can present incremental improvement, the team can balance that change against competing criteria. By charting the range of possible solutions, Pollination and Design Explorer don't force a design decision. They merely inform the process. Using them to empower a conversation about the relative performance of design options or identify a variety of improvement options makes these new methods far more appealing to designers than optimizing scripts or shaming energy metrics.\n\n \n\nWe think that a posture that respects both aesthetic quality and performance criteria encourages better design. To this end, singular optimization is too selfish and inflexible to be useful within an integrated team. We think that design explorer and similar tools that support conversation and compromise are the right way to go.\n", "attachments": [], "created_by_name": "Leland Curtis", "created_at": "February 08, 2016 at 01:37PM", "created_by": "LelandCurtis", "parent_id": "reply_2985220_Comment_1456821", "id": "reply_2985220_Comment_1458426"}