{"body": "\nAris,\n\nYour file is running perfectly fine on my machine (although it takes a good half-hour to run all of the way through).\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/qwRdyPROLy3gdMYMpBI*HnNUPnkhLl9XynMMM5Y8vY*UV5zkz*6dfbMVFFFB*cXy3lMA0hwmtc9wgTIS6ZJaXHBfAPAi58hB/UTCIMapWorking.JPG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/qwRdyPROLy3gdMYMpBI*HnNUPnkhLl9XynMMM5Y8vY*UV5zkz*6dfbMVFFFB*cXy3lMA0hwmtc9wgTIS6ZJaXHBfAPAi58hB/UTCIMapWorking.JPG)\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/qwRdyPROLy3o8i7PkTdLeb1EAGifrg2Tz8QidvRr1lio7VPxmDrqeQxk8hH8t9U5hZqJgkuxXEQC2AtF2*PyHDHbX-k49RAF/WorkingUTCIGH.JPG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/qwRdyPROLy3o8i7PkTdLeb1EAGifrg2Tz8QidvRr1lio7VPxmDrqeQxk8hH8t9U5hZqJgkuxXEQC2AtF2*PyHDHbX-k49RAF/WorkingUTCIGH.JPG)\n\nMy guess is that your issue happens because you might be trying to create HBZones separately from your EnergyPlus results and these two really need to be done together.  This is because the microclimate maps work by matching the names of the HBZones and surfaces to the results of the EnergyPlus model and these can get out of sync if you re-generate HBZones and don't rerun them through E+. So, if you run everything in your script together, it should work.\n\n\n\nI also know that outdoor microclimate maps are time intensive and they are really built for cases where you need a lot of freedom to test different strategies and geometries (like all of the strategies E+ can run and all of the geometries that Rhino can create).  If you are ok with the simplification of ENVI-MET's pixel world, you don't need to test strategies beyond the usual ones, and your test area is small enough to be accommodated by ENVI-MET's free license (I forget how many pixels by how many pixels it allows), Antonello has built a connection from Ladybug to ENVI-MET that he posted here:\n\n[http://www.grasshopper3d.com/group/ladybug/forum/topics/lb-envi-met](http://www.grasshopper3d.com/group/ladybug/forum/topics/lb-envi-met)\n\n\n\nCheers,\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "May 9, 2017 at 6:43am", "created_by": "chris", "parent_id": "topic_1748083", "id": "reply_2985220_Comment_1748362"}