{"body": "\nAymeric and Djordje,\n\n\n\nThank you both very much for pointing out this difference and for all of the knowledge and insight that you have shared here.  I think that I can explain where the difference between the two components is coming from and I have realized that I have been making a very misleading assumption in my example files that I intend to correct immediately.\n\n\n\nI can assure you that both the SolarCal and MENEX models are applicable to the outdoors (even though I know that the authors of SolarCal do not explicitly state this in their paper).\n\n\n\nThe key difference between the two MRT methods (and corresponding components) is that the \"solar adjusted temperature\" component assumes that you have already computed a starting MRT for long wave radiation in the absence of any short wave radiation.  True to its name, the component only adds a MRT delta to this long wave MRT to account for additional short wave radiation from the sun.  On the other hand, the MENEX model and the Thermal Comfort Indices component are doing a full long wave radiation balance in addition to the short wave radiation balance to give you a MRT for a person standing out in a field under an open sky.\n\n\n\nThe Thermal Comfort Indices component was giving much lower MRT values because it accounts for the fact that the sky (in the absence of sun) tends to be at a much lower perceived temperature than the air at Earth's surface or the ground (since the temperature of clouds and other objects higher in the atmosphere are cooler than those at the surface).  The great misleading assumption that I have been making in my example files is that, by plugging in the EPW dryBulbTemperature into the \"solar adjusted temperature\" component, I have been assuming that the temperature of the sky is the same as the temperature in the EPW air, which is almost never the case for the reason that I just stated.\n\n\n\nI have just added an option for a long wave radiation balance into the \"solar adjusted temperature\" component with [this github commit](https://github.com/mostaphaRoudsari/ladybug/commit/2261a222787f42016a763208f9da7b04f339bdca).  You can see below and in the attached file that the solar adjusted component can now give results that align more closely with the MRT of the thermal indices component:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/8p51V5ywRUKGdLMHaVe9XPVDFWO0o2AhwtWYJ4Yj0NHobSw6K2lwHP*vse9FnMIOSwZheB5qXOOXFB6-7wxD3gUpD0OD8W-v/MRTDifferences.JPG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/8p51V5ywRUKGdLMHaVe9XPVDFWO0o2AhwtWYJ4Yj0NHobSw6K2lwHP*vse9FnMIOSwZheB5qXOOXFB6-7wxD3gUpD0OD8W-v/MRTDifferences.JPG)\n\nThe typical difference between the two components is not much more than 1 degree C and the only major differences occur at high levels of solar radiation.  This is to be expected given that the SolarCal method is doing a much more detailed approximation of short wave radiation falling on the human than the MENEX model, which I believe is approximating the geometry of the human body with a cylinder and only differentiating between a few solar angles.\n\n\n\nOver the next few hours, I am going to correct my outdoor comfort example files and ensure that I am also accounting for sky temperature in the outdoor microclimate maps.  I will post back here once I do so.\n\n\n\nThanks again for bringing this up and for all of the knowledge you have shared.\n\n-Chris\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1530678", "name": "correctOutdoorSolarMRT2.gh"}], "created_by_name": "Chris Mackey", "created_at": "May 15, 2016 at 3:01pm", "created_by": "ChrisMackey", "parent_id": "reply_2985220_Comment_1526209", "id": "reply_2985220_Comment_1530676"}