{"body": "\nHi Theodore,<br/><br/>Thank you for your previous reply. Please forgive me the silence as it took me a while before pursuing back my CFD journey.<br/><br/>I have been using the outdoor example file to run airflow through an atrium with windward windows opened. I believe the results are coherent, the area of stagnant air on the 2nd floor is a result of pressure differences on a multistorey building.<br/>[<img class=\"align-left\" src=\"http://api.ning.com:80/files/21oynV1A7zKA7A2TO7Eo7Ld-GpxZRmWgA0yK50rFMVJGXSKNEH*RoNp9vtoH*ZU3Kn*kTbRag5kQ3Fxi4NWdAUbbf0bOaD8k/Butterfly_atrium.jpg?width=400\" width=\"400\"/>](http://api.ning.com:80/files/21oynV1A7zKA7A2TO7Eo7Ld-GpxZRmWgA0yK50rFMVJGXSKNEH*RoNp9vtoH*ZU3Kn*kTbRag5kQ3Fxi4NWdAUbbf0bOaD8k/Butterfly_atrium.jpg)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMy future intention is to optimise the outlet's geometry to benefit best from wind driven effects, I will set to an evolutionary solver to lower the average pressure in the leeward side of the outlet.<br/>For this reason I will have to proceed with lower accuracy to reduce run times and finally set it to the maximum for reliability of the final solution and result visualisation.\n\nThe way I have been trying to increase accuracy is by lowering down the testgrid size to 0.1 and using snappyhexmeshdict.<br/>I am not so confident in varying the different refinement levels and cell sizes of the refinement region and windtunnel.<br/>Would you be able to provide me with a a brief explanation on how to handle these parameters for higher or lower accuracy?<br/><br/><br/>Does Butterfly/OpenFoam processes stratification of heat (stack effect) accounting for internal heat gain?<br/>I was thinking of allocating a mannequin somewhere in the rooms and assign its surface temperature to human body temperature, and perhaps add some boxes for any electrical devices.<br/><br/>Thank you for making all of this possible.<br/><br/>Kind Regards,<br/>Olivier\n", "attachments": [], "created_by_name": "Olivier Dambron", "created_at": "November 22, 2016 at 06:38AM", "created_by": "OlivierDambron", "parent_id": "reply_2985220_Comment_1598806", "id": "reply_2985220_Comment_1643998"}