{"body": "\nHi Saket,\n\n\n\nGlad to hear that you're using the microclimate maps.  Like the answer to many questions in simulation, how you model your phenomenon depends on what you need out of it.  In other words, I would need more info from you to suggest the best way of modeling it.\n\n\n\nTo start, is this food center indoors or outdoors?  If it's indoors, you could account for the extra heat of the cooking by using a higher equipment load in the food center zone.  This will ensure that you are accounting for this extra heat but E+ will use its own simple functions to distribute the equipment heat throughout the zone and this many not be at the level of detail that you need for your study.\n\n\n\nIn this case (or if your food center is outdoors), you might want to model each stove as its own zone.  You could set the equipment load and schedule of these \"stove zones\" to be that of a typical stove and make the top surface construction to be a thin metal plate (with high insulation on all other sides so the heat is directed towards this plate).\n\n\n\nAnother option if you are not concerned about conditions changing over time is to build your own MRT map using the Ladybug_Generate Mesh, Ladybug_Surface View Factor,  Ladybug_Solar Temperature Adjustor (if the center is outside), and Ladybug_Recolor Mesh components.  This would be similar to [what is done in this example file](http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;fork=hydra_2&amp;id=Glazing_and_Winter_Comfort_Tool_-_IP&amp;slide=0).  It will give you the highest control over the spatial parameters of your model (ie. you can set the temperature of different surfaces to be exactly what you want) but it will only be for a single snapshot of typical conditions.\n\n\n\nFinally, if you are really worried about accounting for the plumes of air rising off of the stoves, you can use the new Butterfly plugin to run a CFD simulation and get the air temperature distribution in the food center.  However this would be a huge amount of work and probably a few days of simulation for just a single snapshot in time.\n\n\n\nSo there are a lot of models you can build and your level of abstraction depends on why you are modeling your center and what you need from your analysis.\n\n\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "March 22, 2017 at 03:57PM", "created_by": "chris", "parent_id": "topic_1717004", "id": "reply_2985220_Comment_1718733"}