{"body": "\nAbraham,\n\n\n\nI don't know the type of occupant that you are trying to simulate as well as  you do but, if the concern is that the night time comfort values do not seem realistic, you should keep in mind that both the ASHRAE and European Adaptive models were derived from surveys of awake occupants.  While the topic has not been investigated as well as it should be, the few adaptive-style surveys of sleeping occupants that have been conducted show that people tend to desire significantly cooler temperatures when they are sleeping as opposed to when they are awake.\n\n\n\nNotably, Chapter 8 of Humphrey's recently-published book on Adaptive Comfort ([https://books.google.com/books?id=lOZzCgAAQBAJ&amp;printsec=frontco...](https://books.google.com/books?id=lOZzCgAAQBAJ&amp;printsec=frontcover&amp;dq=Adaptive+Thermal+Comfort+Foundations+and+analysis&amp;hl=en&amp;sa=X&amp;ved=0ahUKEwi6npqSi__KAhUJMj4KHf7SCXMQ6AEIKjAA#v=onepage&amp;q=Adaptive%20Thermal%20Comfort%20Foundations%20and%20analysis&amp;f=false)) provides some interesting insights into this.  In a 1973 survey, Humphreys found that the quality of sleep started to deteriorate at temperatures above 24-26C regardless of the time of year and that there was no clearly-determinable lower limit to comfortable sleeping temperatures (in other words, people were fine at 12C if they were given enough blankets).  He surveyed only British occupants who were sleeping in traditional beds with mattresses and a wide range of blankets.  This is important because the nature of the findings is such that the comfort temperatures would be very different if the survey participants had been sleeping in a hammock or in closer contact with the ground (both popular practices for a number of cultures living in warmer climates).  Traditional mattresses cut the ability to radiate body heat in half as compared to a standing human body and I would venture a guess that this is a big reason why much cooler temperatures are desired while sleeping on mattresses as opposed to standing awake/uptight.\n\n\n\nSo for your case, if you want to account for a time of the day that occupants are sleeping on mattresses, I would change the comfort temperature for this these hours down to 24C.  Otherwise, if you are trying to show the comfortable hours of awake people in your space, your current 100% comfortable nighttime hours are a better estimate.  I have also noticed that nighttime temperatures become comfortable in extreme weeks of hot/dry climates.  This is what is happening in this extreme week simulation of Los Angeles' San Fernando Valley here:\n\n[https://www.youtube.com/watch?v=WJz1Eojph8E&amp;index=3&amp;list=PL...](https://www.youtube.com/watch?v=WJz1Eojph8E&amp;index=3&amp;list=PLruLh1AdY-Sj3ehUTSfKa1IHPSiuJU52A)\n\n\n\nI will put in the ability to set custom values for comfort temperatures into the Adaptive Comfort Recipe soon so that you can test out a 'sleeping comfort temperature' if you would like.  I have created a github issue for it here:\n\n[https://github.com/mostaphaRoudsari/Honeybee/issues/486](https://github.com/mostaphaRoudsari/Honeybee/issues/486)\n\n\n\nI was not so convinced by Nicol's argument about humidity on those pages as I was when I saw the correlations of both operative temperature and effective temperature to surveyed comfort votes in real buildings.  Humphreys shows these correlations on page 106 of the book I linked to above.  Notably, the correlation of Effective Temperature to comfort votes (0.257) is slightly worse than the correlation of just Operative Temperature (0.265).  In other words, trying to account for humidity actually weakened the predictive power of the metric.  This difference in correlation is not so great as for me to discount an Adaptive comfort model based on Effective temperature (as deDear once proposed).  However, the correlations of PMV (0.213) and SET (0.185) to comfort votes are so poor that I now use the PMV model only with great caution.\n\nThis reason for the decreased importance of humidity may be multi-faceted, whether it's Nicol's explanation or another.  Still, the data suggests that we are probably better off ignoring humidity when forecasting comfort and should only consider it when evaluating conditions of extreme heat stress where people's primary loss of heat is through sweating.\n\n\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "February 17, 2016 at 9:01am", "created_by": "chris", "parent_id": "reply_2985220_Comment_1464438", "id": "reply_2985220_Comment_1465260"}