{"body": "\nGrasshope,\n\n\n\nThank you for assembling such an awesome set of research and publications.  It seems that we are finally getting to some conclusions about the differences between Sky View Factor (SVF), Vertical Sky Component (VSC), and now Sky Exposure Factor (SEF).  For everyone else following this post, this discussion has been ongoing in these other threads:\n\n[http://www.grasshopper3d.com/forum/topics/sky-view-factor-vs-vertic...](http://www.grasshopper3d.com/forum/topics/sky-view-factor-vs-vertical-sky-component?groupUrl=ladybug&amp;xg_source=msg_com_gr_forum&amp;groupId=2985220%3AGroup%3A658987&amp;id=2985220%3ATopic%3A1377260&amp;page=1#comments)\n\n[https://github.com/mostaphaRoudsari/ladybug/issues/230](https://github.com/mostaphaRoudsari/ladybug/issues/230)\n\n \n\nGrasshope, you have gone right to Oke, the grandfather of urban climatology, whose papers I have several times and yet I somehow I always missed the finer details of the sky view calculation.  From his definition, I had always thought of Sky View Factor as a purely solid angle or \"view factor\" calculation in the sense of Mean Radiant Temperature.  However, the numbers and formulas that you give here clearly show that Oke meant that this metric for quantifying and understanding urban heat island must refer back to the urban surfaces and their orientation in relation to the sky. It cannot simply be the view from points in space.\n\n \n\nTo clarify the distinction in simple geometric terms: **The key difference is that Sky Exposure refers to the sky seen by a point in space while Sky View refers to that seen by a surface. ** Both of them involve the calculation of either projected rays or solid angle calculations to the sky (since they both are “view” calculations).  However, while Sky Exposure treats each patch of the sky with relatively equal weight, Sky View weights these patches by their area after being projected into the plane of the surface being evaluated.  In other words, the sky view calculation for a horizontal surface would give more importance to the sky patches that are directly overhead than those near the horizon because these overhead patch are “in front” of the surface (as opposed to on the side).\n\nTo express this difference in the trigonometric terms you cite here:\n\n**Wall View = 0.5(sin<sup>2</sup> θ + cos θ – 1) / (cos θ)**\n\n**Wall Exposure = θ/π**\n\nI both cases:\n\n**θ = tan<sup>-1</sup>(H / 0.5W)   - ** This is the solid angle or ray-tracing calculation**\n\n**SkyViewOrExposure = (1 - 2 (WallViewOrExposure))**\n\n \n\nTo put this in more simpler terms for the View Analysis component, all that I actually have to do to convert sky exposure to sky view is multiply each of the traced view rays by 2cos(ϕ), where ϕ is the angle between the surface normal and the given view ray being traced.\n\nI have done this by adding this line of code () and I have verified that I get the values from Oke’s paper that you cite above, Grasshope. Accordingly, the View Analysis component now has the option to compute either Sky Exposure or Sky View.  You can see this happening in this new example file:\n\n[http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;for...](http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;fork=hydra_2&amp;id=Sky_Exposure,_Sky_View,_and_Sky_Component&amp;slide=0&amp;scale=1&amp;offset=0,0)\n\n \n\nTo (once and for all!) clearly define the difference between the three metrics at the top of my reply and to explain how to calculate each with Ladybug Honeybee:\n\n**Sky Exposure Factor** -  The percentage of the overlying hemispherical sky that is directly visible from a given POINT or set of POINTS.  This is equivalent to a geometric solid angle calculation or ray-tracing calculation from points.  It is useful for evaluating one's general visual connection to the sky at a given point and should be applied to cases where direct views to the sky are the parameter in question.\n\nSky exposure is calculated with the Ladybug_View Analysis component like so:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/5ihJsFRcOvOKD2Q1eMu1GmYhyeypVxf2U*OckQyiR5w3WQporDrkImF4erXb7rjXpewpAC9lGPmjtHQpbnD9FPxSUMTZ8Zpk/SEF.JPG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/5ihJsFRcOvOKD2Q1eMu1GmYhyeypVxf2U*OckQyiR5w3WQporDrkImF4erXb7rjXpewpAC9lGPmjtHQpbnD9FPxSUMTZ8Zpk/SEF.JPG)\n\n**Sky View Factor –** The percentage of the overlying hemispherical sky that is directly visible from a given SURFACE or set of SURFACES. While Sky Exposure treats each patch of the sky with relatively equal weight, Sky View weights these patches by their area projected into the plane of the surface being evaluated.  In other words, Sky View for a horizontal surface would give more importance to the sky patches that are overhead and less to those near the horizon.  Sky View is an important factor in for modelling urban heat island since the inability of warm urban surfaces to radiate heat to a cool night sky is one of the largest contributors of the heat island effect.\n\nSky View is calculates with either the Ladybug_View Analysis component like so:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/5ihJsFRcOvPRVlTnk1YQTvC3RyrQGgS1xrRa*EYwNiTjUtVR2oE-0UajGU-76jnUxOfX6ew0PdoJNjBiAcshxZ-eHvzyyQP2/SVF1.JPG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/5ihJsFRcOvPRVlTnk1YQTvC3RyrQGgS1xrRa*EYwNiTjUtVR2oE-0UajGU-76jnUxOfX6ew0PdoJNjBiAcshxZ-eHvzyyQP2/SVF1.JPG)\n\nOr with the Honeybee_Vertical Sky Component Recipe like so:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/5ihJsFRcOvOYPE7*vahDvpWszhPLDm7a3uotHR2TbhtjHo9G0fxMLqEhYpz2PC2OBbmv-uzjyk8f24Qu5coCNsj7xEYPROrR/SVF2.JPG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/5ihJsFRcOvOYPE7*vahDvpWszhPLDm7a3uotHR2TbhtjHo9G0fxMLqEhYpz2PC2OBbmv-uzjyk8f24Qu5coCNsj7xEYPROrR/SVF2.JPG)\n\n\n\n**Sky Component** - The portion of the daylight factor (at a surface indoors) contributed by luminance from the sky, excluding direct sunlight.  This is essentially the same as Sky View Factor but it often incorporates a sky condition that is not uniform, such as a cloudy sky or sky that is more indicative of diffuse sky light.  Another way of conceiving of this metric is a Daylight Factor calculation without any light bounces.  It is useful for understanding the direct daylight contribution of diffuse skylight and, although many consider it an older (and perhaps outdated) daylight metric, it is still required by some codes and standards.\n\nSky Component can be calculated with the Honeybee_Vertical Sky Component Recipe like so:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/5ihJsFRcOvMVwtQqMpo4WgvLW2JFzq7rIDYollXesh5IXWVdF-T3mQ1O98LK5ePmRfIDt5wtBIF9k-H*UVx5Qe4VmcKuC5wE/VSC.JPG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/5ihJsFRcOvMVwtQqMpo4WgvLW2JFzq7rIDYollXesh5IXWVdF-T3mQ1O98LK5ePmRfIDt5wtBIF9k-H*UVx5Qe4VmcKuC5wE/VSC.JPG)\n\n \n\nIn addition to the added capability in the view analysis component, I have revised the component description to include the definitions above.  I have also corrected the Hydra example file in which I cite sky view as an urban heat island metric to use the new formula:\n\n[http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;for...](http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;fork=hydra_2&amp;id=Sky_View_in_an_Urban_Canyon&amp;slide=1&amp;scale=1&amp;offset=0,0)\n\nFinally, all of this discussion has made me realize that the Vertical Sky Component recipe for Honeybee might not always be evaluating VERTICAL sky.  The sky component might be vertical, horizontal, or in any direction that the input test surface is placed and pts vectors are oriented.  Accordingly, Mostapha, I think that we should change the name of the component to simply be “Sky Component” instead of “Vertical Sky Component”.  Please let me know if you agree.\n\n \n\nThanks again, Grasshope, for all of the great work!  All of this never would have made sense without your research.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "February 14, 2016 at 3:07pm", "created_by": "ChrisMackey", "parent_id": "reply_2985220_Comment_1461200", "id": "reply_2985220_Comment_1463066"}