{"body": "\nTasos,\n\nTo get rid of cooling form the ideal air system, you can either set cooling capacity to zero or the cooling setpoint to a very high number.  You can also use the latter to model mixed-mode building by setting the cooling setpoint to the same value as the maxIndoorTempForNatVent.\n\n\n\nFor an explanation of how air walls and natural ventilation work together in the current version, see the latest release notes:\n\n[http://www.grasshopper3d.com/group/ladybug/forum/topics/new-release...](http://www.grasshopper3d.com/group/ladybug/forum/topics/new-release-ladybug-0-0-59-and-honeybee-0-0-56)\n\nSpecifically, here:\n\n**Air Walls** - Honeybee EnergyPlus models now officially support air walls (or virtual partitions) in a basic implementation.  Now, any time that you use the air wall construction or set a surface type to “air wall,” the air between adjacent zones will be automatically mixed.  At present, this mixing is just a constant flow based on the surface area between zones connected by air walls multiplied by an adjustable “flow factor.”  It is important to stress that this basic air mixing is not with the EnergyPlus Airflow Network, although the groundwork laid in this release will eventually allow for the implementation of the  Airflow Network in future releases.  As such, this present air mixing is only suitable for multi-zone conditions where there is not significant buoyancy-driven flow between zones.\n\n**Natural Ventilation** - To go along with the new potential introduced by air walls, there has been a basic implementation of EnergyPlus’s natural ventilation objects in a new component called “Set EP Airflow”.  The current setup allows for three possible types of natural ventilation: 1) natural ventilation through windows (with auto-calculated flow based on window area, outdoor wind speed/direction, and stack effects), 2) custom wind and stack objects that can be used to model things such as chimneys off of **single zones**, and 3) constant, fan-driven natural ventilation.\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "February 20, 2015 at 08:14PM", "created_by": "chris", "parent_id": "reply_2985220_Comment_1228241", "id": "reply_2985220_Comment_1228579"}