{"body": "\nYeah, the table Reference height refers to the referenceHeight input on the Boundary Layer Parameters component. The Temperature Reference Height refers to the height of the weather station where temperature is measured i.e tempMeasureHeight on Dragonfly_Reference EPW Parameters component.\n\n\n\nAs for calculating the Reference height, where are you getting the \"common sizing rule of 'twice the top building height'\"? I can't find that rule anywhere... I think keeping the default value of 150m as the component advises would be better.\n\n\n\nSomething that helped me a lot, and I think will be of interest to you is this thesis:[https://dspace.mit.edu/handle/1721.1/99251?show=full](https://dspace.mit.edu/handle/1721.1/99251?show=full). Specifically, chapter 4 has a set of sensitivity analysis for UWG input parameters, which shows you the % impact of varying the various parameters in terms of heating/cooling energy, and temperature change. In general, it found that varying the meteorological parameters (like the boundary layer inputs) deviated simulated temperature less then 0.5 K, for less then 43 hours of the year from the original empirical measurement. Which is why the study concludes its safe to keep the meterological inputs to default values.\n\n\n\nAn important caveat here is that the Reference height, is a slight exception to this as it had an effect on Boston temperatures beyond that limit (pg 43). That being said, I spent some time trying to figure out how the 150m value was calculated, and as far as I can tell, its based on an atmospheric simulation model, referenced in Bueno's thesis. So unless you have access to your own vertical temperature dataset, I think keeping the meterological values as they are is a good rule of thumb.\n\n\n\nS\n", "attachments": [], "created_by_name": "Saeran Vasanthakumar", "created_at": "September 15, 2017 at 10:20PM", "created_by": "SaeranVasanthakumar", "parent_id": "reply_2985220_Comment_1813221", "id": "reply_2985220_Comment_1814066"}