{"body": "\nHi Chris and thanks again!!\n\nThis is it ... almost.\n\nI would suggest to extend the PSH to the comfort polygon regardless if there is or not the internal heat gain one. In this way you can get the possible contribution of the PSH in total. This follows the same principle of the cooling polygons, where all of them converge to the comfort. Will be more consistent and flexible in this way (on my opinion).\n\nAs for the balance point i agree that the 12.8 gives the maximal extent and this is the default. For an example i'm working on now i get almost 15C, but i'll start to be more aware of checking this value for different examples.\n\nFor future versions (also the bioclimatic ... hopefully) i think that relevant inputs should be provided for realistic conditions. I need to think better how to do that and/or if it will be efficient to check against additional climatic data (thinking right now about wind speed and natural ventilation strategy).\n\n\n\nI have another question here related to the results of the analysis. If you see the picture below, on the right side you see the total number of points that felt on each polygon. The percentages are calculated ok. So far, so good.\n\nBut when i see the left side of the picture (the psychometric chart) there are some things that look strange to me. For instance, the EC received 2% and the thermal mass 1.7%, and the use of fans 2%. As i see the points the thermal mass contains all the points the EC or the Fans contains and more. But it's contribution is lower. I assume you are checking ONLY that the point fell or not inside the polygon. I see that the number of points of the thermal mass is lower than the other two (153) but from the image it doesn't make sense for me. Hope i'm explaining this clear enough ...\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/SHaYwHVxU3ITyv2oRo4k6oQtc5iOLG8HuiZCIptI3Z5Bp0XNtnnJfKp5fcm6kQx9xx814ZAy*NJ8GAkaSZDvl9u*Znhw9qv9/Capture.png?width=721\" width=\"721\"/>](http://api.ning.com:80/files/SHaYwHVxU3ITyv2oRo4k6oQtc5iOLG8HuiZCIptI3Z5Bp0XNtnnJfKp5fcm6kQx9xx814ZAy*NJ8GAkaSZDvl9u*Znhw9qv9/Capture.png)Thanks again. This is a great addition to the component!!\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "September 05, 2017 at 06:24AM", "created_by": "AbrahamYezioro", "parent_id": "reply_2985220_Comment_1808863", "id": "reply_2985220_Comment_1808789"}