{"body": "\nDear Chris and Abraham,\n\n\n\nApologize for my late reply!\n\n\n\nThank you very much for the discussion and detailed clarification from which the community will definitely learn a lot!\n\n\n\nI agree with your differentiation between the three concepts, sky exposure, sky view factor and sky component, each of which defined in a particular rationale and having particular implications, and this may bring more clarity and precision to environmental performance analysis.\n\n\n\nThe revised view analysis component seems working well. I did a small test using a cylinder with its top open as the obstruction geometry and an upward test surface positioned at the centre of the bottom surface of the cylinder. By rotating the cylinder around the centroid of the test surface, we get different obstruction scenarios in relation to the test surface that have the same level of \"sky exposure\" but different \"sky view factor\", depending on the \"relative position\" of the visible sky to the normal of test surface as explained by Chris. The sky exposure factor value fluctuates a bit, but it is close to the value calculated according to trigonometry. (GH file attached)\n\n\n\nI have one more small suggestion, if it's not too troublesome: it'll be great if the result legend text can change according to the type of view analysis specified automatically, instead of showing a general \"Skyview Analysis\".\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/7C2qIN6WACkO-*UkZxpmvD*paD8vldLlwVQNNGPOQedGqKxLLEDfYi2ayw65OLOhrg7mrLRCpBctF7Q-4haVE*mjTw*HNtec/Capture.PNG\" width=\"668\"/>](http://api.ning.com:80/files/7C2qIN6WACkO-*UkZxpmvD*paD8vldLlwVQNNGPOQedGqKxLLEDfYi2ayw65OLOhrg7mrLRCpBctF7Q-4haVE*mjTw*HNtec/Capture.PNG)\n\nThank you all very much, again, for your great inputs and the swift update of the components!\n\n\n\nJi\n\n\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1466679", "name": "SVF_SEF_test_v001.gh"}], "created_by_name": "Grasshope", "created_at": "February 19, 2016 at 09:36AM", "created_by": "Grasshope", "parent_id": "topic_1459770", "id": "reply_2985220_Comment_1466677"}