{"body": "\nAlejandro,\n\nI am sorry for responding so late.  It seems that you did not update LB_LB to the latest version in your attached GH file.  Below you can find a GH file where I have updated all of the components to the latest version and, as you can see, everything works fine:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/wElhaJF9fXI*NeK0mUQL-q*6ZgItn8huVrygCE*Fpo0Be7QfzvkP*hhemU7RDqd1dc96yZdcLIkqtIJJOUQ*Ff-b5KSeV3ba/AdaptComfOK.PNG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/wElhaJF9fXI*NeK0mUQL-q*6ZgItn8huVrygCE*Fpo0Be7QfzvkP*hhemU7RDqd1dc96yZdcLIkqtIJJOUQ*Ff-b5KSeV3ba/AdaptComfOK.PNG)\n\n\n\nOver the next week, I am going to be adding in several new capabilities to the Adaptive model in LB+HB that are not an official part of ASHRAE or ISO standards but they are endorsed by the experts and researchers who have helped build the standards.  Mostapha, I will be sure to have the component give a comment any time that these un-standardized methods are used and I will be clear that I have made them a part of LB because I have found these insights from new research to be particularly helpful to design processes for passive architecture.  Also, I think many of us recognize that both ASHRAE and ISO were initially founded to produce standards for conditioned or refrigerated spaces and that, understandably, they .  Among the features that I will be adding in:\n\n1) You will have the option of using either the American ASHRAE adaptive model or the ISO EN-15251 model (see the CBE's comfort tool for a visual of the differences - [http://comfort.cbe.berkeley.edu/](http://comfort.cbe.berkeley.edu/)).\n\n2) In addition to a different comfort polygon, the European standard also uses a \"running mean\" outdoor temperature instead of the average monthly outdoor temperature.  This \"running mean\" is computed by looking at the average temperatures over the last week and weights each of the daily average temperatures by how recent it is.  This makes more sense to me than the ASHRAE method and addresses the issue that you bring up, Alejandro.  Needless to say, the updated adaptive model will allow you to use either a running mean or average monthly temperature with either the American or European polygon.\n\n3) The WIP adaptive chart currently has an option for a \"levelOfConditioning\".  This input allows you to make use of research the was conducted along-side the initial development of the adaptive model, which showed that the findings did not contradict the PMV model when people were surveyed in fully conditioned buildings.  This parallel research ended up producing a different correlation between the outdoor and desired indoor temperatures and this correlation had a much shallower slope than the official adaptive model for fully naturally-ventilated buildings.  The levelOfConditioning allows you to make a custom correlation for full natural ventilation, full conditioning or (presumably) somewhere in between for a mixed-mode building.  This levelOfConditioning will become an official input for all LB components using the adaptive model (not just the chart at the moment).\n\n\n\nAt the end of all of this, I will put together a new video series on Adaptive comfort so that we are all on the same page about how to use the model.\n\n\n\n-Chris\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1320263", "name": "AdaptiveComfortCalculator3_CWM.gh"}], "created_by_name": "Chris Mackey", "created_at": "July 4, 2015 at 1:06pm", "created_by": "chris", "parent_id": "reply_2985220_Comment_1313245", "id": "reply_2985220_Comment_1320262"}