{"body": "\nArtem,\n\nI have altered your GH file to include how you set up a schedule with your insulated blinds.  You can find it attached and I hope that you don't mind that I also updated all components in the file to the version that we have on the github now.  Here's an image showing the workflow for setting up a schedule with the blinds:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/YRV3Lv4YkELWPsw4gWQIZ45x83LzJmM9H9F7ipQ6Yt5bf99kfeMjxf0KHTBaMDGr6Za8RIq-Xp0Xv6M5LrZKLYF28cYDA--Z/BlindsSchedule.PNG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/YRV3Lv4YkELWPsw4gWQIZ45x83LzJmM9H9F7ipQ6Yt5bf99kfeMjxf0KHTBaMDGr6Za8RIq-Xp0Xv6M5LrZKLYF28cYDA--Z/BlindsSchedule.PNG)\n\nHere, the blinds are being pulled any time that the solar radiation gets too intense or the outdoor temperature is above the building balance point.\n\nYou are right to point out to that I have not made any tutorial videos on how to use the ZoneShades component yet.  I have had it on my list for a while but the workflow doesn't address all cases of dynamic shades (notably cases where the shade is in between panes of glass) and I was considering holding off until this was better fleshed-out.\n\nAs you see in the example file, for HBObjects, you connect a HBZone or a HBSurface that has windows already on it.  You want to use the HBObjectsWShades in the rest of your workflow and the other outputs are just to help you visualize what you are simulating.  As you can see, I connect the shadeBreps to a preview component in the file so that you see what the generated shades look like.\n\nThe zoneData inputs are there for another type of shade analysis that is unrelated to the dynamic shades case that you are running here.  I attached a second GH file that shows this other workflow in case you are curious.  I mostly use those zoneData inputs to align zone heating, cooling and solar beam gain values to correct windows.  This can them be fed into another component that performs a \"shade benefit analysis\".\n\n\n\nAs I said before, if you calculate the airflow that you will get with certain aperture size, you can create a custom schedule of airflow values and feed it into your simulation for your NatVent values.  You can also use the temperature results that come out of your simulation to make a custom airflow schedule (not just outdoor data).  All of this said, I am currently working on the components that will allow you to set an indoor temperature at which to open the windows that will be used dynamically in the simulation.\n\nThe heating/cooling setpoint schedule cannot accept a CSV schedule currently because the default of HB is to use a dual setpoint schedule (which does not accommodate CSV schedules).  To be honest, I am not so sure why we have them as inputs right now but perhaps Mostapha can shed some light on this.  In the meantime, if you would like to set an HVAC availability scheduled to shut off the HVAC when you are not trying to reach a setpoint, I currently have a quick hack that does this that I will eventually turn into a full component.  Let me know if you need this and I will try to pull it together.\n\n-Chris\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1185725", "name": "HB_shoeboxing_CWM.gh"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1185726", "name": "Example of shade benefit simulation for energy14.gh"}], "created_by_name": "Chris Mackey", "created_at": "December 10, 2014 at 9:17pm", "created_by": "chris", "parent_id": "reply_2985220_Comment_1185816", "id": "reply_2985220_Comment_1185724"}