{"body": "\nVery very good questions Petar. Good to see that Honeybee has users like you.\n\n1. It is up to you as a designer to make the decision about using skylight vs direct sunlight or mix of them. It is about the space that you are designing and your design intent. Just think about an atrium vs a museum. And now think of the atrium in two different climate zones. As a [lighting] designer you make the decision on how do you want the space to be, how the climate is and then try to take advantage of skylight and/or direct sunlight to achieve your design goals.\n\n\n\n2. Yes. There is a watchTheSky component next to sky types which let you visualize the sky. There is also an example file that you can check.\n\n\n\n[<img class=\"align-center\" src=\"http://api.ning.com:80/files/UbQGb2BFO*VkHhCfKat-2lspnB5C13JVjkDvn0qfe0*aswiDgHO6qOVc066gu-PmLRr7CsjxZzVDVNza0gpd9M0fztoBah48/capturingTheVideos.jpg?width=721\" width=\"721\"/>](http://api.ning.com:80/files/UbQGb2BFO*VkHhCfKat-2lspnB5C13JVjkDvn0qfe0*aswiDgHO6qOVc066gu-PmLRr7CsjxZzVDVNza0gpd9M0fztoBah48/capturingTheVideos.jpg)\n\n3. This one again depends on your model. For your model I would suggest a minimum number of 4 for your final analysis. -ab is only one of the  parameters. Check this [slides](http://www.radiance-online.org/community/workshops/2011-berkeley-ca/presentations/day1/JM_AmbientCalculation.pdf) by [John Mardaljevic](http://www.radiance-online.org/community/workshops/2011-berkeley-ca/photos/img0006.jpg) if you want to have a better understanding of radiance parameters and their effect on the results.\n\nI also added the link to \"Tutorial on the Use of Daysim Simulations for Sustainable Design\" by Christoph Reinhart to [teaching materials](http://www.grasshopper3d.com/group/ladybug/page/ladybug-teaching-resources). I encourage you to at least read chapters 1 and 2 of the tutorial. Check pages 25 and 27 have two examples about selecting the parameters.\n\nGreat questions. Keep them coming.\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "March 18, 2014 at 7:32pm", "created_by": "mostapha", "parent_id": "reply_2985220_Comment_1028531", "id": "reply_2985220_Comment_1028297"}