{"body": "\nHi Leland,\n\nThank you for your checks. It was definitely helpful. So there was two issues that I needed to address. Both of them were causing minor differences in a way that was so hard to realize by just looking to the results but your trick for putting .5 was really helpful to trace them down.\n\nThe main issue was that dayskymtx generates an extra patch for the ground (which is the first one in the results), I was taking care of this is selectSkyComponent but as a result I was multiplying the last patch of each row with the wrong str. angle. If you rotate the sky once you set one of the numbers to .5 you could see that.\n\nThe second issue was that the order of angles was reversed which was an easy fix.\n\nImage below shows the sky before conversion on the left, the one with conversion from the angles in the middle and the one with ladybug internal conversation in the right. As you can see the values are very similar. The angles that comes from the geometry is slightly different from the ones from Radiance which is negligible.\n\nI was thinking maybe even for the sake of visualization I should show the values before the conversion in sky dome but I assume that makes it hard for some users to use the values for their own studies as they have to find the angles from geometries so I just left it as it is for now. Let me know your thoughts on this. I hope this fix finally closes this discussion. :)[<img class=\"align-full\" src=\"http://api.ning.com:80/files/SV3csQ*6q4eDW4tp8SJm8dOAelw0O9ACWwCaW67zJ5BTG2SxsQkZIKUoyjR-iIe8d5cXc3V6Z9cK3IZT17SotfMgleZ2HSP*/genskymtx_roundIII.png?width=721\" width=\"721\"/>](http://api.ning.com:80/files/SV3csQ*6q4eDW4tp8SJm8dOAelw0O9ACWwCaW67zJ5BTG2SxsQkZIKUoyjR-iIe8d5cXc3V6Z9cK3IZT17SotfMgleZ2HSP*/genskymtx_roundIII.png)\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1209860", "name": "cumulativeSkyMtxerror_removedStr_3.gh"}], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "January 22, 2015 at 07:50PM", "created_by": "mostapha", "parent_id": "topic_1162106", "id": "reply_2985220_Comment_1209859"}