{"body": "\nHi Abraham,\n\nI have tried testing the scenario that you describe and I think I understand some of what you mean about the solar fan but I am still unsure of what you mean with the solar envelope.\n\n\n\nIn the case of the solar fan, I know that it does not form a perfectly rectangular extension for a rectangular starting surface but this is actually the right geometry for those solar vectors (albeit, it is probably more specific than you would actually need for a given project and it takes much more calculation time than is necessary for such a simple question).  If you are looking for something that gives you a slightly abstracted solar fan just for a given hour range and has a much quicker calculation time, I know that Saeran Vasanthakumar has just pushed an alternative solar fan and envelope to the ladybug github and this might better suit your needs ([https://github.com/saeranv/enviro_simulation/tree/master/gh_files](https://github.com/saeranv/enviro_simulation/tree/master/gh_files)).\n\n\n\nI feel I should put a bit of a disclaimer and say that these component that I made are for in-depth solar fan and envelope analysis where you might set criteria other than a simple hour range for selecting solar vectors.  For example, you can use the sunPath component to select just the sun vectors when the temperature is cold enough that people want sun and the radiation is strong enough to provide warmth.  You could then build a solar fan from those vectors to ensure outdoor comfort for a certain time of year in a given space.  Another scenario would be selecting solar vectors that pertain just to a growing season (ie. between a certain temperature range and humidty level).  You might then choose vectors when the sun is strong enough in this growing season and build a solar fan off of that.\n\n\n\nLet me know if this answers your question and, if not, perhaps you can annotate the attached screenshots of the scenario you described to give us a better sense of what you mean.\n\n\n\n-Chris\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A999226", "name": "Solar Envelope.PNG"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A999227", "name": "Solar Fan.PNG"}], "created_by_name": "Chris Mackey", "created_at": "January 29, 2014 at 08:47PM", "created_by": "chris", "parent_id": "reply_2985220_Comment_998407", "id": "reply_2985220_Comment_999225"}