{"body": "\nThis discussion is great.Thanks Grasshope and thanks Chris for wrapping things and implementing them.\n\nBut i think also that some other clarifications are in order.\n\nThe VSC (or Sky Component as Chris proposes now) definition is not quite right as stated above. From this [link](http://wiki.naturalfrequency.com/wiki/Sky_Component) (sorry for that, but i'm lazy to look for a better one) we can see that:\n\nThe terms **sky component** and **sky factor** refer to the actual contribution of the sky to daylight, after considering both luminous distribution and incidence angle effects. There appear to be no hard and fast rules as to the type of sky distribution to be used with either term, however they are typically calculated using either the [CIE Uniform Sky](http://wiki.naturalfrequency.com/wiki/Sky_Illuminance#UniformSky) or [CIE Overcast Sky](http://wiki.naturalfrequency.com/wiki/Sky_Illuminance#OvercastSky) to remove the dynamic effects of beam solar component.\n\nAfter that the definition of VSc, as given by the BRE:\n\nThe Vertical Sky Component (VSC) is described by the UK Building Research Establishment (BRE) as *the ratio of the direct sky illuminance falling on the vertical wall at a reference point, to the simultaneous horizontal illuminance under an unobstructed sky* [Littlefair, 1991]. It also states that the Standard CIE Overcast Sky model is to be used for the [sky illuminance](http://wiki.naturalfrequency.com/wiki/Sky_illuminance) distribution. This means that the reference value for the VSC percentage is effectively the unobstructed horizontal sky component.\n\nAnd that's why i like a bit less the definition above (just sky component) and then generalizing the concept for all other possible surfaces.\n\n\n\nAs for SVF, doing a quick search of recent (relatively) sources that are trying to develop methodologies to define SVF they are based almost exclusively on solid/geometrical considerations. See these references for illustration:\n\nGrimmond C.S.B., Potter S.K., Zutter H.N. and Souch C. 2001. **Rapid Methods to Estimate Sky-View Factors Applied to Urban Areas**. International Journal of Climatology. 21: 903–913 (2001). DOI: 10.1002/joc.659\n\nMatuschek, O. Matzarakis, A. 2010. **Estimation of Sky View Factor in Complex Environment as a Tool for Applied Climatological Studies**. In: Matzarakis, A., Mayer, H., Chmielewski, F.-M. (Eds.), Proceedings of the 7th Conference on Biometeorology. Ber. Meteorol. Inst. Univ. Freiburg No. 20, 535-540.\n\nMatzarakis A., Matuschek O. 2011. **Sky view factor as a Parameter in Applied Climatology - Rapid Estimation by the Skyhelios Model**. Meteorologische Zeitschrift, Vol. 20, No. 1, 039-045 (Open Access Article).\n\nHämmerle M., Gál T., UngerJ. &amp; Matzarakis A. 2011. **Comparison of Models Calculating the Sky View Factor Used for Urban Climate Investigations**. Theoretical and Applied Climatology (2011) 105:521–527. DOI 10.1007/s00704-011-0402-3.\n\n\n\nI know some other researches that use the term SVF just from its geometrical implications. This is probably because all those are based on site measurements or photographing.\n\nIt will be really interesting to calibrate those with the new LB component.\n\n\n\nThanks again,\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "February 14, 2016 at 11:05PM", "created_by": "AbrahamYezioro", "parent_id": "reply_2985220_Comment_1463071", "id": "reply_2985220_Comment_1463328"}