{"body": "\nAbraham,\n\nIndeed, \"garbage in garbage out\" might be a good way to describe this case :).  You are correct in that there is no way (or at least very few ways) to get such high air temperatures in your climate's winter.  Believing that this is possible is nothing short of an adiabatic fantasy.\n\nAs for the means by which I created those colored charts: with the outputs that you can request with the \"Generate EP Output\" component, I have tried to make it possible for you to track all terms of the energy balance calculation that E+ is running. If you set the \"zoneGainsAndLosses_\" input of the \"Generate EP Output\" component to True, you will get a number of useful energy values out of the E+ simulation (and displayed on the \"Read EP Result\" component).  This includes solar gains, people gains and infiltration gains+losses.  If you take this output along with the lighting gains, the equipment gains and the heating/cooling that you already usually have coming out of this component, you have almost all of the terms of the energy balance that E+ does.  The only major thing that is missing is the conduction through the envelope but you can look at this if you set \"surfaceEnergyAnalysis\" to True on the \"Generate EP Output\" component and use the \"Read EP Surface Result\" component.  The heat flow through the envelope comes through on a surface-by-surface basis so it can sometimes be difficult to find just the surface that you are interested in if you have a large model.  Since you had only one window in your model, it was easy for me to find.\n\nI should note that the total heat gain chart that I made in the post above is a bit of a hack and is not a perfect representation of all of the heat that is coming into the zone - since it only includes people + equip + lights + solar and not possible infiltration or envelope gains.  It also excludes the heat that can be removed (or accidentally added) by natural ventilation.  To make the chart, all that I did was use the \"SeparateData\" component on those 4 types of gains and used the native grasshopper \"addition\" component to add them together (I think that I also had to use a native Grasshopper \"Flip Matrix\" component to make sure the right parts of the list were added).  The attached GH file shows how I did this.\n\nLet me know if you have any other questions.\n\n-Chris\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1213281", "name": "HB_shoeboxing_CWM_AY_Resid_CWM.gh"}], "created_by_name": "Chris Mackey", "created_at": "January 28, 2015 at 3:47pm", "created_by": "ChrisMackey", "parent_id": "reply_2985220_Comment_1212755", "id": "reply_2985220_Comment_1213280"}