{"body": "\nHi Chris and thank you very much for the great work in linking THERM to Energy Plus!\n\nI've been able to run the example file but I'm not sure I understand the theory behind whole process, in order to be able to replicate it on another case study. (Sorry, probably I'm just lacking the basic understanding on how to merge the THERM model results with EP construction)\n\nFor what I understand, in the example file we start from the THERM materials and THERM model in order to simulate the thermal bridge. The WALL-NOTHERMALBRIDGE EP construction element is a \"standard\" EP abstraction of the real wall (with the CELLULOSE EP Material created from THERM CELLULOSE Material) that doesn't take into account the steel material in it, the resulting EP Construction has five material layers against the six materials of the real wall.\n\nIn the WALL-THERMALBRIDGE EP construction instead we substitute the \"CELLULOSE...\" insulation material layer (layer 4) with a \"special\" material capable to transfer the thermal bridge phenomenon inside the EP construction.\n\nIn THERM we simulate the whole 2D model with fixed boundary condition (only needed to calculate R and U value, so I guess we can leave the example values in every country) and we obtain an R-value of the overall lenght of the simulated wall. After importing the THERM result we subtract from it the R values of the other four layers of the WALL-NOTHERMALBRIDGE EP (so that we don't calculate them twice), and then we create a specific new EP Material (ThermalBridgeMat) in which the conductivity comes from this operation and then we rebuild another EP construction material in which the layer 4 is the new ThermalBridgeMat. Is it ok?\n\nNow the question is, are there any guidelines on hints to understand how to break up for example a \"linear\" thermal bridge problem to better evaluate it? I Post an image with a basic example:\n\nLet's say I have a two-storey house (ground floor and first floor) and the floor of the first floor creates a thermal bridge in the wall (red line). Probably in Energy+ I’ll go for a two zones modelling. Now in order to take into account the thermal bridge how am I supposed create the THERM file? I could (First hypothesis) leave the ground floor wall as it is, and simulate the slab and the first floor wall together (cyan box), and then “spread” the new value all over the first floor wall, or I could simulate the ground floor wall, the first floor and the slab and use an unique value for the two walls, which is better? Is there any documentation to understand if there is a basic workflow in order to tackle the issue?\n\n\n\nThank you very much and sorry for the long post!!\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1736765", "name": "Therm_Energyplus_question.pdf"}], "created_by_name": "Filippo", "created_at": "April 21, 2017 at 02:08AM", "created_by": "Filippo", "parent_id": "reply_2985220_Comment_1430124", "id": "reply_2985220_Comment_1736763"}