{"body": "\nTheodore,\n\nFirst just a small correction to what you said:\n\nFor simpler solar distribution calculations (fullInteriorAndExterior), EnergyPlus uses VIEW FACTOR from the window to the zone surfaces to divide up the incoming solar energy (it is not divided equally).  This is a fine assumption as long as you are only interested in results on the zone level (like zone cooling, or average zone air temperature/MRT).\n\nHowever, if you are going to generate a micro-climate map off of the energy simulation results, this method is not satisfactory and you really need to be breaking up individual surfaces into multiple ones to capture the variation in surface temperature and running the simulation with fullInteriorAndExteriorWithReflections.\n\nIf you are trying to generate a micro-climate map for a convex zone, you have a tough judgement call that varies depending on the type of geometry that you are simulating.  If you have an L-shaped zone where all windows are far away from the \"joint\" of the L, I would suggest breaking up the zone in two zones and putting an air wall between them (the HB view factor component will know to discount the air wall from the MRT calculation).  However, there are many cases where I would say that this breaking up is not worth it since incoming solar energy cannot pass through an air wall (E+ does not treat it as transparent) and so this can badly mess up your radiative heat transfer calculations if you put an air wall close enough to a window that sunlight is hitting it.  In this case, if you can find a way to make the zone not convex (ie. shave off the small convex portion of the zone) this might actually be best in some cases.  Otherwise, you might have to accept the limitation of solar energy distributed by view factor with the simpler model.\n\nMan, I really wish E+ team would fix this convex issue.  It's a really big limitation that I know could be addressed with a bit more time.  Mark my words, if it isn't fixed in 3 years, I am going to edit the E+ code myself.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "January 4, 2016 at 9:50am", "created_by": "chris", "parent_id": "topic_1430127", "id": "reply_2985220_Comment_1430512"}