{"body": "\nHi Chris,\n\n\n\nSorry for coming back to you so late on this.\n\n\n\nI went through some literature on the web and in books to understand it myself. It seems that most people would agree that the log wind profile represents wind flow more accurately in lower heights. The general formula for the log wind profile is:\n\n\n\nU(z) = (u*/k)[ln((z-d)/zo)] + psi(z, zo, L)  (1)\n\n\n\nwhere U(z) is the mean horizontal wind speed at heigh z, u* is the friction velocity (velocity scale representative of velocities close to a solid boundary), k is the von karman constant (empirically set at 0.41 for rough and smooth surfaces), d is the displacement height, zo is the specific surface roughness, and psi is a stability term.\n\n\n\nMost cases assume neutral stability in the atmosphere to eliminate the psi term (i.e. z/L = 0) If not there are much more complex calculations required between temperature and wind speeds, essentially requiring numerical simulations to calculate the profile. With eliminating the psi term, it is easy to calculate the wind speed at any height z, provided we know the wind speed at reference heigh z1, like so:\n\n\n\nU(z)/U(z1) = ln((z-d)-zo)/ln((z1-d)-zo1) -&gt; U(z) = .... (2)\n\n \n\nwhere z is the height we are interested in, zo is the roughness height in our case area, z1 is the reference height and zo1 is the reference roughness of the measurements. These are the measurements in the EPW file. The added information so far compared to the power law is that we also need the roughness level of the EPW data (usually near airports where roughness is very low, like 0.0002).\n\n\n\nAnother simpler way is to calculate the friction velocity first by:\n\n\n\nu*=kU(z)/ln(z/zo), (3)\n\n\n\nassuming d=0 and z is the reference height of the measurements. Then we can use this to calculate the wind profile.\n\n\n\nWhile d=0 is an assumption I can understand, I do not really agree with accounting for a similar roughness level between the area of measurements and the case area. This is highliy problem and context specific. Especially in urban environments in my opinion it is almost always wrong.\n\n\n\nThe displacement height (d) is usually calculated as 2/3 of the average height in the area of interest (sometimes \"average\" has a qualitative connotation as \"characteristic\"). Accounting for displacement height does introduce a problem though, the wind profile below d meters is undetermined, since ln(x) is undefined for x&lt;0. In order to solve there is a two-step approach which forms these two equations:\n\n\n\nU(z) = (u*/k) x ln(z/zo1) for z &lt; a*d\n\n\n\nand\n\n\n\nU(z) = (u*/k) x ln((z-d)/zo), for z &gt; a*d\n\n\n\nLiterature mentions that the choice of zo1 and a (i.e. the boundary of the 2 profiles) is quite arbitrary and not very influential in the results. Usually, zo1 is much lower than zo since lower roughness is expected on a higher height, especially in urban zones.\n\n\n\nThe way I understand it, I think even implementing the simple formula (1) and then using (2) to calculate the profile is enough. For the inclusion of the displacement zone I imagine additional inputs would be required from the users and it would be their responsibility to conduct some sort of sensitivity analysis on the results. Equation (3) would be ok if no data on roughness level of the EPW measurement is available.\n\n\n\nAnyways, that's my 0.02c. Bear with me and the mistakes herein, this isn't my specialty by a long shot and I'm just delving into all of this.\n\n\n\nSome references:\n\n\n\nWikipedia ofc.\n\nsts.bwk.tue.nl/drivingrain ( a nice page with a lot of additional references. The two-method was mentioned here).\n\nwind-data.ch/tools/profile.php? (a nice online tool that calculates log-wind profiles) and gives the most commonly reproduced values (in the literature) for zo.\n\nWilcox, Turbulence Modeling for CFD (this is more related to CFD but it gives some background on the physics of the log-law)\n\nArgain et al. 2008, Estimation of the Friction Velocity in Stably Stratified Boundary Layer Flows Over Hills (an example of the complicated calculations when not assuming a neutral stability in the atmosphere)\n\nAmerican Society of Civil Engineers (1999), Wind Tunnel Studies of Building and Structures (as always very good reference, provides the standard categories for zo values)\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "March 16, 2015 at 12:27AM", "created_by": "TheodorosGalanos", "parent_id": "reply_2985220_Comment_1240892", "id": "reply_2985220_Comment_1243318"}