{"body": "\nHi Mostapha and thank you for your reply,\n\nYes I need to apply the change globally.\n\nI attach the two different example idf file, the gh and the word file with the comparison of the two files.\n\n\n\nI would like to add inside Honeybee the possibility to calculate CEN Adaptive Comfort. At the moment with Honeybee I can only generate an \"incomplete\" file and then apply the correction through the idf editor. This, for example, makes it impossible to use the discomfort hours as a fitness function for an optimisation inside Grasshopper.\n\nWhat I need:<br/>I need to modify the internal gains section and to add some schedules and output variables.\n\nWhat's the problem:\n\nWhenever i need additional strings that are not already written by Honeybee I can add them in the Honeybee Run Energy Simulation (for example i need the adaptive comfort CEN outputs and I can have them added using a panel).\n\nFor the additional schedules I think it's a bit more complicated because I don't know if I can add more input into the Honeybee Set Energy Plus Zone Schedules to plug in some more Schedules (their name are WorkEFF_SCH - work efficiency, ClothingINS_SCH - clothing insulation and AirVELOCITY_SCH - air velocity), maybe I can add the additional schedules inside the additional strings input along with the additional output variables?\n\nThird and most complicated issue, I need to insert some values mainly inside people internal gain (but also into lights and electric equipment) but I don't know how to do it, if I try to add another \"people\" internal gain from the additional strings as I have done for the output variables I end up having two people internal gain.\n\nThis problem maybe could be resolved by adding the possiblity to block the automatic creation of the internal gains, so if I can stop Honeybee from writing them maybe I can then add them through the additional strings option...\n\n\n\nthank you very much!!\n\n\n\nFilippo\n\n\n\n\n", "attachments": [], "created_by_name": "Filippo", "created_at": "November 22, 2016 at 07:04AM", "created_by": "Filippo", "parent_id": "reply_2985220_Comment_1641411", "id": "reply_2985220_Comment_1643906"}