{"body": "\nMax,\n\nI am incredbily sorry that it took so long for me to get to this point but I think what I am about to say will come as good news.\n\nI dug a deeper into the code and I found a major bug from before the time when Mostapha standardized the naming of glazing surfaces.   In the early days of Honeybee, Mostapha did a lot to enable the running of very complex glazing surfaces through E, which involves the breaking up of the window into smaller triangles and quadrilaterals (since the core of E+ does not understand window geomtries other than rectangles and triangles).  It took a while for us to standardize the names of the glazing pieces such that we can take all of those small windows and assemble the results back into the one window in Rhino.\n\nAs a workaround at the time, I added in this very hacky code, which caught (what I thought were) all of the cases where the surface names did not match perfectly.  In your case, however, it completely backfired and confused the window surfaces with the corresponding wall surfaces that they are a part of.\n\nWe didn't notice the bug until now because it affected so few cases.  Needless to say, [I have fixed it now](https://github.com/mostaphaRoudsari/Honeybee/commit/eba81d5f23a3cda0c213daf67ee788116c74ab1e) and all of the results that I get during the night time make sense:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/gkF2k60sIb4sZvcppks4Ek4g7BKabAFt9o0N9JF-4NTUPxbr2w8uSPfHUoR-PYriRVjDouWA59Vw0q6PT4Pyaz*W*qGOJNxB/FinallyWorking.JPG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/gkF2k60sIb4sZvcppks4Ek4g7BKabAFt9o0N9JF-4NTUPxbr2w8uSPfHUoR-PYriRVjDouWA59Vw0q6PT4Pyaz*W*qGOJNxB/FinallyWorking.JPG)\n\nI attached the fixed file and let me know if this clears up everything on your end.\n\nThanks again for you persistence with this.  Because of your efforts, many people were saved from a difficult-to-detect bug.\n\n-Chris\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1574463", "name": "ComfMap_CWM_FIXED.gh"}], "created_by_name": "Chris Mackey", "created_at": "August 1, 2016 at 2:18pm", "created_by": "chris", "parent_id": "reply_2985220_Comment_1574076", "id": "reply_2985220_Comment_1574462"}