{"body": "\nTheodore,\n\n\n\nI'm not sure the following is applicable to what you are considering, but maybe my issue inspires a cool thought. Let me know what you think.\n\n \n\nOne of our major problems with energy models is that they require so much detailed information to be accurate (building form, materials, system design assumptions) that it is hard to use them during conceptual design, when they can best influence major design decisions. Often the range of potential assumptions are so large we introduce huge error while outputting misleadingly precise numbers. This data, if not properly understood, is dangerous. Ideally, we would iterate through the max, min, and expected value of all input assumptions to gather a cloud of data that represents all likely outcomes, rather than a single assumption. This would then allow us to gather useful info without requiring accurate inputs.\n\n \n\nThis workflow can be built using honeybee components, but we have little direction on what inputs are most critical for various climates, or what those ranges should be. A study that focused on the sensitivity of the energy model to various inputs could help our teams focus on nailing down critical elements first, without wasting time refining parameters that don't really matter. Perhaps a pattern will emerge for typical building types in various climates that can help guide design teams.\n\n \n\nPerhaps you could develop a module to identify which major parameters (solar gain, infiltration, U-values) are most likely to have the greatest impact on an energy model based in various climates. I'm imagining the passive strategy tool already developed in HB, but focused on refining our energy model assumptions based on weather data. If we knew which parameters are likely to be most impactful, or the range of error we should expect at a given stage of a project, it might help us better use energy modeling information in the early stages of design.\n\n \n\nIf anyone else has found a way past this problem, please let me know!\n", "attachments": [], "created_by_name": "Leland Curtis", "created_at": "July 15, 2015 at 10:03am", "created_by": "LelandCurtis", "parent_id": "topic_1326279", "id": "reply_2985220_Comment_1326381"}