{"body": "\nMostapha, I try to explain better.\n\nI remembered (or I understood) that when you input more than one object in the geometry input they were ignoring each other so you could have made more studies, one for each object, with one single run, with each object surrounded by the same context geometries (if you check the image I attached the two dark grey boxes are the test geometries and the wirework boxes are the context). \n\nJust recently I understood that it doesn't work (I thought anymore) like this but that if you input more than one test object in the geometry input each one acts as context for the others. This makes things longer because it means that if I have to test say 100 variations of the same object I have to connect and disconnect the geometries 100 times. In the way I remember it was before I had just to input the 100 objects in the geometry input and with one single run get the results in different branches.\n\nChris says it always worked like this (that each test geometry acts as context for the others), so it means I misunderstood or more likely I remember wrong. So to run multiple studies at the same time he suggests to input multiple geometries and graft the input. I tried but the result is shown in the previous post, the output is quite complicated to manage. You can see that for two test objects with 6 sides each I get one single list with six branches.\n\nNow is not important if it was always like that or was not, but I was suggesting that could be useful that it would work like I remember :) if it is possible. When you input multiple test obejcts in the geometry input they ignore each other so you can run easily multiple studies, one for each object, at the same time. If you want to run one single study on two objects at the same time then you input also these objects in the context input so they shadow each other.\n\nLet me know if this time was more clear. Thank you.\n\n \n\nFrancesco\n", "attachments": [], "created_by_name": "Francesco De Luca", "created_at": "January 16, 2017 at 9:25am", "created_by": "FrancescoDeLuca", "parent_id": "reply_2985220_Comment_1672391", "id": "reply_2985220_Comment_1673110"}