{"body": "\nHi Chris,\n\n<br/>Thanks for you test and your reply! you tested the older version, the new version is a little bit different, but the main function is similar.\n\nI made the latest version with Abraham's contribution, he gave some very good ideas, and we have been working together on them.\n\n<br/>I rewrote the component and now the system to generate pergola shades is a function.[<img class=\"align-center\" src=\"http://api.ning.com:80/files/4-r35uyukEZMfBM3x*zKCo6KedPI0b72IptVyiBb1exsRzZIeb3ZQCL7LegEqlyAmUvSBmctR5kH3XcZNTmYuZuCbq7womrX/function_pergola.png?width=400\" width=\"400\"/>](http://api.ning.com:80/files/4-r35uyukEZMfBM3x*zKCo6KedPI0b72IptVyiBb1exsRzZIeb3ZQCL7LegEqlyAmUvSBmctR5kH3XcZNTmYuZuCbq7womrX/function_pergola.png)I have never tried the component by connecting depths instead Vectors. Because to run correctly the component needs to have shading surfaces with a depth and shape according to the sun vectors.<br/>But we can work around the depth as well. We have to find another method to find the right size of the pergola shades.\n\n\n\nthe component generates the best dimension of pergola shades to block the sun rays.<br/>It accepts multiple shading surfaces which are generated by vectors and it creates a big pergola shade for all of them (we have to modify a bit this part), or it finds the shading surface with the max sun Altitude or with the max solar radiation value.<br/>It is not completed yet, there are some small bugs to fix about the merge mode and a couple of good Abraham's ideas which we have to elaborate\n\n[<img class=\"align-center\" src=\"http://api.ning.com:80/files/4-r35uyukEafvt-okn7ktCgDXyKiilRBw-3S0d2Bmyy0GC2s*dX-o0TKnM2sHz*XoNr8Vbn9VIkbsU5RyPbYWZwW1TL5g8T3/function_pergola2.png?width=500\" width=\"500\"/>](http://api.ning.com:80/files/4-r35uyukEafvt-okn7ktCgDXyKiilRBw-3S0d2Bmyy0GC2s*dX-o0TKnM2sHz*XoNr8Vbn9VIkbsU5RyPbYWZwW1TL5g8T3/function_pergola2.png)\n\n\n\nI am agree with you about the integration also in order to reduce the number of components.\n\nWe can do in this way, if Abraham is agree, we can complete this component with all functions and then we can try to integrate it into LB shading designer, thus when all functions work fine. What do you think about it?\n\n\n\nBest\n\nAntonello\n\n\n\n\n", "attachments": [], "created_by_name": "Antonello Di Nunzio", "created_at": "April 11, 2016 at 03:04PM", "created_by": "AntonelloDiNunzio", "parent_id": "reply_2985220_Comment_1506073", "id": "reply_2985220_Comment_1506193"}