{"body": "\nHi Chris,\n\nThanks for  your detailed answer. Clear to me that all these checking are just a first approach to understand the potential of the location.\n\nYour explanation for the time constant makes sense and i get it. If you have time check the attached papers we published a while ago in relation to the contribution of thermal mass in the reduction of temperature in residential buildings. See the nice contribution of the heavy TM or the lower one for light TM.\n\n\n\nAs for the solarHeatCapacity, your description (of the 50W) is derived on a 1 Facade/Floor ratio and fully glazed. The only way to reduce it is to increase the ratio (bigger facade area). Which is not recommended (energy losses), but this is a different issue. So, roughly, we can say that 50 is the lower value. If i have less glazing area this number will be higher (right?)\n\nI want to define a value list of \"architectural situations\", so it is easy to explain and understand. One situation can be:\n\n\"Ratio facade/floor 1 &amp; Fully glazed\" = 50\n\n\"Ratio facade/floor 1 &amp; Half glazed\" = 75\n\n\"Ratio facade/floor 1.5 &amp; Fully glazed\" = 30\n\n\"Ratio facade/floor 1.5 &amp; Half glazed\" = 50\n\n\"Ratio facade/floor 0.75 &amp; Fully glazed\" = 70\n\n\"Ratio facade/floor 0.75 &amp; Half glazed\" = 90\n\nMakes sense for you something like this?\n\n\n\nI also defined a value list for the timeConstant like this:\n\nLight Building (Mobile home) = 1<br/>Medium-light building (Cement tiles on floor) = 4<br/>Semi Heavy Building (Concrete floor + Tiles) = 8<br/>Heavy Building (Concrete floors/ceilings + Heavy external and internal walls) = 12\n\n\n\nAs for the first 5-10 cm effective TM in general my assumption is that you take half of the mass to your space and half to the space above/below you. Will be interesting to do a parametric study on just the thermal mass, uninsulated and insulated to see what the depth limits effectivity will be. Interested in doing such a study together? Can be a nice work even for publishing.\n\n\n\nThanks a lot ... again,\n\n-A.\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1811352", "name": "THERMAL MASS_article.pdf"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1811353", "name": "published.pdf"}], "created_by_name": "Abraham Yezioro", "created_at": "September 10, 2017 at 02:20AM", "created_by": "AbrahamYezioro", "parent_id": "reply_2985220_Comment_1811424", "id": "reply_2985220_Comment_1811351"}