{"body": "\nHi Mostapha,\n\nThanks for uploading the .ghuser files. I have replaced the previous files with the new ones and the problem with the discrepancy between two different versions of a component appears to be solved.\n\nI almost forgot to answer your questions on the previous post.\n\nThe capability to avoid the hassle of setting adjustments for individual luminance distribution images generated over a long period of time with short intervals between consecutive shots allows the user to setup a semi-automated process through which the generated images could be integrated for a preset layout such as a web page and updated once required.\n\n\n\nRegarding the flasecolor component, the two features of saving as PNG file and the capability to adjust the masking threshold would be all I can think of for now to enable the user for further modifications on the false color images. There are certainly other options like acuity loss, color loss and veiling glare that are available through the interface of wxfalsecolor. However, I do not find them as critical at least for the purposes of my own project.\n\nI hope the source code for wxfalsecolor/falsecolor2 would provide the options for PNG formatting.\n\n\n\nThe situation with the integrated masking feature for values below 0.1 is that once you change the output from regular \"color fill\" to \"contour bands\", the margin around the image frame will also receive the color of lowest value (pink-purple) and will be no longer rendered as a black margin that you can find on a  regular \"color fill\" output. Now, this is not a  problem with the Honeybee_falsecolor component. wxfalsecolor also does the same thing with the margin colors with a \"contour bands\" layout. I was under the impression that the added feature for \"Background masking\" on the link I had attached would address this issue. \n\nI appreciate indeed all the effort for further developments of the Honeybee/Ladybug components.\n\nAlireza\n", "attachments": [], "created_by_name": "Alireza", "created_at": "April 13, 2014 at 04:13PM", "created_by": "Alireza", "parent_id": "reply_2985220_Comment_1043386", "id": "reply_2985220_Comment_1043768"}