{"body": "\nHi Chris,\n\n<br/>Thank you for the information again. Looks like we are making the Mean radiant temperature more precise with each reply and mutual support.<br/><br/>\n\n<br/>    Thanks for all of the knowledge you have shared.  If what you say is correct about the small difference between the global horizontal and direct/diffuse calculations in the MENEX model, than the discrepancy likely has more to do with the difference between the approximation of human geometry in the MENEX model (plane or cylinder) and the human geometry approximation in the SolarCal model (some coefficients derived from radiation studies of mannequins).  I noticed some fairly large differences between using a suggested global horizontal method and a direct/diffuse method with the SolarCal model (differences on the order of 20%) but I imagine that this is because a mannequin human geometry is more sensitive to changes in solar orientation than a cylinder or plane.  All of this is very good to know.\n\n\n\nYes, I guess this might be the case: the sensitivity of the SolarCal model to different parts of human body surfaces and surfaces areas.\n\n\n\n<br/><br/>    Am I correct in understanding that you recently corrected the grey-body assumption about sky temperature in the Thermal Comfort Indices component with this commit?<br/><br/>    [https://github.com/mostaphaRoudsari/ladybug/commit/a2a37b6dccc4e750](https://github.com/mostaphaRoudsari/ladybug/commit/a2a37b6dccc4e750)...\n\nThe previous incoming long-wave radiation was derived by Ångström for clear sky conditions. The added correction \"(1 + 0.22*((N/10)**2.75))\" is a fractional cloudiness factor by Maykut and Church (I attached the publication below which mentions it).\n\n<br/>So the emissivity coefficient of the (cloudy) sky is now:\n\nepsilon_sky = (0.82 - 0.25*(10**(-0.094*0.75*e))) * (1 + 0.22*((N/10)**2.75))\n\nI do not think that you could use the same value to calculate the sky temperature with Stefan-Boltzmann law, as the incoming long-wave radiation has been derived from the air temperature (2 meters above the ground), not the sky temperature. So by:\n\n​​​skyTemp = (La / [epsilon_sky * sigma])^0.25 - 273.15​\n\n<br/>One would get the **air temperature** from which **La** is derived, not **skyTemp**.<br/><br/>The possible reason why SolCal Mean radiant temperature is currently getting similar values to Thermal Comfort Indices Mean radiant temperature could be that fact your epsilon_sky is almost equal to 1 (0.95), so it depends solely on **La**.<br/><br/>I spoke with Dr. Blazejczyk, and got a publication on different sky temperature models. Apart from upper mentioned Swinbank, Berdahl-Martin, Melchor it has a lot more methods with mutual comparison of their resulting values. I attached it below.\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1537961", "name": "Parametrization schemes of incident radiation in the North Water polynya.pdf"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1537962", "name": "Survey of Sky Effective Temperature Models.pdf"}], "created_by_name": "djordje", "created_at": "May 28, 2016 at 08:14AM", "created_by": "djordje", "parent_id": "reply_2985220_Comment_1535577", "id": "reply_2985220_Comment_1537960"}