{"body": "\nGeof,\n\n\n\n2. [The problem is solved](https://github.com/mostaphaRoudsari/Honeybee/issues/454#issuecomment-170369025). Honeybee has an internal extra check for daylighting analysis to make sure the radiance parameters are set to minimum for any grid based analysis. The first analysis was passing this extra check and because of that it was running faster. It doesn't mean that the first analysis is totally wrong as it depends on the analysis case and should be checked and optimized before running the final analysis.\n\n\n\nYou can read more about radiance parameters here ([http://radsite.lbl.gov/radiance/refer/Notes/rpict_options.html](http://radsite.lbl.gov/radiance/refer/Notes/rpict_options.html)), and here ([http://radiance-online.org/community/workshops/2011-berkeley-ca/pre...](http://radiance-online.org/community/workshops/2011-berkeley-ca/presentations/day1/JM_AmbientCalculation.pdf)). Since you have a light-shelf I suggest you to add to the number of ambient bounces (ab).\n\n\n\nNow back to your wish to have the analysis run faster you can comment the line **hb_writeRADAUX.checkInputParametersForGridBasedAnalysis()** inside Honeybee_runDaylightSimulation and it won't overwrite the initial values but make sure that you run a number of test cases and compare the results between the runs.\n\n\n\nBack to your definition, it looks good to me. You could have saved yourself some time by using MassToZone component and then just adding the ceiling separately but there's nothing wrong with your approach.\n\n\n\nThe main place in the definition that can change is how you're generating the vertical fins. I imagine you can use a single set of components to generate every group of the fins but again your definition will work.\n\n\n\nI updated your file to the latest version, which means you also need to [update Honeybee and Ladybug](http://hydrashare.github.io/hydra/viewer?owner=mostaphaRoudsari&amp;fork=hydra_1&amp;id=Update_Ladybug_and_Honeybee&amp;slide=0&amp;scale=1&amp;offset=0,0) in case you're looking to modify the file.\n\n\n\nHope it helps,\n\nMostapha\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1435697", "name": "ParametericModel_updated.gh"}], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "January 10, 2016 at 11:30am", "created_by": "mostapha", "parent_id": "reply_2985220_Comment_1435408", "id": "reply_2985220_Comment_1435696"}