{"body": "\nHi Chien,\n\n \n\nThank you again for your time and your kind help!\n\n \n\nIn case we have different understandings of the term \"air wall\", maybe I should make it more clear regarding what I called \"air walls\" or \"virtual partitions\" as follows:\n\nWhat I mean \"air walls\" here, is derived from the description of the E+ documentation with the header of \"Air wall, Open air connection between zones\". (Page 17, [http://apps1.eere.energy.gov/buildings/energyplus/pdfs/tips_and_tri...](http://apps1.eere.energy.gov/buildings/energyplus/pdfs/tips_and_tricks_using_energyplus.pdf))\n\nAs I understand, the term \"air wall\" used in E+ here refers to a description of something like \"boundary condition\" between adjacent interzone heat transfer surfaces, but not a kind of \"construction or material\" (like air space resistance or air gaps within a wall/double glazing window).\n\nThe main purpose of introducing the \"air wall\", is to simulate or approximate the airflow/convection/natural ventilation effect between multiple thermal zones which are connected by a large opening.\n\n \n\nIn my previous tests, using HBzones and GB, I managed to create the gbXML file which can be successfully imported to DB (without assigning any constructions within HB). And the adjacency condition can be recognized automatically by DB, even when I did not use the \"Solve adjacencies\" component in HB - shared surfaces between multiple thermal zones are recognized automatically by BD as \"internal - partition\"(which are standard partitions, but not virtual partitions).\n\nIn order to create/approximate \"virtual partition\", I need to manually draw a \"hole\" in the standard partition surface (fig.1&amp;2). Again, the reason why we want to use \"virtual partitions\"(or \"air wall\") is that it allows airflow between multiple thermal zones which are connected by large openings and we could get different temperature of the each subdivided thermal zone which compose a large thermal zone.\n\n \n\nMy question is, if there is a possible way to simulate/approximate this kind of \"virtual partitions\"(or \"air wall\") in HBzones or in GB? If so, I would like to test if DB recognizes it or not. Actually, we expect that there is no need to involve any manual operations (like drawing a \"hole\" in the standard partition surface) in DB, due to an automatic optimization loop.\n\n \n\nThank you!\n\n \n\nBest,\n\nDing\n\n\n\nfig.1\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/ea4x8ggFHeJNpzszyYRTZxtFWL9MFn*FwM*TsO021pSXqHBtxCP8eEDqYRCBG-fPt71l4c4R1J38HM8WkUhJk2eoad7SrDXr/1.jpg\" width=\"367\"/>](http://api.ning.com:80/files/ea4x8ggFHeJNpzszyYRTZxtFWL9MFn*FwM*TsO021pSXqHBtxCP8eEDqYRCBG-fPt71l4c4R1J38HM8WkUhJk2eoad7SrDXr/1.jpg)\n\n\n\n\n\nfig.2\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/ea4x8ggFHeKwONAfil3rzwzna-6DNDPgx3FtberAfE-550fQSuUawwl2ngDiH*C3VrNq3r1jhSjfKi0rYEEQBZSZTIAi0dQS/2.jpg\" width=\"363\"/>](http://api.ning.com:80/files/ea4x8ggFHeKwONAfil3rzwzna-6DNDPgx3FtberAfE-550fQSuUawwl2ngDiH*C3VrNq3r1jhSjfKi0rYEEQBZSZTIAi0dQS/2.jpg)\n", "attachments": [], "created_by_name": "Ding", "created_at": "July 22, 2014 at 6:28am", "created_by": "doudou", "parent_id": "reply_2985220_Comment_1100408", "id": "reply_2985220_Comment_1104849"}