{"body": "\nHi Theodore and Abraham,\n\nThank you guys for the discussion.  It is a good reminder that I should make a tutorial video soon that explains what is going on behind the scenes soon.\n\n\n\nFirst, to answer Abrahams's question about how shades are accounted for in the simulation/thermal map and Theodore's thought that just accounting for shades in the E+ run was sufficient. I think that it may be clearest to explain what is going on with this infographic:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/KAR5IkyS4P-lIZiRQZXsSELnbHrPlWEz*NYFbhbFbH41Xxvxzbc-wSLT0wwhjG7z*f5loJl*-LvPRQrR-I583qM7fHd1KNuh/RumoerImages04.png?width=721\" width=\"721\"/>](http://api.ning.com:80/files/KAR5IkyS4P-lIZiRQZXsSELnbHrPlWEz*NYFbhbFbH41Xxvxzbc-wSLT0wwhjG7z*f5loJl*-LvPRQrR-I583qM7fHd1KNuh/RumoerImages04.png)\n\nAs the graphic shows, the thermal maps are made from 4 key types of inputs.  The radiant temperature map is formed through a consideration of both the temperature of the surfaces surrounding the occupants and the direct solar radiation that might fall onto the occupants through un-shaded windows.  The first surface temperature effect is easily computable from your Energy simulation results and the HBZone geometry.  However, the second is calculated by seeing how sun vectors pass through the windows of the zones and uses the SolarCal method of the CBE team ([http://escholarship.org/uc/item/89m1h2dg](http://escholarship.org/uc/item/89m1h2dg)) to compute an MRT delta resulting from solar radiation.  This delta is then added to the initial values computed through surface temperature view factor.  When you do not connect up your shading brep geometry, internal furniture breps, or outdoor context geometry that might block sun to the additionalShading input, the thermal map will assume that sun can pass unobstructed through the window or through indoor furniture to fall onto occupants.  It is important to stress that the EnergyPlus simulation does not count for blind geometry or internal furniture as actual geometry.  Just as numerical abstractions of surface area and material properties.  So we need you to plug in the actual geometry of these things when we compute the MRT delta resulting from sun falling directly onto people.\n\n\n\nNext, to clear up the definition of window transmissivity.  The important thing to clarify here is that, whether it refers to the tranmittance of glass or to the amount of sun coming through a fine screen of blinds, the value is multiplied by the radiation falling on the occupant and thus has a direct correlation to the MRT Delta from sun falling on occupants.  So, if you set transmissivity to zero, the sun falling on the occupants will not be considered in the calculation and, if you set the transmissivity to 1, the assumption is that there is no window (or the window glass is 100% clear).  So, Abraham, your definition of it as a coefficient is appropriate.\n\nNormally, I would just recommend that you leave this value at the default 0.7, which corresponds to the transmittance of the default glass material in Honeybee.  However, there are 4 cases in which you might consider changing it:\n\n1) You are not using the default Honeybee glazing material, in which case, you should change the transmissivity to be equal to this new value.\n\n2) You have a lot of really small blind/shade geometries and you do not want the view factor component to take several minutes to trace sun vectors through the detailed shade geometry and so you are ok with using just a simple abstraction instead of plugging shade breps into the additionaShading.  In this case, you might try to estimate the average percentage of radiation coming through the blind geometry (maybe with some simple Ladybug radiation studies or with your intuition about the amount of sun blocked by the shades).  You will then multiply this by the tranmissivity of your glass and this will be the value that you input to the component.\n\n3) Your blinds for your Honeybee simulation are dynamic, in which case, plugging shade breps into additionalShading is not going to work because the component will assume that those shades are always there.  In this case, you should be plugging a list of 8760 values into the transmissivity that correspond to when the shades are pulled.  When the blinds are completely up, the value should be the tranmittance of your window and, when they are down, the value should be the window tranmittance multiplied by the fraction of light coming through the shades.\n\n4) You have shades/blinds but they are transparent or are not completely opaque.  The additionalShading_ input assumes that all shade geometry is opaque and so you cannot use it to account for such shades.  Accordingly, you will need to account for it through the tranmissivity.\n\n\n\nIn the future, I may try to pull more information about blinds and glass properties off of the HBzones inside the view factor component but, for now and for the next few months, the above describes how it works.\n\n\n\nTheodore, for curved geometry, I think that your safest bet is going to be planarizing the Rhino geometry before you turn it into a HBZone (so you just divide the curved surface into a few vertical planar panes of glass that approximate the curve well enough).  This is essentially what the runSimulation component does for you automatically (it meshes the geometry as you see here: [https://www.youtube.com/watch?v=nMQ2Pau4q6c&amp;index=12&amp;list=P...](https://www.youtube.com/watch?v=nMQ2Pau4q6c&amp;index=12&amp;list=PLruLh1AdY-SgW4uDtNSMLeiUmA8YXEHT_)).  If I were to figure out a way to incorporate shades in this automatic meshing workflow, your EnergyPlus simulation would take a very long time to run and I am not even sure if the result will be that accurate with the way E+ abstracts shades.  So I don't think that it's really worth it over just planarizing the geometry yourself.\n\n\n\nLastly, I won't be able to figure out the problem with your current run Theodore, unless I get the GH file from you.  Make sure that you are using all up-to-date components.\n\n\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "February 20, 2015 at 7:21pm", "created_by": "chris", "parent_id": "reply_2985220_Comment_1227352", "id": "reply_2985220_Comment_1228564"}