{"body": "\nHi Mike,\n\n\n\nThank you greatly for the feedback.  Derin's and your thoughts are really helping refine the components. Now that I am understanding the hybrid workflows between the Honeybee components and current THERM capabilities, I wholeheartedly agree that the current means of inserting the WINDOW glazing system is far from ideal.\n\n\n\nI think that I may have found an implementation that allows for both an clear parallel with current THERM workflows but also affords the geometric flexibility that I was originally hoping to include with the ability to set any angle (not just the 4 orthogonal orientations).  Just to explain briefly the importance of the flexibility, it is possible and even common to have glazing systems that are at an slant to the vertical and, in a purely THERM workflow, you could just rotate the whole THERM model with glazing system before you draw the frame.  This same process will not work if you are drawing your frame in Rhino before exporting to THERM unless you have some means of rotating the glazing system geometry in Rhino/Grasshopper before your frame-drawing.\n\n\n\nNow to explain the implementation:\n\nThe _orientation_ input of the \"Import WINDOW Glz System\" component now takes one of four integer values, which reference the typical means of importing a glazing system into THERM:\n\n0 = Up<br/> 1 = Down<br/> 2 = Left<br/> 3 = Right\n\nThe _location_ input still has the same functionality to set a point for the location of the glazing system.  However this input can now also be a plane that sets the entire reference for the glazing system.  In this manner, you can rotate a plane before inputting it into the component to get any slant that you want.  In this example, I just set the plane to be the WorldXZ instead of the default WorldXY:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/b8ZVJ4Q*UlLT9*ZjlLWMKthfWgWj7pxj91s4Is**O-V91C0hvqRA6XtmUBpfzEdUICnvQPA6zNjZyWQEvZZXuXHNuCTcB4Wz/NewOrientation.JPG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/b8ZVJ4Q*UlLT9*ZjlLWMKthfWgWj7pxj91s4Is**O-V91C0hvqRA6XtmUBpfzEdUICnvQPA6zNjZyWQEvZZXuXHNuCTcB4Wz/NewOrientation.JPG)\n\nSee the attached file to use the updated component and let me know your thoughts on this.\n\n\n\nThanks again!\n\n-Chris\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1490584", "name": "Galzing System From WINDOW.gh"}], "created_by_name": "Chris Mackey", "created_at": "March 22, 2016 at 10:39pm", "created_by": "ChrisMackey", "parent_id": "reply_2985220_Comment_1489482", "id": "reply_2985220_Comment_1490583"}