{"body": "\nThanks Chris,\n\nI like my new friend ('**Ladybug_Adaptive Comfort Parameters**') :-)\n\nThe think is: The building in my case is one from the Bauhaus. Built at the 1930's. Absolutely no mechanical systems. So i have to rely completely in passive means.\n\nTo speed things i'm calculating comfort for Extreme hot/cold week, thinking maybe on typical weeks instead.\n\nThe cool week is kind of \"right\", but the hot (extreme) is giving all night hours 100% comfort. Knowing the climate, there is no way this can be the case. Some of the settings with the european standards give sometimes the right tendency, but still, compared to ASHRAE's the average of % percentage is too high.\n\nAlso my assumptions for flexibility of use/clothing/etc is the maximal. I mean, no constrains on this respect (\"let's be passive as much as we can\").\n\nSo right now i have no specific questions, but rather your advice, if any: \"What you would do ...?? (I don't like these kind of questions, sorry).\n\nA request, yes, if it is possible to output the set temperature for each hour. For instance, when you give the degFromTargetMtx i'll like to know this target. This is for control, and i think this is important for better understanding this black box.\n\nAny other insights you may have, just shoot.\n\n\n\nNot related to the discussion, but if you happened to check the model, we are simulating 2 apartments in the building. The northern one is only one thermal zone. The southern is divided in rooms. I wanted to see how much difference e get between both ways. And there is. No doubt the more detailed modeling looks more reliable. Also if you have some points here, shoot again.\n\n\n\nBTW humidity, look at  page 32-33 in the AC book. Nicol is clear on the \"real\" influence of the humidity, arguing it is mostly psychological than real.\n\nThanks again, and to you too Mauricio.\n\n-A.\n", "attachments": [], "created_by_name": "Abraham Yezioro", "created_at": "February 16, 2016 at 8:36am", "created_by": "AbrahamYezioro", "parent_id": "reply_2985220_Comment_1464150", "id": "reply_2985220_Comment_1464438"}