{"body": "\nHaha, yeah, this is one way to describe it. Finished Chris's HB tutorials, kinda got familiarized with the toolset but still have little idea what to do with it. Hopefully (hail!) Hydra will prove useful (pretty sure it will).\n\nHere is exactly where we need suggestions from you and other users. Please consider submitting issues for all the changes that you think can make Ladybug and Honeybee easier to learn and use. Now is the best time as we're almost re-writing everything.\n\nI dug up my github account, last time I was confused by its application, but I guess it's ok if I just post issues or comments (still a bit new to it, I'm not so savvy when it comes to social media XD).\n\nThe underscores are there for a reason. They indicate which inputs are required, optional or required with a default value.\n\nCan proudly note that I knew that, maybe it is my problem, but I tend to find them ugly or abnormal, something you see in the code, behind the scenes.\n\nI guess Python is case sensitive, but I think I'd express more sympathy to, let's say **all caps** for MUSTS, **upper case** for Important and **all lower** for the rest. \n\nAgain, purely personal preference that, I guess, relies on the hierarchy of the letters (maybe it is something one naturally gets from learning alphabetic languages, because I really miss this feature here in China). Maybe **italicize** the words or **bold** them?\n\nAgain, just suggestions, I donno anything about Python but I do know that it is not that simple with the code unlike in the Word.\n\nI'm not sure what do you refer to by blank inputs? Do you mean the separators? If that is the case then yes. That's the limitation that we currently have to group inputs.\n\nYeah, I see. I wonder if David considered adding something like separators to GH components or ability to rearrange the position of inputs (would be my personal wish))), because so far he left an impression that he considered everything and couldn't stick to all because of legitimate reasons XD.\n\n\n\nPersonally and I think many will agree, I would like to see fast and stable work first and \"prettification\" later. So can't and don't want to complain too much XD.\n", "attachments": [], "created_by_name": "Tim", "created_at": "February 18, 2016 at 02:29AM", "created_by": "Timur582", "parent_id": "reply_2985220_Comment_1464663", "id": "reply_2985220_Comment_1465812"}