{"body": "\ndear Chris and Mostapha\n\nI am testing the new version of Honeybee and Ladybug with a colleague and I still have some problems.\n\n1) I am sorry to say that the \"monthlyGrndTemps\" in the \"energySimPar\" command does not seem to work for me... I set that as a list (see the attached files) to get 21°C, but the .idf file always give me the default 18°C\n\n2) I am working with the \"additionalStrings\" parameter, that is really great to add new features (thank you soooo much for that!). Unfortunately, I still have a problem. As I told you before, I would like to change the section \"People\" of Internal Gains, because I need to add other features that I use in Energy+. Using the \"additionalStrings\", I added the schedules I needed and set up the \"Internal Gains\" as a text, and it worked fine, but now I have two different \"Internal Gains\": the default HoneyBee one and mine, attached to the same Thermal Zone... Even if I skip the \"HoneyBee_Set_Energyplus Zone Loads\", there is still a default Internal Gain that I cannot avoid (see the attached files). How do you think I can solve that?\n\nI know I cannot overwrite the HoneyBee components with the \"additionalStrings\", but can I remove the default Building programs of the Energyplus library, as I do with Openstudio?\n\n \n\nI don't know if that is possible, but on the \"Honeybee_bldgPrograms\" command, it would be great to have a \"none\" string corresponding to no default program settings (which, anyway, cannot be used for European standards).\n\nAnother idea that I have, but I don't know how feasible it is, is the possibility to insert new schedules or delete the default ones from the \"HoneyBee_Set_Energyplus Zone Loads\", with the \"Insert Parameter\" command. Of course, these are only suggestions form an end user: just to solve the problem in the easiest way for you would be awesome :))\n\n \n\nMoreover, there are a couple of new issues that I haven't experienced with the previous versions:\n\n1) from time to time (more or less every time I run a simulation or change something in the file) the \"Honeybee run Energy Simulation\" gives me this error: \"failed to find M in Library\", where M is either a material name or a construction name. If I connect again the same materials or constructions to the HBSurfaces, or I run the \"update this file\" command for HoneyBee and Ladybug, the error disappears, to come back again for apparently no reason (see the attached files).\n\n2) the \"SimControls\" command does not work anymore, as it does not change the simulation controls according to my true-false sequence (see the attached files).\n\n \n\nThank you so so much for your work, which is really useful... if you come to Italy sometimes, you know you have a beer paid from us ;)\n\nLetizia\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1260412", "name": "HB_TEST_1004.gh"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1260413", "name": "HB_TEST_1004.idf"}], "created_by_name": "Letizia Martinelli", "created_at": "April 10, 2015 at 09:22AM", "created_by": "LetiziaMartinelli", "parent_id": "reply_2985220_Comment_1257744", "id": "reply_2985220_Comment_1260411"}