{"body": "\nErnesto and Marco,\n\nI should probably have been clearer with my previous statement and what I mean by a \"good way\" to model completely custom shade geometry. First, Marco, if your shades have enough thermal capacity or resistance to be safe with the assumption that they are the same temperature as the air, then the use of the the \"EP Context Surface\" is a \"good way\" to model this custom geometry.  However, if the shades do not have this heat capacity or resistance, you may have to find another method.\n\n\n\nAltogether, there are at least 4 main ways of modeling shades in EnergyPlus:\n\n\n\n1) Custom geometry of whatever you want but this geometry will only be factored in the simulation by it's blocking of sun.  The temperature of the geometry will be assumed to be the same as the outdoor air (no emissivity or absorptivity is specified) and so it is really only intended for shading objects like other buildings, trees, or shades made of materials with a high heat capacity/resistance.  This is what the \"EP Context Surface\" does.\n\n\n\n2) Blind geometry for which the temperature of the surface will be calculated.  Here you can specify an emissivity and absorptivity for the blinds but you are limited to expressing only horizontal or vertical slats as your shades (no other geometries).  This is what the \"EnergyPlus Window Shade Generator\" does by default.\n\n\n\n3) Interior Roller Shades / Exterior Perforated Screen geometry for which the temperature of the surface will be calculated.  This is just like the blind geometry in that you specify the emissivity and absorptivity but here you are are limited to 2D shades that are parallel to the window plane. The \"EnergyPlus Window Shade Generator\" is also capable of modeling this type of shade.\n\n\n\n4)  Completely custom geometry for which the surface temperature of the shade will be calculated.  While this may seem like the best of all worlds, it is usually VERY time-consuming to pull off as you have to parameterize the geometry into a matirx of values for the amount of sun that is permitted for every sun angle.  OR you have a BSDF file that represents the properties of your shade ready to go.  This is what I meant previously by a \"good way\" to model custom shade geometry and I should have clarified that there is no easy way to generate this type of matrix.  EnergyPlus can model it if you have it, though.  At the moment, there is no specialized Honeybee component to generate this type of shade as it is already such a high amount of custom work that you should probably only attempt it if you know how to generate such a matrix or have the BSDF file.  To include this type of shade in the Honeybee simulation, you will have to write custom IDF text into a panel and connect it to the additionalStrings of the RunSimulation component.  For this custom IDF string, you will use the windowmaterial:complexshade object in EnergyPlus:\n\n[http://bigladdersoftware.com/epx/docs/8-3/input-output-reference/gr...](http://bigladdersoftware.com/epx/docs/8-3/input-output-reference/group-surface-construction-elements.html#windowmaterialcomplexshade)\n\n\n\nErnesto, I think that your case is probably well-approximated by 3) Interior Roller Shades / Screen geometry as it is really not that complex:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/rFmq0S5l0CJTMKQnWmNmQlR61oKZ41e-LNKNaW2ZuqC0XiXfn748ea8r1eSke2ahLsRBGsvEEPnF3w3FHXFweq2eiCbFdrJ*/NotComplexGeomtry.JPG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/rFmq0S5l0CJTMKQnWmNmQlR61oKZ41e-LNKNaW2ZuqC0XiXfn748ea8r1eSke2ahLsRBGsvEEPnF3w3FHXFweq2eiCbFdrJ*/NotComplexGeomtry.JPG)\n\nHere is an example file that shows you how to do both 2 and 3 of the above examples so that you can get this working in your file, Ernesto:\n\n[http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;for...](http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;fork=hydra_2&amp;id=EnergyPlus_Window_Shade_Generator&amp;slide=0&amp;scale=1&amp;offset=0,0)\n\n\n\nIf you are really feeling like this perforated screen approximation wont do you justice, here is an example of how to use the additionalStrings input to add a custom EP Object that does not have a HB component (in this case, I am adding an evaporative cooling tower):\n\n[http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;for...](http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;fork=hydra_2&amp;id=Evaporative_Cooling_Tower&amp;slide=0&amp;scale=1&amp;offset=0,0)\n\n\n\nHope this helps and is clear.\n\n-Chris\n\n\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "February 24, 2016 at 9:10pm", "created_by": "ChrisMackey", "parent_id": "reply_2985220_Comment_1468687", "id": "reply_2985220_Comment_1471159"}