{"body": "\nHi Anders,\n\n\n\n<font size=\"2\" style=\"font-size: 13px;\">Great to know that you started using Ladybug! I'm waiting for your awesome comments on Python scripts  optimization. Here are the answers:</font>\n\n\n\n<font size=\"2\" style=\"font-size: 13px;\">1. In theory, you should be able to use any units for input and the result will be always in SI! There is an internal conversion from Model Units to Meters. [Warning: I developed and tested the 'bug only in meters and I haven't tested it [</font>intensively<font size=\"2\" style=\"font-size: 13px;\">] for other units. I recommend you to use meters for now.]</font>\n\n\n\n<font size=\"2\">2. Correct! If you input a mesh the component will use the initial mesh as the test grid else it will be meshed based on the gridSize which you won't have full control...</font>\n\n\n\n<font size=\"2\">3. Correct! That's how you can minimize the time of the study to zero not calculating what you don't need to know! :)</font>\n\n\n\n<font size=\"2\">4. Correct! [and that's why the direction of the normal of the surfaces does matter. It should face outward.]</font>\n\n\n\n<font size=\"2\">5. You can do that but then the accuracy of the result could be questionable in some cases. As djordje said center points are the test points and probably you don't want all the glazing to be evaluated based on one single point in case the glass is partially shaded. I understand why are you doing that though and I will add the option to [average the result for each test surface](https://github.com/mostaphaRoudsari/ladybug/issues/25) similar to what I show in this video 22:27 ([http://www.youtube.com/watch?v=aoMy4O3vN6g](http://www.youtube.com/watch?v=aoMy4O3vN6g)), so you can subdivide the test surface and then get the average results for the surface.</font>\n\n\n\n<font size=\"2\">Best,</font>\n\n<font size=\"2\">Mostapha the gentle! ;)</font>\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "March 19, 2013 at 9:47am", "created_by": "mostapha", "parent_id": "topic_812250", "id": "reply_2985220_Comment_812724"}