{"body": "\nGreetings Fellow Solar MRT Adjustors,\n\nI am pleased to announce that the solar adjusting component now outputs radiant temperature in degrees Celsius instead of radiation flux.  This includes both a legend for the colored mannequin that is in perceived radiant temperature and an output of the perceived radiant temperature of each mannequin mesh face from the component.  This radiant temperature mesh face list corresponds to a list of mesh face areas that are also output from the component such that you can perform statistical analysis on radiant asymmetry over the mannequin to gauge whether a certain temperature difference across the mannequin is of concern.  An important limitation to recognize if you do this type of analysis is that it is assumed that every part of the mannequin has the same clothingAbsorptivity or albedo and, in reality, the absorptivity is likely to differ across articles of clothing and between clothing and skin color so the radiant temperature difference between mesh faces might be much greater.\n\nFurthermore, I have changed the analysisPeriod_ input to analysisPeriodOrHOY_ and this input can now accept specific hours of the year, which should make it easier to do point-in-time studies.  Reiner, I hope this helps with the studies that I saw you setting up and let me know if you experience any bugs or difficulties.\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/8HLa0OEkxj9PyI22AuzAPcViS0EEkl-iyEYwzz8PJN3N3b16aczg5ZunsrsnsvwgB1yhOiK2NiHiaX9*x-QY2EXcZm7dgYc*/NewSolarMRTComponent.PNG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/8HLa0OEkxj9PyI22AuzAPcViS0EEkl-iyEYwzz8PJN3N3b16aczg5ZunsrsnsvwgB1yhOiK2NiHiaX9*x-QY2EXcZm7dgYc*/NewSolarMRTComponent.PNG)\n\nLastly, I wanted to make a note relating to something that Bernardo asked, which was about the differences between the CBE method used in this component and its application to outdoor solar temperature adjustment.  I have realized that there is an important assumed factor in the CBE method, which is that the radiant heat transfer coefficient is about half of that of the convective heat transfer coefficient.  This is an ok assumption for most indoor conditions when you typically have low wind speeds and people lose about half of their heat to the radiant environment.  This assumption should also be ok if your final measure of comfort is with the PMV, Adaptive, or UTCI components, which will account for wind speed and air temperature in the heat balance.  However, if you are using this component and the CBE method to look at radiant asymmetry in the outdoors resulting from solar radiation, be aware that the MRT delta might not be as large as it seems because the wind speed can be much higher outdoors such that people lose much more heat to the air than the radiant environment.  I summary, I guess that there isn't much of a standard for radiant asymmetry outdoors anyway but I would caution using this component for outdoor radiant asymmetry studies.\n\nYou can find the new component in the attached GH file and you can get it in your LB toolbar by syncing with the github.\n\nEnjoy!\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "November 8, 2014 at 3:20pm", "created_by": "ChrisMackey", "parent_id": "reply_2985220_Comment_1163712", "id": "reply_2985220_Comment_1164407"}