{"body": "\nMaurico and Abraham,\n\n\n\nThis is a very interesting discussion here and a lot of good is coming out of it.  The heart of the issue comes from the fact that EnergyPlus calculates a custom U-Value for gas materials using a complex algorithm that accounts for convection of the gas depending on the thickness of the gap, the temperature difference across it, and the gas molecular properties.  Including this algorithm in Honeybee would involve a great deal of time but, if we are just looking for a back-of-the envelope estimate assuming fairly standard gap thicknesses (like 1 cm), this is relatively straightforward.  This 'back-of-the-envelope' estimate is what we had been doing for the air gap material but we had not included the other 4 gases used in windows.  I took a look at the properties of these gases in LBNL WINDOW and just added them to the Honeybee 'CalculateU-Value' function:\n\n[https://github.com/mostaphaRoudsari/Honeybee/commit/3152fda56f7301f...](https://github.com/mostaphaRoudsari/Honeybee/commit/3152fda56f7301f56057ce345b354ce8ea1661a1)\n\nNow you should see the U-value of a glazing assembly with krypton computed correctly by Honeybee in the attached file.  Note that all of your EnergyPlus simulations with Honeybee will be fine with whatever EP material you assign.  In other words, the production of a negative U-Value here was purely an interface error in HB and not a simulation one.\n\n\n\nOn another note, the inclusion of these EnergyPlus DataSets materials in the userCustomLibrary is something that I could imagine a lot of people desiring and so I have added the idf that you have built here to the Honeybee 'resources' folder in case anyone wants this feature in the future:\n\n[https://github.com/mostaphaRoudsari/Honeybee/blob/master/resources/...](https://github.com/mostaphaRoudsari/Honeybee/blob/master/resources/userCustomEPLibrary.idf)\n\n\n\nLastly, Mauricio, if you are interested in extending the types of glazing that you can run with Honeybee, I just added a new component in the last release that allows you to take any glazing assembly that you create with LBNL WINDOW and assign it to windows in Honeybee.  [LBNL WINDOW](https://windows.lbl.gov/software/window/window.html) includes a continuously-updated database with every type of glass and gas currently on the market and so you should always be able to find what you need there.  Here is an example file showing you how to use the new LBNL WINDOW component:\n\n[http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;for...](http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;fork=hydra_2&amp;id=Import_LBNL_WINDOW_Glazing_Assembly_for_EnergyPlus&amp;slide=0&amp;scale=1&amp;offset=0,0)\n\n\n\nGreat work, gentlemen!\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "February 02, 2016 at 07:10PM", "created_by": "chris", "parent_id": "reply_2985220_Comment_1452898", "id": "reply_2985220_Comment_1453523"}