{"body": "\nColin,\n\n\n\nWe selected the defaults of the ideal air system to be in line with what we thought were common low-energy practices but, if we are to be honest with ourselves, many of these practices have a bias towards higher-latitude climates where high humidity is less of a issue.  The defaults do not include any humidity control, use a differential dry bulb air side economizer, and use the ASHRAE 62.2 ventilation specification, which uses a sum of ventilation/square meter + ventilation/person.\n\nThe unfortunate side of these default specs is that there is always some ventilation coming in (because of the ventilationPerArea), which often means that you're bringing in outdoor air in unoccupied hours that have a thermostat setback, minimal heat gains, and no need for cooling. Running the ventilation system without activating the cooling coil can mean that you are bringing in very humid outdoor air sometimes, particularly in evenings.  As such, you may want to use only a ventilationPerPerson specification or use a ventilationSchedule to shut off the ventilation during these unoccupied hours (using the \"Set EnergyPlus Loads\" component or the \"Set EnergyPlus Schedules\" component respectively).  This might mitigate your peak cooling at 9PM as well as your higher humidity in evenings, particularly if your space is not occupied then.\n\nThe differential dry bulb economizer might also introduce more outdoor air when it is humid outside, resulting in more \"unrealistic\" humidity values.  As such, switching to a differential enthalpy economizer or removing the economizer altogether can avoid these cases of bringing in more humid outdoor air to cool the zone.  You can do this with the \"Set Ideal Air Loads Parameters\" component.\n\nIf both these methods don't give you humidity values that you are happy with, you can always put in humidity control by setting a maxHumidity on the \"Set EnergyPlus Zone Thresholds\" component.\n\n\n\nTo be fair to the ideal air system, you would have to consider these ventilation/economizer/humidity control specifications for almost any air-based system that you are designing and I do not see these initially \"unrealistic\" humidity levels as a limitation of the ideal air system as much as a limitation of typical high-latitude HVAC controls.  This said, I will fully admit the limitations of the ideal air system in terms of not giving electricity/fuel values (just loads) and the fact that you don't have a single multi-zone boiler/chiller supply air temperature as you would for a centralized HVAC system.\n\n\n\nTo get to your questions:\n\n1) The danger of looking at energy balance variables for only a single hour is that you might not get them summing to something close to 0, since you are running a transient simulation.  Over a day, you will be more likely to get values summing to 0 and (because of your building's thermal lag) you will also probably get a better representation of the cause of the peak cooling.\n\n2) There was a bug in the code and you are not supposed to get the HVAC outputs with the \"Read EP Result\" component.  You are supposed to use the \"Read EP HVAC Result\" component like so:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/a0gZpI6iXILtl-3SaZpy95kh*CTa4TgybwsbhdhBprpsVUZ5N2cqfOREeSRsG6Ygx1dwi3Q89FIB3pukU5Qmv3wKQXOqKrOS/HVACOutputs.JPG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/a0gZpI6iXILtl-3SaZpy95kh*CTa4TgybwsbhdhBprpsVUZ5N2cqfOREeSRsG6Ygx1dwi3Q89FIB3pukU5Qmv3wKQXOqKrOS/HVACOutputs.JPG)\n\nI have fixed this in the attached GH file.  In case you were wondering what those units are, they are Joules.  All energy results output from EP are in joules and I convert them to kWh inside the HB components since this is what we are typically using in the building industry.\n\n\n\n-Chris\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1488383", "name": "HVACOutputs.gh"}], "created_by_name": "Chris Mackey", "created_at": "March 19, 2016 at 02:05PM", "created_by": "chris", "parent_id": "reply_2985220_Comment_1487061", "id": "reply_2985220_Comment_1488382"}