{"body": "\nOk, I think that I have finally gotten to the bottom of this!  All of the components are correct and there is apparently a subtle yet important difference between Sky View Factor and Vertical Sky component.  According to the glossary of the (admittedly somewhat old) reference of [Sun, Wind and Light](https://books.google.com/books?id=vMVFp_7zlaIC&amp;printsec=frontcover&amp;dq=sun,+wind+and+light&amp;hl=en&amp;sa=X&amp;ved=0ahUKEwjwur7WzMvKAhXItBoKHRFBCw0Q6AEIJTAA#v=onepage&amp;q=sun%2C%20wind%20and%20light&amp;f=false), there are separate definitions for the two metrics.  They are as follows:\n\n**Sky Component** - The portion of the daylight factor (at a point indoors) contributed by luminance from the sky, excluding direct sunlight.\n\n**Sky View Factor** - The sector of the sky as seen from a daylight aperture or building surface.  It can be measured as either a fraction or as a three-dimensional solid angle.\n\n\n\nIt seems that we all thought these metrics were the same but it turns out that Sky Component is just a weird (and almost deceptive) metric.  Frankly, I can't understand what it is used for.  However, perhaps the even more deceptive fact is that the Sky component computed with a uniform Radiance sky is not actually using a perfectly uniform sky as seen here.\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/G6D6VGDF3GtWpuLYUiFAP5VshekR3kVrOy-Nbm0-9KuEMnLgpHWpbd6CiVLzcWCAf20ZZruNYNDQWDmoaOAN*vyr5x2xdI6E/NotActuallyUniform.JPG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/G6D6VGDF3GtWpuLYUiFAP5VshekR3kVrOy-Nbm0-9KuEMnLgpHWpbd6CiVLzcWCAf20ZZruNYNDQWDmoaOAN*vyr5x2xdI6E/NotActuallyUniform.JPG)\n\nSo we will always get VSC results that are not aligned with that which we get from the sky view components.  All of this and the fact that sky component seems to be an outdated metric makes me want to take it out unless someone can give a good reason for how it could do more good than the harm that it has done here in deceiving us.\n\nI still see important merit in keeping the sky view components as sky view is important for modelling the cooling down of surfaces at night as they radiate heat to the cool night sky.  Sky component just seems like an outdated daylight metric.\n\n\n\nLet us know your thoughts and I have opened up a github issue for further discussion:\n\n[https://github.com/mostaphaRoudsari/ladybug/issues/230](https://github.com/mostaphaRoudsari/ladybug/issues/230)\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "January 28, 2016 at 4:35pm", "created_by": "ChrisMackey", "parent_id": "reply_2985220_Comment_1448487", "id": "reply_2985220_Comment_1449370"}