{"body": "\nTheodore –  To answer your initial question \"is interior wall orientation crucial to energy simulation in multi-zone models?”. Answer: Yes, very.\n\n\n\nEnergyPlus needs to know what bounds each thermal zone and which side of the surface “outside” is, and E+ knows this by the order vertices are entered.  E+ requires surface normals to be oriented uniformly (facing outwards, away from the individual zone volume) and all thermal zones need to be fully enclosed, defined by its own set of surfaces.\n\n \n\nTherefore, a two zone model with a shared wall requires the dividing wall (ceiling/floor) to be defined for each zone independently.  Although these surfaces will have the same x,y,z coordinates and occupy the same plane, E+ will see them as boundaries defining each individual zone so wall assemblies can be applied and the energy transfer calculated correctly.  Omitting one shared plane will result in E+ throwing errors at you.\n\n \n\nTaking this a step further: if a ceiling in thermal zone Z1, has a thermal zone above it (Z2) that occupies only a portion of the total surface area of the ceiling, with the remaining area as a roof, the “outside” boundary conditions for Z1 ceiling varies (part is a ceiling/floor of Z2 and the other is ceiling/outside) and E+ needs to know this by dividing the ceiling surface accordingly.  Thus your ceiling of Z1 will need to be made of two planes one that relates to the floor of Z2 and one that is ceiling/roof material.  In other words; when adjacency conditions of a zone’s surface changes, E+ needs to be informed of this condition by defining a new surface.\n\n\n\nIt may be too late in the night to try to write technical explanations, so I hope this explanation helps clarify rather than confuse.\n\n \n\nCheers\n", "attachments": [], "created_by_name": "JPE", "created_at": "May 7, 2015 at 12:08am", "created_by": "JPE", "parent_id": "reply_2985220_Comment_1281801", "id": "reply_2985220_Comment_1282035"}