{"body": "\nSorry for the long post, but I think this topic is very important.\n\n \n\nI agree with Abraham. Pollinator or Design Explorer are great ways to analyze iterative studies. These data viewers allow easy sorting/exploration of the data but they don't provide detailed statistical analysis.\n\nCurrently, one of the limitations with Pollinator/Design Explorer is that it relies on the user to find the patterns. Often those patterns simply boil down to \"this parameter is most important.\" That is amazing to have, but I'm sure some there are algorithms out there that could rip through the data to quantify how much more important one parameter is than another. Or identify those parameters/outputs that are statistically significant (or irrelevant). Did you include enough iterations to draw sound conclusions? What about an algorithm that exposes trends/patterns that are less apparent? Is this the kind of sensitivity analysis you are working towards? If so, I'd love to know more.\n\n \n\nIt sounds like you have the automation part down, but I'll include the following for anyone else who is interested in doing this. I recommend automating a parametric model to run individual iterations one after the other (in series) rather than generating many models at the same time (parallel). Components like Brute Force or Octopus will automate sliders to update your model using your chosen input parameters. This creates the \"re-input\" you are looking for to trigger a new HB calculation. I like to connect integer sliders to stream gate components to create more complex data flows and limit the number of iterations I'm testing. For example, you can use a single slider to control multiple stream gates, updating many input parameters at a time with specific values. Rather than test every combination of every input parameter (this compounds quickly), you can test only those combinations you care about. Stream gates allow you to iterate through geometry options as well as numerical input parameters.\n\n \n\nOnce a single run has completed, you can save the input parameter settings and output values to an excel or json file or use a data recorder component to store the values in GH. Pollinator or Design Explorer then allow you to analyze all that data.\n\n \n\n \n", "attachments": [], "created_by_name": "Leland Curtis", "created_at": "January 21, 2016 at 08:29AM", "created_by": "LelandCurtis", "parent_id": "reply_2985220_Comment_1443454", "id": "reply_2985220_Comment_1444164"}