{"body": "\nHi Burin,\n\nThanks for looking into this and clarifying what the boolean toggle options does for the IDF.  I am sorry for not explaining this in my initial response.\n\nTo be honest, I am still confused by the results myself and I am open to changing the name/description of the input based on what you have found here.  modulateFlowOrTemp is not the best name for what seems to be going on and we should change it to reflect more what is happening in the IDF.\n\n\n\nHere is how I am understanding the results of the different cases:\n\n1) When the variable flow option is selected (and the outdoor air set to \"None\"), the heating and cooling of the space seems to happen only through re-circulation of the indoor air.  My comparison to a VAV system was not appropriate and perhaps it would be better to compare it to a window air conditioner or a warm air furnace, which, as far as I understand, only re-circulate indoor air and do not bring in outside air.\n\n2) My reasoning for the name modulateFlowOrTemp came mostly from my realization that the supply air temperature remained within the defined limits when  the variable flow option is selected (and the outdoor air set to \"None\").  When the outdoor air was set to Maximum or Sum, the supply air temperature went way out of the temperature limits that I initially set.  I realize now that the flows are varying in both cases and the name of the input really must change.\n\n3) I think that the reason why we don't see any effect from the air side economizer is because the heating/cooling energy results that you get from an ideal air system are just the sum of the sensible and the latent heat added/removed from the zone by the system. This value of heat added or removed from the zone does not change whether the added/removed heat comes from outside air or from a cooling/heating coil.  Since there is no cooling coil or boiler or chiller in an ideal air system, there is no way to request an output of the energy added/removed by such a coil or chiller as opposed to that removed/added by outside air.  In other words, the air side economizer option on the ideal air system is practically useless because it does not help us differentiate the cooling that comes from the outside air vs. that which comes from a coil.  All that it does is change the outdoor air fraction while keeping the reported cooling/heating values the same.\n\n\n\nPlease let me know if you think that this explanation makes sense, Burin and, in light of all this, I am very interested in your suggestions.\n\n\n\nFrom my own perspective, I am now convinced that the default should definitely have the outside air requirements set to \"None\" since, otherwise, we cannot distinguish cooling/heating that happens from addition of outside air and that which must be supplied by a coil.  At least when we get rid of the outside air requirement, we can be sure that the ideal air system values are only showing heating/cooling from a coil or HVAC system.\n\n\n\nI have decided to remove the airsideEconomizer input since it seems to give misleading expectations.  I am going to recommend here on out that, if you want to estimate the effect of increasing outside air on cooling, you should use the \"Set EP Airflow\" component, use fan-driven natural ventilation, and you should connect a custom CSV schedule of airflow.  You will have to create such a schedule with native GH components using the outside air temperature, your zone setpoints, and the times that you are cooling in your initial run of E+.  Either you do this or you set up a full-blown system with OpenStudio.\n\n\n\nI have also decided to get rid of the heatRecovery input since it seems like this will also produce misleading expectations by the same logic.\n\n\n\nLastly, I am going to change the name of the modulateFlowOrTemp_ input to outdoorAirReq_.  The default will be to have no indoor air requirement as stated above but you can input either \"maximum\" or \"sum\" to have the IDF run accordingly.\n\n\n\nLet me know if this sounds good or if you have suggestions.  Updated GH file attached.  The github has the new Ideal Air Loads component.  Make sure that you have sync correctly and restart GH after updating your components.\n\n-Chris\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1233906", "name": "05_HVACIssues_CWM2.gh"}], "created_by_name": "Chris Mackey", "created_at": "March 01, 2015 at 02:11AM", "created_by": "chris", "parent_id": "reply_2985220_Comment_1233761", "id": "reply_2985220_Comment_1233905"}