{"body": "\nThank you.\n\nLadybug Photovoltaics components sometimes can have a couple of purposes, depending on the situation. This is one of those situation.<br/>\"TOF\" component in general should be used to calculate the TOF and TSRF indices. They show, how \"distant\" is your **_PV_SWHsurface** from the optimal **_PV_SWHsurface** surface in terms of tilt and azimuth angles.<br/>However, in your case we are not interested in TOF and TSRF indices. We would just like to know what are the **_PV_SWHsurface** optimal tilt and azimuth angles, regardless of the supplied **_PV_SWHsurface**.\n\nSo the circular surface supplied to the \"TOF\" component's **_PV_SWHsurface** input is irrelevant. It can be of any area, and any tilt/azimuth angle.<br/><br/>The **PV_SWHsurfacesArea** output of the \"PV SWH system size\" component depends on a couple of factors:<br/>**moduleActiveAreaPercent_** (leave it at 90%).\n\n**moduleEfficiency_**,\n\n**systemSize_**.<br/><br/>Calculation of **systemSize_** depends on your electricity demand, cost of the PV system, type of the object, country, local regulations etc. This is something that an engineer needs to determine.<br/>For example, in USA for a residential house in the Sunbelt, depending on finances, a household would try to cover 100% of its annual electricity needs with their PV system. Which means that the **systemSize_ **you chose needs to cover the annual electricity consumption. You can perform EnergyPlus simulation or use any other way to get the annual electricity consumption.\n\nLadybug \"Photovoltaics Performance\" component can calculate the optimal **systemSize_** by given the annual electricity consumption.<br/>However the component is made to address fixed tilt and azimuth PV systems only.<br/>An approximate way to overcome this is to calculate the optimal **systemSize_** for fixed tilt and azimuth PV system, and then multiply it with the \"difference in %s\" panel at the very right of the **fixed_vs_tracker_PV2.gh** file. Again, this is not what Ladybug \"Photovoltaics Performance\" component is made to do, but it will probably get you in a ball park.<br/><br/>\n\nInputted 32 degrees for north_ direction is actually 328 degrees.<br/>This is due to Ladybug Photovoltaics being based on NREL model which uses clockwise angles convention. This convention is also most commonly used in solar radiation analysis.\n\n<br/>Dubai weather data files are uploaded in [here](https://www.dropbox.com/s/fcep5p3i2594wxn/ARE_Dubai.Intl.AP_MN6.zip?dl=0).\n\n\n", "attachments": [], "created_by_name": "djordje", "created_at": "November 23, 2016 at 5:29pm", "created_by": "djordje", "parent_id": "reply_2985220_Comment_1644987", "id": "reply_2985220_Comment_1645164"}