{"body": "\nHi Chris,\n\n<br/>Thank you for the useful comments!\n\nJust a couple of comments based on last two replies.\n\n<br/>MENEX model, which I believe is approximating the geometry of the human body with a cylinder and only differentiating between a few solar angles.\n\nI believe that this is correct although some equations could have been derived by assuming the body to be a plane. This is very usual approach when estimation of the radiation absorbed by a person is conducted.\n\n\n\nI think that the use of the globalHorizontalRaditiaion formula instead of the one that separates direct and diffuse radiation might be causing the thermal comfort indices component to underestimate the amount of shortwave radiation on the occupant by a small amount.  This said, the occupant geometry can influence the amount of shortwave radiation so much that I think this underestimation is fine given all of these typical unknowns of occupant geometry.\n\nThis could be the case, although noticed, the final difference between global and direct,horizontal,reflected radiation usage is small.\n\n\n\nThe Thermal Comfort Indices component was giving much lower MRT values because it accounts for the fact that the sky (in the absence of sun) tends to be at a much lower perceived temperature than the air at Earth's surface or the ground (since the temperature of clouds and other objects higher in the atmosphere are cooler than those at the surface). The great misleading assumption that I have been making in my example files is that, by plugging in the EPW dryBulbTemperature into the \"solar adjusted temperature\" component, I have been assuming that the temperature of the sky is the same as the temperature in the EPW air, which is almost never the case for the reason that I just stated.I have just added an option for a long wave radiation balance into the \"solar adjusted temperature\" component with [this github commit](https://github.com/mostaphaRoudsari/ladybug/commit/2261a222787f42016a763208f9da7b04f339bdca).\n\n<br/>It is important to notice that the current Solar Adjusted Temp Stefan Boltzmann formula is now treating the sky to be a gray body of a constant emissivity coefficient.<br/>Due to cloud cover, the emissivity coefficient of the sky is constantly changing. Therefor the constant emissivity coefficient of 0.95 may result in underestimation of the actual incoming long-wave radiation at all the time when the sky is not clear.<br/>My modest suggestion would be to use some empirical sky temperature formula from the ones attached below instead.<br/>There are of course other formulas, but it looks like Swinbank Cole and Berdahl Martin seem to be popular in USA.\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1534650", "name": "Ts__SwinbankCole_BerdahlMartin_Melchor.zip"}], "created_by_name": "djordje", "created_at": "May 21, 2016 at 6:46am", "created_by": "djordje", "parent_id": "reply_2985220_Comment_1533903", "id": "reply_2985220_Comment_1534649"}