{"body": "\nHi Ji,\n\n\n\nThanks for sharing this, glad to see that you have are running whole simulations now! The results look ok, wake regions are where they are supposed to be. Ofc, I can tell the mesh quality is still quite rough.\n\n\n\nI went through your attached log but it seems to be a successful run, perhaps the error log wasn't attached. In any case, I believe we have identified this issue. The goal of the update fvSchemes component was to apply schemes to finalized meshes in an automatic way. While this is useful for new users it is also a dangerous thing to do in CFD studies.\n\n\n\nThe component works by relating mesh quality to the mesh non-orthogonality, which the checkMesh component reports. While non-orthogonality is one of the important criteria of mesh quality it does present difficulties on some kind of meshes, especially like the simple cases that BF has been meshing so far.\n\n\n\nThe example case of simple box buildings in a wind tunnel above for instance will appear as a good quality case for even the lowest of cell-count meshes, simply because it is an orthogonal geometry. That means that checkMesh will probably report low values (imagine an empty blockMesh of 10m blocks has a non-orthogonality of 0) which in turn means that higher order schemes might be paired with actually low quality meshes. This I believe is causing problems. \n\n\n\nI posted a possible solution to this here [https://github.com/mostaphaRoudsari/Butterfly/issues/57](https://github.com/mostaphaRoudsari/Butterfly/issues/57). The idea is that Buttefly provides additional options to the users, enabling them to choose between first-order (faster, more robust, but lower quality schemes) and second-order (slower, less robust, but more accurate) schemes depending on mesh quality, stage of assessment, etc. In cases like the above mesh quality a first-order scheme might provide a better option. To test this I am attaching an fvSchemes file you can use by replacing yours in the /system folder of the case. \n\n\n\nAs a note however, I would like to stress there is so much that a tool like Butterfly can provide in this area. Meshing is a quite complicated and demanding part of the process, involving a lot of trial and error. Sometimes the problem is just the mesh and not the solution options (GIGO stands true in CFD as well). It does however get easier with experience. The safe advice is the simplest one: when changing solution options doesn't help, refine mesh and run again.\n\n \n\nKind regards,\n\nTheodore.\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1589262", "name": "fvSchemes"}], "created_by_name": "Theodoros Galanos", "created_at": "August 27, 2016 at 01:59AM", "created_by": "TheodorosGalanos", "parent_id": "topic_1589319", "id": "reply_2985220_Comment_1589260"}