{"body": "\nHey guys\n\nDon't get me wrong here. I'm not trying to invent something radically new. And this thread has taken a completely new direction. I am as you know using the great tools Honeybee and Ladybug they provide all the means to what I try to achieve.\n\nWhat I need is to get a fast (as possible) evaluation of passive heat/solar gain from a certain facade. I know my building can cool to a certain degree (lets say 80 W/m2 - now lets forget other internal gains) and I want to be sure my facade is not letting **excessive amounts** of heat into the room/building. Normally I would make a full blown simulation to count my overheating hours and thereby evaluate my facade. To speed up the process, the idea is just to evaluate overheating hours in a faster way. So what I am thinking is that **excessive amounts** may estimated by counting high intensity irradiation patches in a **critical sky-component** or whatever such thing would be called that surpasses my sensible cooling load. My hope is that any facade visible to the sky-patches would very similar to the number of overheating hours if properly calibrated to a simulated model. However I have no idea right now, if this can be done.\n\nWhy do this? Speed, convenience, whole building thermal analyses. \n\n@Chris and @Abraham The **critical sky-component** is made with LBs radiance component radiation and filtering the beam-components with highest effects from a yearly epw-file. \n\n@Chris Conductive heat gains are also important especially if the facade is badly insulated, so the next step is to filter the outdoor temperature parallel with that critical sky-component and then do a static heat transfer analysis and combine that with the effect from direct sun influence. Again, no idea if it works.  \n\nHope it makes sense. I a little embarrassed I drew you into this little experiment. This was not at all the point of the discussion. But now we are into it I like to know what you think. If it works its kinda neat, at least i think it is.\n\n/K\n", "attachments": [], "created_by_name": "Kristoffer Negendahl", "created_at": "November 17, 2014 at 12:32PM", "created_by": "KristofferNegendahl", "parent_id": "reply_2985220_Comment_1170461", "id": "reply_2985220_Comment_1170409"}