{"body": "\nThanks for posting, Theodore , and thanks, Abraham, for posting a good response,\n\nQ1. I am on Abraham's side here.  The component gives you wind speeds and wind vectors at the heights of each of the arrows.  Not sure if you are asking for something else here.\n\nQ2. Abraham got this one too.  You will have to connect the hourly wind directions to annualHourlyData to use the conditional statement like this.  You can also create a wind profile for a single hour with the HOY input (if that is what you meant by zero for every hour except for one).\n\nQ3. I originally had a log law implemented with the component but decided to abandon it because it does not appear to be a standard in architectural environments (EnergyPlus, CONTAM, COOLVENT and a lot of other building airlfow modelers all use a power law).  The only place that I have seen a Log law used is in climatology and meteorology.  Perhaps I can bring the log law back as an option if there's enough of a reason for it.  Is there a particular reason why you want to use the log law?\n\nQ4. I think that I just understood what you meant by log law.  I remember seeing a recent presentation of urban climatology that was suggesting that, in dense urban environments, you should describe the wind speed change with a kind of 2-profile method (one relationship for the urban canyons where the wind is very low and another for the space above the average height of surrounding buildings, which tends to follow more of a power law).  If this is what you meant by Log Law, I could probably implement something like this but I have not found enough literature on the subject to be able to do so (I only saw it in a presentation).  Theodore, if you post a paper that could help me understand how this log law is calculated, I can implement it.  Calculating the average height of buildings from Rhino geometry is easy so, if we get the first part implemented, this second part about building heights should be easy.\n\nQ5 (I think).  I am not so sure what you mean by roughness here.  Do you mean a roughness length (the height above the ground above which the wind speed is above zero)?\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "March 11, 2015 at 10:39PM", "created_by": "chris", "parent_id": "reply_2985220_Comment_1240844", "id": "reply_2985220_Comment_1240804"}