{"body": "\nAntonio,\n\nThank you for your post and I understand much better what you are trying to do now given this information and your post here:\n\n[http://www.grasshopper3d.com/group/ladybug/forum/topics/design-buil...](http://www.grasshopper3d.com/group/ladybug/forum/topics/design-builder-cannot-import-gbxml-generated-by-grizzlybear?commentId=2985220%3AComment%3A1357549&amp;xg_source=msg_com_gr_forum)\n\n\n\nAt the moment, I have only implemented a simple way of using air walls in EnergyPlus, which basically mixes the air between zones joined by an air wall at a constant mixing rate (this mixes both the temperature of the zones and the humidity between the zones).  This simple way of using air walls is what DesignBuilder does by default until you set the natural ventilation to be \"calculated,\" in which case DB with try to build an Airflow Network for you.\n\n\n\nThese simple inter-zone mixing objects are separate from the natural ventilation objects currently implemented in Honeybee and these simple natVent objects operate on a zone-by-zone basis.  Because Honeybee assigns these nat vent objects (as well as a lot of other things) on a zone-by-zone basis, this was also how I implemented the interZoneAirFlowRate, although I understand that this makes things very confusing and also limiting.  So, right now, you can only use the interZoneAirFlowRate to increase or decrease the total air flow between one zone and all of its neighbors and you cannot yet specify a different flow rate to each zone that it is adjacent to.  If this sounds confusing, the readMe output of the setEPNatVent component should always give you detailed information on how these mixing objects are being changed as you play with the interZoneAirFlowRate value.\n\n\n\nI was planning to never bother with providing the ability to set different mixing levels for different adjacent zones as I was hoping to just implement the Airflow Network in Honeybee (thereby eliminating the need for such a messy method).  At present, though, I have been able to model all of my natural ventilation cases well with just the simple objects and so my motivation to implement the AFN hasn't been as high as I was initially expecting.\n\n\n\nI can try to get around to implementing the AFN but it is still going to be a while given everything else I have on my plate.  The AFN might also be overkill depending on how complex your building is and uploading a GH file of your energy model would enable me to better help you.\n\n\n\nIf you really need the capability to set different mixing objects for different zones right now, you can try to override everything by putting you own mixing objects into the 'additionalStrings\" input of the \"Run Simulation\" component.  I give you an example of how to input such a mixing object in the attached file.\n\n\n\nHope all of this helps,\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "September 12, 2015 at 2:29pm", "created_by": "ChrisMackey", "parent_id": "reply_2985220_Comment_1358775", "id": "reply_2985220_Comment_1360388"}