{"body": "\nDjordje,\n\n\n\nThanks for all of the information and I apologize for the late reply.  I agree that we are improving the components with each iteration and hopefully this reply will count as another one!\n\n\n\nI have come to realize thanks to your publications that I have been abusing the word \"sky temperature\" to mean something other than how it is traditionally used.  I was using it to refer only to the long wave radiation loss and not to the full radiative balance to the sky.  As such, I will refrain from using this term here on out.\n\n\n\nMore importantly, a very knowledgeable friend of mine who maintains the [Urban Weather Generator](https://github.com/hansukyang/UWG_Matlab) just recently enlightened me to the fact that all EPW files that contain radiation (which is essentially all EPW files for our purposes) also contain actual recorded values for the long wave ambient (La) term that we have been trying to derive from relative humidity, cloud cover, and air temperature.  Specifically, the field is called \"Horizontal Infrared Radiation Intensity\" and you can see it shows up in the EPW documentation as field N12 [here](http://bigladdersoftware.com/epx/docs/8-3/auxiliary-programs/energyplus-weather-file-epw-data-dictionary.html).  My friend was using this infrared value from the EPW to simulate urban heat balances and he told me that this is more accurate than trying to derive the radiative loss from humidity and cloud cover as this measured value already accounts for all things the could prevent long wave loss to space (including cloud cover and wayer vapor among other smaller things).  As such, I have modified the \"Import EPW\" component to now bring in this infrared data with [this commit](https://github.com/mostaphaRoudsari/ladybug/commit/d3d92748c10c18aaa4972072ae82ba94d8a96e0f).\n\nI did a quick validation for myself comparing the values from the formula that you posted here, Djordje, and the measured values in the EPW file.  You can run this validation for yourself in the attached GH file and, from the image below you can see that both the formula from the Maykut and Church model and the EPW values are relatively close:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/kpFJ*-3Tpnv8aVpmph*hTQF6NCP0evhIt*OTAgCvM1n2gs4nkF9gw0ePtN5IjicJMEnCRyIdDODJn14QgS8F7YG5M2EDvOZv/ValidationofDownwellingRad.JPG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/kpFJ*-3Tpnv8aVpmph*hTQF6NCP0evhIt*OTAgCvM1n2gs4nkF9gw0ePtN5IjicJMEnCRyIdDODJn14QgS8F7YG5M2EDvOZv/ValidationofDownwellingRad.JPG)\n\n\n\nSince I trust my friend who runs the UWG and my general instinct that a physically measured value is probably more accurate than one derived from other measurements, I will replace the outdoor long wave functions in all of the comfort maps with these infrared values from the EPW.  I will also change the \"Solar Adjusted Temperature\" component to take this long wave radiation and an input instead of the relative humidity.  I will post back here once I do so, which should be relatively soon.\n\n\n\nI feel that another update of all of my example files is due but the error does not seem as large as my previous one and so I will just aim to have all example files updated by the next stable release in a month.  Djordje, I also want to hear your thoughts on this method before I make such a big move of changing the example files.\n\n\n\nAnd thanks again, Djordje, for all of the knowledge.  This is shaping up to be a major learning experience for me.\n\n\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "June 7, 2016 at 6:02pm", "created_by": "chris", "parent_id": "reply_2985220_Comment_1537960", "id": "reply_2985220_Comment_1543496"}