{"body": "\nYalda, Mostapha and Antonello,\n\n\n\nI just wanted to make you aware of a related project that I have been working on that also should be better coordinated with Mostapha's efforts and I think will help with Yalda's issue here.\n\n\n\nThe impetus for this related project is that there are thousands of weather file stations in the world that are producing publicly-available hourly data but have either not been running long enough to generate EPW files, have a few hours where there are gaps in the data, or are not keeping detailed radiation records that are required to produce EPW files.   A full map of these weather stations (and links to order/download their data) can be found on the National Climatic Data Center (NCDC) website here:\n\n[http://gis.ncdc.noaa.gov/map/viewer/#app=cdo&amp;cfg=cdo&amp;theme=...](http://gis.ncdc.noaa.gov/map/viewer/#app=cdo&amp;cfg=cdo&amp;theme=hourly&amp;layers=1&amp;node=gi)\n\n\n\nI have been working on a component that can take the hourly data downloaded from the map database above and produce an actual-year EPW file for any station on the map if you have a base EPW file for a nearby location.  The main reason why I need the base EPW file is that many of these stations are not recording detailed radiation data with a pyranometer but they are often keeping detailed records of sky conditions like cloud cover and visibility (especially if they are airport weather stations).  By finding the correlation between these sky conditions and radiation in the initial base EPW file, I have been hoping that I can a pretty decent estimate of radiation for the weather station that is only recording sky conditions.  So far, the results look really promising but I really should quantify the percent error of this method before distributing it widely.  I followed this method to create an actual-year weather file for Paris in the deadly 2003 European heat wave as you see here:\n\n[http://www.payette.com/post/2963956-perspective-international-clima...](http://www.payette.com/post/2963956-perspective-international-climate-summit)\n\n\n\nGiven the opportunity to test this for another case, Yalda, I have produced an actual-year EPW file of 2015 for what I think is your site (assuming that the ARDAL you are referring to is the Ardal in Iran and not the one in Norway or India).\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/WYFQ5Cc97gospQ1iUsBhpYYIsWFrXOR8EEDTTO*L3qqMBZbOMcrcui9L9TQC6sDLc1W5tjOV*1e7ndjRsVxJRjLgV4CD3OBw/NCDCConnection.JPG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/WYFQ5Cc97gospQ1iUsBhpYYIsWFrXOR8EEDTTO*L3qqMBZbOMcrcui9L9TQC6sDLc1W5tjOV*1e7ndjRsVxJRjLgV4CD3OBw/NCDCConnection.JPG)\n\nFor some reason, the peak temperatures in the NCDC records of Ardal are coming much earlier in the day than the nearby Esfahan.  I am positive that this is something reflected in the NCDC and the WMO's records.\n\nYou can find the EPW file attached along with the GH file that I used to generate it and the 2015 text file that I downloaded from the map database (Shahr Kord).  The the base EPW file that I used is from the US DoE database (Esfahan).\n\n\n\nI am planning to release this component for connecting to the NCDC database with Dragonfly (the new insect that I have been working on to extend the capabilities of LB+HB).  If any of you test out this workflow or have any feedback, please send it to me or post here.\n\n\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "March 05, 2016 at 02:23PM", "created_by": "chris", "parent_id": "reply_2985220_Comment_1477276", "id": "reply_2985220_Comment_1478034"}