{"body": "\nAbraham,\n\nGlad to hear that you are making the full jump to Ladybug and I hope that I can help in the process!\n\nI probably could have been clearer in that previous discussion that the climate consultant strategies that I did not implement on the psych chart were because I thought that the Climate Consultant methods really mis-represented them.  This was definitely the case for the \"shading\" polygon, which never really made sense to me and, in the case of building shading, it is really too orientation-specific to be represented on the chart.  I could imagine psych chart polygons describing the MRT delta of someone sitting in the sun vs shade  but this is probably better represented using two comfort polygons with high/low MRTs (derived from the solar adjusted temperature component) rather than a specific strategy polygon.  Also the natural ventilation polygon in climate consultant seemed to do more damage than it helped.  I always thought the actual \"comfort\" polygon was a better representation of natural ventilation's potential than any other possible strategy polygon.\n\nFor the three strategies that you cite there, we have a \"Thermal Mass + Night Vent\" polygon in the current psych chart (let me know if I'm mis-understanding your \"thermal mass\" reference). I felt that the climate consultant method was a fair here, although it had some important limitations that are built into the psych chart methods.\n\nAs for the last one (passive solar heating), I agree that this should have a spot on the chart.  Now that I've had time to think about it, I can see a good representation of this as long as the user connects up the \"globalHorizontalRadiation\" to the annualHourlyData.  I'll try to implement this as soon as I get the chance (hopefully before the semester starts):\n\n[https://github.com/mostaphaRoudsari/ladybug/issues/412](https://github.com/mostaphaRoudsari/ladybug/issues/412)\n\nAre there any other important polygons that I am missing?  Also, remember that I added some polygons that climate consultant did not have (like desiccant dehumidification and occupant use of fans). Any new ideas for polygons are always welcome.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "August 21, 2017 at 09:23PM", "created_by": "chris", "parent_id": "reply_2985220_Comment_1801571", "id": "reply_2985220_Comment_1801648"}