{"body": "\nHi Saeed,\n\n\n\nI have never done this myself but I can offer my thoughts on this.\n\n\n\nThe way I see it there are two optimization workflows. One has to do with an automated optimization of alternative scenarios through usually evolutionary algorithms like Galapagos or Octopus. The other has to do with a kind of brute force technique that goes through ALL possible design iterations and produces results for each one.\n\n\n\nIt might sound weird, but it seems to me that the evolutionary optimization techniques are better suited for later stages of development where most of the variables have been semi-locked in and the program can be allowed to show us the best alternative. But used during early design it kind of turns the whole design improvement process into a black-box which doesn't seem right to me. Maybe other users have comments on this.\n\n\n\nIn terms of time I do believe that both techniques have similar demands, although evolutionary techniques might arrive to an end result faster due to the selection process. Setting up the second method also takes a bit more time in order to create the GH structure that saves and stores results for each iteration.\n\n\n\nThe advantage of the second technique is that it enables you to browse through all results and make conscious decisions based on several different parameters and parameter ranges (which very often change during design). To do that you can use TT's DesignExplorer utility which Mostapha also worked on ([http://tt-acm.github.io/DesignExplorer/](http://tt-acm.github.io/DesignExplorer/)). In practical cases this is invaluable, because it is something you can show to a project team and work with them to improve the design.  The second advantage of this method is that you don't actually need to create your algorithm :)\n\n\n\nBut be careful! The number and range of the parameters will exponentially increase the time required. Although this is an issue with both methods.Thankfully the Fly! component in HB, which is used to run all iterations, will inform you of that before you run. Try searching the forum for keywords that apply to this and you can find a few definitions shared.\n\n\n\nHope this helps! Good luck in your study! Let us know how it goes.\n\n\n\nKind regards,\n\nTheodore.\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "October 18, 2016 at 11:40PM", "created_by": "TheodorosGalanos", "parent_id": "topic_1620881", "id": "reply_2985220_Comment_1621229"}