{"body": "\nHi Aristo,\n\n\n\nFirst, to reply to your numbered comments:\n\n1. Flux in lumens, as reported within the IES file, is currently displayed through the luminaireDetails output. I wasn't quite sure if candela values are of any use from a display perspective as some IES files tend to have upwards of a 1000 numbers. That is why the candela values are visualized in the Rhino viewport.\n\n\n\n2. Did you check out the (relatively) new Honeybee_IES Project component? It does produce a Bill of Quantity and also allows an export to Excel. I have explained this here: [http://www.grasshopper3d.com/xn/detail/2985220:Comment:1474434](http://www.grasshopper3d.com/xn/detail/2985220:Comment:1474434)\n\n\n\n3. Eulumdat to IES is an easy fix. I wasn't aware that anybody had tested this using Eulumdat files. I will add this feature when I update the code next time.\n\n\n\n4. Can you describe this simulation? The time taken by the simulation itself should not be that long because Radiance ( the calculation engine) has optimization algorithms to tackle multiple sources. My comment about multiple sources had more to do with Rhino than HB itself.\n\n\n\n5. What do you mean by material design ? As in textures for surfaces?\n\n\n\nNow, with regards to future work, we don't have a road-map of sorts at present as personally I am not quite sure about what might be useful to people who work exclusively with electric lighting. Most of the (vocal) users of Honeybee tend to be interested in Daylighting and that is where our development efforts have centered over the past year. You can read more about it [here](https://www.radiance-online.org/community/workshops/2016-padua/presentations/213-SadeghipourSubramaniam-AutomatingWorkflows.pdf) and [here. <br/>](https://docs.google.com/presentation/d/1F94HVkpEDKpPWHAiDYfbm_0VBk6P745oT8ihViFlq8Q/edit?usp=sharing)\n\nIf there is some sort of consensus-based opinion from lighting designers on what would be useful we will look into adding new features.\n", "attachments": [], "created_by_name": "Sarith Subramaniam", "created_at": "December 29, 2016 at 10:09PM", "created_by": "sarith", "parent_id": "reply_2985220_Comment_1663670", "id": "reply_2985220_Comment_1664226"}