{"body": "\nFrancesco and Mostapha,\n\n\n\nThat was indeed a bug.  Thank you for finding it and reporting it.  I have fixed it in the copy of the components on the github and in the attached GH file.\n\n\n\nAs for the second issue of aligning points in Rhino space with the chart, you have already realized that the temperature is plotted with 1 Rhino unit equal to 1 degree temperature.  Because humidity ratio values are so small, I multiply them by a scaling factor that is set inside the component:\n\n[https://github.com/mostaphaRoudsari/ladybug/blob/master/src/Ladybug...](https://github.com/mostaphaRoudsari/ladybug/blob/master/src/Ladybug_Psychrometric%20Chart.py#L1741-L1742)\n\nI originally did not expose this parameter as an input to the component because the psychrometric chart was already so large and it currently has the most inputs of all components in Ladybug.  Still, if you make a case here that exposing such an input would help you better coordinate your point values, I can do it.  You should also note that you can connect up the chartHourPoints output of the psych chart to a native GH \"Point\" component to see the point in Rhino.\n\n\n\nFinally, I would like to take this opportunity to get your thoughts on another topic that Mostapha mentioned to me earlier.  At present, when you plug in epw values to both the psych chart and the PMV comfort component, you do not get the same percentage of comfortable hours out of the two components.  This is because the PMV component assumes that the MRT is the same as the dry bulb temperature by default while the psych chart needs to assume that there is only one MRT value for all hours in order to draw only one comfort polygon.  I have realized that this discrepancy can be confusing to people and I can think of 2 ways of addressing it:\n\n1) If someone connects up epw data or a list of 8760 values to either MRT or windSpeed of the psych chart, I assume that the user wants to align the data and I just pass the aligned values through the PMV function.  The issue here becomes what to do with comfort and strategy polygons.  The simplest option would just be to not allow the user to plot any polygons on the chart in this case.  Alternatively, I can plot two comfort polygons showing the range from warmest comfort to coldest comfort across the 8760 values but, with this, I can't allow the user to plot multiple metRate or cloValue polygons.  Nor can I accurately plot the strategy polygons.\n\n2) I can just tell people that the assumption of a single MRT and windSpeed is a limitation of the one-polygon psych chart methodology.  In the end, the psychometric chart is just a means to help you visualize temperature and humidity and it is not really a tool for measuring how comfortable a space is over a long time period.  To assess comfort over long periods of time, you should really be running the PMV comfort component and you should probably account for how the wind and MRT change over time as well as people's clothing.  Comfort, in reality, is not a static thing and the assumption that a single polygon can represent the dynamism of your thermal preference is inherently flawed.\n\n\n\nLet me know your thoughts,\n\n-Chris\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1557219", "name": "HumRatio_CWM.gh"}], "created_by_name": "Chris Mackey", "created_at": "June 28, 2016 at 7:10pm", "created_by": "ChrisMackey", "parent_id": "reply_2985220_Comment_1556823", "id": "reply_2985220_Comment_1557218"}