{"body": "\nHello Theodore,\n\n\n\nI believe we are looking for something very similar. I would be very interested in seeing Honeybee interfacing with EnergyPlus's EMS. There is some python code my research group and I have developed to improve parts of building energy models which we would like to connect to EnergyPlus. The best example I've seen thus far is Ladybug and Honeybee here. Additionally, it would be awesome to drop our code in as a component in grasshopper and link up with a ladybug+honeybee building model setup. So overall, I would be very interested in seeing a connection between Honeybee and EnergyPlus EMS. \n\n\n\n**Side discussion you might find interesting: **\n\nI would also like to bring to your attention the FMI standard ([https://fmi-standard.org/start](https://fmi-standard.org/start)), which is a standard for packaging models and connect with other tools. One of those supported tools is EnergyPlus, which uses EnergyPlus' ExternalInterface and EMS components to connect with functional mockup units (FMUs) for cosimulation. \n\nThe ExternalInterface can map to three EnergyPlus input objects (EMS) called:<br/>ExternalInterface:FunctionalMockupUnitImport:To:Schedule<br/>ExternalInterface:FunctionalMockupUnitImport:To:Actuator<br/>ExternalInterface:FunctionalMockupUnitImport:To:Variable.\n\nFMUs are models, typically written in Modelica but can be other languages, that are packaged into C code with necessary solvers to passing results between models on a timestep basis. In other words, a model written in modelica is packaged and connected to EnergyPlus using the FMI standard and EP's EMS. Coming from the other side of the setup, using research from LBL done by Thierry Stephane Nouidui and Machael Wetter, you can package EnergyPlus as an FMU. One example of this work can be found: [http://eetd.lbl.gov/publications/functional-mock-up-unit-import-in-ene](http://eetd.lbl.gov/publications/functional-mock-up-unit-import-in-ene). \n\n\n\nThe reason I bring all this up is because I asked a different question on GitHub recently about how to link Python code to EnergyPlus (really the EMS). Although this question is quite different there are some similarities and the end result is nearly the same. The question can be found: [http://stackoverflow.com/questions/30717611/fmu-export-of-python-co...](http://stackoverflow.com/questions/30717611/fmu-export-of-python-code-or-python-interface-with-fmi-standard-for-use-in-energ) and also here: [https://unmethours.com/question/8356/fmu-export-of-python-code-or-p...](https://unmethours.com/question/8356/fmu-export-of-python-code-or-python-interface-with-fmi-standard-for-use-in-energyplus-co-simulation/)\n\n\n", "attachments": [], "created_by_name": "Justin Shultz", "created_at": "June 17, 2015 at 2:58pm", "created_by": "JustinShultz", "parent_id": "reply_2985220_Comment_1300192", "id": "reply_2985220_Comment_1310931"}