{"body": "\nRauland,\n\nThank you for finding this.  It was a bug that was occurring because, when a person's metabolic rate starts to get very low (ie. when they are sleeping) they start to desire very warm temperatures (around 26-27 C).  However, with the way you are using the psych chart, the comfort polygon is showing you the air temperatures that are comfortable when the radiant temperature is the default 25C (lower than the desired temperature for a sleeping person).  As a result, the desired air temperatures end up being very high (around 30C) so that the sleeping person, overall, feels like it is 27C.  When you blow this very warm 30C air onto a person, it can actually cause them to feel warmer than without any air movement since the means by which the person is loosing the most heat is to the radiant environment (imagine trying to cool a person with a hair dryer).  This causes the \"occupant use of fans\" polygon to overlap with the comfort polygon like it does here at a metabolic rate of 0.8:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/6Tyx6FS0AhfdzeCZ2qULboISevb55C6mBXrIhhUkHwp7YanY4Z-8awgenRLSMokp44ZqAshDXSUH2sVpC0JR855m6IZhxr0F/WindCoolingOverlapwithLowMetRate.PNG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/6Tyx6FS0AhfdzeCZ2qULboISevb55C6mBXrIhhUkHwp7YanY4Z-8awgenRLSMokp44ZqAshDXSUH2sVpC0JR855m6IZhxr0F/WindCoolingOverlapwithLowMetRate.PNG)\n\nBy the time that you get down to sleeping metabolic rates of 0.7, the \"use of fans\" polygon completely overlaps with the comfort polygon, meaning that the use of wind is not at all helpful.  I hadn't considered this originally and so this was causing the component to fail.  I have fixed this in the attached file by not generating an \"occupant use of fans\" polygon whenever this complete overlap occurs.\n\n-Chris\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1343842", "name": "environmental_psychrometric_CWM.gh"}], "created_by_name": "Chris Mackey", "created_at": "August 15, 2015 at 02:55PM", "created_by": "chris", "parent_id": "reply_2985220_Comment_1343095", "id": "reply_2985220_Comment_1343840"}