{"body": "\nMike,\n\n\n\nI looked deeper into your suggestion about creating custom frame cavity materials in Grasshopper.  It turns out that it is relatively easy to set the 'Cavity Model' of a custom gas material.  However, LBNL has not yet implemented the ability to define the 'Gas Fill' from a .THMX file (all custom frame cavity models just default to air materials).  As I understand it, there are a few features that the LBNL team has not implemented yet on the .THMX file type, which it is planning to implement in the future:\n\n1) Ability to set 'Gas Fill' of materials other than air in a .thmx file\n\n2) The ability to set the Gravity Arrow from the .thmx file\n\n3) The ability to associate .thmx files with THERM and have them automatically open when double-clicked (this will save us from having to open  THERM and navigate to the thmx file every time we want to bring it in).\n\n\n\nI am hoping that the Honeybee components will give LBNL a good reason to implement these features on the thmx file soon.  I plan to send the LBNL team an email about these critical missing capabilities.\n\n\n\nTo be in line with the current limitations that LBNL has set for the time being, I have changed the type_ input on the \"Honeybee_Therm Material\" component to be cavityModel_ instead.  This way, you can set a cavity model if you are creating a gas material or you can just leave it blank to create a solid material.\n\n\n\nI should also mention that, if you are using the \"Import from WINDOW\" workflow, the THERM polygons for the glazing system will automatically account for the gas fill by using the \"effective conductivity\" of the gas that WINDOW computes for you.  This is what THERM does when you import a glazing system (THERM doesn't create a custom frame cavity material and set the gas.  It just uses this effective conductivity).\n\n\n\nGiven that most exotic gasses get used between window panes and not in the frame cavities, the current capabilities should hopefully satisfy most needs.  Still, it doesn't hurt to put a bit of pressure on LBNL to implement the features above.\n\n\n\n-Chris\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1491684", "name": "ThermExportWorkflow.gh"}], "created_by_name": "Chris Mackey", "created_at": "March 24, 2016 at 11:21am", "created_by": "ChrisMackey", "parent_id": "reply_2985220_Comment_1490674", "id": "reply_2985220_Comment_1491683"}