{"body": "\nCD2005 (sorry I got your name wrong last time and for getting back do late),\n\nThere are three big things that are wrong with your file:\n\n1) Your zones are not closed volumes in the file that I have opened.  This image shows the problem:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/QxYZWE5p2qvSwQkr6ykkmwSFy**FdI0rC0N6bFywDero*b--HxR1gJ-B0UPqd2SXSvEho3Raca-CZqHoRyn*Fk0Zr6lBx8TQ/OpenBreps.PNG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/QxYZWE5p2qvSwQkr6ykkmwSFy**FdI0rC0N6bFywDero*b--HxR1gJ-B0UPqd2SXSvEho3Raca-CZqHoRyn*Fk0Zr6lBx8TQ/OpenBreps.PNG)\n\nIf this is not what you are seeing on your own machine when you hook up your HBZones to a panel, then you have not uploaded the right Rhino and Grasshopper file.\n\n2) You have not run your HBZones through an EnergyPlus simulation.  You need to do this in order to get data with which to construct the indoor temperature map.  I would strongly recommend following along through the first 8 videos of this tutorial series before trying to construct an indoor radiant temperature map of your own project ([https://www.youtube.com/playlist?list=PLruLh1AdY-SgW4uDtNSMLeiUmA8Y...](https://www.youtube.com/playlist?list=PLruLh1AdY-SgW4uDtNSMLeiUmA8YXEHT_))\n\n3) You are using components from the last stable release, which is fine but you should know that there has been a lot of development on the indoor temperature map workflow in the last 20 days (there is now a much cleaner workflow that integrates the air and radiant temperature with comfort alanyses now on the github).  If you imagine using this workflow frequently, I would recommend updating with the Ladybug_Update Ladybug and Hopneybee_Update Honeybee components.  See the attached recent file for how the workflow is currently structured.\n\n-Chris\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1229623", "name": "Indoor Temperature Map20.gh"}], "created_by_name": "Chris Mackey", "created_at": "February 22, 2015 at 2:21pm", "created_by": "chris", "parent_id": "reply_2985220_Comment_1229147", "id": "reply_2985220_Comment_1229622"}