{"body": "\nI see, thank you for the tip. I am reminding myself about the mesh brep settings and how to mesh faces by dividing uv distance - I probably could use the paneling tool components by rajaa. I remember they work super.\n\n\n\nWhen I do run a batch simulation, right now I just get viewport exports but i actually need to write list of values into an excel speadsheet each time it simulates. \n\n\n\nI see that from radiation analysis component I get a list of values with no tree structure, when I would like to have lists of values separated by which face it is on. But I understand this may not be possible because the geometry input is meshed and joined.\n\nIdeally extracting colors from vertex points will give me a list of values that are identical to the values out of the radiation analysis component. I could probably use the find similar component or set components to check. \n\n\n\nHowever, the ram usage is an issue for me - these days I am often either detailing and doing stuff in revit and dynamo or have another rhino-grasshopper open isolating and solving a part of a bigger definition. while the rhino and grasshopper run definitions in batches. or I have 3ds max open running a GPU renderer. and It would be really useful to be able to set a limit on ram usage. Its just that even after the simulation is finished, grasshopper will ALWAYS maintain the level of ram usage , whether I am doing something with kangaroo or like ladybug that can be super RAM heavy.\n\nmaybe this can only be considered as a feature of the grasshopper as a whole rather than  from a component ?\n\n\n\nThank you again Mostapha, for these great set of components. and so many of them! I have been working on sustainable design issues since college. and very special that you guys decided to leave the codes really open source, too. \n\n\n\np.s. do you know or use the pv watts website ? I havent looked into all the honeybee components yet but I remember using pv watts a lot when I was calculating on site solar energy potential. that plus 40 year period rain data for sizing the roof + water cirsterns. I guess what i am saying is that I dont know how much information and how many different kinds of information is contained in epw files.\n\n\n", "attachments": [], "created_by_name": "Youngjae chung", "created_at": "November 18, 2014 at 4:16pm", "created_by": "YOUNGJAECHUNG", "parent_id": "reply_2985220_Comment_1170841", "id": "reply_2985220_Comment_1171338"}