{"body": "\nGrasshope,\n\n<br/>While I am glad that you have posted this discussion, it is not a critical error and thank you, Abraham, for making this clear. The ever-so-slight difference in PMV was resulting from Ladybug's use of the CBE code from a year ago, which used a 'still air threshold' of 0.15 m/s. The CBE group seems to have recently changed this variable to be 0.1 m/s ([https://github.com/CenterForTheBuiltEnvironment/comfort_tool/blob/m...](https://github.com/CenterForTheBuiltEnvironment/comfort_tool/blob/master/static/js/comfortmodels.js#L100)).<br/>The 'still air threshold' is the air speed that is used to determine whether to use the original Fanger PMV model (which was developed with climate chamber surveys at low air speeds) or attempt to compute a 'cooling effect' from increased wind speed by running iterations of this PMV model until the results align with the SET calculation. As I understand it, the still air threshold is not a part of any building code and (like many of the coefficients and terms in the PMV model) it's a fairly subjective value that is there to make the comfort models align with each other or align with climate chamber survey data. I don't know what prompted the CBE group to change this value but this example points to a larger issue with PMV, which is something that I WOULD deem 'critical' in a broader scientific research sense.<br/>Namely, we should be much more concerned about whether PMV is a good predictor of real-world occupant comfort votes than we should be concerned about getting all of our coefficients of our theoretical comfort models to be the same. For example, the real-world occupant surveys that were used to build the Adaptive comfort model found PMV to be more poorly correlated to occupant comfort votes than the simple operative temperature (or globe temperature). You can see the R2 values of these metrics to comfort votes on page 106 of this [very comprehensive book](https://books.google.com/books?id=lOZzCgAAQBAJ&amp;printsec=frontcover&amp;dq=Adaptive+thermal+comfort&amp;hl=en&amp;sa=X&amp;ved=0ahUKEwjr08y7hdDKAhWHGh4KHWNGAx8Q6AEIIzAB#v=onepage&amp;q=Adaptive%20thermal%20comfort&amp;f=false).\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/zOUTc6Nq2HNF-me67sEpt7wP68hsh9n-SG4GT6wCLirfpfazbedH6hYDvCIvGNrx8yilcvf4wLtzpUZJeTLXXtcLj3sj05CX/CorrelationsofThermalMetrics.jpg?width=721\" width=\"721\"/>](http://api.ning.com:80/files/zOUTc6Nq2HNF-me67sEpt7wP68hsh9n-SG4GT6wCLirfpfazbedH6hYDvCIvGNrx8yilcvf4wLtzpUZJeTLXXtcLj3sj05CX/CorrelationsofThermalMetrics.jpg)\n\nSo, if we are going to debate the accuracy of PMV calculations, I would much rather have us discuss this deeper, systemic issue of the PMV methodology as it relates to real people in real buildings.  Or, if we are going to talk about differences of decimal places and subjective coefficients, let us couch the issue within the broader question of PMV's accuracy.\n\n\n\nAll of this said, I have [amended the ladybug code](https://github.com/mostaphaRoudsari/ladybug/commit/588524d5cdb45ce27dae45e3e6d735d0b14dc52d) to align with the most recent CBE code so that you now get matching values between the two. I hope this helps and thank you both for starting the discussion.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "January 29, 2016 at 03:52PM", "created_by": "chris", "parent_id": "reply_2985220_Comment_1448799", "id": "reply_2985220_Comment_1449989"}