{"body": "\nAris,\n\n\n\nThanks for posting and your questions are good ones.  The way in which I made the shade benefit method relevant to thermal comfort has involved the creation of a fairly abstract metric of degree-days/square meter, which sometimes takes a while to understand.  To explain what is going on in the cases that you posted, I can tell you that the second one where you are just increasing the grid size is showing you that that there is actually greater variation in shade benefit when you zoom in and perform a calculation with more sun vectors.  This is why the legend increases (because there are some small spots that matter more when they are not averaged together with some less important spots).  If you multiply by the area of the individual cells in each case and add up all of the results for each of these two cases, you should get something similar as the absolute value provided by shading all of the beneficial regions.\n\n\n\nThe first case is a bit more difficult to explain but I am fairly certain that it is happening because each shade benefit simulation has a finite number of degree-days that it is trying to improve.  When you increase the size of the testRegion as you do in the first example, you are spreading those degree-days across a larger surface, resulting in overall smaller numbers of degree-days/m2.  One way that you might try to get a more constant metric (or more of an absolute value provided by the whole shade) is that you can multiply the results by the number of people that are seated in the testRegion (or perhaps just multiply by the area of the testRegion).  This way, you are accounting for the fact that the larger shade will make more people comfortable (it's not just one person or set of degree-days that you are improving).  In your specific case here, I think that we are also seeing a number of areas where the benefit of the shade is in conflict with the desire to not have shade in the winter, resulting in some smaller values.\n\n\n\nLet me know if you end up testing out the multiplication by the testRegion area and, if you get results that indicate a more \"absolute value\" of the shade that is more consistent between the cases, I might consider revising the metric that is output from the component.  The important thing to realize across all of this is that the RELATIVE shade desirability across you testShade will always be the same (even if the way that we define absolute shade benefit changes).  So, if you have a finite amount of shade material, it is always in your interest to provide more of it in the areas with more shade desirability.\n\n\n\nIf you have more questions about how the component works, I can point you to this paper on it:\n\n[https://www.dropbox.com/s/cgrod252iopmci2/SIMAUD_Paper12.pdf?dl=0](https://www.dropbox.com/s/cgrod252iopmci2/SIMAUD_Paper12.pdf?dl=0)\n\n\n\nAlso, the original shade benefit method that this component is based on can be found here:\n\n[http://web.mit.edu/tito_/www/Publications/BS2011_Shaderade.pdf](http://web.mit.edu/tito_/www/Publications/BS2011_Shaderade.pdf)\n\n\n\nThanks again,\n\n-Chris\n\n\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "September 24, 2016 at 3:35pm", "created_by": "chris", "parent_id": "topic_1603846", "id": "reply_2985220_Comment_1604993"}