{"body": "\nHi Grasshope,\n\n\n\nGlad that everything has been running smoothly.  To answer your question:\n\nYes, the original ddys issued by ASHRAE are different than those that are generated by the Energy Simulation components.  However, they are very close to each other and my inference as to why they are not perfectly equal is that the ddys for ASHRAE/DoE are likely built using all of the collected weather data over the (at least) 18 years that a weather station has been recording data.  In contrast, the Energy Simulation components use the same statistical methods but on just the data with in the epw, which is just one year (albeit a 'typical' year statistically).\n\n\n\nYou should keep in mind that what E+ is trying to do with the ddy file and autosizing of the HVAC is mimic the process that an engineer undergoes to size specify your building's HVAC system and there can be variations in techniques for sizing the HVAC just as there can be differences between the weather in an epw and that which a building actually experiences once it is built.  Still, it's probably safe to say that, if an engineer has a ddy file that is issued by ASHRAE, they will probably use that to size the system instead of a ddy file generated just from the epw.  As such, it's a good idea to include the ddy file next to the epw if you have it as this is closer to what an engineer might do.\n\n\n\nAll of this said, in the cases that I tested, the minor differences between the ASHRAE ddy and that generated by the Energy Simulation components had a negligible effect on the resulting heating and cooling values out of E+. I was often able to get the heating energy to match down to the kWh and the cooling energy matched within 1-2%.  The cooling sizing is off because the Sky model for radiation used by AHSRAE  in the ddy files (ASHRAEtau method) requires some information not contained in the EPW. Instead, I use ASHRAE's simpler ClearSky model at the highest solar intensity. As a result, the function here oversizes the cooling system by small amount (1-2% as mentioned previously).\n\n\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "July 27, 2016 at 6:37am", "created_by": "chris", "parent_id": "reply_2985220_Comment_1571838", "id": "reply_2985220_Comment_1571781"}