{"body": "\nHi Chris, Thank you for responding. \n\n\n\nAfter this post, I did some searching and I was able to obtain an education license for simulation cfd 2015 and another cfd software called hyperworks. \n\n\n\nI first looked at autodesk simulation cfd 2015 and was optimistic because it had an export plugin from revit, which i use anyway for material takeoffs and etc, but found that it did not take solar radiation into account. This was a downer because I have heard that solar radiation could effect indoor airflow - convection - as much as 50 percent at a time. \n\n\n\nThen I searched again and found that Hyperworks, a software by altair technology can be coupled with a radiation software. So I went through the trouble of obtaining an educational license of Hyperworks. However, though some email exchange I have found that the coupling is a one-way. The radiation analysis software was used, I think, for understanding the solar loading for a SOM project called [church of light](http://www.thermoanalytics.com/applications/mom/cathedral_of_christ_the_light). \n\n\n\nThe support guy said : \"Unfortunately our coupling with Hyperworks is really a one way coupling.  We can accept H coefficients from their software in RadTherm, but they will not read in our wall temps.  That said, it still can be a useful coupling in the sense that you can run the analysis in Hyperworks, send H coefficients to RadTherm, and run the analysis to better understand radiation and conduction.  Most importantly, that analysis can be done for longer transient analysis, but will require much less compute time and resources.\"\n\n\n\nNot only did I not understand what he means by the H coefficients, my wanting to get a CFD understanding coupled with solar radiation was again, unsatisfied. In the mean while I had to finish a presentation so I haven't had the time to try to get some result on the natural ventilation. I would probably need to look into how their solutions work before I can understand if their software would \"do the job\"\n\n\n\nThank you for letting me know about your work on this. I downloaded the Honeybee_Set EP Natural Ventilation component and made sure that it is allowed, but it does not show up in grasshopper.\n\n\n\nYou pointed out that \"The component (and the corresponding equation) is mostly meant for cases where you have  zones with windows that are NOT connected by an air wall (or a larger airflow network).\" I wondered if you are suggesting it would be a code violation for zones to be connected by an air wall for fire safety reasons. It would be a violation I guess, like not putting an fiber insulation or some kind of smoke stop between Spandrel panels and the edge of a floor plate would be a code violation for a typical office building.\n\n\n\nThere is [a project by kevin daly architects](http://kevindalyarchitects.com/projects/edison-language-academy/) where you can see a section drawing with what seems like a cfd analysis (could be an illustration)  \n\n\n\nit was my initial visualization/simulation goals were  for a facade design I am working on\n\n1) an average air velocity across a zone at noon, for example, if a passive design strategy like this was used. for this I am guessing cfd is not entirely necessary. probably means that it could be used earlier in a design process, too. This would be more about user comfort.\n\n2) at a later phase, like in detailing facade components, if airflow is indeed as expected for a zone that is connected to an air wall / chimney like feature (and to see if there is a proper mixing of air)\n\n3) and a projection of energy savings, of course.\n\n\n\nAfter seeing [a video of simulation cfd](http://youtu.be/kI02JEwwvyQ?t=40m45s) I was optimistic, but like I said sim cfd does not take account of solar loading. I think I would probably go ahead start with one zone with sim cfd first, try three zones stacked on top of each other, then try hyperworks and try to factor in solar radiation.\n\n\n\nFor analyzing multiple zones on different levels, being able to add a chimney would be especially useful, I think. Having said that, I don't have a lot of experience of using honeybee except for the daylight component so it would take some time for me to understand the components. \n\n\n\nI hope some of the information here is useful for you. after all, both sim cfd and hyperworks are commercial softwares and somewhat different than the e plus project you are working on, I guess but still trying to address a similar problem.\n\n\n\nso.. in cased you missed it I was asking I downloaded the Honeybee_Set EP Natural Ventilation component and made sure that it is allowed and placed in the user object foler, but it does not show up in grasshopper. what could be the reason?\n\n\n\n\n\n\n\n\n", "attachments": [], "created_by_name": "Youngjae chung", "created_at": "January 10, 2015 at 9:32am", "created_by": "YOUNGJAECHUNG", "parent_id": "reply_2985220_Comment_1198588", "id": "reply_2985220_Comment_1202064"}