{"body": "\nHi again Chris and Mostapha, I make quite a few posts in many different forums and subforums but I have to say you guys - Chris and Mostapha - are among the most helpful and prompt. amazing, thank you. I wish there is a website where people vote for the most helpful and informative forum on the web.\n\n\n\nI am not sure how I can get a hold of fluent or phonics but thank you for explaining a good practice for using CFD i.e. to confirm the coefficients for a formula.\n\n\n\nIts beginning to take a shape on my head how to approach the topic. I am under the impression what you are referring to as a steady state is distinct from a transient analysis, which looks at the beginning and end of a system behavior. So I understand as a steady state analysis as an analysis about a kind of a \"running\" mode, at least in this context. so it makes sense that there would need to be a guess about an initial air flow.\n\n\n\nI just tried your definition and I can see the Nat Vat component and it is running without problem. However I got an error message \"1. no eio file was found adjacaent to the .csv _resultFileAddress.results cannot be read back into grasshopper without this file.\"  from the honeybee read EP result component. \n\n\n\n\n\nso I double clicked the unnamed.idf file, and EP-launch popped up. \n\nand I clicked simulate button, and now in the folder there is an eio file. \n\nnow I run the Honeybee_run_simulation component again and this time the read EP component works without error, and as a result I do get an operative temperature for zone graph, though mine looks different, and based in san fransisco Intl AP.\n\n[<img class=\"align-center\" src=\"http://api.ning.com:80/files/YeapLx*gE2bHDxUS1Rhh8EJrCIvfk8XyvrwvmanspEtQcNFtI4mY4gpa50obmZcBVLudtDWlsFD5hhUd3n0T-BWa1y5OPJNm/natventtest.jpg?width=721\" width=\"721\"/>](http://api.ning.com:80/files/YeapLx*gE2bHDxUS1Rhh8EJrCIvfk8XyvrwvmanspEtQcNFtI4mY4gpa50obmZcBVLudtDWlsFD5hhUd3n0T-BWa1y5OPJNm/natventtest.jpg)\n\n\n\nAnyways, I do get a result, I just did not know that running EP-launch from the unnamed.idf file was a part of the workflow so if anyone is trying this chimneyExample File and getting an error about a missing eio file, just double click on the idf file created by the Run_Energy_Simulation component.\n\n\n\nAbout what you said Chris, \" Once you get CFD air flow values for a given temperature difference between your zone and outside air, you can use the orifice equation and solve for your discharge coefficient (Cd).  You can then plug this discharge coefficient into your HB energy model and get a sense of airflow through the chimney for the whole year\"\n\n\n\n\n\nI have to try this workflow since I am preparing a CFD analysis. My only question right now is, Chris, which one of \"operative temperature\" and \" meanRadTemperature\" output from Read EP result component equivalent to temperature values for surfaces or heat flux values for surfaces ?\n\n\n\nThank you again! hope to share a result of coupling a CFD and Honeybee-ladybug soon, hopefully by the end of this month. might be next month because I have a different presentation at the end of this month.\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1207132", "name": "Screenshot 2015-01-19 12.55.25.png"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1207133", "name": "Screenshot 2015-01-19 13.08.59.png"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1207134", "name": "Screenshot 2015-01-19 13.16.47.png"}], "created_by_name": "Youngjae chung", "created_at": "January 19, 2015 at 11:28AM", "created_by": "YOUNGJAECHUNG", "parent_id": "reply_2985220_Comment_1203363", "id": "reply_2985220_Comment_1207131"}