{"body": "\nHi Chris,<br/><br/>Again, thank you again for the useful information, and the comparisons!!<br/><br/>Just for any future references and for the people who might be following this topic, a small clarification:<br/>The current **Thermal Comfort Indices** incoming long wave radiation uses Ångström clear sky conditions emissivity coefficient, with Maykut and Church cloudiness factor so that it accounts for cloudy sky conditions. So basically this corrections creates the cloudy (all) skies emissivity coefficient.\n\n\n\n<br/>I was not aware of the fact that .epw files have been shipped with the **horizontalInfraredRadiation**. Thank you for posting this information!<br/><br/>I took a look at EnergyPlus [horizontalInfraredRadiation page](http://bigladdersoftware.com/epx/docs/8-3/auxiliary-programs/energyplus-weather-file-epw-data-dictionary.html#field-horizontal-infrared-radiation-intensity).<br/>In there they state that: **\"If it is missing, it is calculated\"**.<br/><br/>I am pretty much certain that in Serbia, government weather stations do not record the long-wave radiation data.<br/>So I thought that this data is probably recorded in more developed countries, definitively in USA.<br/>I replicated the formula provided by mentioned bigladdersoftware.com [page](http://bigladdersoftware.com/epx/docs/8-3/auxiliary-programs/energyplus-weather-file-epw-data-dictionary.html#field-horizontal-infrared-radiation-intensity) in cases when \"Horizontal Infrared Radiation Intensity is missing\".<br/>This is the same Clark and Allen (1978) formula mentioned in upper attached **Survey of Sky Effective Temperature Models.pd**f, Table 3.<br/><br/>Once I checked the differences between the Clark and Allen formula and the **horizontalInfraredRadiation** from the epw file, they were not actually really close, but the same.<br/>I checked for a couple of locations in USA, but also outside of it, for different climates. The results were again the same:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/zxy*xRp5iQ7Ypmwpr*QkgAwEOC1sKXO1gCptCfDhnFYnttq1IsVUt-waGSOFg-kENJLkiCFMgmrEq0lwR7NoegAhaUvgMjtO/calculatedLa_vs_measuredLa.jpg?width=300\" width=\"300\"/>](http://api.ning.com:80/files/zxy*xRp5iQ7Ypmwpr*QkgAwEOC1sKXO1gCptCfDhnFYnttq1IsVUt-waGSOFg-kENJLkiCFMgmrEq0lwR7NoegAhaUvgMjtO/calculatedLa_vs_measuredLa.jpg)\n\nI attached the file below.<br/>I must admit that there are also hours when -1/+1 difference Wh/m2 exists, but my guess is that this is due to rounding of the values which is performed by EnergyPlus as shown in the example at [bigladdersoftware.com page](http://bigladdersoftware.com/epx/docs/8-3/auxiliary-programs/energyplus-weather-file-epw-data-dictionary.html#field-horizontal-infrared-radiation-intensity) (0.036, 0.815, 340.6).\n\n<br/>So it's either the Clark and Allen formula is super precise and can predict the long wave radiation to be exactly the same as the physically measured value, or .epw weather files are in fact not using physically measured values but calculated ones.<br/>My assumption would be that it is the second case.\n\n\n\nIt seems that the only major difference between the two is that the Maykut and Church model seems to be overestimating the long wave radiation loss to the sky in very cold conditions.  Otherwise the models show fairly good agreement\n\nBased on upper assumption, I do not think that we can distinguish whether either of these two incoming long-wave radiation methods is more precise or if the other one overestimates the **La** values.<br/><br/>Thank you too for the knowledge and the shared information!!\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1544279", "name": "horizontalInfraredRadiation_Clark_Allen_1978.gh"}], "created_by_name": "djordje", "created_at": "June 08, 2016 at 10:28AM", "created_by": "djordje", "parent_id": "reply_2985220_Comment_1543815", "id": "reply_2985220_Comment_1544278"}