{"body": "\nHi Aaron,\n\nAh.  This one is my fault.  I used the \"Update Honeybee\" component to automatically bring all of the components in your GH file up to the most recent version (the version that is on our github) but this update method comes with a caveat.  If a more recent component has a different number of inputs/outputs or the names of these inputs/outputs are different, the component will fail.  This is because the python code inside the component is up to date but the component, as a whole, is not.\n\nI attached a GH file with the correct glazing ratio component, which I updated manually.  To get the glazing component that I used in the video, you need to sync with the version of the components on the github.\n\nIn order to do this, the process is a bit convoluted these days since Github has stopped allowing automatic downloads but here are the steps for the best way if you don't plan on updating frequently:\n\n1) Download a copy of our most recent code to your computer by going here ([https://github.com/mostaphaRoudsari/ladybug](https://github.com/mostaphaRoudsari/ladybug)) and clicking on 'download ZIP.'\n\n2) Unzip the file and you should see one folder called userObjects. All of the files in here will be most up-to-date LB userObjects\n\n3) Delete your old Ladybug+Honeybee userObjects by going to File &gt; Special Folders &gt; User Objects Folder in the GH program window and deleting all of the LB+HB components there.\n\n4) Drag the new Ladybug userObjects from the unzipped location onto your GH canvass.\n\nYour components are now up-to-date.\n\nBe wary that, if you stay up-to-date with the github, the overall version of the components might not always be as stable as that which we release at the official download link but you will get access to all of the new features that we are building in.  This includes things like the breakUpDist_ on the glazing component.\n\n\n\nGlad to be of help!  Right now, the best way that you can help and support LB+HB is just by spreading the word to your colleagues.  The larger the community, the more that we can help each other.  Also, testing out the tools and reporting issues is a huge help to us and allows us to find bugs that we would never be able to find on our own.  In a few more months, we will be putting together a Wiki and this will include a lot of places for awesome users like yourself to contribute with example files from your projects, videos, and even scientific discussions / research papers that you have found relevant to the project.  Lastly, I think we will have a LB+HB T-shirt drive at some point since there seems to be a good demand for this.\n\nStay awesome,\n\n-Chris\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1168952", "name": "Multizone_Residence_AirWall_CWM.gh"}], "created_by_name": "Chris Mackey", "created_at": "November 14, 2014 at 07:34PM", "created_by": "chris", "parent_id": "reply_2985220_Comment_1167190", "id": "reply_2985220_Comment_1168951"}