{"body": "\nTasos and Theodore,\n\nYou are definitely correct that we need this capability of assigning constructions/materials on the component to deal with the single HBSrfs case.  It would also be helpful if someone wants to assign different window constructions based on cardinal direction, which I know is something that tends to happen a lot when looking for strategies to deal with western facades.  Accordingly, I have created an issue here:\n\n[https://github.com/mostaphaRoudsari/Honeybee/issues/449](https://github.com/mostaphaRoudsari/Honeybee/issues/449)\n\nI will try to get to it soon and let me know if you agree with the proposed workflow of separating the skylight inputs into their own component.\n\n\n\nTasos, I am glad that the set of components in the previous post works for your situation and, Theodore, there is a component to change the RAD materials of a set of HBObjects in the same way that you change the EP Constructions for a zone:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/JGWHmZoi22BNPaJ0GijTOgEZ8znKzsvLTcYqt4jY2gUCVchcNa3IZ4Kp11DnKBR4XZchg6GUoH9QzhFBbLVP*pUijxzqPsDb/ChangeRadGlassMAterial.JPG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/JGWHmZoi22BNPaJ0GijTOgEZ8znKzsvLTcYqt4jY2gUCVchcNa3IZ4Kp11DnKBR4XZchg6GUoH9QzhFBbLVP*pUijxzqPsDb/ChangeRadGlassMAterial.JPG)\n\n\n\nTasos, I am glad that you like the component.  It was one of the first that contributed to and (as you can see) it is one that still keeps me very busy.  Ofc course I should mention that the original idea for the component and the part of the script that deals with non-planar surfaces is all Mostapha's.  His \"offset curve on surface\" and guess-and-check method to determine the correct glazing ratio is really brilliant.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "January 5, 2016 at 8:22am", "created_by": "ChrisMackey", "parent_id": "reply_2985220_Comment_1430879", "id": "reply_2985220_Comment_1430966"}