{"body": "\nHi Sarith,\n\n\n\nThanks for the insight, it's really helpful! I have just begun on this trip so I have a lot to learn as I go. \n\n\n\nYes you are right this is supervised learning so I am not trying to discover patterns in data or anything like that but merely fill in the gaps let's say. This is by far the simplest way of incorporating ML into our field. While ML I feel is a bit overrated in general, the impact it can have to AEC models I feel is underrated.\n\n\n\nI talk about parametric design a lot (mostly to myself lol) and I even try to practice it a bit on a personal and work level. But how many parametric designs are actually feasible? What percentage of iterations can we run in the 2 weeks of time we have to prepare the concept design report in a typical project. These are the questions that motivated me to find a way to make this a practical and useful exercise. ML is my first stab at this, and I'm in the very first steps of it too. \n\n\n\nI also don't think I'll be using ML to decide which simulations to be run. My goal, with my limited knowledge on the subject, was to use in the typical way: train a model that can predict outcomes.  I feel it's quite good at that, especially when it comes to effort (both in terms of real time and computational time). \n\n\n\nI am indeed currently using scikit-learn which is an amazing library with (as always it seems in python) a pretty incredible community! I was initially using R, for different studies, and thought of starting there but I would eventually like to integrate this directly to environments like GH and Dynamo (in the future), so python (and possibly .NET) seemed a better way to start.\n\n\n\nI have only skimmed the surface but there are quite a few developments in ML that seem, to my untrained eye, as having potential in reducing the dimensionality of our models in an efficient way (e.g. random search vs grid search). I plan to have a few million of alternatives on the third model to test these out. Will post my findings and the walls I hit here for those interested!\n\n\n\nP.S.: Thanks for link I'll try to access a few papers even though without being a student it's a rich man's hobby lol!\n\n\n\nEdit: Seems most of the research is available for free, that's awsome!\n\n\n\nKind regards,\n\nTheodore.\n\n\n\n \n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "November 29, 2016 at 4:55pm", "created_by": "TheodorosGalanos", "parent_id": "reply_2985220_Comment_1648462", "id": "reply_2985220_Comment_1648643"}