{"body": "Grasshope and Anton,\n\nI see that you are going through the crazy navigation of the E+ outputs for the ideal air system that took me over a year of trial and error to figure out (it is crazy how E+ has hundreds of outputs but lacks some of the really important ones). Hopefully, you can fet through this discovery faster then it took me. To go down the list:\n\n1. The \"supply air total coolng energy\" is the energy removed by the ideal air \"cooling coil\" from the supply air stream (this supply air includes the outdoor air). As such, this output is the closest thing to the actual system cooling load that you can get from an ideal air loads model. The \"zone total cooling energy\" is the energy removed from the zone by the ideal air cooling system, which is fundamentally different than the energy removed by the cooling coil from the supply air stream (since the supply air stream includes outdoor air). The numerical difference that you see between these two outputs in your csv is the energy removed by outside air from the supply air stream.\n\n2. Ironically, the statement that you have written is not true although it is what I thought when I first saw an ideal air output with \"outdoor air\" in it. The \"zone outdoor air total cooling energy\" is the energy removed from the ZONE by outdoor air coming through the ideal air system when it is in cooling mode. It is not energy removed from the SUPPLY AIR STREAM by the outdoor air, which is actually what we want to know most of the time to complete our energy balances. As such, I find the\"zone outdoor air total cooling energy\" to be a royally useless output. What is perhaps more frustrating is that EnergyPlus does not have an output for theergy removed from the SUPPLY AIR STREAM by the outdoor air and so I have to calculate this inside the readEPResult component by subtracting the zone cooling energy from supply air stream cooling energy.\n\n\n4. We currently do not have humidity co trol but adding this should have a minimal effect as air based cooling systems already remove a lot of the humidity by having a low supply air temoerature. This said, humidity control is easy to implement if anyone wants to have a go at editing the ideal air system template that we use.\n\nHope this helps,\n\n-Chris", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "October 09, 2015 at 02:18PM", "created_by": "chris", "parent_id": "reply_2985220_Comment_1376270", "id": "reply_2985220_Comment_1376298"}