{"body": "\nHi Dimitrios,\n\n\n\nSo you are saying that using Honeybee I can either get results for Illuminance,Radiation and Luminance for a specific time and date, or get annual results for Illuminance or Radiation. So it is either point in time or annual. I can t set a period? This month to that month etc?\n\nYes, and no. Yes because you can get that results that you mentioned but no, because if you are running an annual analysis, the study will run for the whole year. You can use the components afterward to read the results for a specific month or each time step, but you can it set it up before hand.\n\n\n\nIn the _gridSize input of the Ladybug_Radiation_Analysis component, you say **\"This value should be smaller than the smallest dimension of the test geometry for meaningful results\". **But what if we want to run it for individual panels (attached)? I set the grid size to something larger than the panels size, in order to just test the center of each panel. Do you think there would be any mistakes with the results there?\n\nAs far as the surfaces are not overshadowed it will give you the same results. Your attached example is correct.\n\n\n\nIf there is no context in the context_ input of the Ladybug_Radiation_Analysis the analysis doesn't run. So I 've been using an insignificant small geometry as fake context to simulate the \"no context\" situation. Do you see any issues with what I am doing? Have you considered changing the component to run even with no context?\n\nAre you sure about this? The component should run with no context. Can you please check again and send me an example that you can't run the analysis with no context. That can be a bug.\n\n\n\n(in previous comment) Regarding the \"004_gridBasedAnalysis.gh\", and while switching from type 0 to 2 at the GRD, -you are right- the outputs in the component are correct as you have it in the images. But the Analysis type remains as 1 in the \"glz_.6_TVis_.4.typ\" so the units in the legend read always as wh/m2. Even when changing the target folder. Something maybe with the overwriting the file? (could be at my system but I doubt cause I have admin privileges).\n\nThis might be a bug too. I will check this later and let you know. I will also reply to the other discussion later tomorrow. Thanks for bringing up these sort of questions.\n\n\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "December 4, 2014 at 11:18pm", "created_by": "MostaphaSadeghipour", "parent_id": "reply_2985220_Comment_1180992", "id": "reply_2985220_Comment_1181291"}