{"body": "\nHello All,\n\n\n\nI just saw Alstan present his database of materials the other day.  It's a wonderful project and it will likely be my go-to source for a lot of opaque radiance materials.  At the moment, it's mostly just Alstan and Greg Ward that have contributed and I hope others will send their material collections in the future.\n\n\n\nIt's also worth noting that LBNL has assembled a database of all glass and window materials currently on the global market.  Specifically, this is called the [International Glazing Database (IGDB)](https://windows.lbl.gov/materials/igdb/) and, because of it, there is really no need to make such a database of glazing materials anymore.  They update the database regularly and you can produce Radiance materials from the database using [LBNL Optics](https://windows.lbl.gov/software/optics/optics.html) and you can produce EnergyPlus constructions using [LBNL WINDOW](https://windows.lbl.gov/software/window/window.html).\n\n\n\nLBNL is also working on integrating a lot of complex light-diffusing systems now into their [Complex Glazing DataBase (CGDB)](https://windows.lbl.gov/software/CGDB/) so most translucent materials will also be covered by this database.\n\n\n\nAs a result, if we were to make such a library, it's really only going to be for opaque materials.  On thing that might be nice would be to take the LBNL Therm library and assign heat capacities, densities, and visual reflectance to all of the materials so that we could easily use them in E+ and Radiance.  Here's the current list of THERM materials that install with THERM and that Honeybee uses:\n\n[https://github.com/mostaphaRoudsari/Honeybee/blob/master/resources/...](https://github.com/mostaphaRoudsari/Honeybee/blob/master/resources/thermMaterial.csv)\n\n\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "October 16, 2016 at 10:27am", "created_by": "ChrisMackey", "parent_id": "reply_2985220_Comment_1619536", "id": "reply_2985220_Comment_1619459"}