{"body": "\nHi Kondrad\n\n1) There are two types of surfaces that Ladybug Photovoltaics use:<br/>**_PVsurface** - this is basically what you've mentioned: a surface which will be populated with PV modules. The larger the surface, the larger the number of modules and system size, there for the higher annual energy generation.<br/>**baseSurface_** - this input exists only for \"PV SWH system size\" component. It's purpose is to represent a mounting plane on which the PV modules will be put onto. The dark blue colored roof in the photo below is that mounting surface in this case:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/I3qJw2-zaOEVsGx8tn8yPA7ichtUvbVTHv1zy3T8Cke0iDKXEzU6rJt0pvopLIkYXS*x8XYRXvTtWubkHnkRLDkNB8e1rFvi/baseSurface_.jpg?width=300\" width=\"300\"/>](http://api.ning.com:80/files/I3qJw2-zaOEVsGx8tn8yPA7ichtUvbVTHv1zy3T8Cke0iDKXEzU6rJt0pvopLIkYXS*x8XYRXvTtWubkHnkRLDkNB8e1rFvi/baseSurface_.jpg)\n\nSo the size of area of the baseSurface_ is not important but its plane.\n\n<br/>2) It is important. It basically sets the initial losses of the system.\n\nIf that is the soiling value you have, then yes, you need to add it to the DC to AC derate factor component, and then plug its output to \"DCtoACderateFactor_\" input. I did that in the attached definition below.\n\n3) The north vector/numeric value is not propagated due to possible independent usage of components.<br/>I plugged the 0 value to all three component's which have \"north_\" input. You can change it to what ever value you need.\n\n\n\nPlease let me know if I didn't answer completely to your questions, or if you have more of them.\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1644891", "name": "fixed_vs_tracker_PV2.gh"}], "created_by_name": "djordje", "created_at": "November 23, 2016 at 11:23AM", "created_by": "djordje", "parent_id": "reply_2985220_Comment_1644696", "id": "reply_2985220_Comment_1644890"}