{"body": "\n1. The core algorithm inside Radiance essentially solves Robert Kajiya's famous [Rendering Equation](http://dl.acm.org/citation.cfm?id=15902). One of the key principles in Kajiya's theory relates to balancing radiant energy between any two points.\n\n2. The \"glass\" primitive is implemented inside Radiance as a simplification of the \"dielectric\" primitive. It only accounts for transmission and reflection of light and assumes a default value of 1.52 as refractive index. This simplistic assumption works for most architectural applications as we are mostly interested in just transmission and reflection. More complex phenomena such as bending of light inside thick glasses, caustics etc can be studied with \"dielectric\" instead (which usually increases the simulation time significantly).\n\n\n\nIf you consider #1 and #2 from above, you have your answer. With regards to what to use for your simulation, I agree with Chris. Use an opaque material instead (like plastic or metal). Keep the specularity to zero if your material is not shiny.\n\n\n\nA few years ago, I had done some tests on this while learning Radiance. A couple of images from then are below. The values are from 0 transmittance to 100 % transmittance (left-right). The color palette for falsecolor is the default color palette usually set in Radiance.[<img class=\"align-left\" src=\"http://images.imagebam.com/69/a8/23/aa4a60576771023.jpg?width=600\" width=\"600\"/>](http://images.imagebam.com/69/a8/23/aa4a60576771023.jpg)\n\n\n\n\n\n\n\n\n\n\n\n\n\nIf you set the refractive index to 1 instead of 1.52, you'd get rid of any presence of material at all (because 1 is for air). Here is an example of that with dielectric (indices decrease from 1.52 to 1 in a linear order).\n\n[<img class=\"align-left\" src=\"http://images.imagebam.com/8c/9f/82/7aac44576776953.jpg?width=600\" width=\"600\"/>](http://images.imagebam.com/8c/9f/82/7aac44576776953.jpg)\n\n\n", "attachments": [], "created_by_name": "Sarith Subramaniam", "created_at": "August 12, 2017 at 06:26PM", "created_by": "sarith", "parent_id": "topic_1795613", "id": "reply_2985220_Comment_1797840"}