{"body": "\nTheodore,\n\nSorry for being away from the conversation for a couple of weeks.  As Mostapha points out, a lot of your criteria for a good ABM package are going to be related to the means by which you plan to dynamically interact with the E+ simulation.  If you are going to interact with it via MLE+, then an ABM package that is in Matlab would likely be the best.  Mostapha, is there a way to use MLE+ without having to buy Matlab?\n\nIf you are going to go with a BCTVT approach, then an ABM package that is in Modelica would probably be best.  I know a colleague who is working with the BCTVT and I remember seeing some great stuff that he was doing with Modelica. I remember that he was using the Dymola interface to access the modlelica building components library that Michael Wetter put together and that this library had really only been validated with Dymola and not the other interfaces for Modelica (Dymola is not free, although it is a lot less expensive than MATLAB).  Still, Modelica is an open language unlike MATLAB and there are free interfaces for it that are getting better.  Thus, there may be some long-term benefits to developing with that.  Let me know if you want to be put in touch with my colleague who is working with the Modelica building components library.\n\nFinally, the agent behavior that you are trying to model will also shape how you integrate it into the simulation.  If the behavior is triggered by temperature, solar radiation, or glare/daylight values that you get from a Radiance simulation, then you don't have a need for these very complex interfaces and you can get what you are after with just the objects that are already in E+ and with csv schedules.  For understanding all of the objects that you have at your disposal in E+, I recommend using the IDF Editior that comes with E+ (C:\\EnergyPlusV8-3-0\\PreProcess\\IDFEditor) and the online [Input/Output Reference](http://bigladdersoftware.com/epx/docs/8-0/input-output-reference/).  I had no knowledge of E+ objects a year and a half ago and both of these resources were critical for my tapping into E+.\n\nOnce you have a good understanding of the specific behaviors that you are trying to model and the capabilities that E+ already has, I think you will be in a better position to decide what tools are most valuable to you.\n\nHope this helps,\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "January 02, 2016 at 06:04PM", "created_by": "chris", "parent_id": "reply_2985220_Comment_1426330", "id": "reply_2985220_Comment_1429489"}