{"body": "\nHi Mostapha,\n\n\n\nThank you so much for the response. You are right I should have started with the gaps, it's usually where new things come from.\n\n\n\nI feel the thing I would like to implement most in this kind of interface is CFD. We have done some code development and we are actualy now in the process of developing a simple interface for openfoam (Linux) that would help us streamline our simulations (which are usually one of a certain number of standard scenarios. I believe CFD to be as important as energy simulation for the built environment (perhaps even more for indoor comfort) but it's much harder for people to access. In that light, I would love to help in anyway I can in the Butterfly project. My programming skills are quite bad (although I'm home-schooling myself lately) but I do have a somewhat good understanding of openfoam/cfd. I have to admit though didn't realize there would be a Windows version, any chance we can get foam extend? Anywayds, if you go for it let me know!\n\n\n\nOther parts I would feel there is a gap you already mentioned:\n\n1. Visualization. Actually my home schooled programming is on javascript and d3.js. There is so much data out there concerning building operations and it's very hard to transform them to information useful for us or owners/clients. I am hoping to start a small research project soon on D3.js. My idea is to develop a kind of system in which data (presumably databases) can be 'thrown in' a D3 site which would then transform this data into a series of graphs, plots, etc., into a more structured representation. An example I'm thinking here is EMS data outputs.\n\n\n\n2. LCA. This however is a frustrating part. My main expertise is in LCA but that doesn't mean I like the world of (especially commercial) LCA. While there are a ton of wonderful people to help you (lca-list is amazing for example) there are close to none open data for LCA. Also, one of its biggest disadvantages is it's geographic relevance (never site specific) which is quite important for the construction industry. But with the popularity EPDs are getting lately and the easy way they can be used for simple LCAs I think it's time for some development here as well. So I wouldn't mind the introduction, if the people over there require some assistance.\n\n\n\n3. Easy use of detailed ACMV (sorry for the tropical term) simulations. I get quite frustrated when I have to use DesignBuilder for detailed simulations, the program is just so limiting in the design capabilities. That is why I am so excited for the Openstudio components getting back on track!\n\n\n\nP.S.: Hadn't heard of 3 phase daylight simulation, sounds so cool! \n\n\n\nKind regards,\n\nTheodore.\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "July 16, 2015 at 09:54AM", "created_by": "TheodorosGalanos", "parent_id": "reply_2985220_Comment_1326965", "id": "reply_2985220_Comment_1327144"}