{"body": "\nHi Mostapha, \n\n\n\nThat is my guess as well for the daylight analysis as I had the same issue with the E+ analysis but I solved it and now I can run analyses without any problem. A \"ReRun\" component for DL analysis recipes in order to be able to create a new local folder and run the analysis from there would probably solve the issue. It would be great if you could also update the \"ReRun IDF\" component so it has the \"WriteIt\" command implemented as in the example file you made for Vinu. (the latest release only has the \"RunIt\" command if I am correct).\n\n\n\nAs for the first part of the problem, I (probably falsely) assumed that I need to update my custom EP libraries of the remote machines on the C:\\ladybug folder (or in the \"defaultFolder_\" I ask LB_LB and HB_HB component to create) so I can run the E+ analysis on my remote machines with the materials I created for the recipe on my local machine. Base on this assumption I was wondering if the LB_LB and HB_HB components could first check if the \"defaultFolder_\" path that I input already exist before they create a new one and if it does they read and write from and to the existing contents of it (EPlibraries, RAD libraries e.t.c) instead of creating new ones. \n\nThis way I could have all of the LB_LB and HB_HB components of the remote machines look in one shared \"ladybug\" folder. Is it a bit more clear now? \n\n\n\nfinally I think the next step to the remote analysis process is to parse and cache the generated .csv's on a web-service application and read them on a local machine without waiting time. So practically create a web-service that will do exactly what the \"read_EP\" results does but on a server. (or on the background of a local machine). This would save significant amount of time since the generated .csv's (in my case) exceed 1GB and takes a while to be read within GH. I will try to bring this together and will update you but if anyone has some experience on building web-service apps in Python would be of great help!\n\n\n\n\n\nTasos\n\n\n\n \n", "attachments": [], "created_by_name": "Anastasios Kokkos", "created_at": "November 23, 2015 at 3:45am", "created_by": "AnastasiosKokkos", "parent_id": "reply_2985220_Comment_1405911", "id": "reply_2985220_Comment_1406947"}