{"body": "\nHi Youngjae,\n\nSorry for getting back so late.  The difference between steady state and transient calculations is the basis of a lot of important building science debates these days.  Notably, its responsible for a lot of the present practice's emphasis on the benefits of insulation over thermal mass.\n\nAlong this line of thinking, I would strongly recommend that you use surface flux values as inputs to your CFD simulation if you can (instead of surface temperature).  While EnergyPlus tends to view large surfaces as being at the same temperature, this is usually far from reality and it can actually lead to misleading understandings of airflow patterns since flux includes a time element of Joules/second (or Watts) instead of temperature, which is time independent.\n\nI attached a GH file showing how to bring in surface flux data and color Zone surfaces based on these results.  You should pick an hour of the simulation that you are interested in CFD modeling and use these individual surface flux values and assign them to the surfaces in your CFD model.  Let me know if that is unclear.\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/DIpsX3jcHzNldp92Fk81rtt8zs93DDEU6YmiqOBVxllSVt-tGPSzvwqLHQuFn0LoLYfvv3fGQmmRjapFIjO1NUn3GAFk8rac/Flux.PNG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/DIpsX3jcHzNldp92Fk81rtt8zs93DDEU6YmiqOBVxllSVt-tGPSzvwqLHQuFn0LoLYfvv3fGQmmRjapFIjO1NUn3GAFk8rac/Flux.PNG)\n\nRunning EP-launch is not supposed to be a part of the workflow.  The reason why the simulation did not automatically run after you set \"_runEnergyPlus\" to True on the run simulation component is that you currently have EnergyPlus 8.2 installed and Honeybee only works with EnergyPlus 8.1 right now. Normally, we would keep everything up-to-date with the DoE but there was a particularly massive change that happened in the shift form 8.1 to 8.2, which is that all of the original FORTRAN code of E+ was translated over to C.  In the long run, this will be great since many more people know C than FORTRAN.  However, for the release of 8.2, there are a lot of bugs and certain processes that are slower than usual and so our plan is to wait for the next release to upgrade.  So, long story short, just install EnergyPlus 8.1.\n\nStay awesome,\n\n-Chris\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1216724", "name": "ChimneyExampleFile2.gh"}], "created_by_name": "Chris Mackey", "created_at": "February 03, 2015 at 03:27PM", "created_by": "chris", "parent_id": "reply_2985220_Comment_1207131", "id": "reply_2985220_Comment_1216723"}