{"body": "\nDerin,\n\n\n\nThank you for all of the great feedback.  All of this is really helping improve the usability of the workflow.\n\n\n\nI definitely understand that the orientation of coatings/interlayers/air cavities/BCs in relation to each other is important but I was under the impression that we were talking about the overall orientation of the whole model.  Let me know if I am misunderstanding.  I know that this overall model orientation in relation to the gravity arrow is important and this is why I allow you to put in any numerical orientation when your model is in the XZ plane.  But all models in the XY plane should have the same orientation with respect to the gravity arrow (no matter how the are rotated in that plane).  Do you know of any other parameters (like the gravity arrow) for which it is important to orient the model?  I realize that my own use of THERM is still pretty limited (I am usually only using it to get wintertime U-Values) and any knowledge that you could share is much appreciated.\n\n\n\nYou're case for the export of models with holes makes sense.  I had gotten a little too obsessed with developing a purely Rhino/GH workflow that I did not give enough credit to the things that are easy to do in THERM, (like the paint bucket).  You can now export models with holes in them to THERM as you see here in the attached file:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/jUbMg2cp8jrbwWgHfRCFGxd0F4dFM-e8O6od3hH5VH4dcFwk0Bfr8H1twfwYu5SZnWSmXlnZOA7FK6frOYe2tb1zhcRtGC5s/HolesInThermModel.JPG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/jUbMg2cp8jrbwWgHfRCFGxd0F4dFM-e8O6od3hH5VH4dcFwk0Bfr8H1twfwYu5SZnWSmXlnZOA7FK6frOYe2tb1zhcRtGC5s/HolesInThermModel.JPG)\n\nI am still leaving in the warning on the component just so that new users are aware of the possible workflows but the .thmx file is written.\n\n\n\nLastly, that workingDir issue was a bug that I have just fixed (see github and attached file):\n\n[https://github.com/mostaphaRoudsari/Honeybee/commit/19ae2e7794ef88c...](https://github.com/mostaphaRoudsari/Honeybee/commit/19ae2e7794ef88c53e41ddd7ff9f8d14cbfba0dd)\n\nThanks for finding it and let me know if you have any other suggestions.\n\n\n\n-Chris\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1489057", "name": "ThermExportWorkflow.gh"}], "created_by_name": "Chris Mackey", "created_at": "March 20, 2016 at 12:32pm", "created_by": "ChrisMackey", "parent_id": "reply_2985220_Comment_1487742", "id": "reply_2985220_Comment_1489056"}