{"body": "\nGrace and Jonathan,\n\nThank you so much for all of the information.  I also did some research over the last few hours and I can confirm that you are correct. NFRC states that we're supposed to use a black body with view factor 1 for the exterior.  Accordingly, I have set this as the default whenever anyone plugs in the words 'outdoor' for the film coefficient or plugs in a convective film coefficient greater than 10 W/m2K (which is pretty certainly an outdoor condition).  You can see the changes here on the github and, if you update your components to sync with the github, they will now work in this manner:\n\n[https://github.com/mostaphaRoudsari/honeybee/commit/8804bbdc65bc26a...](https://github.com/mostaphaRoudsari/honeybee/commit/8804bbdc65bc26a2eef97f5ab358a3191b8b6b12)\n\nI'll update the example files with these new components soon.\n\n\n\nFurthermore, for the sake of giving complete control over to people using the THERM components, I have added an extra input for a \"Custom Radiant Environment\" (customRadEnv_) and an extra component by the same name to generate what is needed for this input:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/B3HakomPt9XSs3tTpAE0gca5vtwiwPHPSJ89pAJ6tpLI891N-XGsniBvwREJCF4*pPzkS30cL7GB3ffuRYWJR-b1XZvcCWKe/BlackBodyTHERMSimulation.PNG?width=721\" width=\"721\"/>](http://api.ning.com:80/files/B3HakomPt9XSs3tTpAE0gca5vtwiwPHPSJ89pAJ6tpLI891N-XGsniBvwREJCF4*pPzkS30cL7GB3ffuRYWJR-b1XZvcCWKe/BlackBodyTHERMSimulation.PNG)\n\nThis allows you complete control over the radiation model, view factor, radiant temperature of the environment, and the emissivity of the environment.  If you leave the viewFactor input blank, it will assume an autoEnclosure model but, if you specify a viewFactor, it will use the black body model along with that view factor.\n\n\n\nFinally, I confirmed that the Constant Heat Flux Boundary Condition is mostly intended to account for solar radiation.  So I added an input for this on the boundary condition component.\n\n\n\nI'll post back here once I get the chance to update the example files.\n\nThanks again,\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "May 26, 2017 at 11:50PM", "created_by": "chris", "parent_id": "reply_2985220_Comment_1758464", "id": "reply_2985220_Comment_1758625"}