{"body": "\nJonathan,\n\nThanks so much for the post.  The radiation model can be assigned in the thmx file that Honeybee writes and I just didn't expose it on the Boundary Condition component as I have usually not applied it my own workflows (to be honest, I am not as big of a THERM power user as I am sure that you and many others in the community are).  Now that you have explained it, I see that it's really important and I will add in the ability to assign the radiation model as soon as I can.  I have created a github issue for it and I should have it added to Honeybee within a day or two:\n\n[https://github.com/mostaphaRoudsari/honeybee/issues/629](https://github.com/mostaphaRoudsari/honeybee/issues/629)\n\n\n\nWhile I have you here, do you mind if I ask you a few questions about your workflow (and the boundary condition inputs that I might need to expose on the BC component):\n\n\n\n1) Is is generally good practice to model the exterior BC with a black body radiation model?  If so, I can make the BC auto-assign to a black body radiation model if someone inputs \"outdoor\" for the film coefficient. I know the black body radiation model well but I don't know if it's typically better suited to outdoor conditions compared to the AutoEcnlosure model.\n\n\n\n2) Is is necessary to expose the view factor input for the black body model or do you think everyone will always want to assume a view factor of 1?\n\n\n\n3) Do you ever use the \"Constant Heat Flux\" Boundary condition?  I have never seen a workflow using it yet but I have always assumed that it was used to account for things like solar flux.  I know that I can assign it from the thmx file and, if I understood how it was supposed to be applied, I would know how to expose it properly.\n\n\n\nThanks again,\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "May 26, 2017 at 01:13PM", "created_by": "chris", "parent_id": "topic_1757024", "id": "reply_2985220_Comment_1758193"}