{"body": "\nHi Letizia,\n\nThanks for posting here.\n\nMostapha's recommendation for the additional strings input is what will help you for 2) and 3).  I think that updating should also help with your construction issue.  If you post an example file with this construction issue, I am sure that we can figure out what is going on (generally, going back to a previous version is likely not going to be so helpful in the long run).\n\nFor your 1) question about comfort, you can request outputs related to the Adaptive comfort model from E+ by simply adding the required text output to the \"simulationOutputs_\" input of the \"Run Energy Simulation\" component (it looks like you figured this out from your example file).  I also wanted to make sure that you are also aware that there is a Ladybug component made to calculate adaptive comfort after you have already run the energy simulation and I find this to be useful for playing around with things like wind speed rather than having to run the E+ simulation each time.  At the moment, this adaptive component only does ASHRAE adaptive comfort and not ISO yet so I understand if you want to use the first method.\n\nAs for 4), I have just run into some issues with the ground temperature myself.  E+'s default assumption that the ground is 18C year-round was giving me some pretty crazy results.  Just today, I have added the ability to set ground temperatures with the Energy Sim Par component.  I also changed the default ground temperatures to be informed by the undisturbed ground temperatures in the weather file using code contributed by Anton Szilasi to parse the ground temp out of the EPW. The default is now that a ground temp of 18C will only be used in cases where the undisturbed ground temperature is below 18C and will be the actual undisturbed ground temperature if it rises above 18C.  This seems closer to what a lot of the recommendations in the E+ reference give.  Let me know if this helps.\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "April 4, 2015 at 10:36am", "created_by": "ChrisMackey", "parent_id": "reply_2985220_Comment_1255163", "id": "reply_2985220_Comment_1256246"}