{"body": "\nHi Grasshoppe,\n\n\n\nWell done! That's a CFD simulation alright!\n\n\n\nResults look ok, I mean it's hard to judge since this one is a simple case and not a real model of an area where we have some expected results.\n\n\n\nIn the visualization, points is an interesting option. It's a matter of aesthetics I guess, I go with surfaces :) Also what you can try is selecting Filters -&gt; Slice (you can also find it in the icons above the pipeline viewer), in the Slice options below the pipeline press Z normal and on the Z coordinate press some height relevant to the buildings (e.g. 1.75m a typical human scale). That would show you the flow around the buildings on that height. Experiment with selecting other normals and values. Keep playing with the filters there's some cool things in there. Also you can check out the mailing list and extensive paraview documentation.\n\n\n\nConcerning the errors I apologize because I just downloaded your case.\n\n\n\nIt appears that the decomposeParDict is not included in the system folder. I am not sure if this is due to BF not going through the whole workflow yet or an ommission on our side. Please feel free to add it in Github. I will also note it down and pass it to Mostaph to check. In the meantime please find attached a VERY detailed decomposeParDict file. I took the liberty to set it at 4 processors (the numberOfSubDomains value) and also selected (that is uncommented) the scotch decomposition method. It's the easiest method to use since it is automatic and doesn't require any more inputs on how the domain is decomposed on the x,y,z directions (which would require you to change values in the attached file).\n\n\n\nNow, the different folders created are simply snapshots of the current solution at the specific timestep. To control how often the solver is saving change the writeInterval number in the controlDict file. You can also change almost all these values on the fly, while OF is running.\n\n\n\nFinally, concerning the other errors of parafoam it seems somehow parafoam is reading the intial condition names instead of actual results from the solution files and it doesn't like it.\n\n\n\nDoes this happen only when you open the case (i.e. at 0 time) or does it also happen when you move to an other timestep?\n\n\n\nAlso, are you using paraFoam, paraview or the paraFoam -builtin method?\n\n\n\nThe extension of the paraFoam file seems to be .foam which means you are probably using the built in viewer. That might be the issue but I'm not sure.\n\n\n\nCan you try running paraview, navigate to your case folder, open the .foam file and see if there is still an error?\n\n\n\nAlso, if it isn't much trouble can you zip one of the time folders and attach it here? I'd like to take a look at what's inside to check against what the error report says. \n\n\n\nOnce again thanks for testing! \n\n\n\nKind regards,\n\nTheodore.\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1577330", "name": "decomposeParDict"}], "created_by_name": "Theodoros Galanos", "created_at": "August 06, 2016 at 02:32AM", "created_by": "TheodorosGalanos", "parent_id": "reply_2985220_Comment_1577108", "id": "reply_2985220_Comment_1577329"}