{"body": "\nHi Olivier,\n\n\n\nSince Daysim (the annual daylighting simulation engine used by HB) employs data extracted from tmy epw files for daylighting calculations, I think it is safe to assume that the sky conditions are probably reflective of the prevailing humidity conditions (I just had a chat about this with my [advisor](http://www.engr.psu.edu/ae/faculty/mistrick/), who incidentally also happens to be on the committee for L[M-83](https://www.ies.org/store/product/approved-method-ies-spatial-daylight-autonomy-sda-and-annual-sunlight-exposure-ase-1287.cfm)).\n\n\n\nThe Tregenza sky patches considered in daylighting calculations don't do a good job of incorporating the correct size of the sun into calculations. In the figure below, the sun on the right is the one considered for calculations in Daysim. You can get a more accurate answer by considering a more discretized sky, however, I am not aware if that is possible with Daysim (and therefore HB) right now. Therefore, your direct sun calculations are likely to be off somewhat depending on how much of it there is(I'd say overestimated).\n\n\n\n[<img class=\"align-left\" src=\"http://api.ning.com:80/files/9ydERlsdPuGHkUiAkbBx19KJuKp-iZy8vam6SY-gEfA3ruUTw5eROVVEiQqzJgJV5GQax-so8fkhWFgWKUlqeLz*pdViQ45s/Untitled.png\" width=\"306\"/>](http://api.ning.com:80/files/9ydERlsdPuGHkUiAkbBx19KJuKp-iZy8vam6SY-gEfA3ruUTw5eROVVEiQqzJgJV5GQax-so8fkhWFgWKUlqeLz*pdViQ45s/Untitled.png)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThe calculations with humid sky, which are on account of the sky itself (and not the sun alone) are likely to be more relevant. \n\n\n\nRegarding your questions about studying weathering effects with LB/HB, I have no idea as that is something that I haven't looked into before. I am sure someone else on this list has a more informed opinion on this issue than I do.\n\n\n\nYour project, and your approach to it, seems really interesting and I am glad to be having this discussion :).\n\n\n\nSarith\n\n\n\n\n", "attachments": [], "created_by_name": "Sarith Subramaniam", "created_at": "September 02, 2016 at 11:35AM", "created_by": "sarith", "parent_id": "reply_2985220_Comment_1592617", "id": "reply_2985220_Comment_1592466"}