{"body": "\nHi Severine, \n\nIf you want to know what sort of calculations are going under the hood you could perhaps find useful info here: \n\nRadiance - [http://radsite.lbl.gov/radiance/framer.html](http://radsite.lbl.gov/radiance/framer.html)\n\nDaysim - [http://daysim.ning.com/](http://daysim.ning.com/)\n\nWhen you run the simualtion you will notice on the batch terminal that Daysim is also being called, so you may want to consider how Daysim uses Radiance files &amp; data. \n\n \n\nRegarding your current problem, I think you stumbled onto something weird and interesting.\n\nInterior and exterior readings appear to differ by 40 in the best case scenarios. Even setting the transmittance to 1 yields similar results. I tried changing from cummulative sky to climate sky and got similar values. Changing the test points did nothing either. \n\nI think, (yet I'm too lazy to prove this) that the difference in values stems from diffuse radiation over the sky dome. \n\nIf you delete everything except the glass you'll notice that interior values are like 80-90% of the exterior values (this seems like the expected behaviour with a transmittance of 1). So, if we consider that a vertical window, part of an opaque box, is receiving radiation from 25% of a sphere, as you start to inset the interior test points the radiation they receive will be a fraction of the 25%. \n\nLet me try to explain this better...The exterior surface receives radiation from a section of a sphere calculated by 180degrees on the xy plane (let’s call this angle theta) and by 90degrees (let’s call this angle phi) in azimuthal elevation. If you integrate this over spherical coordinates (theta from 0 to pi; phi from 0 to pi/2) you will find that it comes to a quarter of a sphere. By comparison, the interior surface will not integrate theta from 0 to 180degrees,nor phi from 0 to 90degrees, instead it will be the subtended angle from the exterior surface as a function of their separation; the farther in you go the smaller the view of the outside. \n\nIf my hypothesis is correct there shouldn't be that much difference since the separation is only 10cms...the subtended angle would be like 170 instead of 180 for theta and 85 instead of 90 for phi...overall if you integrate both spherical areas there should only by a difference of 10%.\n\nIn conclusion, I believe the unexpected behaviour stems from the previous subtended angle thing. If direct radiation was the only factor the difference would be the aforementioned 10%, which suggests that an additional source of energy is also affected by this. Perhaps indirect and diffuse radiation from other areas of the sky dome.\n\nI’m definitely intrigued on why this is happening. Please post if you figure it out.\n\nRegards,\n\nMauricio\n\n \n", "attachments": [], "created_by_name": "Mauricio Aguilar Cardenas", "created_at": "April 06, 2016 at 11:06AM", "created_by": "MauricioAguilarCardenas135", "parent_id": "topic_1502227", "id": "reply_2985220_Comment_1502510"}