{"body": "\nI just wanted to share my experience performing 400 annual glare analysis on a monster 128-CPU server. So here it goes\n\n1- The server is based on Amazon's EC2 service. The server has 128 V-CPUs and 1.9 TB of RAM.  I think I'm going to start a GoFundMe campaign to buy one for myself :)\n\n2- The server's cost is about $13 an hour. I get free access to supercomputer through my university and xsede.org because I earned an NSF Honorable mention last March, however, the supercomputers available through both resources are a little complicated for me to use, as opposed to the one available from amazon that has Microsoft server 2012 already installed.\n\n3- I wanted to run 400 annual glare simulations for 400 different views. \n\n4- I tried a to perform annual glare simulation for one view on my Dell XPS that has Intel Core i7-6700HQ processor and 16GB of system memory. The simulation took 2 hours to complete. Radiance parameter ab was set to 6. \n\n5- I wanted to obtain the batch file for each view so I can run them on the server. So I used the fly component to run all 400 simulations and closed the cmd windows, that wasn't bad ( for me at least) because I asked my son to this job for me, he was just glad to help me :)\n\n6- I created one batch file using this cmd command:\n\ndir /s /b *.bat &gt; runall.bat\n\nThis created a file with the path to each .bat file. I edited this file in Notepad++ to include the word \"start\" at the beginning of each line. This was done using the \"find and replace\" dialogue box.\n\n 7- I split my newly created batch file into 3 batch files, each one has about 130 file names and \" start\" before the file names.\n\n8- installed radiance on my server\n\n9- Ran the first batch file on the server, this started 130 cmd windows performing my simulations, CPU usage was anywhere between 90% to 100%  and about 105 GB of RAMs were used.\n\n10. It took about 5 hours to complete all 130 simulations, I expected to run all in 2 hours but can't complain because this would've taken about 260 hours to run on my laptop. After the simulations done I ran the second and then the third batch files ( total of about 15 hours). \n\n11. I got 400 valid dgb files. Couldn't be happier! \n\n\n\n\n\n\n\n\n\n\n\n \n", "attachments": [], "created_by_name": "Ninja", "created_at": "August 10, 2016 at 08:54PM", "created_by": "RaniaLabib", "parent_id": "topic_1576412", "id": "reply_2985220_Comment_1579897"}