{"body": "\nHi Theodore,\n\nSorry that there has not been as much activity on this discussion as there should have been.  I know that Mostapha put in a lot of checks that tried to self-correct in cases where the Rhino surfaces were not correctly mirrored.  Part of the difficulty stems from the fact that we wanted to keep these checks fast and just use some vector intersections to test whether a surface is facing the right direction but these checks clearly do not always work in my experience as in yours.  I have thought about adding in a check on the \"zones from surfaces\" workflow that uses a Rhinoscript function to put the surfaces into the Rhino scene, join them, explode them, and reassign the normals to the original HBSrfs.  Normally, I would use RhinoCommon for this joining operation but I know that the \"JoinBreps\" function there can produce a closed brep where all of the surfaces are facing inward, which is a bug in RhinoCommon and supposed to be impossible.  This rhinoscript route will take a lot longer to run but I know that it will never fail.\n\nSo I know that this is going to be a big compromise in the time it takes to run but I have ran into this difficulty with normals so may times myself that I badly want it to be changed.\n\nMostapha, what are your thoughts on this?  I am thinking that I will only put the rhinoscript check function on the \"CreaHBZones\" component and I will leave the masses2Zones workflow as is.\n\nIn the meantime, Theodore, can you upload a GH file that contains just a portion of the building that you are trying to simulate but enough so that you get the error?  I will use it to try to fix this issue if Mostapha is ok with it.\n\nLastly, I really cannot understand what you are asking about with the adjacent surfaces.  As long as you follow the rules that I lay out in this video, you should be fine:\n\n[https://www.youtube.com/watch?v=cDvBWDA0aF0&amp;index=10&amp;list=P...](https://www.youtube.com/watch?v=cDvBWDA0aF0&amp;index=10&amp;list=PLruLh1AdY-SgW4uDtNSMLeiUmA8YXEHT_)\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "May 2, 2015 at 1:32pm", "created_by": "chris", "parent_id": "reply_2985220_Comment_1277434", "id": "reply_2985220_Comment_1278966"}