{"body": "\nAaron,\n\nThis error is not actually that severe in terms of the consequences for energy use.  Your overall energy use values that you get out of the simulation should still be pretty accurate.  However, if you are looking at surface temperatures or sub-zone results, these values will likely not be accurate.\n\nThe error results from the fact that you have zone geometry that is concave (or L-shaped to put it more simply) and this means that Energy Plus's simplified algorithm for ray tracing sun rays from the windows into the zone is not working so well (since some of the rays intersect more than one wall of your zone).\n\nYou will notice that, if you run the simulation without interior reflections using the Energy Simulation Par component, that the error goes away.  Running the model this way will just use a view factor calculation from the window to the other surfaces of the zone in order to distribute the incoming solar energy to the zone's surfaces (rather than a sunray tracing operation that will usually put more solar energy into the floor slab).\n\nSo, to solve the problem, you can either not look at surface results, run the simulation without interior reflections, or break up your L-shaped zone into two zones with an air wall between them.\n\nI hope that helps.\n\n-Chris\n\nPS. If we are ever unable to answer E+ questions like this, a good site to post E+related questions is this awesome one that Peter Ellis (the founder of the OpenStudio plugin for Sketchup) put together: [https://unmethours.com/questions/](https://unmethours.com/questions/)\n\nPSS. I got an email about another post that you made about multiZone adjacencies that seems to have gotten lost in the Grasshopper Website system.  If you post again, I will write you a response.\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "November 10, 2014 at 5:46pm", "created_by": "ChrisMackey", "parent_id": "topic_1165652", "id": "reply_2985220_Comment_1165874"}