{"body": "\nHi Albert.\n\n\n\nI remember that I awe you a video on how generate geometries from floor plans! I put a script together that can help you to clean your file. I put the closed curve for each floor under a separate layer, and used 'dynamic geometry pipeline' from Human plugin to bring them to grasshopper. Then projected each group to floor plane. Then I used a script that I originally wrote for another [discussion](http://www.grasshopper3d.com/xn/detail/2985220:Comment:1528124) to find the points that are close to each other but don't align.\n\n\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/SfsQAdhhVittKKnea4caMnTbFqVaIwjMTEICtxGZe49B7uErZP-ui6ri8ePXJrYLjJuiyFWUWfK4VcQJ-1K0gQV3l-Ag8V2g/find_problematic_points.png?width=721\" width=\"721\"/>](http://api.ning.com:80/files/SfsQAdhhVittKKnea4caMnTbFqVaIwjMTEICtxGZe49B7uErZP-ui6ri8ePXJrYLjJuiyFWUWfK4VcQJ-1K0gQV3l-Ag8V2g/find_problematic_points.png)\n\n\n\n\n\nI also projected all the curves to XY plane which you can use to check all the plan curves at different floors together. For editing the curves use plan view and set planar to True and then select control points and move them around to make sure the lines are aligned perfectly. Since I'm using Dynamic Geometry Pipeline component each time that you change a line it will recalculate the script. You can alternatively use Grasshopper's Geometry Pipeline component but then you need to re-run the script after making changes in Rhino.\n\n\n\nI attached both Rhino and Grasshopper files. You need to have Human plugin installed to be able to use this script.\n\n\n\nHope it helps,\n\nMostapha\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1579409", "name": "checkPlanCurves.gh"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1579810", "name": "hotel_projected_lines.3dm"}], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "August 10, 2016 at 06:43AM", "created_by": "mostapha", "parent_id": "reply_2985220_Comment_1579553", "id": "reply_2985220_Comment_1579408"}