{"body": "\n\n\nOk. You should supply all of those facade elements to the **context_** input, regardless if they are glass or opaque panels.\n\n\n\nLet me now just clarify the **self-shading** term, as it may be that we did not understand each other quite well.\n\nI will pick one piece of the PVsurface at the bottom row:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/QXFoMJO9hw7sMg6*Z0bbSImL5BRc4Yw3*e6RTpNWwoW*17bhMNRwL5bCxj011rUo77YZug*G33IFt1ql7AVPyrYfPxzW-IMI/shading_diagram_1.jpg?width=200\" width=\"200\"/>](http://api.ning.com:80/files/QXFoMJO9hw7sMg6*Z0bbSImL5BRc4Yw3*e6RTpNWwoW*17bhMNRwL5bCxj011rUo77YZug*G33IFt1ql7AVPyrYfPxzW-IMI/shading_diagram_1.jpg)\n\nSo the **label \"1\"** represents the PVsurface for which the shading diagram will be created.\n\n**Label \"2\"** is the back facade (made of glass or opaque elements, does not matter).<br/>**Label \"3\"** represents the row of PVsurfaces above.\n\nNow take a look at how the shading diagram would look like for the mentioned PVsurface. I made some of its parts a bit incorrect on purpose, so that I could clearly the differences a bit easier:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/QXFoMJO9hw5kuluQfh3UKJ8-vPN5jzItoIA-XjlDVMnqP50ZQbIRfGf7MENrgPeuH7w6S7FSndibASKK4BZ7is3S49fkGcaj/shading_diagram_2.jpg?width=200\" width=\"200\"/>](http://api.ning.com:80/files/QXFoMJO9hw5kuluQfh3UKJ8-vPN5jzItoIA-XjlDVMnqP50ZQbIRfGf7MENrgPeuH7w6S7FSndibASKK4BZ7is3S49fkGcaj/shading_diagram_2.jpg)\n\n**Label \"1\"** would be first type of self-shading. It's the shading which prevents the PVsurface to \"see\" anything behind its back.<br/>**Label \"2\"** would be shading from the facade wall to which the PV surfaces are attached to. I deliberately colored it blue, to distinguish it from other two types of the shading. Otherwise it would look black.<br/>**Label \"3\"** is the second type of self-shading: the shading from the above row of PV surfaces.<br/>In literature, you won't find the terms: first and second type of self-shading. I invented them.<br/>To my knowledge, when **self-shading** is mention, this will probably be related with **label \"3\"** (second type of self-shading). It's the shading from the adjacent rows of PV modules in front, or like in this case above.<br/><br/>So when I said:\n\nYou do not have to supply the surfaces additionally to the context_ input. The component will \"under the <br/>hood\" add them to the context_ input to account for self shading. Last year this hasn't been the case, <br/>but after the suggestion by Chris Mackey, I changed this feature.\n\nThis was related to the first type of self shading (**label \"1\"**).\n\n\n\nAnd when I said:\n\nHowever, as we are using the PV SWH System size component, there will be no self-shading. The PV <br/>SWH System size component positions the PV rows in such a way, that no self shading will appear for <br/>the given minimalSpacingPeriod_ criteria.\n\nThis was related to the second type of self shading (**label \"3\"**).\n\nI should also mention that I made the upper photo a bit incorrect. If you would do the shading analysis, the **label \"3\"** would be almost non-existent. Here is how the shading diagram would actually look like:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/QXFoMJO9hw5hyVycXJXjitswOo1*6sHsmYC2OxzSokrzVeeqnEj0u7eFfTj7cAEPuypKwjP1ln8zm4Gz78SMOpPQC4Do4Yaf/shading_diagram_3.jpg?width=200\" width=\"200\"/>](http://api.ning.com:80/files/QXFoMJO9hw5hyVycXJXjitswOo1*6sHsmYC2OxzSokrzVeeqnEj0u7eFfTj7cAEPuypKwjP1ln8zm4Gz78SMOpPQC4Do4Yaf/shading_diagram_3.jpg)\n\nAs mentioned this is because **PV SWH System size** component will position each PVsurface row in such a way, so that there would be no second type of self shading for the chosen minimalSpacingPeriod_ criteria. In our case, as the minimalSpacingPeriod_ criteria we chose the summer solstice in the Northern Hemisphere from 10 to 14 hours. We should have taken from 9 to 15, but we took from 10 to 14 to as on option of lowering the distance between the PV rows.<br/>This means that there will be no second type self-shading all year round from 10 to 14 hours.\n\nLet me know if all of this helps in any way.\n", "attachments": [], "created_by_name": "djordje", "created_at": "May 28, 2016 at 12:10pm", "created_by": "djordje", "parent_id": "reply_2985220_Comment_1538214", "id": "reply_2985220_Comment_1538235"}