{"body": "\nHi, all\n\n\n\nI was inspired by this website and tried to figure out how to create this kind of graph by grasshopper. (It's too bad I know nothing about Java, the code seems quite clean)\n\n[http://michaelvandaniker.com/electricity/](http://michaelvandaniker.com/electricity/)\n\n\n\nAnyway, I figured it out in the end, and added another layer information about solar power the photo-voltaic panel generated. \n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/PdXXQXB083VwcZGn-8ee0sjX3ygZUFhn-Tu8mXljbhHu7E8oYLt-Rw0icRFZZjcsERqM1CNzpyN-46Wtr3T7Gu91zk1AiZ9t/Info01.PNG?width=750\" width=\"750\"/>](http://api.ning.com:80/files/PdXXQXB083VwcZGn-8ee0sjX3ygZUFhn-Tu8mXljbhHu7E8oYLt-Rw0icRFZZjcsERqM1CNzpyN-46Wtr3T7Gu91zk1AiZ9t/Info01.PNG)[<br/>](http://api.ning.com:80/files/PdXXQXB083X-9MMoW0j2KnoqzJ83zekXDuVPw7U-VVjmO7palwCVcmHGXLMpwXg508HjRb*smGYhll8bIjzLMxgkYG*nslxE/Info01.PNG)\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/LkCkzR8kYllLhbTd6MTYhRY5kJgkGicG7jsJFk5yM2xcew0vEI4IngWd8o7MS8Wvn3w5ZnqfdM9NplrmbES1OrFIgxGZssRI/Info02.PNG?width=750\" width=\"750\"/>](http://api.ning.com:80/files/LkCkzR8kYllLhbTd6MTYhRY5kJgkGicG7jsJFk5yM2xcew0vEI4IngWd8o7MS8Wvn3w5ZnqfdM9NplrmbES1OrFIgxGZssRI/Info02.PNG)\n\n\n\nIt's quite interesting to visualize how the building performance along with temperature and activities. If anyone is interested, I'd like the share the method I found.\n\n\n\nThe first step is to collect data we need: temperature and electricity usage.\n\nSo the electricity data is easy to get from electricity company website, that only took me 5 minutes. However, how to get annually hour weather data is quite challenging: I need hourly temperature data for the whole year. Weather underground do have that data, but it only displayed daily, so I will need to click 365 pages to collect all the information. Fortunately, there's already someone figured out the solution -- screen-scraping.\n\n[http://flowingdata.com/2007/07/09/grabbing-weather-underground-data...](http://flowingdata.com/2007/07/09/grabbing-weather-underground-data-with-beautifulsoup/)\n\nI only modified the searching code to hourly data instead of daily average temperature (see the attachment ).\n\n\n\nAfter getting all the data I need, the visualization part is much easier. I just assigned the value to the point cloud as color and size. However, there's one question that really bothers me which is how to color the grid and export to illustrator.  It's easy to use the colorMesh component but when export to illustrator the color disappeared. What I did in the end is using the hatch component from human to convert each mesh into hatch. This worked but I am wondering if there's any more efficient way? I know ladybug component can bake graphics that maintain the color information to illustrator.\n\n\n\nBest\n\nQinheng\n\n\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1547261", "name": "modifiedCode.txt"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1547262", "name": "Elec-temp_Info.gh"}], "created_by_name": "Qinheng", "created_at": "June 13, 2016 at 8:47pm", "created_by": "Qinheng", "topic": "Annually thermal infographic about electricity usage and temperature", "id": "topic_1547263"}