{"body": "\nWonderful Ladybug Community!\n\n\n\nThis is a reminder that Mostapha and I will be teaching two days of workshops in San Francisco covering the latest and greatest Ladybug Tools development.\n\n\n\nOn Saturday August 5th, we will be covering [CLIMATE DATA + DAYLIGHT WORKFLOWS WITH LADYBUG + HONEYBEE](http://buildingsimulation2017.org/workshops.html#WK-PEC03).  The morning will cover weather data visualizations as participants learn the basic principles for generating customized climate graphics with Ladybug. The afternoon will explain the workflows for daylight modeling with Honeybee as participants learn to automate and run more advanced studies. This session is perfect for people who have some background in climate analysis are are looking to harness the capabilities of visual scripting in their workflows.\n\n\n\nOn Sunday August 6th, we will be covering [ENERGY + ENVELOPE DESIGN WITH HONEYBEE OPENSTUDIO + THERM](http://buildingsimulation2017.org/workshops.html#WK-PEC05).  The session will focus on building energy modeling and envelope U-value modeling with the Honeybee plugin for Grasshopper. In the morning, participants will setup a parametric energy model and use it to perform a sensitivity analysis to inform intermediate stages of design. In the afternoon, instructors will explain the basics of modeling construction details with Honeybee THERM.\n\n\n\nThe workshops are in conjunction the 2017 International Building Simulation Conference and will be held at the Pacific Energy Center.  You do not need to be registered for the conference in order to attend the Ladybug workshops.\n\n\n\nRegistration for the workshops can be done here:\n\n[http://www.bs2017.org/register/](http://www.bs2017.org/register/)\n\n\n\nIf you are not interested in attending the conference, just select the \"Workshop(s) Only\" option in the registration form.\n\n\n\nCheers!\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "July 19, 2017 at 1:40pm", "created_by": "chris", "topic": "Ladybug Tools Workshops in San Francisco! (Aug 5th-6th)", "id": "topic_1786234"}