{"body": "\n[<img class=\"align-center\" src=\"https://github.com/ladybug-tools/butterfly/blob/master/etc/graphics/logo/butterfly_100px.png?raw=true\"/>](https://github.com/ladybug-tools/butterfly/blob/master/etc/graphics/logo/butterfly_100px.png?raw=true)\n\nWe are very excited to finally release the Butterfly plugin for both grasshopper and dynamo on this lovely first day of Spring! After several rounds of development, testing, and modification, Butterfly has finally metamorphosed to have all known major bugs fixed and is ready to be used by a larger number of people in our community.\n\n\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/mW49cr6lkax1tOEUiCibWmGp66jeqlHNSt*aoxz7TgiicXvmpY4lTyDgKTt9GpstXxZlmKNMraxqE-xsSgTFNythZaAj42eL/graphics.jpg?width=750\" width=\"750\"/>](http://api.ning.com:80/files/mW49cr6lkax1tOEUiCibWmGp66jeqlHNSt*aoxz7TgiicXvmpY4lTyDgKTt9GpstXxZlmKNMraxqE-xsSgTFNythZaAj42eL/graphics.jpg)\n\nButterfly is powered by [OpenFOAM](http://www.openfoam.com/), which is a validated and open-source engine for Computational Fluid Dynamics (CFD). Primarily, Butterfly assists with exporting geometry and other input  parameters from the CAD + scripting interface to the OpenFOAM engine. The Grasshopper plugin supports live results visualization that updates as the CFD simulation iterates.  The Dynamo plugin supports results visualization once the analysis is over or paused.\n\n\n\nFor installation instructions and guidance on getting started, check out the [Butterfly wiki page](https://github.com/ladybug-tools/butterfly/wiki). There, you can find step-by-step installation directions and tutorial videos. There also 3 YouTube playlists for getting you started with installing OpenFOAM for Windows and using [Butterfly for Grasshopper](https://www.youtube.com/playlist?list=PLkjfDmSc5Orx2qJivQBA9Rgk2KAOiESmo) and [Butterfly for Dynamo](https://www.youtube.com/playlist?list=PLkjfDmSc5Orwm25oLj3cddDKR8SOXUP5l).<br/>\n\n<br/><iframe _origwidth=\"560\" allowfullscreen=\"\" frameborder=\"0\" height=\"315\" src=\"https://www.youtube.com/embed/videoseries?list=PLkjfDmSc5OrxwNaf7xmPJ5lpmF11J7kuE&amp;wmode=opaque\" width=\"560\"></iframe>\n\n\n\n\nSimilar to other ladybug tools, Butterfly uses an external validated engine (in this case, OpenFOAM) and you need to install it first to get the insect up-and-running.  However, unlike Radiance and EnergyPlus, OpenFOAM doesn’t have a native installation for Windows and it requires Linux to run. Accordingly, the current version of “OpenFOAM for Windows” uses a technology called [docker](https://www.docker.com/) to run a Linux virtual machine on your system, inside which OpenFOAM operates. While this sounds complicated, the good news is that all of this setup has been packaged into the installer for “OpenFOAM for Windows.”  So running this installer with all its defaults should give you everything you need.\n\n\n\nThe bad news is that the installation can fail if you don’t check your Windows system properly beforehand or don’t follow every step carefully afterwards. You will also need to run Rhino, Revit, and OpenFOAM as an administrator to ensure Butterfly works properly (by right-clicking each launcher for the program and selecting “Run As Administrator\").  This said, if you follow the steps carefully, you should have no issues with the installation. You can find some of the issues that people faced during the alpha testing and the solutions to them [here](https://github.com/ladybug-tools/butterfly/issues?q=label%3A%22OpenFOAM+installation+issues%22+is%3Aclosed).\n\n\n\nButterfly is the first plugin that is fully developed based on the structure that I [discussed before](http://www.grasshopper3d.com/group/ladybug/forum/topics/ladybug-analysis-tools-in-2017) which consists of a [core library](https://github.com/ladybug-tools/butterfly) and [[+] libraries](https://github.com/ladybug-tools/butterfly-plus) for specific software (in this case Grasshopper and Dynamo). We hope this structure to extend ladybug tools to more platforms by re-using the current code. We will provide a better documentation with more details on this matter in the near future but for now you can use the API for [butterfly](http://ladybug-tools.github.io/butterfly/doc/butterfly), [butterfly_grasshopper](http://ladybug-tools.github.io/butterfly/doc/butterfly_grasshopper) and [butterfly_dynamo](http://ladybug-tools.github.io/butterfly/doc/butterfly_dynamo/) for customizing or extending the current development.\n\n\n\nFinally, having access to a powerful CFD engine from inside parametric/generative modeling environments is a great power and as Spider-Man or Uncle Ben once said:\n\n\n\n“with great power comes great responsibility!”\n\n<br/>We believe in learning by doing and we don’t expect you to be a CFD expert to get started with butterfly however we expect you to educate yourself along the way. If you have never used OpenFOAM before [here](http://jibranhaider.weebly.com/openfoam.html) is a great presentation to get started. We also highly recommend checking out the official [OpenFOAM User Guide](https://cfd.direct/openfoam/user-guide/) that goes through most of its functionality. Finally, we have also collected a number of other [learning resources](https://github.com/ladybug-tools/butterfly/wiki/Learning-Resources) on this page that can be a good starting point.\n\n\n\nWe understand that you will have questions about the plugins which you can post to this forum or Dynamo discussion forum however CFD related issues and questions should be posted to [CFD Online](https://www.cfd-online.com/).\n\n\n\nI like to thank everyone who have helped us with the development and testing during the last year or so, and special thank to [Theodore](http://www.grasshopper3d.com/profile/TheodorosGalanos) who single-handedly educated me through the process of migrating to OpenFOAM and developing butterfly. Butterfly wasn’t possible without Theodore!\n\n\n\nAs always let us know about your comments and suggestions.\n\n\n\nHappy flying the butterfly! Happy Spring!\n\n\n\n\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "March 20, 2017 at 11:06am", "created_by": "MostaphaSadeghipour", "topic": "Butterfly beta release for Grasshopper and Dynamo", "id": "topic_1716735"}