{"body": "\nHi all,\n\nI am trying to use some ldt files for simulating optic fyber (to increase natural light) by Parans. Honeybee reads Ies file, so I decided to change my ldt file in Ies using Photoview ( an Oxytech software), but the example file of Sarith didn't work with this new Ies file. Is there a problem about the new ies file made with Photoview? can I use directly ldt file? \n\nAfter that, I am looking for a way to improve the model of a building with dynamic shading with the contribute of this technology. Natural light from optic fyber is produced when the sky is sunny. The fyber have to work When the sensor for dynamic shading reach the values of threshold. So the first idea was to use the light control component to switch on and off the light, and calculate the contribute of this technology in the UDI range. But the light control is usefull for electric consuption ( one of the input is the power of the light in watt and not lux or Ies file), and the new Luminaire compontent I don't know if can be used for this kind of study (on off during the year).\n\nThanks in advance\n\nDavid \n\n\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/p9ey71ICjWc-4phugQcnCmB6Neu6nZuFRdFJ2qURWet4f6ye1s1wPimwsSzdj-l-5WgD5WjOm-LpHSriLVMFUZqPzHDUInAa/IES.png?width=750\" width=\"750\"/>](http://api.ning.com:80/files/p9ey71ICjWc-4phugQcnCmB6Neu6nZuFRdFJ2qURWet4f6ye1s1wPimwsSzdj-l-5WgD5WjOm-LpHSriLVMFUZqPzHDUInAa/IES.png)\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1461370", "name": "Parans L1 Small.ldt"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1461371", "name": "Parans L1 Small.IES"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1461372", "name": "IES_Electric_Lighting_Basic_Example.gh"}], "created_by_name": "David Maimone", "created_at": "February 12, 2016 at 03:10AM", "created_by": "DavidMaimone", "topic": "ldt file and IES file \\ Interior light contribute in annual analysis", "id": "topic_1461373"}