{"body": "\nHi everyone,\n\n\n\nI'm trying to do some energy simulations with honeybee. I usually use Diva but in last weeks I have started with Honeybee.\n\nI'm trying different work-flow to simulate various types of shading devices.\n\nIn file attached you can find all the different attempts. Unfortunately I have some problems with these simulations.\n\n\n\n1) - The first problem is related to EP Construction components: You need a newer version of ladybug to use this component.... so I can't create any new materials.\n\nI have tried to use the update components but it doesn't run and produces this error:\n\n**Downloading the source code...**<br/>**Removing Old Version...**<br/>**Runtime error (Win32Exception): WindowsError**<br/>**Traceback:**<br/> **line 235, in main, \"&lt;string&gt;\"**<br/> **line 264, in script**\n\n\n\n2) (Red Box) I have simulated a box with a single window facing south. Both with or without shading (and different shading combinations) I obtained always the same result. I used the window shade generator component and seems It is working well.\n\nWhat is the problem?\n\n\n\n3) In the box 3, I have only changed the approach to define the thermal zone. The E+ component gives me this error: Solution exception: 'hb_EPFenSurface' object has no attribute 'blindsMaterial'. I don't know what is the problem.\n\n\n\nAt the end, I tried to simulate a complex geometry shading device. As you suggest, in other post, I used HBContext component but during the E+ simulation compares this error message: **'None Type' object is unsubcriptable. **Maybe the geometry is too complex or something goes wrong with the mesh?\n\n\n\nThank you for your availability and help. And sorry for too many questions.\n\n\n\nBye\n\n\n\nAndrea\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1485284", "name": "HB attempts.gh"}], "created_by_name": "Andrea Zani", "created_at": "March 15, 2016 at 10:25AM", "created_by": "AndreaZani905", "topic": "Some problems with E+ honeybee simulation", "id": "topic_1485285"}