{"body": "\nHello everyone,\n\n\n\nI am about to run a parametric study with around 1800 states. For each of those states several building performance parameters will be calculated (mainly daylight metrics within the buildings and outdoor comofort and shade in the outdoors).\n\n\n\nI mean to use pollination in order to quickly sort through the results afterward. However, I have never used it before and I was wondering if there is an example definition laying around. It would be very helpful into getting me started.\n\n\n\nAnother thing I was wondering about is structuring the results. My main parameters in the study are angles of orientation for either the total massing or the individual rotation angles for the buildings. Would it be possible to structure the results in a way that you can browse through all results of individual rotation angles for one of the available massing orientation angles (see below)? Is that a matter of proper structuring my parameters before I link them to Pollination? Or is that already handled by simply linking my parameters in?\n\n\n\ne.g.\n\n\n\n                                         \n\n                                               Building 1 angle: 5    Building 2 angle: 0\n\n                                               Building 1 angle: 10  Building 2 angle: 0\n\n Orientation angle: 45                  Building 1 angle: 15  Building 2 angle: 0\n\n                                               Building 1 angle: 20  Building 2 angle: 0\n\n                                               etc.\n\n\n\nThanks a lot in advance!\n\n\n\nKind regards,\n\nTheodore.\n\n\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "January 25, 2016 at 07:48PM", "created_by": "TheodorosGalanos", "topic": "Pollination for HB/LB", "id": "topic_1447107"}