{"body": "\nI wanted to share some thoughts and resources about modelling natural ventilation of buildings. I have been thinking a lot about natural ventilation lately because it seems like one of the most promising ways to leverage simulation results from ladybug and inform design of building envelops with benefits that can be modeled. Given 20 percent of the cost of a project typically goes to the facades, and maybe a half of that goes to the openings, there is a good enough reason to question how to materialize that 10 percent, which can result in 10-30 percent difference in total energy comsumption.\n\n\n\nI think ideally radiation analysis, natural ventilation and daylight analysis on floors should all inform opening sizes and placements, as well as the building sections at large. However natural ventilation seems to be the most complicated one because it couples airflow and thermo dynamics. I have a definition setup so that I can batch simulations for radiation analysis and daylight analysis, but natural ventilation is the missing link. So for what I am doing now I will select a handful of design that seem to work the best based on the two available analysis and convert all the geometry into CAD files so that I can run them in an evaluation copy of autodesk simulation CFD. So for now I can do this in 2 stages.\n\n\n\nBut for the future, given the possibility of actually have that as a part of grasshopper feature, which would be lovely, I want to understand the science behind it and share some links.\n\n([http://www.wbdg.org/resources/naturalventilation.php](http://www.wbdg.org/resources/naturalventilation.php)) In this link the author outlines quite a few general principles and variables to consider for natural ventilated buildings.\n\nFor example, how stack effect works.\n\nQstack = Cd*A*[2gh(Ti-To)/Ti]^1/2, where\n\n<br/>Qstack = volume of ventilation rate (m³/s)<br/>Cd = 0.65, a discharge coefficient.<br/>A = free area of inlet opening (m²), which equals area of outlet opening.<br/>g =9.8 (m/s²). the acceleration due to gravity<br/>h = vertical distance between inlet and outlet midpoints (m)<br/>Ti = average temperature of indoor air (K), note that 27°C = 300 K.<br/>To = average temperature of outdoor air (K)\n\n\n\nThe thing about natural ventilation is that not only the sizes and positioning of openings of the facade facing predominant wind matter, but also the openings on the other side matter. The vertical distance between the inlets and outlets also need to be taken into account. The author suggests that naturally ventilated buildings should be no wider than 45 feet.\n\n\n\nand in this pdf presentation it discusses CFD for natural ventilation and illustrates why it is not easy\n\n[http://isites.harvard.edu/fs/docs/icb.topic882838.files/L17.6205Air...](http://isites.harvard.edu/fs/docs/icb.topic882838.files/L17.6205Airflow-Modeling_Ibarra.pdf)\n\n\n\nand in this pdf briefly outlines the approach taken by designbuilder \n\n[http://isites.harvard.edu/fs/docs/icb.topic472869.files/DesignBuild...](http://isites.harvard.edu/fs/docs/icb.topic472869.files/DesignBuilder%20Simulation%20Training_HSD.pdf)\n\n\n\nLastly a wide spectrum of environmental analysis works by e3lab\n\n[http://www.e3lab.org/research](http://www.e3lab.org/research)\n\n[http://www.e3lab.org/green-buildings](http://www.e3lab.org/green-buildings)\n\n\n\nIf I make progress on a way to tie the three analysis together (radiation, daylight and natural ventilation), I wont forget to post it on this thread.\n\n\n\nThanks.\n", "attachments": [], "created_by_name": "Youngjae chung", "created_at": "December 14, 2014 at 03:28PM", "created_by": "YOUNGJAECHUNG", "topic": "Thoughts on bouancy driven natural ventilation", "id": "topic_1188113"}