{"body": "\n[](http://api.ning.com:80/files/h04tScqf3LY1j7-F74wJ8mVog9tJXJyfGJnJpK74zwBAOldU3vWMdp2RlCWRm4C-x8BdnsFnxqkKLoJLbV7zqK5tMCB2rHEr/interzoneairflowratequestion.PNG)\n\n[](http://api.ning.com:80/files/h04tScqf3LY1j7-F74wJ8mVog9tJXJyfGJnJpK74zwBAOldU3vWMdp2RlCWRm4C-x8BdnsFnxqkKLoJLbV7zqK5tMCB2rHEr/interzoneairflowratequestion.PNG)\n\nHi All,\n\n\n\nI have a question regarding the component \"setEPNatVent\", in which different types of natural ventilation can be set.\n\nI am trying to simulate a large volume by splitting it into small thermal zones with AIR WALL as adjacency type, and I would like to input a specific amount of natural ventilation that these zones are getting (calculated in another program).\n\nHowever, it is important to have E+ understanding that these zones are acquiring air from specific neighbouring zones (might changing over time within a year simulation).\n\n\n\nMy question is: how is the input (as shown in the image) **interZoneAirFlowRate **defining the incoming air temperature in a zone? Especially difficult to define this is when multiple zones are fed into this component. How does it understand whether the specific amount of air is flowing from one zone to another with a specific sensible heat level and moisture?\n\n\n\nIf this is not possible to be done through this component: Is there a way to trick E+ in making this set up possible? The goal is to have each zone getting a specific air flow rate from another zone, with the relative air temperature and relative humidity. Setting the mechanical system for each zone with the related air temperatures and ventilation rates is a good solution?\n\nI hope the problem is clear and that someone can help me with this!\n\n\n\nThank you,\n\nAntonio\n\n[<br/>](http://api.ning.com:80/files/h04tScqf3LY1j7-F74wJ8mVog9tJXJyfGJnJpK74zwBAOldU3vWMdp2RlCWRm4C-x8BdnsFnxqkKLoJLbV7zqK5tMCB2rHEr/interzoneairflowratequestion.PNG)\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/h04tScqf3LYULzbaNTmUgRmX-LEOonq4QHECJ88RaxBOsI8p2mJdY-9iMxLzn9t8hXfZB0FE3UBY8Nsp2OSlIXCvS7zxCQvg/interzoneairflowratequestion.PNG\" width=\"582\"/>](http://api.ning.com:80/files/h04tScqf3LYULzbaNTmUgRmX-LEOonq4QHECJ88RaxBOsI8p2mJdY-9iMxLzn9t8hXfZB0FE3UBY8Nsp2OSlIXCvS7zxCQvg/interzoneairflowratequestion.PNG)\n\n\n", "attachments": [], "created_by_name": "Antonio D'Aquilio", "created_at": "September 9, 2015 at 10:09am", "created_by": "AntonioDAquilio", "topic": "Interzone Airflow Rate for a large volume", "id": "topic_1357445"}