{"body": "\nDear All, \n\nI am posting this thread to avoid future confusion regarding Infiltration Values. \n\nThe air infiltration method is calculated by the Design Flow Rate (see \"Ref Object: ZoneInfiltration:DesignFlowRate\" ) in Energy Plus. \n\nTo obtain the Design Floor Rate , the Rate per Zone Floor Area Field is chosen. I couldn't find documentation on the precise equation for this.\n\nGiven the Design Flow rate equation, it is calculated at ambient pressure. Considering wind speeds and other factors. \n\n<img src=\"http://bigladdersoftware.com/epx/docs/8-0/engineering-reference/media/image1721.png\"/>\n\n\n\nThe \"ACH2m3/s-m2 Calculator\" component enables the conversion from Air Change Rate (this is Air flow / Volume; NOT Air Flow * (Volume / Surface Area)) to Inflitration Rate per Area (floor area) at ambient pressure. \n\nConsequently when using the previous calculator component consider the use of Air Change Rate at ambient pressure. \n\nCertain standards, such as passivhaus, use ACH@50 Pa. This method is commonly denomintaed as n50\n\nAn aproximation to converting ACH@50Pa to ACH@ambient is by a factor of 20. \n\nSo a passivhaus standard (0.6ACH@50) = ACH * 20. \n\nTherefore, if we wish to simulate the passivhaus standard the 0.6 is to be divided by 20, which results in an Rate Per Area of 0.000167. This is less than the typical value indicated in the description of the set \"EPZoneLoads\" component. \n\nIn addition to the Air Permeability method, there is also the air infiltration method which relies on Airflow / Surface Area of Building Envelope. The method employed in the UK also uses a pressure of 50 Pa, and is known as q50. \n\nThe equivalency between q50 and n50 is as follows:\n\nq50 = n50 * (Volume / Surface of Building Envelope)\n\n\n\nHope this helps. I had to review energy plus documentation and HB code to make sense of this. \n\n\n\nbest wishes, \n\n\n\nMauricio \n\n\n\n\n\n\n", "attachments": [], "created_by_name": "Mauricio Aguilar Cardenas", "created_at": "February 03, 2016 at 10:30AM", "created_by": "MauricioAguilarCardenas135", "topic": "Infiltration Values", "id": "topic_1453895"}