{"body": "\nHi everyone!<br/><br/>Thank you again for the fantastic tool you developed! It's really giving me a considerable help in developing my thesis work.<br/>Last time I wrote here asking help about the evaluation of UTCI and PET through the \"Outdoor comfort calculator\" and \"Thermal comfort indices\" components and the analysis worked pretty well.\n\n<br/>Now, since Chris (thank you!) added the \"PET analysis Recipe\" component to Honeybee, I wanted to define an outdoor microclimate map in order to compare the UTCI and PET and PMV (even though this one can be evaluated only for indoor conditions) indices and to evaluate more accurate results. I will then do the same simulation using an urban weather generator tool (Dragonfly maybe) in order to show the effect of urban heat islands on the outdoor comfort.\n\n<br/>So, I wrote the definition for the above-mentioned analysis, trying to obtain something similar to what you can do with the software Envi-met, considering the buildings like uniform blocks with two generic materials (one for the walls and one for the roofs) and giving the ground zone a material with the proprieties of the basalt stone (since it is the main material in my analysis area). I also accounted the trees and the transparency of their canopies (using the definition that is on Hydra).<br/>At last, I simplified the better I could the geometries of the buildings in my area, so that there are no problems with the exportation of the geometries to OpenStudio.\n\n<br/>Unfortunately I have a problem with the Honeybee ComfortRecipe components and Grasshopper shows this message: \"If you have connected a viewfactorMesh that includes regions on the indoor, you must connect up energy simulation data for zoneAirTemp, srfIndoorTemp, zoneAirFlowVol, zoneAirheatGain and zoneRelHumid\" although I think I didn't set any indoor zones. Furthermore, when I connect these inputs to the Recipe component, the results seem to be weird and inexact.<br/><br/>Anyone knows what could be the problem? I think it is something about the geometries of my model, but I don't know exactly how I could fix it.<br/><br/>I hope I explained clear my issue.<br/>I know that maybe the problem is more simple as I expect, but I'm quite new to these tools and I hope I can learn more asking for advice.<br/><br/>Attached you can find my definition with the internalized geometries.<br/><br/>I hope someone can help me and still thank for all your work.<br/>Best regards,<br/><br/>Francesco\n\n \n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1535085", "name": "Microclimate map UTCI vsPETvsPMV Internalised.gh"}], "created_by_name": "Francesco Scarpati", "created_at": "May 22, 2016 at 10:14am", "created_by": "FrancescoScarpati", "topic": "Outdoor Microclimate Map issue", "id": "topic_1535086"}