{"body": "\nNOTE: Apologies, I posted this on the main Grasshopper discussion page - I now realise this would've been much more appropriate here. Sorry for the double post!\n\n\n\nHi all,\n\n\n\nI am an amateur user of Rhino/Grasshopper but am beginning to explore its possibilities in my capacity as a sustainability consultant. I'm looking to use the Ladybug PV tools to provide as much information as possible about PV sizing, orientation, shading and expected outputs.\n\n\n\nI've been using the \"020 PV shaded analysis\" example canvas as a starting point (very useful, thanks to its creators) and have been trying to incorporate the **TOF** and **PV_SWH_SystemSize **modules but am having issues with both.\n\n\n\nFor the **TOF **module, I find that no matter which inputs I provide, the **optimalTilt **is always 45 and the **optimalAzimuth **is always 180. I'm providing a weather file input and a north vector.\n\n\n\nI'm then using the **optimalTilt **and **optimalAzimuth **outputs to supply the **PV_SWH_SystemSize **inputs for **arrayTiltAngle** and **arrayAzimuthAngle - **obviously this isn't actually doing anything useful at the moment as the outputs from the **TOF** are always 45 and 180.\n\n\n\nWith the **PV_SWH_SystemSize **module, I'm having issues with the spacing it is providing between the rows of PV. I know it calculates this based on the sun position on a date based on the altitude of the location the weather file provides, but I think the spacing is far too large, especially for a rooftop array where the space is more like 1-2m normally. I'm trying to specify a summer date in the format the **minimalSpacingDate** output provides (15 NOV 15:00) so the calculated spacing is lower, but it just throws up an error whenever I do.\n\n\n\nFinally, it would be really useful to be able to get the **PV_SWH_SystemSize **component to actually produce the array it has created as Rhino geometry, so they can be viewed when rendered; is that possible? Also, is it possible to restrict the module so that it only creates rows with dimensions such that it fits within a surface you provide?\n\n\n\nApologies, I know these are a lot of probably very basic questions! I've attached my canvas - again, I'm sorry it's not as neat as it could be. Thanks in advance for any and all help!\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1702948", "name": "Basic Dense Massing.3dm"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1702949", "name": "20170228-Photovoltaics shaded analysis Basic Dense Massing-v2 (updated LB).gh"}], "created_by_name": "T Wigg", "created_at": "March 1, 2017 at 5:20am", "created_by": "TWigg", "topic": "Ladybug PV analysis: TOF issues and general advice", "id": "topic_1702950"}