{"body": "\nHi,\n\nI'll continue the tread here as a discussion and not as a comment. I've found some issues that maybe a discussion is more appropriate.\n\nI was curious about the original question and Mostapha's reply. So i decided to check this more thoroughly.\n\nStarted comparing the solar vectors LB calculates against DIVA's, for Tel Aviv EPW, 10 am. There are differences, even meaningful ones (5-6 degrees in the azimuth, 2-3 degrees for altitude). Then i calculated by myself the numbers and even consulted a couple of websites ([NOAA &amp; ESRL](http://www.esrl.noaa.gov/gmd/grad/solcalc/azel.html) and [pveducation](http://pveducation.org/pvcdrom/properties-of-sunlight/sun-position-calculator)). The differences with LB remain about the same.\n\nSince my calculations are consistent with those of the websites and Diva's, and even with those of Ecotect (yes, i have the numbers) i started to thing what could be the problem (it is not daylight savings!!). I've found that the input time in LB is, probably, the Solar Time and the others is the local time (or civil time ... your clock).\n\nAfter i use the Solartime as input for receiving the azimuth/altitude the results are more consistent with those of LB (for this specific example, instead of giving 10 i gave 9:38).\n\nI don't know if LB calculations take into account the Equation of Time, or earth declination, but i think the formula should be revised.\n\nAlso the input time is a matter of discussion. People (me) always thing about Time as the one you see in your clock (civil) and not the one according to sun position. As you can see the differences can be very significant.\n\nI'm attaching my checking file, using Tel Aviv EPW at 10 am, for your convenience i concentrated the numbers in excel.\n\nHope this helps to make this (important) point clear. Sorry for the length.\n\n\n\n-A.\n\n\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A906399", "name": "SunpathCompare-LB-Diva.gh"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A906400", "name": "SunpathCompare-LB-Diva.xlsx"}], "created_by_name": "Abraham Yezioro", "created_at": "August 29, 2013 at 7:30am", "created_by": "AbrahamYezioro", "topic": "Sun path from Ecotect vs Ladybug", "id": "topic_906401"}