{"body": "\nHi all,\n\n\n\nI'm a Masters of Building Science student at Victoria University of Wellington, New Zealand, focusing my thesis on creating a means to assess thermal and daylight performance of office buildings within early stages of design and provide meaningful feedback. Honeybee and ladybug are excellent tools for this!\n\n\n\nI would love to create a template in honeybee and ladybug which allows the architect or engineer to load in their geometry to the brep of multiple breps, choose their climate from the list of New Zealand climates, and run an energy and daylight iterative simulation method. The outputs would then be read by a component that would do a sensitivity and uncertainty analysis on the data of all the parametric simulations and provide a range of parameters which the architect and engineer stay within (a limited slider if you will) of highlighted parameters which would be the most sensitive to change. Sensitivity would be defined by how much of an impact the change would make on thermal and daylight comfort (comfort defined by adaptive thermal comfort here in New Zealand and standard daylight comfort for office workers).\n\n\n\nMy question to the forums is this:\n\n\n\nFirstly, is there already a component within grasshopper or honeybee/ladybug which does this?\n\nSecondly, as the construction standards, schedules and loads are different here in NZ, how am I able to create my own Building Program and Zone program to add to the library of programs in honeybee?<br/><br/>Thirdly, is there a way to create a schedule in a less \"list-y\" way. My problem in making schedules as just a string of 8,760 numbers is that it becomes complicated if you insert holidays into this schedule. EnergyPlus has a feature where you define the holiday periods that overwrite the schedules for those specific days - does honeybee have this feature, or would you need to just continue to use native Grasshopper components to do this overwriting?\n\n\n\nSorry for the long post, hope to hear from you all\n\n- Elly\n", "attachments": [], "created_by_name": "Elzine Braasch", "created_at": "July 28, 2015 at 5:18pm", "created_by": "ElzineBraasch", "topic": "Creating new Building Programs and Zone Programs for New Zealand context", "id": "topic_1333550"}