{"body": "\nHi all,\n\n\n\nI am transferring a discussion that already started [here](http://www.grasshopper3d.com/group/ladybug/forum/topics/custom-ep-construction-not-accepting-custom-ep-material?commentId=2985220%3AComment%3A1224099&amp;xg_source=msg_com_gr_forum) regarding the possibility of having an LCA and financial assessment of structures introduced into LB and HB. My initial thoughts are that since we create a list of materials and we assign them to surfaces - volumes the next step could be to have an Life Cycle Analysis and Financial assessment produced.\n\n\n\nThe most common form to produce an LCA into a form that is commonly used and easily communicated is in the form of Environmental Product Declarations (EPDs) that follow ISO 14025:2006. As every form of LCA, EPDs raise a bunch of question regarding their boundaries and the accuracy of the results especially if we include the factor of location. In comparison with other LCA practices though, EPDs have to be followed by Product Category Rules (defining the boundaries of the study) that can be reviewed by external parties if the EPD is to go public. Part from that EPD results reflect each stage of the life cycle of a product including potential benefits from Reuse or Recycling. Finally if you have a system - for example a building - you can add the EPDs of the different subcomponents forming the building and get a final EPD for the building itself - the point where I think HB's functionality is fully aligned.\n\n\n\nThe financial assessment can easily be concluded if one has the price of the material he/she uses. Finally the environmental indicators of the EPDs (LCI, LCIA) can be translated into [Shadow Costs](http://en.wikipedia.org/wiki/Shadow_price) (Shadow costs for Environmental Indicators [here](http://www.ce.nl/publicatie/shadow_prices_handbook_%3A_valuation_and_weighting_of_emissions_and_environmental_impacts/1032)) and added to the final financial assessment as an option. \n\n\n\nI have developed a similar plug-in (in C#) for Grasshopper for my master's thesis last year. The project focused on the comparison between constructing normally and constructing implementing Design for Deconstruction practices in steel buildings. The idea was to compare the two cases based on their environmental and financial performance. In the process I included also options for transportation of the material and for shadow cost, embodied energy and carbon assessment and more. The final outcome can be visualised in Rhino's viewports and exported to excel sheets. The plug-in is connected to local db with EPD data for steel profiles. The same scheme though can be followed for any type of material if we have the right database to connect it to! \n\n\n\nPlease have a look if interested at [the report here!](http://issuu.com/akokkos/docs/computational_modelling_tools_for_t) And let me know if you have any questions!\n\nPlease note that the report includes 3+ chapters dedicated to design for deconstruction practices e.t.c that are irrelevant with the topic but maybe interesting to read:) \n\nAlso if someone is interested in the report I can always send it to you. \n\n\n\n(I will upload a video -runthrough of the plug-in later this week)\n\n\n\nI would be very interested to have these capabilities in LB and HB and happy to help realising it! \n\n\n\nThanks \n\nTasos\n\n\n\n\n", "attachments": [], "created_by_name": "Anastasios Kokkos", "created_at": "February 14, 2015 at 6:07am", "created_by": "AnastasiosKokkos", "topic": "Life Cycle Assessment (EPD) and Financial impact Assessment with HoneyBee", "id": "topic_1224534"}