{"body": "\nHi all,\n\n\n\nThanks for the wealth of information and amazing tools! I've spent some time working through Chris's excellent Honeybee tutorials, but I'm having difficulty with the following problem... I'd like to be able to compare the overall performance of different massing models, each of which will be composed of several zones. \n\n\n\nI'm looking at heating load in this dramatically simplified example with two zones. I'm hoping to use Ladybug's 3D chart to visualize the combined heating load of both zones for January in a single chart. Everything seems to work fine when I run the output directly from [ReadEPResult] to [3DChart], returning one chart for each zone. I'm returning an error message when I try to hook up my totaled list, though.\n\n\n\nMy approach has been to use Ladybug's separate data [strNum] component to separate the numerical values from the text string, explode the data tree, then add the two resulting lists together and reinsert the text string at the beginning. When I feed the resultant list into the 3D chart, however, [3DChart] returns the error message \"1. Solution exception:unsupported operand type(s) for -: 'str' and 'str'\"\n\n\n\nI can't figure out where my approach is going wrong -- any help is greatly appreciated... Thanks!\n\n\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1734649", "name": "Screencap1.jpg"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1734650", "name": "Screencap2.jpg"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1734651", "name": "HB_Total Heating Load Chart_Simplified.gh"}], "created_by_name": "John DiSalvo", "created_at": "April 17, 2017 at 1:33pm", "created_by": "JohnDiSalvo", "topic": "Possible to use 3D chart to visualize totaled values from multiple HB Zones?", "id": "topic_1734652"}