{"body": "\nGreetings community of the ‘bug and ‘bee!  We are all pleased to announce the public release of Ladybug 0.0.63 and Honeybee 0.0.60!  Over the last 6 months, we have added a large number of bug fixes and improvements.  Many of the new features and components announced in the last release have become stable and have emerged from their WIP section.  Additionally, after two years of work, we are happy to announce that we finally have full support of an OpenStudio connection within Honeybee, which has ushered in a whole host of new features, notably the modelling of detailed HVAC systems. As always you can download the new release from [Food4Rhino](http://www.food4rhino.com/project/ladybug-honeybee?ufh). Make sure to remove the older version of Ladybug and Honeybee and update your scripts.\n\n \n\n\n\n**LADYBUG**\n\n\n\n**1 - Solar Hot Water Components Out of WIP**\n\nAfter much beta-testing, bug-fixing, and general development, all of the Photovoltaic and Solar Hot Water components are now fully out of WIP!  The main component is based on a Chengchu Yan's [publication](http://www.sciencedirect.com/science/article/pii/S0960148114004807). Components have been added to Ladybug thanks to the efforts of Chengchu Yan and Djordje Spasic..  See [Djorje’s original release post of the solar hot water components](http://www.grasshopper3d.com/group/ladybug/forum/topics/ladybug-solar-water-heating-components-released) for more information on the components that just made it out of WIP.\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/jrLvgSb4KQ7pg0xPb9I6dXYNNxpqjcl*-PqMJl3VNWaEmHZ-pgmoNA2-Ih-nJRjqFUJdrftqjU8-uSk9H6OEZ-2LPEWkN*Bm/Solar.jpg?width=750\" width=\"750\"/>](http://api.ning.com:80/files/jrLvgSb4KQ7pg0xPb9I6dXYNNxpqjcl*-PqMJl3VNWaEmHZ-pgmoNA2-Ih-nJRjqFUJdrftqjU8-uSk9H6OEZ-2LPEWkN*Bm/Solar.jpg)\n\n\n\n**2 - New Terrain Shading Mask Released in WIP**\n\nIn addition to Djordje’s prolific addition of renewable energy components, he has also contributed a widely-useful component to generate terrain shading masks, which account for the shading of surrounding mountains/terrain in simulations.  While initially added to assist the solar radiation radiation and renewable energy components, the component will undergo development to optimize it for energy and daylight simulations over the next few months. Another new component called Horizon Angles can be used to visualize and export horizon angles. You can test them out now by accessing them in the WIP section.  For more information, see [Djordje’s release post on the GH forum here](http://www.grasshopper3d.com/group/ladybug/forum/topics/terrain-shading-mask-component-released).\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/jrLvgSb4KQ527zEp6vGcSsXNSvmpXNP7YjTRMJjkhto*2naqUmDfQ30tnh8lpqE8JHIqowhS85HIgFVVn-HOfylNDCg1-Kou/ShadingMask.jpg?width=750\" width=\"750\"/>](http://api.ning.com:80/files/jrLvgSb4KQ527zEp6vGcSsXNSvmpXNP7YjTRMJjkhto*2naqUmDfQ30tnh8lpqE8JHIqowhS85HIgFVVn-HOfylNDCg1-Kou/ShadingMask.jpg)\n\n\n\n**3 - New Mesh Selector Component**\n\nAfter realizing that the **Optimal Shade Creator **component has applications to a whole range of analyses, it has now been re-branded as the **Mesh Selector** and has been optimized to work easily with these many analyses. Specifically, the component selects out the portion of a mesh that meets a given threshold.  This can be the portion of a shade benefit analysis meeting a certain level of shade desirability, the portion of a radiation study meeting a certain level of fulx, the portion of a daylight analysis meeting a certain lux threshold, and much more!\n\n\n\n**4 - Solar Adjusted Temperature Now Includes Long Wave Radiation**\n\nThanks to [a question asked by Aymeric and a number of clarifications made by ...](http://www.grasshopper3d.com/group/ladybug/forum/topics/difference-between-mrt-calculation-methods), the Solar Adjusted Temperature component now includes the ability to account for long-wave radiative loss to the sky in addition to it original capability to account for short wave radiation from the sun.  As such, the component now includes all capabilities of similar outdoor comfort tools such as RayMan.  The addition of this capability is also paralleled by the addition of a new horizontalInfraredRadiation output on the ImportEPW component.  See the [updated solar adjusted example file here](http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;fork=hydra_2&amp;id=Accounting_for_Solar_Radiation_in_Comfort&amp;slide=0&amp;scale=1&amp;offset=0,0)to see how to use the component properly.\n\n\n\n**5 - Support for both Log and Power Law Wind Profiles**\n\nIn preparation for the future release of the Butterfly CFD-modelling insect, the Ladybug Wind Profile component now includes the option of either power law or log law wind profiles, which are both used extensively in CFD studies.  Thanks goes to Theodoros Galanos for providing the formulas!\n\n\n\n**6 - New Radiant Asymmetry Comfort Components**\n\nPrompted by a [suggestion from Christian Kongsgaard](http://www.grasshopper3d.com/group/ladybug/forum/topics/radiant-asymmetry-and-mrt), Ladybug now includes components to calculate radiant asymmetry discomfort!  For examples of how to use the components see [this example file for spatial analysis](http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;fork=hydra_2&amp;id=Radiant_Asymmetry_Spatial_Map&amp;slide=1&amp;scale=1&amp;offset=0,0) of radiant asymmetry discomfort and [this example for temporal analysis](http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;fork=hydra_2&amp;id=Radiant_Asymmetry_Discomfort&amp;slide=1&amp;scale=1&amp;offset=0,0).\n\n\n\n**7 - Pedestrian Wind Comfort Component Released in WIP**\n\nIn preparation for the impending release of the butterfly CFD-modelling insect, Djordje Spasic with assistance from Liam Harrington has contributed a component to evaluate outdoor discomfort and pedestrian safety. The component identifies if certain areas around the building are suitable for sitting, building entrances-exits, window shopping... based on its wind microclimate. Dangerous areas due to high wind speeds are also identified.<br/>You can check it out now in the WIP section.​\n\n\n\n\n\n**HONEYBEE**\n\n\n\n**1 - New HVAC Systems and Full OpenStudio Support**\n\nAfter a significant amount of development on the part of the OpenStudio team and two years of effort on the part of LB+HB developers, we (finally!) have full support for an OpenStudio connection within Honeybee.  By this, we mean that any energy simulation property that can be assigned to a HBZone will be taken into account in the simulation run by the OpenStudio component.  The connection to OpenStudio has brought with it several new capabilities.  Most notably, you can now assign full HVAC systems and receive energy results in units of electricity and fuel instead of simple heating and cooling loads.  This Honeybee release includes 14 built-in HVAC template systems that can be assigned to the zones, each of which can be customized:\n\n\n\n0. Ideal Air Loads<br/> 1. PTAC | Residential<br/> 2. PTHP | Residential<br/> 3. Packaged Single Zone - AC<br/> 4. Packaged Single Zone - HP<br/> 5. Packaged VAV w/ Reheat<br/> 6. Packaged VAV w/ PFP Boxes<br/> 7. VAV w/ Reheat<br/> 8. VAV w/ PFP Boxes<br/> 9. Warm Air Furnace - Gas Fired<br/> 10.Warm Air Furnace - Electric<br/> 11.Fan Coil Units + DOAS<br/> 12.Active Chilled Beams + DOAS<br/> 13.Radiant Floors + DOAS<br/> 14.VRF + DOAS\n\n\n\nSystems 1-10 are ASHRAE Baseline systems that represent much of what has been added to building stock over the last few decades while systems 11-14 are systems that are commonly being installed today to reduce energy use.  Here is an [example file showing how to assign these systems in Honeybee and in...](http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;fork=hydra_2&amp;id=Calculate_Annual_Utility_Bill&amp;slide=0&amp;scale=1&amp;offset=0,0) and here is an [example showing how to customize the HVAC system specifications](http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;fork=hydra_2&amp;id=Customizing_HVAC_Systems&amp;slide=0&amp;scale=1&amp;offset=0,0) to a wide variety of cases.  To run the file, you will need to have OpenStudio installed and you can [download and install OpenStudio from here](https://www.openstudio.net/downloads).\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/jrLvgSb4KQ6U21w8ed8cAJK2EFcQNmLkG-TITV7TPsd1ixren4QrawMMcDHVZG-rCTAeKBnpIlBQjLEpB5Pr3DqhDxuggJ4X/Calculate_Annual_Utility_Bill_Rhino.png?width=750\" width=\"750\"/>](http://api.ning.com:80/files/jrLvgSb4KQ6U21w8ed8cAJK2EFcQNmLkG-TITV7TPsd1ixren4QrawMMcDHVZG-rCTAeKBnpIlBQjLEpB5Pr3DqhDxuggJ4X/Calculate_Annual_Utility_Bill_Rhino.png)\n\nIn addition to these template systems within Honeybee, the OpenStudio interface includes hundreds of HVAC components to build your own custom HVAC systems. OpenStudio also has a growing number of user-contributed HVAC system templates that have been integrated into a set of scripts called \"Measures\" that you can apply to your OpenStudio model within the OpenStudio interface. You can find these system templates by [searching for them in the building components library](https://bcl.nrel.gov/search/site/?f[0]=im_field_measure_tags%3A956&amp;f[1]=im_field_measure_tags%3A976). Here is [a good tutorial video on how to apply measures to your model within...](https://www.youtube.com/watch?v=9-saA4x07eQ) interface.  Honeybee includes a component that runs these measures from Grasshopper (without having to use the OpenStudio interface), which you can [see a demo video of here](https://www.youtube.com/watch?v=DHs-inRuHwc).  However, this component is currently in WIP as OpenStudio team is still tweaking the file structure of measures and it is fairly safe to estimate that, by the next stable release of Honeybee, we will have full support of OpenStudio measures within GH.\n\n\n\n**2 - Phasing Out IDF Exporter**\n\nWith the connection to OpenStudio now fully established, this release marks the start of a transition away from exporting directly to EnergyPlus and the beginning of Honeybee development that capitalizes on OpenStudio’s development. As such THIS WILL BE THE LAST STABLE RELEASE THAT INCLUDES THE HONEYBEE_RUN ENERGY SIMULATION COMPONENT.\n\n\n\nThe Export to OpenStudio component currently does everything that the Run Energy Simulation component does and, as such, it is intended that all GH definitions using the Run Energy Simulation component should replace it with the OpenStudio component.  You can use the same Read EP Result components to import the results from the OpenStudio component and you can also use the same Energy Sim Par/Generate EP Output components to customize the parameters of the simulation.  The only effective difference between the two components is that the OpenStudio component enables the modeling of HVAC and exports the HBZones to an .osm file before converting it to an EnergyPlus .idf.  \n\n\n\nFor the sake of complete clarity, we should state that OpenStudio is simply an interface for EnergyPlus and, as such, the same calculation engine is under the hood of both the Export to OpenStudio component and the Run Energy Simulation component.  At present, you should get matching energy simulation results between the Run Energy Simulation component and a run of the same zones with the OpenStudio component (using an ideal air system HVAC).\n\n\n\nAll of this is to say that you should convert your GH definitions that use the Run Energy Simulation component to have the OpenStudio component and this release is the best time to do it (while the two components are supported equally).  Additionally, with this version of Honeybee you will no longer need to install EnergyPlus before using Honeybee and you will only need to [install OpenStudio](https://www.openstudio.net/downloads) (which includes EnergyPlus in the install).\n\n\n\n**3 - New Schedule Generation Components**\n\nThanks to the efforts of Antonello Di Nunzio, we now have 2 new components that ease the creation of schedule-generation in Honeybee.  The new components make use of the native Grasshopper “Gener Pool” component to give a set of sliders for each hour of the day.  Additionally, Antonello has included an annual schedule component that contains a dictionary of all holidays of every nearly every nation (phew!).  Finally, this annual schedule component can output schedules in the text format recognized by EnergyPlus, which allows them to be written directly into the IDF instead of a separate CSV file.  This will significantly reduce the size of files needed to run simulations and can even reduce the number of components on your canvas that are needed to add custom schedules. For more information, see [Antonello’s explanatory images here](http://www.grasshopper3d.com/group/ladybug/forum/topics/ladybug-sunrise-sunset?commentId=2985220%3AComment%3A1454784&amp;groupId=2985220%3AGroup%3A658987) and [Antonello's example file here](http://hydrashare.github.io/hydra/viewer?owner=AntonelloDN&amp;fork=hydra&amp;id=Honeybee_Schedules_Creation&amp;slide=0&amp;scale=1&amp;offset=0,0).  You can also see a full [example file of how to apply the schedules to energy simulations here](http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;fork=hydra_2&amp;id=Creating_Custom_Schedules&amp;slide=0&amp;scale=1&amp;offset=0,0).\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/jrLvgSb4KQ5clx*PTEldCQhiP93kSYaiFXirecy5vEwS8TwI5N3*mV8fLKEMFr4Ys1CD-AxI5AZjCivX4jxVflVUcoAMNMnk/Creating_Custom_Schedules_GH.jpg?width=750\" width=\"750\"/>](http://api.ning.com:80/files/jrLvgSb4KQ5clx*PTEldCQhiP93kSYaiFXirecy5vEwS8TwI5N3*mV8fLKEMFr4Ys1CD-AxI5AZjCivX4jxVflVUcoAMNMnk/Creating_Custom_Schedules_GH.jpg)\n\n\n\n**4 - EnergyPlus Lookup Folder, Re-run OSM/IDF, and Read Result Dictionary**\n\nWith the new capabilities of OpenStudio, we have also added a number of components to assist with managing all of the files that you get from the simulation.  In particular, Abraham Yezioro has added a Lookup EnergyPlus Folder component that functions very similarly to the Lookup Daylight Folder component.  This way, you can run an Energy simulation once and explore the results separately.  Furthermore, we have added components to Re-Run OpenStudio .osm files or EnergyPlus .idf files within Grasshopper.  These components are particularly useful if you edit these .osm or .idf files outside of Honeybee and want to re-run them to analyze their results in Grasshopper.  Lastly, a component has been added to parse the .rdd (or Result Data Dictionary) file that EnergyPlus produces, enabling you to see all of the possible outputs that you can request from a given simulation.\n\n\n\n**5 - Electric Lighting Components Out of WIP**\n\nAfter Sarith Subramaniam’s initial components to model electric lights with Radiance in the last release, we are happy to report that they have been fully tested and are out of WIP.  Improvements include support for all types of light fixture geometries and the ability to use the components in a more “Grasshoppery” list-like fashion.  See [Sarith’s original release post](http://www.grasshopper3d.com/group/ladybug/forum/topics/new-electric-lighting-components-for-honeybee-are-available-for) for more information and several example files showing how to use the components can be found here. [1](http://hydrashare.github.io/hydra/viewer?owner=sariths&amp;fork=hydra&amp;id=IES_Electric_Lighting_Demo_Setup)  , [2](http://hydrashare.github.io/hydra/viewer?owner=sariths&amp;fork=hydra&amp;id=IES_Electric_Lighting_Basic_Example)  , [3](http://hydrashare.github.io/hydra/viewer?owner=sariths&amp;fork=hydra&amp;id=IES_Electric_Lighting_Grid-based_calculations)  .\n\n[<img class=\"align-center\" src=\"http://api.ning.com:80/files/jrLvgSb4KQ7d0TBxG6V82AFeUjmG1GmSVCSFk28JuYNisJrdvyOAFsm5I8n5HFH3rSTbBv1pV8DIvdsWm153aXz3cIEI1jr3/ElectricLight.JPG?width=500\" width=\"500\"/>](http://api.ning.com:80/files/jrLvgSb4KQ7d0TBxG6V82AFeUjmG1GmSVCSFk28JuYNisJrdvyOAFsm5I8n5HFH3rSTbBv1pV8DIvdsWm153aXz3cIEI1jr3/ElectricLight.JPG)\n\n\n\n**6 - Improvements to THERM Components**\n\nA number of bug fixes and improvements have been made to the THERM components in order to make their application more flexible and smooth.  Special thanks is due to [Derin Yilmaz](http://www.grasshopper3d.com/profile/DerinYilmaz) , [Mel King](http://www.grasshopper3d.com/profile/MelKing) , [Farnaz](http://www.grasshopper3d.com/profile/Farnaz609) , [Ben (@benmo1)](https://github.com/benmo1) , and [Abraham Yezioro](http://www.grasshopper3d.com/profile/AbrahamYezioro) for all of the great feedback in the process of improving these components.\n\n[<img class=\"align-center\" src=\"http://api.ning.com:80/files/jrLvgSb4KQ7PZsHfUf6WeR1wEYXHzd9owKNyJ1YxwGJZmm*m3x7BkiW7wDhConvUlCxkl6qyfNe5DywnMV2jONhxeo23w4pL/5_Honeybee_ThermModelling.jpg?width=500\" width=\"500\"/>](http://api.ning.com:80/files/jrLvgSb4KQ7PZsHfUf6WeR1wEYXHzd9owKNyJ1YxwGJZmm*m3x7BkiW7wDhConvUlCxkl6qyfNe5DywnMV2jONhxeo23w4pL/5_Honeybee_ThermModelling.jpg)\n\n\n\n**7 - HBObject Transform Components**\n\nAfter some demand for components that can ease the generation of buildings with modular zone types, two components to transform HBObjects with all of their properties have been added to the 00 | Honeybee section.  The components allow you to produce copies of zones that are translated or rotated from the original position.\n\n\n\n**8 - Comfort Maps Supports PET and Integration of CFD Results**\n\nThanks to the addition of the  ‘Physiological Equivalent Temperature’  (PET) component by Djordje Spasic in the last stable release, it is now possible to make comfort maps of PET with Honeybee.  PET is particularly helpful for evaluating OUTDOOR comfort with detailed wind fields at a high spatial resolution.  As such, the new PET recipe has also been optimized for integration with CFD results.  The windSpeed_ input can now accept the file path to a .csv file that is organized with 8760 values in each column and a number of columns that correspond to the number of test points.  Components to generate this csv from Butterfly CFD results will be coming in later releases.  Stay tuned!\n\n<br class=\"kix-line-break\"/> <br class=\"kix-line-break\"/>As always let us know your comments and suggestions.\n\n\n\nEnjoy!<br class=\"kix-line-break\"/>Ladybug Analysis Tools Development Team\n\n \n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "August 11, 2016 at 8:39pm", "created_by": "ChrisMackey", "topic": "Release Notes - Ladybug 0.0.63 and Honeybee 0.0.60", "id": "topic_1580355"}