{"body": "\nHi everyone,\n\n\n\nI haven't been active in the forum for a while. It seems that a lot of updates have happened to the tools which is amazing.\n\n\n\nI am wondering if someone can help me with some new errors I am having from Energy Plus.\n\n\n\nI made a simple building with around 20 zones. I spent a lot of time in drawing this so it should be ok when it comes to tolerance issues. In any case it is MUCH better than other models I've simulated.\n\n<br/>However I get around 3700 lines on my output and a total of 73 warnings and 38 severe errors.\n\n\n\nThe warnings have to do with the message \"one of the surfaces has less than 3 identical coordinates and has been removed\". The errors are various, ranging from FenestrationSurface erros due to invalid building surfaces, adiabatic surfaces cannot have windows or doors (even though I believe I did not set any surfaces as adiabatic), adjacent surface not found, etc. I attach my file and by running the simulation you can see the range of errors.\n\n\n\nI am still running EP 8.1 btw, should I update to the new version?\n\n\n\nI will start looking into my open zones. It is true I have some walls with holes (more like ventilation shafts) but I thought it would be ok. Also, I don't know for the life of me why I get surfaces with such a small area or why surfaces are removed. I tried to play with tolerance, and the above errors are with minimum value of 0.1. Many more come with 0.001.\n\n\n\nAny insight would be appreciated. Also, do you think it would be possible to have some kind of component that can pinpoint the surfaces that give the error. Atm I can only see hexa names and not sure how I can select them.\n\n\n\nThank you very much in advance!\n\n\n\nKind regards,<br/>Theodore.\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1266750", "name": "TicketingAdmin.gh"}], "created_by_name": "Theodoros Galanos", "created_at": "April 18, 2015 at 11:25pm", "created_by": "TheodorosGalanos", "topic": "Energy Simulation errors", "id": "topic_1266751"}