{"body": "\nHi,\n\n\n\nI am working on an office room to collect its light maps. After I collect the lightmaps, I will visualize in Immersive Virtual Environment.  With that in mind, I want to create a sequenced video of lightmaps, but I have encountered a problem doing this. \n\nThe problem: I have created two office rooms, the first one I imported from Revit to 3ds Max and then to Rhino. In this room when I run the grasshopper files all my result values come back 0.00 (Illuminance map generator Grid Analysis.gh). In this case, I am assuming that Honeybee does not recognize the window. Due to that, I have created a box representing the room and drawing a surface to generate the window. In this case, all my results values are around 15100 (LightMapGenarator.gh), which I assumed that is not recognizing any of the geometry. \n\nThe model is available here: [https://www.dropbox.com/s/fwt3545g70tvn3v/InfoVis_Experiment_Model_...](https://www.dropbox.com/s/fwt3545g70tvn3v/InfoVis_Experiment_Model_PreComputed_Scaled_Box.3dm?dl=0)\n\nI have tried to setup the materials and the geometries with different honeybee components with no success. I am sure it is a simple mistake, but I am new to grasshopper and honeybee and could not figure out. \n\nAfter that I will have to export the lightmap to a different software, so my question is how I can render only the light map.\n\nThanks for the help in advance,\n\nBest,\n\nJP\n\n\n\n[https://www.dropbox.com/s/fwt3545g70tvn3v/InfoVis_Experiment_Model_...](https://www.dropbox.com/s/fwt3545g70tvn3v/InfoVis_Experiment_Model_PreComputed_Scaled_Box.3dm?dl=0)\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1503916", "name": "LightMapGenarator2.gh"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1503917", "name": "Illumince Map Genartor Grid Analysis.gh"}], "created_by_name": "Joao Pedro Carneiro", "created_at": "April 08, 2016 at 10:52AM", "created_by": "JoaoPedroCarneiro", "topic": "My room is not recognizing windows or the walls", "id": "topic_1503918"}