{"body": "\nHi all,\n\nI am trying to understand which is the logic behind some result we can have using Annual Analysis with Read Rad 1 component.\n\nAnnual analysis in honeybee is not done with climate data, it don't need skyfile as input but only the epw weather file (which have the informations of the location). Running the analysis and using Read Rad component I can calculate DA-UDI etc throught Daysim.\n\nBUT reading about Daysim calculation method ([http://daysim.ning.com/page/keyword-daylight-autonomy](http://daysim.ning.com/page/keyword-daylight-autonomy)) on the official site I see that DA is obtained \"considers all sky conditions throughout the year\" and also the definition of DA ([http://patternguide.advancedbuildings.net/using-this-guide/analysis...](http://patternguide.advancedbuildings.net/using-this-guide/analysis-methods/daylight-autonomy)) explains that \" a major innovation since in considers geographic location specific weather information on an annual basis\". \n\n\n\nAlso this Paper by Mostapha ([http://www.ibpsa.org/proceedings/bs2013/p_2499.pdf](http://www.ibpsa.org/proceedings/bs2013/p_2499.pdf)  page 3133) explaine that \"One component calculates typical outputs of an annual climate based daylighting analysis, such as Daylight Autonomy and Daylight Availability\".\n\n\n\nMy questions are: Does Honeybee work using CLIMATE BASED data to calculate UDI-DA? How can it use climate data if it needs only epw weather file? If it doesn't use climate data, which kind of sky it use? Looking at DIVA the annual analysis is named \"CLIMATE BASED ANALYSIS\": which are the difference between Honeybee Annual Analysis and this last DIVA analysis.\n\n\n\nHoping someone can help me to understand which kinds of results we are getting from this incredible plug-in,\n\nKind Regards\n\nDavid \n", "attachments": [], "created_by_name": "David Maimone", "created_at": "February 1, 2016 at 3:50am", "created_by": "DavidMaimone", "topic": "CLIMATE BASED ANALYSIS \\ ANNUAL ANALYSIS \\ UDI-DA", "id": "topic_1451504"}