{"body": "\nHi all,\n\n\n\nI have a few questions regarding Daysim's control modes and Honeybee's implementation of them. Been lurking around the forum but haven't found my answers unfortunately. Would appreciate any help!\n\n\n\nQ1: I have a building with a dynamic venetian blind that have 5 slate states (up/inactivated, down/closed, horisontal, 30 and 60 degrees) and they are controlled by exterior irradiance on the facade with different thresholds. I want to calculate the annual illuminance on a grid in the room taking into account the different slate states. Is that possible, and if so how do I do that? \n\nI've read that the only way to use an external sensor is to use the Glare Control Recipe, but there's only one threshold for when the blind should activate, how do I add the other states, with the Shading State components? \n\n\n\nQ2: I might've misunderstood how the simulation is carried out but why can't you add the illuminance sensors (external/internal) before the daylight simulation when you calculate the effect of the blinds? Or am I missing something? \n\nMaybe related: If I add three different shading states and also the Glare Control Recipe to the Advanced Dynamic Shading Recipe component I get the following error at Run Daylight Analysis:\n\nSolution exception:'GlareControl' object has no attribute 'exteriorSensor'\n\nI've attached my example file with the error. Where do you add the exterior sensor?\n\n\n\nQ3: Daysim have a control mode that might not be implemented yet in Honeybee, \"External shading schedule\" or \"AnnualShadingSchedule\". Which imports a blind operation schedule as a csv file. See [http://daysim.ning.com/page/daysim-shading-control-modes](http://daysim.ning.com/page/daysim-shading-control-modes) \n\nIf it isn't implemented, is there a way to manually use this control mode at the moment? \n\n\n\nAll the best\n\nM\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1610060", "name": "Daysim illuminance controlled blinds.gh"}], "created_by_name": "M. Söderlund", "created_at": "October 3, 2016 at 2:46pm", "created_by": "MikaelSoederlund", "topic": "Daysim Control Modes and Honeybee's implementation", "id": "topic_1610061"}