{"body": "\nHi,\n\n\n\nI have a request that many others may enjoy in HoneyBee.\n\n\n\nI've been trying to create a module to calculate LEEDv4 ASE without luck.\n\nIt was very inspired by the readAnnualResultsI block.\n\n\n\nI want it to look at results from an annualDaylightSimulation made with 0 bounces on several rooms.\n\n\n\nCurrently I can use the readAnnualResultsI with a DAIllumThreshold value of &gt;1000 lux but output is in integer percentage-number instead of absolute yearly hours (i can multiply with 8760/100, but then rounding has been done).\n\n\n\nAlso it does not give me a shading schedule which should be activated/deactivated for hours with more or less than 2% of the points with &gt;1000lux.\n\n\n\nIt should output the amount annual hours above 1000 lux for each point in the same tree structure as the input points. (i have a tree with one list per simulated room)\n\n\n\nIdeally it would also output a list of 8760 (or length of whatever input schedule is used) true/false for values, each hour, or freshly generated schedule files (one for each list of inputted points).\n\n\n\nCurrently i do this statistics with regular GH components on every hourly values, but with, lets say, 1000 analysis points, and 8760 hours (8,760,000 float values), grasshopper starts stalling.\n\nI was hoping it was possible through scripting, as this way (like the readAnnualResultsI) it does not slow down the GH UI once finished running.\n\n\n\n-\n\n\n\nMy method is currently to use these freshly generated schedules do extract values from two different daylightAutonomies in order to create a sDA, which is needed for the LEEDv4 simulation. Currently my workflow works, but only on around 200-500 points, while some of our floor plans require more than 5000.\n\n\n\nHope my request makes sense - and let me know if you need any inputs. Hopefully we can make a fast way of implementing new LEED required simulations.\n\n\n\nBest,\n\nMathias Sønderskov\n\nMsc.Eng.Arch\n", "attachments": [], "created_by_name": "Mathias s n", "created_at": "September 25, 2016 at 02:50PM", "created_by": "Mathiassn", "topic": "Calculating LEED ASE", "id": "topic_1605466"}