{"body": "\nI am findings unrealistically high temperatures in a somewhat simple honeybee energy simulation and would like to get some feedback as to why this is happening. I have modeled a simple south-facing shoebox model for a dwelling in San Francisco and would like to study the effect of an \"irregular\" shading scheme on indoor thermal comfort. \n\nYou can see that the construction of the shoebox model uses modified EP Constructions. I edited the thickness for EP concrete for ceiling, walls, and floors and used a climate relevant EP wall construction for the exterior wall. As for the window, a self-defined glazing unit. The program type is a Mid-Rise Apartment. \n\nWhen I run this model as a non-conditioned space, I get insanely high indoor air temperature values. This is most apparent in the first few hours of the year, when outdoor temperature is 15C and indoor is &gt;30C. I reduced the loads within the space with Set EnegryPlus Zone Loads but still have temperatures between 27-30C, which just doesnt seem right. \n\n\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/cGOmy1kX2yWSxy-L-kwF9UzkmEeAF98ecxTauZkNpkDCq4EmpFh6J9WI2owtmICrEVeyKTwb8zU3ZqfhS1wPNHRHLp1LyJFy/TiTo.PNG?width=300\" width=\"300\"/>](http://api.ning.com:80/files/cGOmy1kX2yWSxy-L-kwF9UzkmEeAF98ecxTauZkNpkDCq4EmpFh6J9WI2owtmICrEVeyKTwb8zU3ZqfhS1wPNHRHLp1LyJFy/TiTo.PNG)\n\nScreenshot of the GH native line graph showing indoor temp(green) and outdoor temp (red) during the SF cooling design week (Aug 1-8th). It seems odd that the unit experiences little diurnal swing and is constantly hovering around 85F. \n\n\n\nCan someone provide further explanation as to why an apartment in SF is experienced indoor temperatures upwards of 80F in the winter and a constant temp of 85F in the summer?\n\nThank you for your time and I appreciate the assistance in advance. \n\nKit\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1771477", "name": "170619_HB_Troubleshooting.3dm"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1771478", "name": "Comfort Analysis_HB-troubleshoot.gh"}], "created_by_name": "Kit Elsworth", "created_at": "June 19, 2017 at 4:25pm", "created_by": "KitElsworth", "topic": "Unrealistic Temperatures", "id": "topic_1771479"}