{"body": "\n[<img class=\"align-center\" src=\"http://api.ning.com:80/files/OoN9q1jyhUW7xmMhg-wTUaAORaFEjde9q52cFDMX0JnNOlw*1hmBY8y-wKh1iehH7VLzDjrBSyii8ghagd8*3ZYjrCCEAp-Y/version.0.0.52.GrasshopperGroup.png?width=500\" width=\"500\"/>](http://api.ning.com:80/files/OoN9q1jyhUW7xmMhg-wTUaAORaFEjde9q52cFDMX0JnNOlw*1hmBY8y-wKh1iehH7VLzDjrBSyii8ghagd8*3ZYjrCCEAp-Y/version.0.0.52.GrasshopperGroup.png)\n\nI’m excited to release Ladybug version 0.0.52 today which has several new features and enhancements. There are more than 10 new components, which extend the possibilities of using Ladybug for environmental studies and make it possible to run the analyses faster and more accurately.\n\n\n\nThanks to RADIANCE’s gendaymtx (and the awesomeness of Greg Ward, Ian Ashdown, and the help of Rob Guglielmetti) Ladybug is now using a brand new sky model which makes hourly and real time radiation analysis possible ([Watch this video](http://www.youtube.com/watch?v=s3stJVyaRmg)). SunPath is now improved and there are quite a few new components that work with SunPath including shadow mask, ray-tracing ([short video](http://www.youtube.com/watch?v=b7dtzzY0FF8)), and view from sun ([short video](http://www.youtube.com/watch?v=uJUrgpG6ElI)).\n\n\n\nThere are two new components for shading design and shadow studies that are not fully functional but are good enough to be released as a test version ([This video shows the shadow study component](http://www.youtube.com/watch?v=NjmM4PkG0SA)).\n\n\n\nI’m the most excited to introduce and welcome [Chris Mackey](http://www.grasshopper3d.com/profile/ChrisMackey) as the new co-developer of the ‘bug who has developed the Humidity Ratio calculator for Ladybug which you can find under weather data analysis tab. People working with HVAC system design and thermal comfort may find it particularly useful and you can consider this component an initial step towards a Psychrometric chart for Ladybug.\n\n\n\nThere have also been a few enhancements to the analysis components. The parallel input is working properly now and the analyses are run much faster ([here is the proof!](https://www.facebook.com/photo.php?fbid=595717293774461&amp;set=a.442320969114095.107084.413910668621792&amp;type=1)). The orientation study is also modified so the legends are normalized and will stay at the same size and in the same location. And there’s much more to be explored when you install the components!\n\n\n\nSo far I couldn’t find a fast and accurate way to calculate the Vertical Sky Factor but both the viewRose ([short video](http://www.youtube.com/watch?v=KAmSdRDB_OA)) and the shadow mask components calculate the values of VSF in 2d and 3d which can be used for your studies. I believe there should be a faster way to calculate the VSF based on view analysis.\n\n\n\nYou can download the new version from the [same link](https://www.box.com/s/02d7kp230vb045i9j4ix) and give it a try. I also updated the [source code on GitHub](https://github.com/mostaphaRoudsari/ladybug) and prepared some new examples to get you started. **Don’t forget to update your GHPython to the [latest release](https://github.com/mcneel/ghpython/releases/download/v0.5.101/GhPython.gha) (Thanks Giulio) before updating the Ladybug.**\n\n\n\nThanks again for all the support, great suggestions and the kind comments. Please keep the suggestions coming and stay critical to the ‘bug and the results of your studies.\n\n\n\nBest,\n\nMostapha\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "November 3, 2013 at 11:57am", "created_by": "mostapha", "topic": "New Ladybug 0.0.52 Now Available!", "id": "topic_950076"}