{"body": "\nHi,\n\n\n\nI might have found a glitch in the Honeybee runDaylightSimulation module. I am trying to run multiple Honeybee radiance runs and compare results, but as soon as I unclick the \"runRad\" Boolean toggle of the \"RunDaylightAnalysis\" module the .res or .ill files in my c:\\ladybug\\fileName\\gridBasedSimulation\\ folder disappear. I am forced to rerun the analysis to review results that should be calculated already.\n\n \n\nIt seems that the point of the studyFolder module is to allow the user to review many different runs just by changing the file path, no recalculating required. How can I review my old work if the results are deleted by deactivating the calculation module? The \"overwriteResults\" is set to false.\n\n \n\nI found that if I disconnected the filename first and then quickly canceled the run, I could safely toggle \"RunRad\" to false without deleting the files. I can then create a new radFileName and not worry about destroying old data. So it seems that making the \"runRad\" toggle false deletes the run files. I tried adding a button but this still deletes files. How would you recommend using the Honeybee components to test multiple runs and review old data?\n\n \n\nI have officially made the switch from DIVA because these tools are so much more powerful and flexible! Thanks for all your work.\n\n \n\n \n\n \n\nwith \"runRad\" set to true. Output is good, .res files exists.\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/E6-J*b1OZQMFG83qiaCtED1KmrT7pGUe7zUz3Boo*bSJbS0PqQz*KtHJTJykj*AvcPNgrhcQEeciX1QtqvQdhGViL2ak0R49/resfilesdisappear1.jpg?width=750\" width=\"750\"/>](http://api.ning.com:80/files/E6-J*b1OZQMFG83qiaCtED1KmrT7pGUe7zUz3Boo*bSJbS0PqQz*KtHJTJykj*AvcPNgrhcQEeciX1QtqvQdhGViL2ak0R49/resfilesdisappear1.jpg)\n\n \n\nwith runRad set to false. res files are gone.\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/E6-J*b1OZQO2BtoY1a2*RqvhRYEtwXc0WVdc2RB32fzV-7q9mnSwgrcxm5vBzPJ-ISUNkzMQHxZywBqhROLztDiX07QgbzQE/resfilesdisappear2.jpg?width=750\" width=\"750\"/>](http://api.ning.com:80/files/E6-J*b1OZQO2BtoY1a2*RqvhRYEtwXc0WVdc2RB32fzV-7q9mnSwgrcxm5vBzPJ-ISUNkzMQHxZywBqhROLztDiX07QgbzQE/resfilesdisappear2.jpg)\n\n \n\nAs you can see, the studyFolder module works because I can still import the grid points and other values. When looking at the actual folder in my c drive I can see that the .res or .ill files are deleted. How can I stop this from happening? I would hate to lose a large run this way.\n", "attachments": [], "created_by_name": "Leland Curtis", "created_at": "November 14, 2014 at 07:58AM", "created_by": "LelandCurtis", "topic": "Honeybee studyFolder loses .res and .ill files", "id": "topic_1168649"}