{"body": "\nHi everyone,<br/> one of my colleagues wants to post a discussion but they didn't accepted her here on the GrassHopper forum yet. I post the following for her so that you, brilliant minds, are able to start looking at it...<br/>She will join the conversation as soon as they accept her.\n\nThanks in advance,<br/> Claudio<br/> <br/> <br/> Original post from Claudia:<br/> Hi guys, <br/> I´m new in this forum and I hope I can find here a solution of my problem.<br/> I´m tring to do an energy simulation (and the next step would be the optimization with octopus) with honeybee and ladybug.<br/> I´m analyzing a floor of 2600mq with more than 2/3 of external walls glazed. I´ve got also 174 fins along the perimeter.\n\nThe problem is that when I run the simulation I recive these errors for each window:\n\n** Severe ** GetHTSubSurfaceData: Surface Openings have too much area for base surface=EEE8110BF0A843E9A620_9<br/> ** ~~~ ** Opening Surface creating error=GLZ_0_EEE8110BF0A843E9A620_9_A2E7F42406024C9A833A<br/> ** Severe ** GetSurfaceData: Zero or negative surface area[0.00000], Surface=EEE8110BF0A843E9A620_9\n\nIf i have understood well, according to .err file, the dimension of the window in rhino seems to be bigger then the wall. But it isn´t! i mean i´ve tryed also to put a frame to the windows or to scale them but i got the same results. <br/> Do you know why or how i can solve it??\n\naaand it isn´t finished! even if i checked my Rhino with \"SelCrv, SelBadObject,selLine...\" and i got \"only\" 303 surfaces and 3 polysurfaces i still can´t find the degenerate surface for which i have these errors:\n\n** Warning ** GetSurfaceData: There are 2 coincident/collinear vertices; These have been deleted unless the deletion would bring the number of surface sides &lt; 3.<br/> ** ~~~ ** For explicit details on each problem surface, use Output:Diagnostics,DisplayExtraWarnings;<br/> ** Severe ** GetSurfaceData: There are 1 degenerate surfaces; Degenerate surfaces are those with number of sides &lt; 3.<br/> ** ~~~ ** These surfaces should be deleted.<br/> ** ~~~ ** For explicit details on each problem surface, use Output:Diagnostics,DisplayExtraWarnings;<br/> ** Fatal ** GetSurfaceData: Errors discovered, program terminates.<br/> ...Summary of Errors that led to program termination:<br/> ..... Reference severe error count=7<br/> ..... Last severe error=GetSurfaceData: There are 1 degenerate surfaces; Degenerate surfaces are those with number of sides &lt; 3.\n\nSomeone can help me? it´s three days that i´ve been struggling with this work, but still can´t find the solution :(<br/> Here i attach the rhino and gh file<br/> Thanks a lot <br/> Claudia\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1420993", "name": "Floor.3dm"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1420994", "name": "Floor.gh"}], "created_by_name": "Claudio Marini", "created_at": "December 14, 2015 at 10:32AM", "created_by": "ClaudioMarini", "topic": "Energy+/HoneyBee Error: Zero or negative surface area", "id": "topic_1420995"}