{"body": "\nHello all,\n\n\n\nI wanted to let you know about the new component that is just added to Honeybee that will let you import gbXML files as Honeybee Zones and shading objects.\n\n\n\nI attached the userobject and the example file to this file so you can give it a try with any version of Honeybee that you're already using. The only requirement is to have OpenStudio installed as the component is using OpenStudio libraries to parse gbXML files. If you're using the latest version available on github the component is also available under WIP tab.\n\n\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/Zf5668bSA4-*3U35FLeJC4nfPozFMIZ7F*VGdVoN63PxEUIsPwBxrQvcbuKxNbEtow7RG3aTKce88ZeqLXr-mJFh28rZ1Xa5/import_gbXML.png\" width=\"642\"/>](http://api.ning.com:80/files/Zf5668bSA4-*3U35FLeJC4nfPozFMIZ7F*VGdVoN63PxEUIsPwBxrQvcbuKxNbEtow7RG3aTKce88ZeqLXr-mJFh28rZ1Xa5/import_gbXML.png)\n\n\n\n**Why?**\n\nThe main purpose of developing this component is to save time and effort for importing Revit models for energy and daylight analysis. It bothers me to see a lot of smart people spend a lot of time to just come up with solutions just to get the geometry from Revit to Honeybee for analysis. This component is not solving all the issue but is a first step forward. In an ideal world, the future version of Honeybee, which works both under DynamoBIM and Grasshopper should address this issue but that can take some time to be fully ready!\n\n\n\n**How?**\n\nTo use this component you need to Export your Revit model as gbXML and then use the file path to load the file into Grasshopper. There are several resources available online on how to prepare the analytical model in Revit and export the gbXML file. Here is an image for importing the Revit 2017 sample model using the default settings. As you can see the model will be just as good as what your original gbXML file from Revit is.\n\n\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/Zf5668bSA48AYyHz7hUI7YDepkwFfatLdth*yUjZ4wWs3uDJKs*PU8WmkgfL6oM-xWj*qVaf3HO*Gdf3qFQ5b6syVJhaFsf-/Honeybee_Import_gbXML.png?width=750\" width=\"750\"/>](http://api.ning.com:80/files/Zf5668bSA48AYyHz7hUI7YDepkwFfatLdth*yUjZ4wWs3uDJKs*PU8WmkgfL6oM-xWj*qVaf3HO*Gdf3qFQ5b6syVJhaFsf-/Honeybee_Import_gbXML.png)\n\n\n\n**What can be improved?**\n\nWell, there are several items that can be improved and they are mostly not on us. To get it started I add what I think are the 3 main shortcomings and my thoughts on how they can be addressed in the future. Feel free to add what you think needs to be added to this list in the comments section.\n\n\n\n**1. Revit analytical models and as the results gbXML files, by design, are not intended to be clean**. Watch [this presentation from the Autodesk University](http://au.autodesk.com/au-online/classes-on-demand/class-catalog/2013/revit-for-architects/ab2260#chapter=4) to see the logic behind this approach which in short is it doesn't matter for a large scale early stage energy model. Well, This will be quite a problem for studies that you can do with Honeybee. Included but not limited to daylight and comfort analysis.\n\nThe best solution that I can think of, until Autodesk fixes their exporter, is to use Revit Rooms and Spaces and generate a clean model from the scratch. We have already tried this approach in Revit but since the Revit API doesn't provide access to Room openings we had a very hard time to get it to work.\n\nThat's why that I [opened an idea on Revit ideas](http://forums.autodesk.com/t5/revit-ideas/api-access-to-room-openings-geometry-and-materials-in-revit/idi-p/6642406) to get over this issue. With your support we already have 81 votes, but it hasn't been enough to make them to consider the idea for an official review. If you haven't voted already and you think this will be a helpful feature take a moment and vote so we can have it implemented at some point in the future.\n\n\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/Zf5668bSA49rOXBjOa*R*6N*pJt7QGiggF4mi1p74oQ*qkZVZqPzho1MWvhZfmbQ0UWISWFuzuiBdOsekbgeYuIrOHb5vgcV/access_to_room_openings.PNG?width=750\" width=\"750\"/>](http://forums.autodesk.com/t5/revit-ideas/api-access-to-room-openings-geometry-and-materials-in-revit/idi-p/6642406)\n\n\n\n**2. There is no way (that I know) to export only part of the model.** The way export gbXML is set up in Revit is to export the whole model once together. As a result, if you have a huge model with 100 rooms and you want to get one of the rooms into Honeybee using this component you have to export the whole model, which can take some time, and then import them all back into Grasshopper. To partially address this issue I added an input to the component that allows you input a list of names for rooms that you're interested to be loaded into Grasshopper. You can use the name of the room/space in Revit as an input for the component.\n\n\n\n**[<img class=\"align-full\" src=\"http://api.ning.com:80/files/Zf5668bSA4-aVqmm*vwM0uHBLepEXD6p3O7mfJq3LF7gL7VQ2I1YoCIuFhgA6mmRU6iUgM6mj7be8y74nCqDTRHk9pF9zCRI/Honeybee_Import_gbXML_filter_rooms.png?width=750\" width=\"750\"/>](http://api.ning.com:80/files/Zf5668bSA4-aVqmm*vwM0uHBLepEXD6p3O7mfJq3LF7gL7VQ2I1YoCIuFhgA6mmRU6iUgM6mj7be8y74nCqDTRHk9pF9zCRI/Honeybee_Import_gbXML_filter_rooms.png)**\n\n**<br/> 3. The component doesn't import adjacencies, loads, schedules and HVAC systems.** I wasn't able to export a gbXML file from Revit with any of this data except for the adjacency, but even if you can do that, the component currently can only import geometries and constructions. I hope we get access to 1 and so we don't have to use the xml file approach at all, but if that takes a very long time then we will add these features to the component.\n\n\n\nHappy 2017!\n\nMostapha\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1664214", "name": "rac_basic_sample_project.xml"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1666444", "name": "importGbXML.gh"}], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "December 29, 2016 at 08:11PM", "created_by": "mostapha", "topic": "New Honeybee Component: Import gbXML", "id": "topic_1664216"}