{"body": "\nHi Mostapha,\n\n \n\nIt is really great to know that the full suite of components for energy simulation for Honeybee and GrizzlyBear is released at the [AEC Tech Symposium and Hackathon](http://core.thorntontomasetti.com/aec-technology-symposium-2014/)!\n\nRegarding this, I have two questions:\n\n \n\n1)      I can't find the installation files in the \"food4rhino\" website, in which Version 0.0.57 and 0.0.51 are still the latest version released on April 8th, 2014.\n\n                I was wondering if you could help me to get these full suite of components - especially including GrizzlyBear.\n\n \n\n2)      In addition, I have some questions regarding the model exchange between Rhino/Grasshopper and Designbuilder ([http://www.designbuilder.co.uk/](http://www.designbuilder.co.uk/)), which is a commonly used software tool for checking building energy and thermal comfort and only accepts gbXML format file. I am quite interested in how GH models interoperate with the gbXML format. In order to achieve this, I have tried the GeometryGym gbXML components ([http://geometrygym.blogspot.nl/2014/04/gbxml-for-rhinograsshopper.html](http://geometrygym.blogspot.nl/2014/04/gbxml-for-rhinograsshopper.html)), but I found that some functions of these components were still not implemented yet. So my question is:\n\n                Will the \"GrizzlyBear\" plug-in be suitable for the model exchange between Rhino/Grasshopper and Designbuilder as it is?\n\n \n\nAgain, I would really appreciate it if you kindly offer me these energy simulation components and GrizzlyBear, so that I could test the possibility of coupling GH models and Designbuilder. You can reach me at [yd52503028@gmail.com](mailto:yd52503028@gmail.com)<br/>\n\n \n\nThank you very much in advance!\n\nBest regards,\n\nDing\n\n \n", "attachments": [], "created_by_name": "Ding", "created_at": "June 18, 2014 at 6:01pm", "created_by": "doudou", "topic": "Request for latest Honeybee (energy simulation components) and GrizzlyBear", "id": "topic_1090261"}