{"body": "\n\n\nI will be teaching a 4 hour workshop about using Ladybug for environmental design/analysis this Sunday (March 30, 2014) 1pm - 5pm EST/EDT.\n\n\n\nThe workshop will be streamed live. You won’t be able to ask questions during the workshop but I will be using Ladybug example files which you can download from the [Ladybug group page](http://www.grasshopper3d.com/group/ladybug) so you can follow along with the workshop. You can send me your questions later.<br/>\n\n\n\nThe workshop is a part of the Environmental Design Studio for the students of the [Master in Environmental Building Design (MEBD) program](http://www.design.upenn.edu/architecture/master-environmental-building-design-mebd) at [PennDesign](http://www.design.upenn.edu/).\n\n\n\n\n\nTentative outline:\n\nGetting Started: (epw file, 3d charts, conditional statements)\n\nWind analysis: (windrose, conditional statement &gt; potential for natural ventilation)\n\nSky + Radiation: (radiation rose, sky dome)\n\nSunpath + Shading design: (hourly data overlay, conditional statement)\n\nRadiation, Sunlight hours analysis (roof design, optimum orientation)\n\n\n\nIn case we have time we will also cover one example about:\n\nParametric optimization\n\n\n\nTo watch the workshop please register below:\n\n[https://attendee.gotowebinar.com/register/7552068540507890433](https://attendee.gotowebinar.com/register/7552068540507890433)\n\n\n\nAfter registering, you will receive a confirmation email containing information about joining the webinar. Thanks to [Thornton Tomasetti](http://www.thorntontomasetti.com/) for making streaming the workshop possible.\n\n\n\nMostapha\n\n<br/> PS. Sorry for the short notice. Please feel free to forward this to anyone of interest. **There will be a similar workshop next Sunday (April 6th) at the same time on Honeybee for daylighting simulation**. I will send the registration link early next week. Stay tuned!\n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "March 28, 2014 at 10:58am", "created_by": "MostaphaSadeghipour", "topic": "Watch the Ladybug Workshop Live This Sunday!", "id": "topic_1034817"}