{"body": "\nHello all, I am starting to investigate on energy and daylighting simulations in HB environment. Step by step I am currently studing all Youtube tutorials provided by Mostapha and Chris. As regard Chris's tutorial on energy simulation, I have this questions:\n\nRule of thumb for HB_solveadjacences is to create a sort of hierarchy among this component especially when you make some changes: eg If I want to add new properties in a specific zone (for example a new EPconstruction between two zone) I will plug this component setting to true \"remove current adjacences\" (if needed) before running the simulation. So I have the 1st HB_solveadj that controls the zones without changes and it is followed by other HB_solveadj for the modified ones. Is it correct?\n\nHB_generateEPoutput: Does surfacetempanalysis/surfaceenergyanalysis refer to surface baricenter?\n\nAre E+ schedules related to Openstudiostandards.json?\n\nIn the future are there any possibility to show a completion bar (for example in % like ecotect) for energy simulations? Or at least the percentage of completion similar to Radiance simulation Cmd panel, in order to manage my time because sometimes my pc is completely destined for this type of tasks.\n\nCurrently I am using LB_meshtohatch to export my results directly into illustrator (as vectors), and finally I use \"export selected\" in Rhino saving it as pdf, but this lead to a file with more mb than the ordinary. Due to this component my laptop becomes very slow. Are there any other component to obtain the same results?\n\n(for example in ecotect you could export as metafile without having this heavy 3dm file.)\n\nHow does Github work? Many times I have red in the forum that chris and mostapha fixed some bugs and, without creating a new release, they always have newer version of some components. In the image below I have found this new version of captureview: so by using HB/LB_update might I have new updated component everytime they are online on github? \n\nLast one: Yesterday I ran my first image-based daylighting simulation, unfortunately this morning I decide to rerun the same simulation and it gives me this error (first .gif) that i don't know how to fix (I've also tried to delete simulation folder and re launch it). On the contrary when I run glare analysis provided by mostapha everything goes well with HB_rundaylightsimulation component.\n\n\n\nI am very sorry for asking you all this questions at the same time, but I didn't find anything on this forum for some of my questions.\n\nThank you in advance \n\n\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1534995", "name": "imgbased simulation_cannotfind_errorlog.GIF"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1534996", "name": "how to update_single_component.GIF"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1534997", "name": "basic_daylight_analysis.gh"}], "created_by_name": "lukanuts", "created_at": "May 22, 2016 at 10:05am", "created_by": "lukanuts", "topic": "First steps into HoneyBee simulations", "id": "topic_1534998"}