{"body": "\nHi everyone,\n\nI would like to have precisions on the different methods to calculate mean radiant temperature.<br/>If you have some time, could you please confirm/correct/comment the following asumptions?\n\n\n\n1. From the Thermal Comfort Indices component, Comfort Index 11 (TCI-11):<br/>MRT = f(Ta, Tground, Rprim, e)\n\nwith:<br/>- Ta = DryBulbTemperature coming from ImportEPW component<br/>- Tground = f(Ta, N) where N comes from totalSkyCover input. Tground influences the long-wave radiation emitted by the ground in the MRT calculation.<br/>- Rprim defined as solar radiation absorbed by nude man = f(Kglob, hS1, ac)<br/>- ac is the clothingAlbedo in % (bodyCharacteristics input)<br/>- I can't find any definition in the code of Kglob and hS1. Could you tell me please what are those values referencered to? --&gt; probably the globalHorizontalRadiation but how?<br/>- e = vapour pressure calculated from Ta and Relative Humidity input\n\nDo you agree that in this case the MRT does not depend on these inputs: location, meanRadiantTemperature, dewPointTemperature and wind speed?<br/>It does not depend neither on the other bodyCharacteristics like bodyPosture, age, sex, met, activityDuration...?\n\nMRT calculated by the TCI-11 method is the mean radiant temperature of a vector pointing vertically with a sky view factor of 100%?<br/>For ParisOrly epw,\n\n2. From the SolarAdjustedTemperature component (that seems to be more used for the UTCI calculation examples on Hydra compared to TCI-11).\n\nIn contrast to the TCI-11, this component distinguishes diffuse and direct radiation and contextualizes the calculation thanks to _ContextShading input, right? <br/>It can also be applied to a mannequin thanks to the CumSkyMatrix and thus evaluate the dishomogeneity of radiation exposure.<br/>This component seems not to consider the influence of vapour pressure on the result --&gt; is it then more precise to put the MRT output (from the TCI) as an input of meanRadTemperature for SolarAdjustedTemperature?<br/>The default groundReflectivity is set to 0.25 --&gt; is GroundReflectivity taken into account in the Tground or MRT calculation in the TCI component? If yes, what is the hypothesised groundReflectivity?<br/>The default clothing albedo of 37% (TCI-11 bodyCharacteristics) corresponds to Clothing Absorptivity of 63%?\n\nIf the CumSkyMatrix input is not supplied, <br/>I get 9 results for the mannequin --&gt; where are those points/results coming from?\n\nIf the CumSkyMatrix input is supplied,<br/>I suppose the calculation of the 482 results correspond to a calculation method similar to the radiation analysis component that is averaged over the analysis period. Right?<br/>But I don't understand why the mannequin is composed of 481 faces and meshFaceResult gives 482 results.\n\nFinally, what is the link between the MESH results, the solarAdjustedMRT and the Effective Radiant field ? Is there a paper to have a detailed explanation of the method?\n\n<br/>3. Here are some results for the ParisOrly energyplus weather data. You can find here attached the grasshopper definition.<br/>There is no shading in this simulation and the result coming from the ThermalComfort indices for MRT is very different compared to the solar adjusted MRT.<br/>Why such a big difference and which of the result should be plugged into the UTCI calculation component?\n\nResults for ParisOrly.epw<br/>M,D,H:1,1,12\n\nTa : 6.5°C<br/>rh: 100%<br/>globalHorizontalRadiation: 54 Wh/m2<br/>totalSkyCover: 10<br/>MRT (TCI-11): 1.2°C\n\n_CumSkyMtxOrDirNormRad = directNormalRadiation : 0 Wh/m2<br/>diffuseHorizontalRad: 54 Wh/m2<br/>_meanRadTemp = Ta<br/>solarAdjustedMRT: 10.64°C<br/>MRTDelta: 4.14°C\n\n_CumSkyMtxOrDirNormRad = CumulativeSkyMtx<br/>diffuseHorizontalRad: 54 Wh/m2<br/>_meanRadTemp = Ta<br/>solarAdjustedMRT: 10.47°C<br/>MRTDelta: 3.97°C\n\n_CumSkyMtxOrDirNormRad = CumulativeSkyMtx<br/>diffuseHorizontalRad: 54 Wh/m2<br/>_meanRadTemp = MRT (TCI-11)<br/>solarAdjustedMRT: 5.17°C<br/>MRTDelta: 3.97°C\n\n<br/>Thanks a lot for your help<br/>Regards,\n\nAymeric\n\n\n\n\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1520582", "name": "Comparaison_MRT.gh"}], "created_by_name": "Aymeric", "created_at": "May 2, 2016 at 8:29am", "created_by": "AymericDELABACHELERIE", "topic": "Difference between MRT calculation methods", "id": "topic_1520583"}