{"body": "\nDear all,\n\n \n\nwe are working to a simple tool for calculating the heating and cooling loads (for HVAC sizing).\n\nWe have now completed the organization of the parameters we would like to control according to a general room (cube) with one window. However, we have several doubts about the results.\n\nIn our analysis only one face of the design room has outdoor boundary condition because we need to measure only the dispersions due to the characteristics of this façade face.\n\n \n\nPlease find attached the script we have developed with some instructions. Two options have been considered:\n\n-          1° OPTION: we defined all the properties of the different elements using the *HB_radOpaqueMaterial (*to elaborate further analysis) and *HB_EPOpaqueMat* components.\n\n-          2° OPTION: we used *HB_EPNoMassMat* in order to define the surfaces.\n\n\n\nAs reported previously, all the surfaces are adiabatic minus the reference wall with the window, which has been set as ‘outdoor’.\n\nWhich option should be used? We obtain different results, and in particular:\n\n-          The first option does not report the Heating load in the results;\n\n-          The second option seems to work, but the openstudio component highlights that no mass components could lead to not correct results.\n\nIn fact, when we use *HB_exportToOpenStudio* component we obtain:\n\n“1. The simulation has not run correctly because of this severe error:\n\n   ** Severe  ** This building has no thermal mass which can cause an unstable solution.”\n\nDoes it really affect the simulation?\n\n\n\nMoreover, if we change the schedules (we just try to increase the workday occupancy from 7.00 to 19.00), again (as option 1) we obtain just the Cooling load. Why?\n\nAre the schedules set correctly? We use Cooling and Heating schedules to define the temperatures, but we are not sure the analyses are working in the period we have defined.\n\n\n\nThank you\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1643270", "name": "Thermalloads_FORUM.gh"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1643271", "name": "ITA_MilanoLinate.160800_IGDG.ddy"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1643272", "name": "ITA_MilanoLinate.160800_IGDG.epw"}], "created_by_name": "MMerlin", "created_at": "November 21, 2016 at 5:38am", "created_by": "MMerlin", "topic": "Heating and Cooling Loads", "id": "topic_1643273"}