{"body": "\nHi Ladybug+Honeybee team\n\nFirstly I would like to express my gratitude for providing such amazing climatic design tools to the community. Keep up the great work!\n\nIn the last days I have been experimenting with the shade benefit evaluator tool, trying to determine the general shape of horizontal outdoor shades in various places of a waterfront.\n\nI have noticed that although the tool seems to suggest correct shading forms, the numerical results (degree-days per sq.m.) are not easily comparable between different cases and this may cause misinterpretations. I did a few experiments using the Hydra example and examined only the shade helpfulness to make things less complicated.\n\nWhile keeping all grasshopper parameters the same (including grid size = 1m) I changed the geometry of the potential shade and the area to be shaded. It can be observed that as the examined area becomes larger, the relative contribution of each shading patch becomes less significant. This is expected since the method calculates the percentage of the sun blocked as the component description states. Yet, the comparison of the calculated metric (degree-days/sq m) can easily lead to the assumption that the larger shade is less efficient than the smaller in terms of thermal comfort (1 degree-day/sq m vs 12 degree days/sq m), which is not true.\n\n\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/F0w1ASrn6MreWPVQq388i-cn1HOxdtXJjQbA2ynu539Vx27Oc5YloPegyeSOQfSNrhXLUBh1n41nhcuN1A0*BTCc4ZXS7AQc/shade1.JPG?width=300\" width=\"300\"/>](http://api.ning.com:80/files/F0w1ASrn6Mpl36LEe75lrfIjlZho2xIQucEJtArpICFJtkFT70nCdN4Sh*zwJlB-Ib1KOF-Ixl*cgNo799Er4Y4yfbza8QtU/shade3.JPG)[<img class=\"align-left\" src=\"http://api.ning.com:80/files/F0w1ASrn6Mp2CUx7b9mMGOvSBWTDAgUTBrY6hJxUCauITfEiNtQSk*FmjeOXLtUxskhjUfW6ZI5wqdLPOFUPqAurbYDFFIq7/shade3.JPG?width=300\" width=\"300\"/>](http://api.ning.com:80/files/F0w1ASrn6Mp2CUx7b9mMGOvSBWTDAgUTBrY6hJxUCauITfEiNtQSk*FmjeOXLtUxskhjUfW6ZI5wqdLPOFUPqAurbYDFFIq7/shade3.JPG)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThe same problem can also be observed when changing the resolution of the analysis to finer levels (e.g. 0.5m or 0.25m) while keeping geometry the same, although according to the component description, normalisation should take care of that (see fig. below).\n\n\n\n[<img class=\"align-left\" src=\"http://api.ning.com:80/files/F0w1ASrn6MqPqy3Qj9sa1lU1vsuaGD0f1B8PaV-JmtpWRyxThXv8suUdu4QJINmvZ-UFAzlil*5vI5ylr52S203W-*D3FjnE/shade2.JPG?width=300\" width=\"300\"/>](http://api.ning.com:80/files/F0w1ASrn6MqPqy3Qj9sa1lU1vsuaGD0f1B8PaV-JmtpWRyxThXv8suUdu4QJINmvZ-UFAzlil*5vI5ylr52S203W-*D3FjnE/shade2.JPG)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nIs this normal? Is there a work-around to this issue (e.g. a different metric or post-process procedure)? I would appreciate hearing your thoughts on this.\n\nBest Regards\n\nAris\n", "attachments": [], "created_by_name": "Aris V", "created_at": "September 22, 2016 at 12:05am", "created_by": "ArisVartholomaios", "topic": "Inconsistencies in Shadebenefit evaluator", "id": "topic_1603846"}