{"body": "\n<br/>Tonight is the longest night of the year (in the northern hemisphere of course) and a good excuse to send a loong post to update you about Ladybug + Honeybee + Butterfly and celebrate the loooong night. So here we go!\n\n \n\n**1. Honeybee is brown and not yellow [stupid!]...**\n\nAs you probably remember Honeybee logo was initially yellow because of my ignorance about Honeybees. With the help of our Honeybee expert, Michalina, now the color is corrected. I promised her to update everyone about this. Below are photos of her working on the honeybee logo and the results of her study.\n\n \n\n[<img class=\"align-center\" src=\"http://api.ning.com:80/files/xMCtlOLhuRfSckKnh1hgX4FaDuIU4cL6Ix8P2wNz2G2E7CfexTWe6nBbo6M3OYJGkefLrWsTtSEttyv6pbnAp*5nAgC7vM9D/Michalina.jpg?width=500\" width=\"500\"/>](http://api.ning.com:80/files/xMCtlOLhuRfSckKnh1hgX4FaDuIU4cL6Ix8P2wNz2G2E7CfexTWe6nBbo6M3OYJGkefLrWsTtSEttyv6pbnAp*5nAgC7vM9D/Michalina.jpg)\n\n[<img class=\"align-center\" src=\"http://api.ning.com:80/files/xMCtlOLhuRd550qXLz7VhEXFu*ae0bVDl2L9c8jlu*t21d1dBzvSJ5hfdB4geFWVoai06En6FajqJkKYfDxo2cVgwxIvtD-s/2013120421_52_46HoneyBeeIconsMD9.ai_66.67CMYK_Preview.png\" width=\"500\"/>](http://api.ning.com:80/files/xMCtlOLhuRd550qXLz7VhEXFu*ae0bVDl2L9c8jlu*t21d1dBzvSJ5hfdB4geFWVoai06En6FajqJkKYfDxo2cVgwxIvtD-s/2013120421_52_46HoneyBeeIconsMD9.ai_66.67CMYK_Preview.png)\n\n \n\nIf you think I'm exaggerating by calling her a honeybee expert you better watch this video:\n\n<iframe _origwidth=\"420\" frameborder=\"0\" height=\"315\" src=\"//www.youtube.com/embed/oi-_s7whFSI?wmode=opaque\" width=\"420\"></iframe>\n\n\nThank you Michalina for the great work! :). I corrected the colors. No yellow anymore. The only yellow arrows represent sun rays and not the honeybee!\n\n \n\n[<img class=\"align-center\" src=\"http://api.ning.com:80/files/xMCtlOLhuRcqfJ11wWCnsJTfn2Xa-BfshZRICDw9aIBbh*3l1nxK4wdVUt0R-NSeNGaUJWml5IYgRSS20tX5Pq5F5joGioQv/Honeybee_updated_logos.png?width=600\" width=\"600\"/>](http://api.ning.com:80/files/xMCtlOLhuRcqfJ11wWCnsJTfn2Xa-BfshZRICDw9aIBbh*3l1nxK4wdVUt0R-NSeNGaUJWml5IYgRSS20tX5Pq5F5joGioQv/Honeybee_updated_logos.png)\n\n \n\n**2. Yellow or brown, W[here]TH Honeybee is?**\n\nI know. It has been a long time after I posted the initial video and it is not fun at all to wait for a long time. Here is the good news. If you are following the [Facebook page](https://www.facebook.com/LadyBugforGrasshopper) you probably now that the Daylighting components are almost ready.\n\n \n\nCouple of friends from Grasshopper community and RADIANCE community has been helping me with testing/debugging the components. I still think/hope to release the daylighting components at some point in January before Ladybug gets one year old.\n\n \n\nThere have been multiple changes. I finally feel that the current version of Honeybee is simple enough for non-expert users to start running initial studies and flexible enough for advanced users to run advanced studies. I will post a video soon and walk you through different components.\n\n \n\n[<img class=\"align-center\" src=\"http://api.ning.com:80/files/xMCtlOLhuRf5TfbDvarXiUY6GSV3j2vaCGXxiAAASVN3yG1v185aaGu4b9LBqkAXeDKHwLtXgCQyHy6kLozwmX2HUt0zPDRP/06_DEC_2013_Honeybee.png?width=750\" width=\"750\"/>](http://api.ning.com:80/files/xMCtlOLhuRf5TfbDvarXiUY6GSV3j2vaCGXxiAAASVN3yG1v185aaGu4b9LBqkAXeDKHwLtXgCQyHy6kLozwmX2HUt0zPDRP/06_DEC_2013_Honeybee.png)\n\nI think I still need more time to modify the energy simulation components so they are not going to be part of the next release. Unfortunately, there are so many ways to set up and run a wrong energy simulation and I really don’t want to add one new GIGO app to the world of simulation. We already have enough of that. Moreover I’m still not quite happy with the workflow. Please bear with me for few more months and then we can all celebrate!\n\n \n\nI recently tested the idea of connecting Grasshopper to [OpenStudio](http://openstudio.nrel.gov/) by using OpenStudio API successfully. If nothing else, I really want to release the EnergyPlus components so I can concentrate on Grasshopper &gt; OpenStudio development which I personally think is the best approach.\n\n \n\n<iframe _origwidth=\"560\" frameborder=\"0\" height=\"315\" src=\"//www.youtube.com/embed/RtOBbJpcJZA?wmode=opaque\" width=\"560\"></iframe>\n\n\n \n\n**3. What about wind analysis?**\n\nI have been asked multiple times that if Ladybug will have a component for wind study. The short answer is YES! I have been working with [EFRI-PULSE project](http://www.buildsci.us/efri-pulse.html) during the last year to develop a free and open source web-based CFD simulation platform for outdoor analysis.\n\n \n\nWe had a very good progress so far and our rockstar Stefan recently presented [the results](http://meetings.aps.org/Meeting/DFD13/Session/A1.3) of the work at the American Physical Society’s 66th annual DFD meeting and the results looks pretty convincing in comparison to measured data. Here is an image from the presentation. All the credits go to Stefan Gracik and EFRI-PULSE project.\n\n \n\n[<img class=\"align-center\" src=\"http://api.ning.com:80/files/xMCtlOLhuRejBs-Y2Y1nkRm*97N3ys0dXSf0m3qTNqPDlOmD5kxLsv9-*creEZJ6PsX7I6E57crFFTEdZ74xsK3kR3BuQcXK/CFD_Simulation_Results.jpg?width=648\" width=\"648\"/>](http://api.ning.com:80/files/xMCtlOLhuRejBs-Y2Y1nkRm*97N3ys0dXSf0m3qTNqPDlOmD5kxLsv9-*creEZJ6PsX7I6E57crFFTEdZ74xsK3kR3BuQcXK/CFD_Simulation_Results.jpg)\n\n \n\nThe project will go live at some point next year and after that I will release the Butterfly which will let you prepare the model for the CFD simulation and send it to EFRI-PULSE project. I haven’t tried to run the simulations locally yet but I’m considering that as a further development. Here is how the component and the logo looks like right now.\n\n \n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/xMCtlOLhuRd-MrzsCHGRETb8R6af8Vf85cEYC7fXV3b9LomNIzXIgSt8gHyBbdkrDZsQKyqBWDGrCwzv*dV-q29BZ7XIYGmZ/butterfly_component.jpg?width=500\" width=\"500\"/>](http://api.ning.com:80/files/xMCtlOLhuRd-MrzsCHGRETb8R6af8Vf85cEYC7fXV3b9LomNIzXIgSt8gHyBbdkrDZsQKyqBWDGrCwzv*dV-q29BZ7XIYGmZ/butterfly_component.jpg) \n\n \n\n**4. Teaching resources**\n\nIt has been almost 11 months from the first public release of Ladybug. I know that I didn't do a good job in providing enough tutorials/teaching materials and I know that I won’t be able to put something comprehensive together soon.\n\n \n\nFortunately, ladybug has been flying in multiple schools during the last year. Several design, engineering and consultant firms are using it and it has been thought in several workshops. As I checked with multiple of you, almost everyone told me that they will be happy to share their teaching materials; hence I started the [teaching resources page](http://www.grasshopper3d.com/group/ladybug/page/ladybug-teaching-resources). Please share your materials on the page. They can be in any format and any language. Thanks in advance!\n\n \n\nI hope you enjoyed/are enjoying/will enjoy the longest night of the year. Happy [Yalda](http://en.wikipedia.org/wiki/Yald%C4%81)!\n\n \n\nCheers,\n\n-Mostapha\n\n \n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "December 21, 2013 at 3:54pm", "created_by": "mostapha", "topic": "Update + Happy Yalda!", "id": "topic_977070"}