{"body": "\nHello everyone!\n\n\n\nI am currently thinking of Agent Based Models (ABM) for building assessment, specifically to understand how behavioural patterns affect building performance and vice versa.\n\n\n\nThe way I see it, and I could be wrong, to some extend these types of analyses are already included in E+ (and HB) in the sense that we can assign schedules of certain building components and systems (e.g. shading, windows aka n.v., thermostats, etc.) according to other independent variables (mainly outdoor temperature and irradiance) that we attribute to imaginary agents.\n\n\n\nHowever, this mostly represents analyses using external (to the model itself) data, and not internally calculated outputs, which are essential for assessing occupant behaviour (e.g. open window when outdoor temperature is lower than..). Thankfully, HB already includes an array of advanced components able to calculate these parameters, especially comfort parameters and daylighting.\n\n\n\nDoes that mean that we could potentially use that information as input to agents that would populate the space of our model? I am thinking here in the same terms as a wind driven rain simulation workflow would work, where first a CFD study would analyse the wind velocity for every point of the mesh and the droplets would then be dropped in that  mesh and their probabilities of their routes would be calculated. In the same way I would imagine we can calculate probabilities of occupant actions in 'points in time', where occupants would change their environments given the results of the simulation. This isn't really real-time but it is still a start and it is a quite good approximation of the nowadays-popular, low-control, mechanically ventilated buildings.\n\n\n\nNow, I believe that I could model these type of agents, and their parameters, rules, probabilities, etc. If so, how interesting and especially how difficult would it be to create the component that would take the results of the simulation for a space as inputs for these agents?\n\n\n\nI know the above is not totally clear but bare with me as this is shaped along your comments and ideas.\n\n\n\n(an example for inspiration from 2011, agent based model architecture: [https://vimeo.com/18967658](https://vimeo.com/18967658))\n\n\n\nKind regards,\n\nTheodore.\n\n\n", "attachments": [], "created_by_name": "Theodoros Galanos", "created_at": "December 04, 2015 at 01:01AM", "created_by": "TheodorosGalanos", "topic": "Towards HB Agent Based Models?", "id": "topic_1414654"}