{"body": "\nHi all,\n\n\n\nI want to develop a program to calculate the solar factor of a facade, for any atypical configuration.\n\nI used Honeybee components to define all the materials of the scene, the sky, and the radiance parameters. Then I define the analysis grids: one before the system “shading+facade” to determine the incident solar energy, and one inside my “box” to determine the transmitted solar energy. The ratio of the two energies for each point of the grid give the solar factor on those points. I average all the points of the grid and obtain hourly values of the solar factor of the system. (Attached files)\n\nI have done a test with an extremely simple “box”, without shading system, with a window for which I defined a RGB transmittivity of 0.5, and I obtained an annual solar factor of 0.33.\n\n\n\n1)     Can you indicate what is wrong about my program?\n\n2)     Facing this result, I’m wondering if the program is really adapted to the calculation of the solar energy. I mean the Ray tracing method used by Radiance is interesting for my problematic but the calculations under the hood may be not relevant for solar energy. The “solar irradiation” calculated take into account only reflexions (and not transmissions). Am I right for this point? ! I really want to understand what is going on under the hood …\n\n3)     Do you know if it’s possible to use this Ray Tracing method for solar energy calculations? (If it exists a program or a way to, even without use HB or LB components ?)\n\n\n\nFor now I can use the program to determine the “solar factor” of the opaque shading system (alone) and then apply this factor to the solar factor of the glazing system (given by suppliers). So that I can have the solar factor of the complete system “shading+window”. It is an idea but still arises the problem of modeling a canvas shading, for instance, which transmits a diffuse part of the solar energy it receives. Or the problem of determining the solar factor of a double glazing system with a venetian blind placed between the panes, or an inside blind for which we must take into account its infrared heating... \n\n \n\nThe conception of this tool constitute my project graduation… so I would be really thankful if you can help me !!\n\nThanks in advance,\n\n \n\nSeverine\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1502225", "name": "SolarFactor_severine.gh"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1502226", "name": "CaptureSolarFactor-withoutshading.PNG"}], "created_by_name": "Severine", "created_at": "April 6, 2016 at 4:41am", "created_by": "Severine", "topic": "Determination of the Solar Factor of a facade", "id": "topic_1502227"}