{"body": "\nLadies and Gentlemen of the Ladybug Community,\n\n\n\nI write to inform you of a change that has been made in the US Department of Energy’s climate file database, which many of you know is the lifeblood of the Ladybug + Honeybee project as well as a cornerstone for a large fraction of the building energy modeling practice.  In accordance with the moving of all EnergyPlus documentation from the Department of Energy’s website to Energyplus’s own website, the entire climate file database has now been removed from its original location and relocated to the EnergyPlus site, causing what I am sure is many broken links across a lot of platforms.\n\nMany of you will not notice the effects of the change immediately since many of us work from weather files that have been already downloaded to our machines.  However, when you go to begin working in a new climate with the Ladybug + Honeybee tools, here is what you have to know:\n\n \n\nFor **TYPICAL USERS** of the last stable release of Ladybug + Honeybee, you will have to manually download, unzip, and open all weather files with the “Open EPW” component until the next stable release.  In other words, the automatic download of the “Open EPW and STAT” component will not work correctly since it was built to reference weather file URLs from the old database.  To download your weather files, we recommend that you use the epwmap interface, which the “Download EPW” component currently sends you to:<br/> [http://mostapharoudsari.github.io/epwmap/](http://mostapharoudsari.github.io/epwmap/)<br/> All links on the epwmap interface have been updated to sync with the new database location and so you should not experience any issues using it.  If you are a big fan of going straight to the source of the climate database, you can find the new location of the database here on the EnergyPlus website:<br/> [https://energyplus.net/weather](https://energyplus.net/weather)<br/> Again, note that all links that you had to the old Department of Energy database will no longer work.\n\n \n\nFor **USERS SYNCED WITH OUR GITHUB**, just sync your components now and you should not experience any issue here on out.  The “Open EPW and STAT” component on the github is fully compatible with the new database location.\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "December 11, 2015 at 10:30pm", "created_by": "ChrisMackey", "topic": "Changed Location of the Department of Energy Weather File Database", "id": "topic_1420036"}