{"body": "\nI just wanted to see if anyone's having a similar experience to what I'm seeing with multithreading for Honeybee, specifically with the Honeybee_Run Daylight Simulation component.\n\nAs I test I ran the same simulation with two different settings, with _numOfCUPs_ set to 1 and again with it set to 10.  I'm running it on a 6 core/12 thread CPU so I should have no problem handling 10 threads.\n\nI've attached an Excel file with my results for how long it took with a single thread vs. how long each of threads took on the 10 thread run.  What it amounts to is that with a single thread it took 51 minutes, and with the 10 thread option it took 47 minutes for it all to finish.  With the latter the first 9 threads finished between 28-34 minutes which is a significant time savings over the single thread run, but the last thread still took almost as long and gave us only about an 8% time savings.\n\nThis is only one simple comparison and only one simulation type, but I've seen this same result happen over and over again over the past year or so with several simulations (annual, irradiance, illuminance,...).  I also don't think it's necessarily a Honeybee problem, because even running the simulations myself by creating the octree mesh and running radiance and daysim from the command line I had the same issue where splitting a model up and running parallel simulations that were then recombined took just about as long as running it all in one thread.  Add into this the time necessary to combine the different files at the end and your multithreading time savings become even less.\n\nSo is it me, my machine, radiance, bad karma?\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1255659", "name": "RadianceResults.xlsx"}], "created_by_name": "Timothy Logan", "created_at": "April 03, 2015 at 01:46PM", "created_by": "TimothyLogan", "topic": "Multithreaded Daylight Simulations", "id": "topic_1255660"}