{"body": "\nHello Mostapha, Chris and everyone,\n\nI am trying to simulation the energy demands of a one-zone room with a dimension of 3(w)*4 (d)*3(h). I am new in this area, so I have some questions about the simulation model, and I would be very grateful if you could help me to have a look.\n\n1. The air change rate is assumed to be 0.5 times per hour and the infiltration rate is 0.1 times per hour, so I sum these two values and set the converted infiltration rate per area as 0.0005 m3/s-m2. I don’t know whether it is appropriate to sum these numbers and input them together in the “infiltration rate per area” part?\n\n2. I found in the latest version, there is a component called “air flow”, which can edit natural ventilation, but if I set minIndoorTempForNatVent equal to the heatingSePt as you showed once in the forum, the simulation result of heating is ridiculous high (like 7000 kwh/m2a). If the minIndoorTempForNatVent value is set to be a little higher than the heatingSePt, the heating result looks much normal (like 200 kwh/m2a). I don't know whether there is anything wrong with my model or settings, and hope you could help me.\n\n3. I want to add the cooling and heating COP values (2.8 and 0.8) in my simulation process. I have noticed that in the forum, you mentioned that the new component \"setEPIdealAir\" can help to add COP, but I am still very confused about how exactly it works. I would be very grateful if you could show me again here.\n\n4. I tried to change the WWR and the U-value of the wall, but I found the results of cooling and heating (especially cooling) vary little, which is not supposed to be like that. I guess there should be something wrong...\n\n \n\nThat's all for my questions.\n\nThank you so much for your time in advance. I would be very grateful if you could help me in this model. It would be very helpful for my work.\n\n \n\nThank you again!\n\nCheers,\n\nYao\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1280250", "name": "5.gh"}], "created_by_name": "Yao Lv", "created_at": "May 04, 2015 at 12:51PM", "created_by": "YaoLv", "topic": "Questions about honeybee in natural ventilation and COP setup", "id": "topic_1280251"}