{"body": "\nHi all,\n\n\n\nI'm using LB/HB as a first choice in design analysis of daylight and energy, and really appreciate how far the development has progressed. I find that recent additions of more hvac system components, among other functionalities, is significantly widening the relevance of the toolset.\n\nMeanwhile having used the tools for some time now and have gone through the forum, in my opinion a few critical system controls is still missing - unless I'm missing some understanding.\n\nIn order to really make the hourly energy analysis valuable in early massing studies etc. the consideration of indoor climate can be more detailed. The HVAC capacities, max. airrate and min. inlet temperature should be within comfortable ranges and hardsized by user input to reduce internal draft problems. If not considered I find that the analysis could possibly demonstrate good energy behavior and reasonable operative temperature but in reality could cause a bad indoor environment - and when \"rectified\" at a later stage the energy consumption will increase.\n\nI would like to know how it is possible in HB to set-up a HVAC system with these ventilation controls and a \"unlimited\" convective/radiant heating system, and how to deal with the issues mentioned below. The inputs parameters exists in the components, but I can't seem to get the right system behaviour.\n\nIn the attached file I have gone through 4 scenaries, each with seperate issues in setting up the system (As no template appearantly supports the combined setup the heating system is simulated using an inlet temperature of 99 degrees).\n\n \n\nThanks a lot!\n\nJon\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1727349", "name": "hvac_control.gh"}], "created_by_name": "Jon Strunge", "created_at": "April 4, 2017 at 4:28pm", "created_by": "JonStrunge", "topic": "HVAC and indoor climate", "id": "topic_1727350"}