{"body": "\nHello All,\n\n\n\nI am facing a problem in running an energy simulation using a model with curved surfaces.\n\nI am attaching the script and the model that should give you the same error I get.\n\nThe error appears as soon as I introduce the glazing surfaces in the geometry and it is the following:\n\n\n\n**1. Solution exception:'hb_EPZoneSurface' object has no attribute 'coordinates'**\n\n\n\nI have been trying to solve it for a while and I have noted the following:\n\n\n\n- I am using the approach of building the zones using the create HBSfrs component. However, nothing changes if I use the Honeybee masses2zone component (error remains);\n\n\n\n- I am introducing the glass surfaces using geometries built in Rhino. However nothing changes if I use the HB component to automatically build the windows based on glass to wall ratio (error remains);\n\n\n\n- This problem in the simulation has been introduced only once I have updated all the components to the latest versions of LB and HB. The geometry was working fine with the versions from Feb 2017. Also, I don't expect that curved geometries should cause problems as they have been used in simulations for quite a while now.\n\n\n\nFinally, there is another problem in the simulation which relates to the HB context surfaces. Even if the simulation runs with the curved geometry, as soon as I add the roof as a shading element I am again not able to go further. The roof is composed also of curved surfaces and I could eventually simplify them but I am surprised that they are not 'digested' as they are quite simple and 'light' in the end.\n\nI hope that I am missing something here and that the problem can be solved easily. It would be great to have your input!\n\nThanks a lot in advance and let me know if you have any questions on this!\n\n\n\nCarmelo\n\n\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1811095", "name": "energy_model_CGG.gh"}, {"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1811096", "name": "model.3dm"}], "created_by_name": "Carmelo G. Galante", "created_at": "September 09, 2017 at 09:28AM", "created_by": "CarmeloGGalante", "topic": "Problems in running energy simulation due to geometry", "id": "topic_1811097"}