{"body": "\nHello Ladybug community!\n\n\n\nI just wanted to send out a post since I just finished presenting my thesis on the application of LB+HB's thermal maps and I wanted to let everyone know the timeline for pushing the maps to the broader community.\n\nAt the moment, there are just a few known issues left that I have to fix for complex geometric cases but they should run smoothly for most energy models that you generate with Honeybee.  Within the next month, I will be clearing up these last issues and, by the end of the month, there will be an updated youtube tutorial playlist on the comfort tools and how to use them.\n\nIn the meantime, there's an updated example file ([http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;for...](http://hydrashare.github.io/hydra/viewer?owner=chriswmackey&amp;fork=hydra_2&amp;id=Indoor_Microclimate_Map)) and I wanted to get you all excited with some images and animations coming out of the design part of my thesis.  I also wanted to post some documentation of all of the previous research that has made these climate maps possible and give out some much deserved thanks.  To begin, this image gives you a sense of how the thermal maps are made by integrating several streams of data for EnergyPlus:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/0gGC4ZQuxjPqWEpJTdJCSyVJYVyQ1xAstb5LPmThgc1tyq4NT*nuxSoFmyhv3JkKhIqdiwFObkecBvzEbzlFHDu22xrOUB25/CreationofThermalMaps.jpg?width=750\" width=\"750\"/>](http://api.ning.com:80/files/0gGC4ZQuxjPqWEpJTdJCSyVJYVyQ1xAstb5LPmThgc1tyq4NT*nuxSoFmyhv3JkKhIqdiwFObkecBvzEbzlFHDu22xrOUB25/CreationofThermalMaps.jpg)\n\n([https://drive.google.com/file/d/0Bz2PwDvkjovJaTMtWDRHMExvLUk/view?u...](https://drive.google.com/file/d/0Bz2PwDvkjovJaTMtWDRHMExvLUk/view?usp=sharing))\n\n\n\nTo get you excited, this youtube playlist has a whole bunch of time-lapse thermal animations that a lot of you should enjoy:\n\n[https://www.youtube.com/playlist?list=PLruLh1AdY-Sj3ehUTSfKa1IHPSiu...](https://www.youtube.com/playlist?list=PLruLh1AdY-Sj3ehUTSfKa1IHPSiuJU52A)\n\n\n\nTo give a brief summary of what you are looking at in the playlist, there are two proposed designs for completely passive co-habitation spaces in New York and Los Angeles.\n\nThese diagrams explain the Los Angeles design:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/0gGC4ZQuxjPSPQoziW-wNXiItVqgppVLRFX49QsytnNB00cYzxGt-EHIRtXidBpmuC*ap5cSEwMMVWI5afp-VB-jLgIRMJax/BoardofLAGenerationDiagrams.jpg?width=750\" width=\"750\"/>](http://api.ning.com:80/files/0gGC4ZQuxjPSPQoziW-wNXiItVqgppVLRFX49QsytnNB00cYzxGt-EHIRtXidBpmuC*ap5cSEwMMVWI5afp-VB-jLgIRMJax/BoardofLAGenerationDiagrams.jpg)\n\n([https://drive.google.com/file/d/0Bz2PwDvkjovJM0JkM0tLZ1kxUmc/view?u...](https://drive.google.com/file/d/0Bz2PwDvkjovJM0JkM0tLZ1kxUmc/view?usp=sharing))\n\nAnd this video gives you and idea of how it thermally performs:\n\n<iframe _origwidth=\"750\" frameborder=\"0\" height=\"531\" src=\"https://www.youtube.com/embed/WJz1Eojph8E?wmode=opaque\" width=\"712\"></iframe>\n\n\n\n\nThese diagrams explain the New York design:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/0gGC4ZQuxjPHQwwr9IBdo83j6K8s8I8thG1PZY4H4UM6O6EwiUuo*WZi3iPSypPd80xIWQRnRLhzwCJO2uenq-68XRARplhS/BoardofNYGenerationDiagrams.jpg?width=750\" width=\"750\"/>](http://api.ning.com:80/files/0gGC4ZQuxjPHQwwr9IBdo83j6K8s8I8thG1PZY4H4UM6O6EwiUuo*WZi3iPSypPd80xIWQRnRLhzwCJO2uenq-68XRARplhS/BoardofNYGenerationDiagrams.jpg)\n\n([https://drive.google.com/file/d/0Bz2PwDvkjovJS1BZVVZiTWF4MXM/view?u...](https://drive.google.com/file/d/0Bz2PwDvkjovJS1BZVVZiTWF4MXM/view?usp=sharing))\n\nAnd this video shows you the thermal performance:\n\n<iframe _origwidth=\"750\" frameborder=\"0\" height=\"531\" src=\"https://www.youtube.com/embed/CATJN-rOkNM?list=PLruLh1AdY-Sj3ehUTSfKa1IHPSiuJU52A&amp;wmode=opaque\" width=\"712\"></iframe>\n\n\n\n\n\n\nNow to credit all of the awesome people that have made the creation of these thermal maps possible:\n\n1) As any HB user knows, the open source engines and libraries under the hood of HB are EnergyPlus and OpenStudio and the incredible thermal richness of these maps would not have been possible without these DoE teams creating such a robust modeler so a big credit is definitely due to them.\n\n2) Many of the initial ideas for these thermal maps come from an MIT Masters thesis that was completed a few years ago by Amanda Webb called \"cMap\".  Even though these cMaps were only taking into account surface temperature from E+, it was the viewing of her radiant temperature maps that initially touched-off the series of events that led to my thesis so a great credit is due to her.  You can find her thesis here ([http://dspace.mit.edu/handle/1721.1/72870](http://dspace.mit.edu/handle/1721.1/72870)).\n\n3) Since the thesis of A. Webb, there were two key developments that made the high resolution of the current maps believable as a good approximation of the actual thermal environment of a building.  The first is a PhD thesis by Alejandra Menchaca <br/> (also conducted here at MIT) that developed a computationally fast way of estimating sub-zone air temperature stratification.  The method, which works simply by weighing the heat gain in a room against the incoming airflow was validated by many CFD simulations over the course of Alejandra's thesis.  You can find here final thesis document here ([http://dspace.mit.edu/handle/1721.1/74907](http://dspace.mit.edu/handle/1721.1/74907)).\n\n4) The other main development since the A. Webb thesis that made the radiant map much more accurate is a fast means of estimating the radiant temperature increase felt by an occupant sitting in the sun.  This method was developed by some awesome scientists at the UC Berkeley Center for the Built Environment (CBE) Including Tyler Hoyt, who has been particularly helpful to me by supporting the CBE's Github page.  The original paper on this fast means of estimating the solar temperature delta can be found here ([http://escholarship.org/uc/item/89m1h2dg](http://escholarship.org/uc/item/89m1h2dg)) although they should have an official publication in a journal soon.\n\n5) The ASHRAE comfort models under the hood of LB+HB all are derived from the javascript of the CBE comfort tool ([http://smap.cbe.berkeley.edu/comforttool](http://smap.cbe.berkeley.edu/comforttool)).  A huge chunk of credit definitely goes to this group and I encourage any other researchers who are getting deep into comfort to check the code resources on their github page ([https://github.com/CenterForTheBuiltEnvironment/comfort_tool](https://github.com/CenterForTheBuiltEnvironment/comfort_tool)).\n\n6) And, last but not least, a huge share of credit is due to Mostapha and all members of the LB+HB community.  It is because of resources and help that Mostapha initially gave me that I learned how to code in the first place and the knowledge of a community that would use the things that I developed was, by fa,r the biggest motivation throughout this thesis and all of my LB efforts.\n\n\n\nThank you all and stay awesome,\n\n-Chris\n", "attachments": [], "created_by_name": "Chris Mackey", "created_at": "May 16, 2015 at 6:26pm", "created_by": "chris", "topic": "Initial Documentation of Thermal Maps", "id": "topic_1288409"}