{"body": "\nHello boys and girls,\n\nRecently I've updated to .61 version and needed to work on some sunlight hours analysis. In such cases I just open the example files kindly provided by Ladybug creators (thank you, love you guys), naturally they get outdated time to time and I update them with Update Ladybug component. Same here but this time I stumbled upon some errors.\n\nAfter the update all the LegendPar components returned error, this happened before and could be fixed by deleting the problem component with newly updated one (if memory doesn't play wacky tricks on me, I remember Mostapha explained that this could happen when the old component had different amount of plugs with the source code, since only the code is being updated, correct me if I'm wrong), but it didn't work this time. \n\nAs you can see on the image below, the red one is the original component and the new one is placed above it. Although the red component is connected, SunlightHours doesn't \"see\" it and show the analysis in fifty shades...ghmm, sorry, in gray shades, which is very hard to distinguish sometimes.\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/rq3DVWxENVE2AN7kdArfuFjjfMYXNq5h0WCmw5gnWy8VYAkKJR10DB4TIzBonlv-BCARobmRIKuuZFlDM4PVBClZnBwxuhRS/Legendparerror.png?width=600\" width=\"600\"/>](http://api.ning.com:80/files/rq3DVWxENVE2AN7kdArfuFjjfMYXNq5h0WCmw5gnWy8VYAkKJR10DB4TIzBonlv-BCARobmRIKuuZFlDM4PVBClZnBwxuhRS/Legendparerror.png)Error balloon says:\n\n1. Solution exception:name 'decimalPlaces_' is not defined\n\n\n\nWhen I connect new LegendPar component SunLightAnalysis gives me this:\n\n\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/rq3DVWxENVFCHteoyZsH*1nXopGHuZG2661qo3zEyCgJZ4uEP36caIdBQKJJSzZukljmQh-cEm4ttke4gijinvhqxCJNyKA9/Legendparerrorsequel.png?width=600\" width=\"600\"/>](http://api.ning.com:80/files/rq3DVWxENVFCHteoyZsH*1nXopGHuZG2661qo3zEyCgJZ4uEP36caIdBQKJJSzZukljmQh-cEm4ttke4gijinvhqxCJNyKA9/Legendparerrorsequel.png)\n\nError balloon says:\n\n1. Solution exception:index out of range: 9\n\n\n\nAt this time analysis diagram says bye bye and nothing works. I tried to change and reconnect all the wires and dance around the computer but nothing worked, is it possible that this is a bug? Or am I doing something cool?\n\n\n\nSorry for the amount of letters here, have a good day.\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1410841", "name": "04_EnvironmentalAnalysis.gh"}], "created_by_name": "Tim", "created_at": "November 27, 2015 at 08:28AM", "created_by": "Timur582", "topic": "Ladybug Sunlight Hours Analysis - LegendPar (Update Ladybug", "id": "topic_1410842"}