{"body": "\nHi,\n\n\n\nI'm trying to figure out the best way to add glazing to my model. I want to run energy and daylight factor simulations. If I get it right there are two ways to do this;\n\n- Manually assign glazing properties to certain surfaces\n\n- Glazing by ratio\n\nI have some issues with both methods though. As I'd like to use the excellent SplitBuildingMass and Solve Adjacencies components the first one is complicated. Correct me if I'm wrong, but first I have to make the HBZones, then decompose these zones in order to add glazing to the walls and finally turn the HBSurfaces into HBZones again. As I have multiple levels I have problems making zones of the surfaces and also the model is already quite slow. Is there a better way to manually assign glazing properties to certain surfaces? I've tried adding the window+wall geometry to the directly to the SplitBuildingMass component but, understandably, the Solve Adjacencies component doesn't understand that parts of the walls are windows.\n\nThe second method works great! Using some simple mathematics I'm able to compute the ratio value when I add a certain number of windows with certain dimensions. However, I need the window widths to be correct when I run daylight factor simulations. It would be possible to solve this by calculating what break up distance will result in the correct window width. However, it doesn't seem like it's possible to assign brake up distances for each facade (North, West, South, East) with a list as it is with glazing ratio, window height and sill height. Is there a way around this?\n\nI've attached a image of what happens when I try to add break up distances as a list.\n\n\n\nI would really appreciate some help. If any of you have a suggestion of a different solution for my glazing issue I'm open to new ideas.\n\n\n\nMy only concern is that the calculations will be too slow, I plan to use Octopus to run several simulations for different designs later on. I have a quite good computer, but a i7 doesn't help much with single threaded calculations.\n\n\n\nThanks,\n\n\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1235999", "name": "HB glazing brake up distance as list.png"}], "created_by_name": "Sverker Dahlblom", "created_at": "March 04, 2015 at 01:53AM", "created_by": "SverkerDahlblom", "topic": "Add Glazing problems: Break up distance as list", "id": "topic_1236000"}