{"body": "\nHi,\n\n\n\nI had some weird experience with the Cumulative Sky component in Honeybee, in which it was referring to the wrong weather file!!!<br/>(important to note that this only applies to HB Cumulative Sky component, and not to the LB component for the same task).<br/><br/>So, my understanding is that the way HB Cumulative Sky component reads the weather file is that it is independent of what the .epw weather file is called (eg ITA_milano_linate_mn70.epw), but what matters is the weather station name inside the actual epw file.\n\n\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/99aVnO*4LGf1KPWLT2H9FPjJLOIK*G4x4ywf31nV7LtP0ruwiz6ulQx-HrJiwxrjh9g54StN5RPI1zT7Xi8GmKWb-df6DC-P/ScreenShot100716at06.14PM.PNG?width=750\" width=\"750\"/>](http://api.ning.com:80/files/99aVnO*4LGf1KPWLT2H9FPjJLOIK*G4x4ywf31nV7LtP0ruwiz6ulQx-HrJiwxrjh9g54StN5RPI1zT7Xi8GmKWb-df6DC-P/ScreenShot100716at06.14PM.PNG)<br/>But I think there is a small bug in the component in the way it reads the this weather station name. So, in my case, the station name inside the epw file starts with 'MN70_' and if I already have used the component before to create a cumulative sky for another location (somewhere in Africa) for which the weather station name also starts with 'MN70_', then the component will not overwrite the old 'MN70' sky folder with the new weather location. (My default location for the sky files is 'C:\\ladybug\\skylib\\cumulativeSkies\\' and the HB version is 0.0.60)\n\nThis way even though when I input the weather file for Milan, my cumulative sky component uses the sky dome for a different location!!!\n\n\n\nTo solve this issue, I list two manual ways:\n\n\n\n1. Either empty the cumulative sky folder before running a new simulation\n\n<br/>2. Edit the epw file and make sure the weather station name doesn't start with a generic text string like 'MN70_' which can cause problems. I solved my problem by renaming it from 'MN70_Milano_Linate' to 'Milano_Linate'.\n\n\n\nI think it will be useful if this bug could be fixed inside the component itself.\n\nLastly, can't thank you enough for all your amazing work!\n", "attachments": [], "created_by_name": "Mohammad Hamza", "created_at": "October 07, 2016 at 11:47AM", "created_by": "MohammadHamza", "topic": "Honeybee Cumulative Sky Error _ Reading Wrong Weather Station", "id": "topic_1613715"}