{"body": "\nGreetings everyone,\n\n\n\nMy name is Nita and I am working on my masters thesis using LB and HB to optimize parametric external shades(integrated to the facade) for an apartment tower in Germany.\n\nMost of the sources and papers I found are using either GenOpt or GenerativeComponents etc. for Multi-objective optimizations, but few of them use Grasshopper to find the optimum values for multiple parameters combination.\n\nI used Galapagos so far only for simple solutions, mostly connected to solar radiation, PVs, external fixed shades etc.But I always used it with one value and never connected it with Energy Plus, Diva or LB at the same time.\n\nThe Galapagos fitness input when contain multiple parameters is uses the average, this however doesn't lead to the best or optimum solution I believe.\n\nThe approach I was planning to use was to conduct parametric study, combine parameters one by one and then 'find' the optimal solution(s) by combining best cases.Considering the large number and range of iterations I assumed the process will be time consuming and decided to try the MOO.\n\nWhat I aim to include several parameters and variations which are most crucial when designing(optimizing) an energy efficient facade while optimizing the geometry of the shades! \n\nAnd I am aware of the problems on various scales a design optimization might raise..and its scary :) \n\nThe results I want to achieve are to fulfill a certain criteria for energy use(in kWa/sqm/a), visual comfort(in DF) and thermal comfort(in PMv and tempratures).\n\n \n\n- My question is does anyone of you know how can I link and design this definition and the GA optimization framework ? \n\n\n\nThank you for reading :D\n\nyour help will be very much appreciated...\n\n\n\nCheers,\n\nNita\n\np.s. So far I have geometries and all definitions needed for energy simulation, comfort and daylighting...I also have no idea if gene pool, or goat optimizer can be used somehow :(.\n\n\n", "attachments": [], "created_by_name": "Nitë", "created_at": "March 31, 2015 at 7:23am", "created_by": "Nita", "topic": "Multi Objective Optimization - LB+HB+Galapagos", "id": "topic_1253437"}