{"body": "\n**IBPSA-USA New York Regional Chapter *presents*:**\n\nParametric Modeling Tools | Ladybug and Honeybee\n\n<br/> **Location:** Thornton Tomasetti, 44 East 27th street (between Madison and  Park)\n\n** **\n\n**Date &amp; Time:** Thursday, August 21, 2014 - 6:00-7:30 PM.\n\n \n\n**6:00-6:30 PM Networking**\n\n \n\n**6:30-7:30 PM   Ladybug and Honeybee**\n\nMostapha Sadeghipour Roudsari, Thornton Tomasetti\n\nChris Mackey, MIT\n\nChien Si Harriman, Terabuild\n\n \n\n**7:30-7:45 PM Q &amp; A**\n\n\n\nClick here to register**: [https://attendee.gotowebinar.com/register/6507378565592582402](https://attendee.gotowebinar.com/register/6507378565592582402)\n\n \n\n**Please register at least a day in advance if you wish to attend in person\n\n \n\nDescriptions\n\n<br/> **Ladybug + Honeybee**\n\n \n\nLadybug and Honeybee are open source environmental plugins for Grasshopper that help architects and engineers create an environmentally-conscious architectural design.\n\n \n\nLadybug imports standard EnergyPlus Weather files (.EPW) into Grasshopper and provides a variety of 3D interactive graphics to support the decision-making process during the initial stages of design. The plugin also provides further support for designers as they test their initial design options with radiation, sunlight-hour, and shading analyses. Integration with Grasshopper allows for an almost instantaneous feedback and, since the plugin runs within the design environment, the information and analyses are interactive.\n\n \n\nHoneybee connects Grasshopper3D to EnergyPlus, Radiance, Daysim and OpenStudio for building energy and daylighting simulation.  The Honeybee project intends to make many of the features of these simulation tools available in a parametric way.  Just as users have made changes to geometry for years in Grasshopper, now users can parameterize system types, zoning schemes, schedules of operation, daylight sensor placement and controls -  all of the “hardcore” simulation parameters that have never been exposed to parametric modeling tools.\n\n<br/> [https://www.facebook.com/LadyBugforGrasshopper](https://www.facebook.com/LadyBugforGrasshopper)<br/> [http://www.grasshopper3d.com/group/ladybug](http://www.grasshopper3d.com/group/ladybug)\n\n \n", "attachments": [], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "August 18, 2014 at 12:16AM", "created_by": "mostapha", "topic": "Ladybug and Honeybee Presentation at IBPSA-USA New York Regional Chapter", "id": "topic_1117592"}