{"body": "\n[If you hate reading long texts just read the **bold** parts!]\n\n \n\n**Hi all**,\n\n \n\nHope you are enjoying/enjoyed the weekend and also for the ones who live in the US hope you are enjoying the extra hour that you got today. If you were thinking how to spend the extra hour we have some stuff for you that should take around 15 minutes!\n\n \n\nRadiance recently released the new version of 4.2.1 and short after that we had several reports about having issues with generating .gif/.tiff files from .hdr images. It turned out to be a bug in Radiance. The great Greg (Ward) and Rob (Guglielmetti) fixed the issue in less than a day and now you can download the new version which works like a charm!\n\n\n\nHere is the [direct link](https://github.com/NREL/Radiance/releases/download/4.3.a.1/radiance-4.3.a-win32.exe) and here is link to [github release page](https://github.com/NREL/Radiance/releases). All you need to do is to **download the [new version](https://github.com/NREL/Radiance/releases/download/4.3.a.1/radiance-4.3.a-win32.exe) and install it in C:\\Radiance.** It will replace the current version and you should be good to go.\n\n(**WARNING: As you can see, there is no \"Program Files\" in the installation path! Make sure to modify installation folder.**)\n\n \n\nOK. It should take you 10 minutes to read up to here and also install the new version of Radiance, but don't stop reading! **There is one more thing that you need to do.** The new version of gendaymtx in Radiance is also changed and we needed to modify genCumulativeSkyMtx component to handle the changes.\n\n\n\n**You need to replace the component manually. I will attach the UserObject to this discussion so you can download it and replace it with the current one.** [This video](http://screencast.com/t/CVEYcL7ax1T)** shows how you can do it in 13 seconds!**\n\n \n\nDone with installation! Here is some updates about development and resources:\n\n\n\nIf you are looking to get started with Ladybug here is some good news for you. With help of [So Young](http://www.grasshopper3d.com/profile/SoYoungHyun), videos of the Ladybug workshop from UPenn [are ready to watch](https://www.youtube.com/playlist?list=PLkjfDmSc5OrzBgdPWQB7rbqFycWpbxtaN). I personally think that the videos are slow, so I suggest you to watch it if you are a beginner with Grasshopper and need some videos to follow along while getting used to Grasshopper. **If you want to watch shorter videos check Chris's video series for Ladybug and Honeybee [here](https://www.youtube.com/user/chrismackey88/playlists).**\n\n\n\nAlso Chien Si is developing a number of components for advanced HVAC modeling using the OpenStudio component. If you have been waiting to model some real HVAC systems in a parametric environment and want to test it while it is getting developed, here is your chance! Right now he is working on air side systems.\n\n \n\nI think my 15 minutes is over! Enjoy the rest of the extra hour and **have a good week.**\n\n \n\n**Cheers,**\n\n**Mostapha**\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1160397", "name": "Ladybug_GenCumulativeSkyMtx.ghuser"}], "created_by_name": "Mostapha Sadeghipour Roudsari", "created_at": "November 02, 2014 at 04:16PM", "created_by": "mostapha", "topic": "Update to RADIANCE 4.3.a.1 before the weather gets really cold!", "id": "topic_1160398"}