{"body": "\nHi:\n\nI am in the midst of trying to resolve a workflow that is needed for my M.Arch thesis work.\n\nEssentially, I have a list of HOY values that I would like to analyze for solar radiation. They do not necessarily bracket into a neat period between two dates.However, I would like to know the cumulative solar effect during their values on a facade surface by using LB's solar radiation analysis component. \n\nConceptually it would seem I need a way to apply the list of HOY values I have to the GENCummulative sky component, or EPW import, as a sort of filter to extract which specified data points to be utilized for the solar analysis. This would be similar to editing a weather file than only analyzing the data points that exist in the file. This could be an option, but I am seeking something a little more automated;particularly since the HOY list is operating from a basic sorting criteria.The sorting criteria is intended to swap out weather files to obtain alternate results based on differing climates with relative ease. \n\nFundamentally, I do not know if there is a way to get around the limitation of the solar analysis component of using a date range or singular HOY. While also unclear how to filter out undesired values using HOY as a criteria when utilizing the sky matrix components. \n\nIncluded is a crude sketch diagram of what I am trying to achieve. \n\nAny help would be much appreciated!\n\n[<img class=\"align-center\" src=\"http://api.ning.com:80/files/7C2qIN6WAClXAoKce4g2AZmJe2HUqQUTeSY9fjrwZSpbjMn*IgWweesgR9WBELP*PvE9q39YZU12Q5u5dQTrTZaal9L5dU-z/IMG_6604.JPG?width=750\" width=\"750\"/>](http://api.ning.com:80/files/7C2qIN6WAClXAoKce4g2AZmJe2HUqQUTeSY9fjrwZSpbjMn*IgWweesgR9WBELP*PvE9q39YZU12Q5u5dQTrTZaal9L5dU-z/IMG_6604.JPG)\n\nThank you,\n\n\n\nDustin \n\n\n\n\n\n\n", "attachments": [], "created_by_name": "Dustin Altschul", "created_at": "February 19, 2016 at 09:54AM", "created_by": "DustinAltschul", "topic": "List of HOY for solar analysis", "id": "topic_1466905"}