{"body": "\nHello everyone, \n\n\n\nI am seeking your general advice in terms of using Galapagos/Octopus. I do not know whether it is the display issue associated with my computer only, I always start with blank interface when I start running Galapagos/Octopus (below is \"room orientation optimization\" shared at  [http://hydrashare.github.io/hydra/viewer?owner=mostaphaRoudsari&amp;amp...;](http://hydrashare.github.io/hydra/viewer?owner=mostaphaRoudsari&amp;fork=hydra_1&amp;id=Room_Orientation_Optimization&amp;slide=0&amp;scale=1&amp;offset=0,0)) [<img class=\"align-full\" height=\"402\" src=\"http://api.ning.com:80/files/DC*DFlgoq-n15v7jYynU9RiHSDJH0kZKNzpBV7LMGGnM07vypB3kY7CJPSZon3Nm4IIOaUUO-*ZOBtxOAGk8Cbpkbp*JKj24/1.JPG?width=750\" width=\"515\"/>](http://api.ning.com:80/files/DC*DFlgoq-n15v7jYynU9RiHSDJH0kZKNzpBV7LMGGnM07vypB3kY7CJPSZon3Nm4IIOaUUO-*ZOBtxOAGk8Cbpkbp*JKj24/1.JPG)It may take quite some time to see some results. That's fine for the above simulation. But my real challenge is, when I am going to optimize room dimension with respect to ASE and sDA calculations, either Galapagos or Octopus goes wildly and never come up with a solution. I believe the time-consuming calculation, especially sDA with higher -ab numbers, trigger the lag a lot? Any suggestion/trick to improve it? \n\n\n\nMost importantly, based on your experience, for example to optimize window/exterior shades sizes and achieve ASE&lt;10% and sDA&gt;55% (LEED v.4 requirements), Octopus (due to its capacity of multiple objectives) is the only choice? Any other approaches within grasshopper? \n\n\n\nThe alternative approach in my mind as a GH beginner is as follows. But I am not sure whether it is doable. Again, your comments will be greatly appreciated. \n\n\n\nSince all my room/window/shades dimension are controlled by number sliders, I am thinking whether a component from GH will trigger these number sliders (not necessary to be all of them but one by one) automatically. If this is possible, I can do \"data recorder\" to record outputs from ASE and sDA. Eventually I will have a database of the input parameters and sDA/ASE results.\n\n\n\nDoes it make sense?  Is there a component which can trigger number slider output at certain step?     \n\n\n\nMany thank! \n\nCheney \n", "attachments": [], "created_by_name": "Cheney", "created_at": "June 27, 2016 at 03:57PM", "created_by": "Cheney", "topic": "Galapagos/Octopus headache", "id": "topic_1556625"}