{"body": "\nThis component is opened as a reply to Aymeric Delmas's questions [posted in here](http://www.grasshopper3d.com/group/ladybug/forum/topics/lb-terrain-generator?commentId=2985220%3AComment%3A1612825&amp;xg_source=msg_com_gr_forum).\n\n\n\nHowever, following the install instructions and checking for the opentopography.org availability, the component does not seem to manage to download the data... (see picture attached).Djordje, do you have any idea about what I can I do or check to fix this?\n\nI just tried to run the component for a couple of locations and it successfully downloaded the data from opentopography.org:\n\n[<img class=\"align-full\" src=\"http://api.ning.com:80/files/9Dz4T2phCGGv*F0vVOw2gHAblx22sVfUlA2UahGQu9gyjgwSUPJhOqooaYbVxA*FDNok9Ii9bI7dPeHg-vmlkB*-EXz6FVU0/saintDenisReunion.jpg?width=300\" width=\"300\"/>](http://api.ning.com:80/files/9Dz4T2phCGGv*F0vVOw2gHAblx22sVfUlA2UahGQu9gyjgwSUPJhOqooaYbVxA*FDNok9Ii9bI7dPeHg-vmlkB*-EXz6FVU0/saintDenisReunion.jpg)\n\nWhen did you try to run the component? An hour ago?<br/>Can you try again?\n\n\n\n\n\nOther question, just to be sure, regarding the \"origin_\", is it the central point that you to get out of the output mesh/surface? And does it need to be the point at the actual point elevation or does it need to be the point projected on the ground floor (as I do in my definition)?\n\nYes, you are correct about both things: it's the central point and it will lie on the actual terrain (it will be projected to the terrain).<br/>The latitude and longitude information from the _location input will be taken to find the origin_ point. Elevation will always be ignored, as elevation is calculated from the elevation of the point laying on the terrain at those particular latitude-longitude coordinates.<br/><br/>Please let me know if I did not precisely gave the answer to your questions. Or if I misunderstood your question.<br/>We are here to help with any issue.\n", "attachments": [], "created_by_name": "djordje", "created_at": "October 07, 2016 at 04:25AM", "created_by": "djordje", "topic": "Few questions about \"Terrain Generator 2\" component", "id": "topic_1612848"}