{"body": "\nSo I was thinking we can have a nice community chat about pollination.\n\n\n\nI have recently actually starting to use it for parametric studies. I also had the opportunity to discuss with some wonderful people in the forums about their experiences and troubles in some other threads but I though we can somehow bring us all together. After all, when we are talking about parametric tools and parametric design, practical application seems to be the grey area.\n\n\n\nHow do I use it? Why do I use it? I know I have many difficulties in the actual generation and manipulation of patterns in my parametric designs. Most of the examples I've run are usually manipulating massing orientation, WWR, heights and lengths, mainly simple parameters. I guess it is a good thing to be at a point where the above are considered normal. Means that HB/LB is a really powerful tool.\n\n\n\nAnyways I wondered if we can share these kind of things here. The actual practices of our parametric models and designs, maybe creative ideas to manipulate shapes and relationships, or even ideas of generative design.\n\n\n\nAs a constructive pessimist I will start with an issue I have. Memory.\n\n\n\nIt seems that high iteration models make me run out of memory. I am not sure why that is. It happens in most types of simulation I've tried so far. I wonder if it is what Chris and Mostapha mentioned on occasion, the peculiar way GH deals and stores things in the computer's memory.\n\n\n\nIs it constantly adding each iteration to the memory? Or is it the way I structure the data flow. For example I have a few number, average, etc., native components before the data recorder which might multiply things saved in memory. Or is it a limitation of the external simulation tools (E+, radiance, etc.)? For me it's the most important issue so far, mainly due I'm used from my CFD studies to leave the work pc simulating for a few days and I'd love to do that in HB/LB!\n\n\n\nI'm adding a simple example. It calculates solar radiation for a simple configuration that changes across spatial and temporal parameters (angles and months). This one has around 3900 iterations (that's because my boolean check will not work with multiple meshes but that's a discussion for later) and it stops around 2300.\n\n\n\nOkay, enough about my problems! How is everyone doing?\n", "attachments": [{"link": "http://www.grasshopper3d.com/group/ladybug/forum/attachment/download?id=2985220%3AUploadedFile%3A1449568", "name": "ParametricExample_TG.gh"}], "created_by_name": "Theodoros Galanos", "created_at": "January 29, 2016 at 01:13AM", "created_by": "TheodorosGalanos", "topic": "Let's pollinate!", "id": "topic_1449569"}